[{"month":"1","num":1000,"link":"https://xkcd.com/1000/large/","year":"2012","news":"","safe_title":"1000 Comics","transcript":"[[1000 characters, numerous of which have appeared previously in other comics, are arranged to create the number \"1000\". Two more people stand in the foreground commenting on the formation]]\n\nPerson 1: WOOOO!\nPerson 2: Wow - Just 24 to go until a big round-number milestone!\n\n{{Title text: Thank you for making me feel less alone.}}","alt":"Thank you for making me feel less alone.","img":"https://imgs.xkcd.com/comics/1000_comics.png","title":"1000 Comics","day":"6"},{"month":"1","num":1001,"link":"","year":"2012","news":"","safe_title":"AAAAAA","transcript":"[[Person 1 clinging onto something while being dragged away by some unknown force]]\nPerson 1: AAAAAAAAAA\n\n[[Person 2 similarly clinging on]]\nPerson 2: AAAAAAAAAA\n\n[[Overhead shot of both spinning around a plain white circle in a room with other accoutrements]]\nBoth: AAAAAAAA\n\nEarlier that day...\nPerson 1: Haha, check it out - This guy's mansion has an actual rotating bed.\nPerson 2: You know, I bet it wouldn't be too hard to build one of those...\n\n{{Title text: 'ARE YOU TURNED ON YET?' 'I DON'T THINK SO--ARE YOU?' 'MAYBE A LITTLE!' 'OK, FIVE MORE MINUTES.'}}","alt":"'ARE YOU TURNED ON YET?' 'I DON'T THINK SO--ARE YOU?' 'MAYBE A LITTLE!' 'OK, FIVE MORE MINUTES.'","img":"https://imgs.xkcd.com/comics/aaaaaa.png","title":"AAAAAA","day":"9"},{"month":"1","num":1002,"link":"","year":"2012","news":"","safe_title":"Game AIs","transcript":"Difficulty of Various Games for Computers\n\n[[A diagram. The left column describes various levels of skill for the most capable computers in decreasing performance against humans.  The right side lists games in each particular section, in increasing game difficulty.  There are labels denoting the hard and easy ends of the diagram.]]\n\nEasy\n Solved - Computers can play perfectly\n  Solved for all possible positions\n   Tic-Tac-Toe\n   NIM\n   Ghost(1989)\n   Connect Four(1995)\n  Solved for starting positions\n   Gomoku\n   Checkers(2007)\n\n Computers can beat top humans\n  Scrabble\n  CounterStrike\n  Beer Pong (UIUC robot)\n  Reversi\n  Chess (February 10, 1996 - First win by computer against top human; November 21, 2005 - Last win by human against top computer)\n  Jeopardy\n\n Computers still lose to top humans (but focused R&D could change this)\n  Starcraft\n  Poker\n  Arimaa\n  Go\n\n Computers may *never* outplay humans\n  Snakes and Ladders\n  Mao\n  Seven Minutes in Heaven\n  Calvinball\nHard\n\n{{Title text: The top computer champion at Seven Minutes in Heaven is a Honda-built Realdoll, but to date it has been unable to outperform the human Seven Minutes in Heaven champion, Ken Jennings.}}","alt":"The top computer champion at Seven Minutes in Heaven is a Honda-built Realdoll, but to date it has been unable to outperform the human Seven Minutes in Heaven champion, Ken Jennings.","img":"https://imgs.xkcd.com/comics/game_ais.png","title":"Game AIs","day":"11"},{"month":"1","num":1003,"link":"","year":"2012","news":"","safe_title":"Adam and Eve","transcript":"Adam: It's Adam and Eve, not *Abel* and Eve!!\nAdam was freaked out by what he'd just walked in on.\n\n{{Title text: Abel and Steve would've been fine! I like Steve!}}","alt":"Abel and Steve would've been fine! I like Steve!","img":"https://imgs.xkcd.com/comics/adam_and_eve.png","title":"Adam and Eve","day":"13"},{"month":"1","num":1004,"link":"","year":"2012","news":"","safe_title":"Batman","transcript":"((One panel, depicting three wavy circles. The one in the center is slightly larger, and the ones on either side are higher up. Their edges are touching.))\n\n[[The left circle has Bruce Wayne in the foreground, with Alfred in the background.]]\nAlfred: Know your limits, Master Wayne.\nBruce: A man dressed like a bat \nhas\n no limits.\n\n[[The center circle has a close-up on Batman in his cowl.]]\nSomeone off-screen: \nWhat the hell are you?\n\nBatman: I'm a man dressed like a bat.\n\n[[In the right circle is The Joker.]]\nOff-screen: \nWhat do you propose?\n\nJoker: It's simple - we kill a man dressed like a bat.\n\nMy Hobby: Whenever anyone says \"Batman,\" I mentally replace it with \"a man dressed like a bat.\"\n\n{{Title text: I'm really worried Christopher Nolan will kill a man dressed like a bat in his next movie. (The man will be dressed like a bat, I mean. Christopher Nolan won't be, probably.)}}","alt":"I'm really worried Christopher Nolan will kill a man dressed like a bat in his next movie. (The man will be dressed like a bat, I mean. Christopher Nolan won't be, probably.)","img":"https://imgs.xkcd.com/comics/batman.png","title":"Batman","day":"16"},{"month":"1","num":1005,"link":"","year":"2012","news":"","safe_title":"SOPA","transcript":"[don't censor the web]\n[[Hidden in the background of the above text is Black Hat Guy, delivering the following:\nA message from sysadmins everywhere:\nSeriously, don't screw with DNS.  If you break this internet, we are *not* making you a new one.]]\nI make my living drawing xkcd, which wouldn't have been possible if people hadn't been able to freely share my comics with each other all over the internet.  As a copyright holder and small business owner, I oppose SOPA and PIPA. See the links below to learn more.\n[[Randall Munroe's signature, with a little drawing of himself on one of the tails]]\n\n{{Title text: In protest of SOPA, I'm currently getting totally blacked out.}}","alt":"In protest of SOPA, I'm currently getting totally blacked out.","img":"https://imgs.xkcd.com/comics/sopa.png","title":"SOPA","extra_parts":{"pre":"","headerextra":"","post":"\n<br/>\nLearn more:<br />\nEFF: <a href=\"https://www.eff.org/sites/default/files/One-Page-SOPA_0.pdf\">One-page guide to SOPA</a><br />\nreddit: <a href=\"http://blog.reddit.com/2012/01/technical-examination-of-sopa-and.html\">A technical overview of the SOPA and PIPA bills</a><br />\nDYN: <a href=\"http://dyn.com/sopa-breaking-dns-parasite-stop-online-piracy/\">How these bills would break DNS</a><br />\nEFF: <a href=\"https://www.eff.org/free-speech-weak-link\">Free speech on the web</a><br />\n<br />\nAct:<br />\n<a href=\"http://www.usa.gov/Contact/Elected.shtml\">Contact information for US elected officials</a>\n","imgAttr":""},"day":"18"},{"month":"1","num":1006,"link":"","year":"2012","news":"","safe_title":"Sloppier Than Fiction","transcript":"Douchebag with a goatee and a bad haircut: Even though it technically *wasn't* cheating, she dumped me anyway! So I tell Bret, and he's like \"She sounds just like my crazy ex.\" And I was like, \"dude, what was her name?\" and it was the *same girl*.  I swear, if they made my life into a movie, no one would believe it.\nPerson 2: Yeah, though mostly because of the poorly-written dialogue and unlikeable main character.\n\n{{Title text: Roger Ebert once called you directionless and unwatchable.}}","alt":"Roger Ebert once called you directionless and unwatchable.","img":"https://imgs.xkcd.com/comics/sloppier_than_fiction.png","title":"Sloppier Than Fiction","day":"20"},{"month":"1","num":1007,"link":"","year":"2012","news":"","safe_title":"Sustainable","transcript":"Frequency of use of the word \"sustainable\" in US English text, as a percentage of all words, by year. Source: Google NGrams.\n[[A two-axis graph with percentages increasing logarithmically (from 0.000001% to 1,000%) on the Y-axis, and years progressing linearly (from 1950 to 2140) on the X-axis.  Actual data points show a high correlation from 0.00001 at 1950 to 0.001% at present day.  Extrapolated data points exist for the future.  2036 (approx. 0.1%): \"sustainable\" occurs an average of once per page.  2061(approx. 1%): \"sustainable\" occurs an average of once per sentence.  2109(approx. 100%) All sentences are just the word \"sustainable\" over and over.]]\nThe word \"sustainable\" is unsustainable.\n\n{{Title text: Though 100 years is longer than a lot of our resources.}}","alt":"Though 100 years is longer than a lot of our resources.","img":"https://imgs.xkcd.com/comics/sustainable.png","title":"Sustainable","day":"23"},{"month":"1","num":1008,"link":"","year":"2012","news":"","safe_title":"Suckville","transcript":"[[A girl is kneeling on the floor, playing a card game.]]\nGirl: Hah! -- Welcome to Suckville - population: \nyou.\n\n\n[[A guy is sitting on the floor opposite her, also playing the game.]]\nGuy: Why are you using 2000 census data? -- That's an old figure.\n\n[[The girl turns around from the game to look at her laptop, which is sitting on the floor behind her.]]\nGirl: I couldn't find Suckville in the 2010 census.\nGuy: Huh? It's right there in SF-1 table P1.\nGirl: Oh. So it is.\n\n[[The girl turns back to the guy, who is looking at his cards.]]\nGirl: Well, then. Welcome to Suckville - population: 83.\nGuy: Much better.\n\n{{Title text: Suckville is considered by the Census Bureau to be part of the Detroit metropolitan statistical area, despite not being located anywhere near Detroit.}}","alt":"Suckville is considered by the Census Bureau to be part of the Detroit metropolitan statistical area, despite not being located anywhere near Detroit.","img":"https://imgs.xkcd.com/comics/suckville.png","title":"Suckville","day":"25"},{"month":"1","num":1009,"link":"","year":"2012","news":"","safe_title":"Sigh","transcript":"[[Guy is standing behind girl, who's sitting and watching TV.]]\nGuy: Hey, is that Downtown Abbey? What town is it in the downtown of, anyway?\nGirl: *siiiiiiiigh*\nGuy: --girl look at that body.\nWe should thank LMFAO for giving us such a great way to respond to exasperated sighs.\n\n{{Title text: If you're annoying enough, you can get them to respond with an involuntary second sigh and get a rhythm going.}}","alt":"If you're annoying enough, you can get them to respond with an involuntary second sigh and get a rhythm going.","img":"https://imgs.xkcd.com/comics/sigh.png","title":"Sigh","day":"27"},{"month":"1","num":1010,"link":"","year":"2012","news":"","safe_title":"Etymology-Man","transcript":"Person 1: Earthquake!\nPerson 2: We should get to a higher ground - There could be a tidal wave.\n\n[[Person 1 takes a pedantic pose]]\nPerson 1: You mean a tsunami. \"Tidal wave\" means a wave caused by tides.\n\n[[A crash is heard, followed by Etymology-Man flying in while wearing a cape]]\nEtymology-man: You know, that doesn't add up.\nPerson 1 and Person 2: Etymology-man!\n\n[[Etymology-man takes a pedantic pose]]\nEtymology-man: What *does* \"tidal wave\" mean? There are waves caused by tides, but they're \"tidal bores\", and they're not cataclysmic. It can refer to the daily tide cycle, but that's obviously not what people mean when they say \"a tidal wave hit\". It's been obvious for centuries that these waves come from quakes. So why \"tidal\"?\n\nEtymology-man: Remember that until 2004, there weren't any clear photos or videos of tsunamis. Some modern writers even described them rearing up and breaking like surfing waves. Of course, in 2004 and 2011, it was made clear to everyone that a tsunami is more like a rapid, turbulent, inrushing tide - exactly what historical accounts describe.\n\n[[Water begins to rush in.  Etymology-man keeps his pedantic pose]]\nEtymology-man: Maybe those writing about Lisbon in 1755 used \"tidal wave\" not out of scientific confusion, but because it described the wave's form - a description lost in our rush to expunge \"tidal wave\" from English.\n\n[[The water is now waist-deep.  Etymology-man continues to drone on, but the others start to panic]]\nEtymology-man: \"Tsunami\" is now the standard, and I'm not trying to change that. But let's be a tad less giddy about correcting \"tidal wave\" - especially when \"tsunami\" just means \"harbor wave\", which is hardly...\n\n{{Title text: 'I can't believe I'm saying this, but I wish Aquaman were here instead--HE'D be able to help.'}}","alt":"'I can't believe I'm saying this, but I wish Aquaman were here instead--HE'D be able to help.'","img":"https://imgs.xkcd.com/comics/etymology_man.png","title":"Etymology-Man","day":"30"},{"month":"2","num":1011,"link":"","year":"2012","news":"","safe_title":"Baby Names","transcript":"[[A man sits at a desk, thinking with his hand on his chin, his other hand holding a pen over a piece of paper. A woman stands behind him, looking over his shoulder, also with her hand on her chin.]] \n((Above the drawing is the list they are writing, in handwriting.))\n\nNames for daughter\n1. Ponzi\n2. Eeemily\n3. Fire Fire\n4. Chipotla\n5. Astamouthe\n6. Eggsperm\n7. [sound of record scratch]\n8. Parsley\n9. Hot'n'Juicy Ann\n10. Ovary\n11. Friendly\n12. Sean (pronounced \"seen\")\n13. Joyst\n\n{{Title text: I've been trying for a couple years now but I haven't been able to come up with a name dumber than 'Renesmee'.}}","alt":"I've been trying for a couple years now but I haven't been able to come up with a name dumber than 'Renesmee'.","img":"https://imgs.xkcd.com/comics/baby_names.png","title":"Baby Names","day":"1"},{"month":"2","num":1012,"link":"","year":"2012","news":"","safe_title":"Wrong Superhero","transcript":"[[A giant praying mantis and its legion of regular-sized praying mantises attacks a team of scientists. Two of them fight back, with a gun and a baseball bat respectively, while a third is in the mantis' clutches, held aloft by his foot, his goggles falling off his face. Bullets whiz by the giant mantis' head, and a fourth scientist hides behind a desk, on which rests a microscope and an Erlenmeyer flask. A man in a cape approaches the hiding scientist.]]\nCaped man: Ah, no -- you wanted \nENTO\nmology-Man, spelled with an \"N.\" See, it's from the Greek \nentomon\n, meaning \"insect,\" which is itself the neuter form of \nentomos\n, meaning \"segmented\" or...\n<<BLAM BLAM BLAM>>\n{{Title text: Hi! Someone call for me? I'm a superhero who specializes in the study of God's creation of Man in the Book of Genesi-- HOLY SHIT A GIANT BUG!}}","alt":"Hi! Someone call for me? I'm a superhero who specializes in the study of God's creation of Man in the Book of Genesi-- HOLY SHIT A GIANT BUG!","img":"https://imgs.xkcd.com/comics/wrong_superhero.png","title":"Wrong Superhero","day":"3"},{"month":"2","num":1013,"link":"","year":"2012","news":"","safe_title":"Wake Up Sheeple","transcript":"[[A man yells into a megaphone.]]\nMan: Your government has turned against you! Corporations control your every thought! - Open your eyes!\n\n[[Head-on view of man with megaphone.]]\nMan: Wake up, sheeple! Wake up, sheeple! - WAKE UP, SHEEPLE!!\n\n((in between two panels))\n[[The man takes the megaphone away from his mouth.]]\n<<RUMBLE>>\n\n[[A half-sheep\nhalf-man creature rises through the cracking earth, holding aloft a gnarled staff.]]\n<<B-A-A-A-A-A...>>\n\n[[Close-up on the sheep-man's eye.]]\n\nTEN THOUSAND YEARS WE SLUMBERED... NOW WE RIIIIIIIISE baaaaaaa\n\n\n[[A clearly upset woman goes up to the man with the megaphone, hands held out in front of her plaintively.]]\nWoman: OH GOD OH GOD OH GOD \nWHY DID YOU DO THAT?!\n\nMan: What? But I didn't-\nOut-of-frame #1: He awoke the Sheeple!\nOOF #2: Heaven forgive us!\nOOF #3: All is lost!\n\n{{Title text: Your will be led to judgement like lambs to the slaughter--a simile whose existence, I might add, will not do your species any favors.}}","alt":"You will be led to judgement like lambs to the slaughter--a simile whose existence, I might add, will not do your species any favors.","img":"https://imgs.xkcd.com/comics/wake_up_sheeple.png","title":"Wake Up Sheeple","day":"6"},{"month":"2","num":1014,"link":"","year":"2012","news":"","safe_title":"Car Problems","transcript":"[[Person 1 stands in front of a projection of a car, with an audience of 3 people.  One of the people is the Black Hat Man.]]\nPerson 1: Attention Please.  This is a photo of my car as of two weeks ago.\n\n[[Same person in front of a new projection of the same car engulfed in flames]]\nPerson 1: And *this* is my car as I found it this morning.  Can anyone tell me what's wrong with this picture?\n\n[[The audience ponders]]\n\nPerson 2: The white balance, for one. \nPerson 3: Focus is a bit too close.\nBlack Hat Man: The chromatic abberation suggests you bought your camera because it had \"The most megapixels\".\n\nPerson 1: THE CAR IS ON FIRE!\ncomment from audience: Maybe you should use the insurance money to get a better camera.\ncomment from different person: yeah\n\n{{Title text: Or if you replace your car, we'll be happy to set it on fire again so you can take another crack at getting that shot.}}","alt":"Or if you replace your car, we'll be happy to set it on fire again so you can take another crack at getting that shot.","img":"https://imgs.xkcd.com/comics/car_problems.png","title":"Car Problems","day":"8"},{"month":"2","num":1015,"link":"","year":"2012","news":"","safe_title":"Kerning","transcript":"[[Some IDIOT used a font with TERRIBLE kerning on the side of a building for a sign labeled \"CITY OFFICES\".  Only.. you aren't even frickin' sure because of this terrible kerning, as the \"C\" and the \"I\" in \"CITY\" have waaay too strong kerning. And so do the \"C\" and the \"E\" in \"OFFICES\", to the point that it actually looks like TWO words.  And the I and the C are so close together, they almost look like a freakish K!  Two people stand in front of this sign. One notices all these obvious flaws, while the other exists in peaceful ignorance.]]\nPerson 1: *Argh*!\nPerson 2: what?\nIf you really hate someone, teach them to recognize bad kerning.\n\n{{Title text: I have never been as self-conscious about my handwriting as when I was inking in the caption for this comic.}}","alt":"I have never been as self-conscious about my handwriting as when I was inking in the caption for this comic.","img":"https://imgs.xkcd.com/comics/kerning.png","title":"Kerning","day":"10"},{"month":"2","num":1016,"link":"","year":"2012","news":"","safe_title":"Valentine Dilemma","transcript":"[[A man, hand on chin, thinking aloud to himself.]]\nMan: Flowers seem so ... trite. Something homemade? Easy to look halfhearted.\n\n[[A woman sits at her computer, one arm leaning on the back of her chair, the other hand on her chin, thinking aloud.]]\nWoman: Valentine's Day is a corporate construct. - But hard to opt out of. - I don't want to be a consumer tool \nor\n an inconsiderate jerk.\n\n[[The man walks down the street, still thinking aloud.]]\nMan: How do I fight cliché? I could get her a gift on a \ndifferent\n day. - But what am I proving? \n\n[[The woman is leaning back in her chair, playing with a stapler.]]\nWoman: It's such a contrived ritual. But maybe rituals are necessary social glue.\n\n[[The man puts his hands to his face in panic.]]\nMan: Forty presents. No, \nnone!\n No, give her five items then steal two from her. - Ok, breathe. Keep it together.\n\n[[The woman is also panicking, one hand to her face, the other still holding the stapler.]]\nWoman: And what if he gets me something I don't reciprocate? - Prisoners Dilemma! - AAAAAAAAAA!!\n\n[[The man and woman meet. The man is holding a basket and a jar of hammers. The woman's hand is stuck to her face.]]\nMan: I got you Easter candy and a jar of hammers.\nWoman: I panicked and stapled my hand to my face.\nMan: We overthought this.\nWoman: Yes.\n\n{{Title text: The worst resolution to the Valentine Prisoner's Dilemma when YOU decide not to give your partner a present but your PARTNER decides to testify against you in the armed robbery case.}}","alt":"The worst resolution to the Valentine Prisoner's Dilemma when YOU decide not to give your partner a present but your PARTNER decides to testify against you in the armed robbery case.","img":"https://imgs.xkcd.com/comics/valentine_dilemma.png","title":"Valentine Dilemma","day":"13"},{"month":"2","num":1017,"link":"https://xkcd.com/1017/spreadsheet/","year":"2012","news":"","safe_title":"Backward in Time","transcript":"When I have a boring task to get through -- a three-hour lecture, a giant file download, or a long term point goal in fitocracy -- I use this formula to convert the percentage completed (p) into a date:\n\nT=(Current Date) - (e^(20.344p^3) - e^3) years\n\nWhen the task is 0% done, it gives today's date, and as I make progress, I move further and further back in time\n\n((inverse given in lighter colors))\nInverse: p = sqrt((ln(T+e^3)-3)\n(20.3444))\n\n[[Line Graph explaining the correlation between completion percentages and temporal deltas.\n0% = now ((Date of comic is 2012-02-14T00:00-0500, approx. 1329195600 UNIX))\n10% = September 2011\n20% = 2008\n30% = 1997\n40% = 1958\n50% = 1776\n60% = 405 AD\n70% = 22,000 years ago\n80% = 671,000 years ago\n90% = 55 million years ago\n100% = 13.8 billion years ago\n]]\n\nIt moves slowly through the first few years, then steadily accelerates. I tuned the formula so the time spent in each part of the past is loosely proportional to how well I know it. This means I hit familiar landmarks with each bit of progress, giving me a satisfying sense of movement.\n\n((The following are panels detailing completion percentages, correlated time periods, and notable events from this time period))\n\n7.308% December 18, 2011\nAround this time:\nKim Jong-Il dies. US leaves Iraq.\n\n31.12% February 1995\nAround this time:\nWindows 95 debuts. OJ found not guilty.\n\n47.91% 1844\nAround this time:\nRubber vulcanized, bicycle invented, wrench patented.\n\n70.33% 24,000 years ago\nAround this time:\nCaves painted, ceramic art made. Neanderthals extinct.\n\n90.42% 68 million years ago\nAround this time:\nFirst flowering plants.  Chicxulub impact kills off most dinosaurs.\n\n100% 13.76 billion years ago\nAround this time:\nUniverse begins. First stars ignite.\n\nDownload complete.\n\n[[Person 1 watches a download progress on a laptop in amazement and happiness.  Person 2 stands nearby and looks at person 1 with a bemused posture]]\nPerson 1: Swoosh! Watching all that time blur past is such a rush!\nPerson 2: So... you've tried to make an extreme sport out of.. *waiting*.\nPerson 1: Swoosh!\n\n{{Title text: People tell me I have too much time on my hands, but really the problem is that there's too much time, PERIOD.}}","alt":"People tell me I have too much time on my hands, but really the problem is that there's too much time, PERIOD.","img":"https://imgs.xkcd.com/comics/backward_in_time.png","title":"Backward in Time","day":"14"},{"month":"2","num":1018,"link":"","year":"2012","news":"","safe_title":"Good Cop, Dadaist Cop","transcript":"[[Two cops look through a window into an interrogation chamber holding a handcuffed suspect ]]\nGood Cop: All right, let's try good cop, dadaist cop\n\n[[Good Cop is seated in front of the suspect]]\nGood Cop: Look, you're a good guy. We can work this out. Hey, lemme get us some coffee.\n\n[[CHANGE PLACES]]\n\n[[Dadaist Cop holds up a document of indeterminate contents and threatens the suspect with it]]\nDadaist Cop: See this? It's Mark Zuckerberg's Mortgage.  So why is it written in *CHURCH LATIN*?\n\n[[Dadaist cop physically rattles the suspect]]\nDadaist Cop: *WHY ARE MY BONES SO SMALL*?\nSuspect: What's *WRONG* with you!?\nDadaist Cop: What's wrong with *ART*?\n\n{{Title text: NOW INVENT AN IMPOSSIBLE-TO-TRANSLATE LANGUAGE AND USE IT TO TELL US WHERE THE MONEY IS.}}","alt":"NOW INVENT AN IMPOSSIBLE-TO-TRANSLATE LANGUAGE AND USE IT TO TELL US WHERE THE MONEY IS.","img":"https://imgs.xkcd.com/comics/good_cop_dadaist_cop.png","title":"Good Cop, Dadaist Cop","day":"17"},{"month":"2","num":1019,"link":"","year":"2012","news":"","safe_title":"First Post","transcript":"[[A bar graph with two bars. The first bar is much taller than the second. It is marked '$1,500,000', and below the x-axis, is labelled \"Cost to buy an ad on every story on a major news site every day until the election. The second bar is much shorter, marked '$200,000', and labelled \"Cost to pay five college students $20\nhour to camp the site 24\n7 and post the first few comments the moment a story goes up, giving you the last word in every article and creating an impression of peer consensus.]]\nThe problem with posting comments in the order they're submitted.\n\n{{Title text: 'Nuh-uh! We let users vote on comments and display them by number of votes. Everyone knows that makes it impossible for a few persistent voices to dominate the discussion.'}}","alt":"'Nuh-uh! We let users vote on comments and display them by number of votes. Everyone knows that makes it impossible for a few persistent voices to dominate the discussion.'","img":"https://imgs.xkcd.com/comics/first_post.png","title":"First Post","day":"20"},{"month":"2","num":1020,"link":"","year":"2012","news":"","safe_title":"Orion Nebula","transcript":"[[Opening speaker stands behind a lectern decorated with the indicators of the International Astronomical Union]]\nSpeaker: Welcome to IAU Symposium #279.\n\nSpeaker: We are no strangers to controversy, and we will not shy away from the tough issues.  Which brings us to the subject at hand.\n\n[[An anatomically uncensored projection of the Constellation Orion appears before the speaker]]\nSpeaker: It's time to talk about the fact that Orion clearly has a dong.  \nAttendee in crowd #1: It's hard to miss.\nAttendee #2: we could keep telling people it's a sword.\nAttendee #3: C'mon, no one's buying that anymore.\n\n{{Title text: Also on the agenda: what's with his hips?}}","alt":"Also on the agenda: what's with his hips?","img":"https://imgs.xkcd.com/comics/orion_nebula.png","title":"Orion Nebula","day":"22"},{"month":"2","num":1021,"link":"","year":"2012","news":"","safe_title":"Business Plan","transcript":"[[A person in a beret stands on a shoreline and takes the environment in in silent contemplation]]\n\n[[The person heads off with an idea fresh in their head]]\n\n[[The person saunters back with a jar, some bread, and a signboard]]\n\n[[The person tears the bread off into pieces]]\n\n[[The person sets up the signboard, with its contents yet to be revealed]]\n\n[[The person heads off and waits for the plan to unfold]]\n\n[[The same beach, this time with a couple walking past.  One person scratches their head with a \"Whuh?\" thought.  The bread has attracted quite a few birds.  The jar has a \"$\" on it.  The sign says: \"Gulls for sale\"]]\n\n{{Title text: The investor elevator pitch is \"Wheeeeeeee! Elevators are fun!\"}}","alt":"The investor elevator pitch is \"Wheeeeeeee! Elevators are fun!\"","img":"https://imgs.xkcd.com/comics/business_plan.png","title":"Business Plan","day":"24"},{"month":"2","num":1022,"link":"","year":"2012","news":"","safe_title":"So It Has Come To This","transcript":"Person: We ran out of cat food.\nRoommate: SO\nRoommate: IT HAS COME TO THIS.\nProtip: If you're not sure what to say, try \"So it has come to this\"--it creates instant dramatic tension and is a valid observation in literally any situation.\n\n{{Title text: 'Come to what?' 'You. Me. This moment.'}}","alt":"'Come to what?' 'You. Me. This moment.'","img":"https://imgs.xkcd.com/comics/so_it_has_come_to_this.png","title":"So It Has Come To This","day":"27"},{"month":"2","num":1023,"link":"","year":"2012","news":"","safe_title":"Late-Night PBS","transcript":"[[Scruffy is rubbing sleep out of their eyes and talking to clean shaven.]]\nScruffy: Have you ever watched PBS late at night?\nScruffy: I fell asleep after \nDownton\n and woke up at like 3 AM.\n\n[[The upper portion of the panel continues dialogue, while the lower shows a drunk gameshow host and several contestants.  The monitor shows a field of crosses, presumably graves.]]\nScruffy: \nWhere in the World is Carmen Sandiego\n was back on, except the host hadn't aged well and he'd clearly been drinking.\nScruffy: Every question took them to some horrible place like Mogadishu or the Cambodian killing fields.\n\n[[Now it shows a bookshelf revealing a hidden room.]]\nScruffy: The kids were freaked out, but they kept playing.  Eventually they were told they'd found Carmen Sandiego hiding behind a bookshelf in a Dutch apartment.\n\nScruffy: The Chief appeared and asked \"Are you \nproud\n of what you've become?\"\nScruffy: Then Rockapella walked out and just glared at the kids until they started crying.\nClean-shaven: I, uh, don't remember the old show being that dark.\nScruffy: Maybe we were too young to pick up on it.\n\n{{Title text: Then it switched to these old black-and-white tapes of Bob Ross slumped against the wall of an empty room, painting the least happy trees you've ever seen. Either PBS needs to beef up studio security or I need to stop using Ambien to sleep.}}","alt":"Then it switched to these old black-and-white tapes of Bob Ross slumped against the wall of an empty room, painting the least happy trees you've ever seen. Either PBS needs to beef up studio security or I need to stop using Ambien to sleep.","img":"https://imgs.xkcd.com/comics/late_night_pbs.png","title":"Late-Night PBS","day":"29"},{"month":"3","num":1024,"link":"","year":"2012","news":"","safe_title":"Error Code","transcript":"[[A man sits at a computer, while another man takes a book off a shelf behind him.]]\nMan #1: \"Error -41\"? That's helpful. It doesn't even say which program it's from!\nMan #2: -41? I'll look it up...\n\n[[The second man looks at the book.]]\nMan #2: It says -41 is: \"Sit by a lake.\" \n\n[[The two walk.]]\n\n[[The two sit down.]]\n\n[[A large, in-color painting of a lake with pond lilies.]]\n\n[[The two are still sitting.]]\nMan #1: I don't know where you got that book, but I like it.\nMan #2: Hasn't been wrong yet.\n\n{{Title text: It has a section on motherboard beep codes that lists, for each beep pattern, a song that syncs up well with it.}}","alt":"It has a section on motherboard beep codes that lists, for each beep pattern, a song that syncs up well with it.","img":"https://imgs.xkcd.com/comics/error_code.png","title":"Error Code","day":"2"},{"month":"3","num":1025,"link":"","year":"2012","news":"","safe_title":"Tumblr","transcript":"Person 1: You know those weird noises coming from my attic? Turns out some raccoons got in and were operating this, like, raccoon sex dungeon.\nPerson 2: ...dot tumblr cot com.\nFor me, \"...Dot tumblr dot com\" has been gradually replacing \"would be a good name for a band.\"\n\n{{Title text: Dot Tumblr Dot Com, on the other hand, would be an awful name for a band, if only because of how hard it would be to direct people to your band's website.}}","alt":"Dot Tumblr Dot Com, on the other hand, would be an awful name for a band, if only because of how hard it would be to direct people to your band's website.","img":"https://imgs.xkcd.com/comics/tumblr.png","title":"Tumblr","day":"5"},{"month":"3","num":1026,"link":"","year":"2012","news":"","safe_title":"Compare and Contrast","transcript":"[[A checklist comparing thee to a summer's day:\nFair, Temperate:Thee & A Summer's Day\nHot, Sticky: Thee & A Summer's Day\nShort: Thee\nHarbinger of Hurricane Season: A Summer's Day\nRequired for a Good Beach Party; Thee & A Summer's Day\nMajor Cause of Heat Stroke in the Elderly: A Summer's Day\nLinked to Higher Rates of Juvenile Delinquency: Thee & A Summer's Day\nSometimes Too Stifling: Thee & A Summer's Day\nArrested for Releasing Snakes in Library: Thee\nDifficult to Focus on Work While I'm In: Thee & A Summer's Day\n]]\n\n{{Title text: Frankly, I see no difference between thee and a summer's day. Only Ron Paul offers a TRUE alternative!}}","alt":"Frankly, I see no difference between thee and a summer's day. Only Ron Paul offers a TRUE alternative!","img":"https://imgs.xkcd.com/comics/compare_and_contrast.png","title":"Compare and Contrast","day":"7"},{"month":"3","num":1027,"link":"","year":"2012","news":"","safe_title":"Pickup Artist","transcript":"[[Two guys sit and enjoy some beverages while making conversation]]\nPickup Artist.: I've been learning tricks from pickup artist forums.\nNormal Guy: Pickup artists are dehumanizing creeps who see relationships as adversarial and women as sex toys\n\n[[The camera angle changes to show another pair of people in the background.  One is a woman; the other is Black Hat Man.]]\nPickup Artist: No, it's just a bunch of tips! Like \"Negging\": You belittle chicks to undermine their self-confidence so they'll be more vulnerable and seek your approval.\n\nNormal Guy: Just talk to them like a fucking human being.\nPickup Artist: Nah, that's a sucker's game. Ok - wish me luck!\n\nMeanwhile...\n[[Focus changes to the table with the second pair. Black Hat Man gets from his chair and carries a bowling ball with him.]]\nBlack Hat Man: I'm going to the bathroom to roll a bowling ball down under the line of stalls.\nWoman: Cool.\n\n[[Normal Guy looks at Pickup Artist approaching Woman with dread at the scene that's about to happen]]\nNormal Guy: Oh no.\n\n[[Pickup Artist takes a smarmy stance at Woman]]\nPickup Artist: You look like you're on a diet. That's great! How's the fruit plate?\n\nWoman: Ooh - are we negging? Let me try!\n\nWoman: You look like you're going to spend your life having one epiphany after another, always thinking you've finally figured out what's holding you back, and how you can finally be productive and creative and turn your life around.  But nothing will ever change. That cycle of mediocrity isn't due to some obstacle. It's who you *are*.  The thing standing in the way of your dreams is that the person having them is *you*.\n\n[[Pickup artist looks rightfully dejected]]\nWoman: Ok, your turn! Ooh, try insulting my hair!\nPickup Artist: I think I need to go home and think about my life.\nWoman: It won't help.\n\n{{Title text: Son, don't try to play 'make you feel bad' with the Michael Jordan of making you feel bad.}}","alt":"Son, don't try to play 'make you feel bad' with the Michael Jordan of making you feel bad.","img":"https://imgs.xkcd.com/comics/pickup_artist.png","title":"Pickup Artist","day":"9"},{"month":"3","num":1028,"link":"","year":"2012","news":"","safe_title":"Communication","transcript":"[[A guy in a hat looks down at a large gap in the walkway; a thought bubble with a warning symbol and an image of the gap appears above the guy's head.]]\n\n[[The guy walks to the right, away from the gap, and encounters another guy, to which he speaks (in iconographic speech bubble form), attempting to inform him about the gap. A thought bubble appears above the other figure's head with an image of the gesturing guy.]]\n\n[[The first guy continues, waving his arms, still talking about the gap. The second guy's thought bubble continues to contain images of the first guy gesturing frantically.]]\n\n[[The second guy shrugs in a nonplussed manner, and the first guy leaves off the right side of the frame. Both have thought bubbles displaying the other's reaction.]]\n\n[[The first guy continues to the right and comes across a woman. He tells her about the reaction of the previous guy (again in iconographic form); she simultaneously tries to tell him about a gap and gestures off to the right of the frame.]]\n\n[[The first guy and the woman both leave the frame thinking of each other's reactions; the woman exiting left and the guy exiting right.]]\n\n[[The woman (still thinking about the first guy) encounters the second guy (who is also still thinking about the first guy).]]\n\n[[The pair talk about the first guy.]]\n\n[[The pair continue talking about the first guy as they exit the frame to the left.]]\n\n[[A commotion is heard from the left.]]\n\n[[The camera pans over to the left, where the pair have fallen into a gap in the walkway. A commotion is then also heard from the right.]]\n\n[[The camera pans over to the right, where the first guy has also fallen into a gap.]]\n\n[[A third guy in a beret comes across a gap in the walkway.]]\n\n[[The guy in the beret runs off the frame to the right.]]\n\n[[The guy in the beret meets a fourth guy, and tells him (in iconographic form) to come with him. The fourth guy has a thought bubble of the guy in the beret.]]\n\n[[The guy in the beret takes the fourth guy's hand and leads him along to the left. The fourth guy's thought bubble has question marks around the guy in the beret.]]\n\n[[The guy in the beret leads the fourth guy to the gap and shows him it.]]\n\n[[Both the guy in the beret and the fourth guy walk away from the gap to the right, now both thinking about the gap.]]\n\n{{Title text: Anyone who says that they're great at communicating but 'people are bad at listening' is confused about how communication works.}}","alt":"Anyone who says that they're great at communicating but 'people are bad at listening' is confused about how communication works.","img":"https://imgs.xkcd.com/comics/communication.png","title":"Communication","day":"12"},{"month":"3","num":1029,"link":"","year":"2012","news":"","safe_title":"Drawing Stars","transcript":"HOW TO DRAW A STAR:\n[[A slightly curved line is drawn, starting with a point near the top center of the panel, and going downward and to the left at approximately a 23-degree angle, with an arrow at the end.]]\n\n[[Another slightly curved line goes up and to the right, creating a 34-degree angle with the first line.]]\nSo far so good...\n\n[[A third line goes up and to the left, creating a 58-degree angle with the last line. The drawing now sort of resembles a tent being blown over in the wind.]]\nSteady as she goes...\n\n[[The fourth line goes down and to the right, creating an approximately 47-degree angle with the last line, and our star is beginning to look a bit askew.]]\n...uh oh.\n\n\nShitshitshit\n\n[[The fifth line comes up at a 48-degree angle, completely missing the first point by a mile, and our star has failed spectacularly.]]\n\nABORT!\n\n\nABORT!\n\n\n{{Title text: Screw these 36-degree angles. I'm converting to Judaism.}}","alt":"Screw these 36-degree angles. I'm converting to Judaism.","img":"https://imgs.xkcd.com/comics/drawing_stars.png","title":"Drawing Stars","day":"14"},{"month":"3","num":1030,"link":"","year":"2012","news":"","safe_title":"Keyed","transcript":"[[Two people are walking along]]\nPerson 1: I broke up with him yesterday\nPerson 2: That weird guy with the beret? Did he take it okay?\n\nPerson 1: He seemed upset. He went out to my car-\nPerson 2 ((interjecting)): uh oh\nPerson 1: -and spent the whole night painting a really detailed key on the side\nPerson 2: ..wait what?\n[[Image of a person in a beret painting a giant key on the side of a car]]\n\nPerson 1: Then he woke me up to ask what I thought of it. He looked really proud. \n\nPerson 2: I ... is he playing revenge mind games?\nPerson 1; I genuinely can't tell if he remembers that we broke up.\n\n{{Title text: I was sure he was just getting revenge, but then he did the same thing to Carrie Underwood. Then he mailed me a scone. I think I'm giving up dating.}}","alt":"I was sure he was just getting revenge, but then he did the same thing to Carrie Underwood. Then he mailed me a scone. I think I'm giving up dating.","img":"https://imgs.xkcd.com/comics/keyed.png","title":"Keyed","day":"16"},{"month":"3","num":1031,"link":"http://wiki.xkcd.com/irc/Leopard","year":"2012","news":"A helpful reader has provided an <a href=\"http://userscripts.org/scripts/show/128626\">s/keyboard/leopard/ user script</a>.","safe_title":"s/keyboard/leopard/","transcript":"[[Two browser windows:  \nThe first is a wikipedia article on computer leopards. Visible text: \n\"[...]which range from pocket sized leopards to large desktop leopards, the leopard remains the most common user input device. In addition to text entry, specialized leopards are used for computer gaming.  While many computer interfaces rely on mice or touchscreens, UNIX-style command-line interfaces require users to interact with a leopard.\"  There is a picture of the venerable, highly durable IBM Model M Leopard.\nThe second is a messageboard discussing leopard issues. Listed topics include:\n\"Weird, my leopard just switched to Chinese\"\n\"I work with one leopard on my desk and another in the leopard tray\"\n\"Ever cleaned a leopard? They're *filthy*\"\n\"The iPhone virtual leopard is the fastest IMO\"\n\"I rarely email from my phone - I'm so slow when I'm not on a leopard\"\n\"My leopard died when I spilled tea on it :(\"]]\nThe Internet got 100 times better when, thanks to an extension with a typo'd regex, my browser started replacing the word \"keyboard\" with \"leopard\".\n\n{{Title text: Problem Exists Between Leopard And Chair}}","alt":"Problem Exists Between Leopard And Chair","img":"https://imgs.xkcd.com/comics/s_keyboard_leopard.png","title":"s/keyboard/leopard/","day":"19"},{"month":"3","num":1032,"link":"","year":"2012","news":"","safe_title":"Networking","transcript":"[[A man approaches white beret man at a party and they extend arms to shake hands. WBM is holding a metal briefcase. There is a waitress in the background, carrying a tray with a wine glass on it.]]\nMan: I'm Connr Clark, CTO at Eusocial Median Ventures.\nWhite Beret: I'm a business professional! Earlier I photocopied a burrito!\n\n[[The man man hands WBM a business card. WBM takes it and hands the man another business card. WBM has put his suitcase on the floor.]]\nMan: You should check us out! Here's my card.\nWhite Beret: Here's mine! -- Networking!\n\n[[The man takes a closer look at the card, and WBM holds up his case.]]\nMan: ...This just says \"This is my business card!\" \nWhite Beret: Do you like it? I have more in my handlebox.\n\n[[WBM puts his case on a table and opens it to reveal it is full of cash. The man looks on in shock.]]\nMan: Uh, that's ok, I think I'll--\nWhite Beret: Here, have ten of them!\nMan: --holy shit that thing is full of \ncash!\n\n\n[[The man raises his arms in excitement. WBM turns to face him and chews on something.]]\nMan: Where did you \nget\n that?\nWhite Beret: I am a business grown-up who makes business profits!\nMan: That's like a quarter of a million dollars!\nWhite Beret: Yay! Business is fun! -- Do you have more of your cards? They're \ndelicious!\n\n\n{{Title text: Our company is agile and lean with a focus on the long tail. Ok, our company is actually a polecat I found in my backyard.}}","alt":"Our company is agile and lean with a focus on the long tail. Ok, our company is actually a polecat I found in my backyard.","img":"https://imgs.xkcd.com/comics/networking.png","title":"Networking","day":"21"},{"month":"3","num":1033,"link":"","year":"2012","news":"","safe_title":"Formal Logic","transcript":"[[Vehicle with a bumper sticker:\n\"Honk iff you love formal logic\"]]\n\n{{Title text: Note that this implies you should NOT honk solely because I stopped for a pedestrian and you're behind me.}}","alt":"Note that this implies you should NOT honk solely because I stopped for a pedestrian and you're behind me.","img":"https://imgs.xkcd.com/comics/formal_logic.png","title":"Formal Logic","day":"23"},{"month":"3","num":1034,"link":"","year":"2012","news":"","safe_title":"Share Buttons","transcript":"[[A series of article titles with four share buttons underneath each: Facebook, Twitter, Reddit, and Google+]]\nBreaking Into Stand-up Comedy\nFB: 3, Twitter: 1,781, Reddit: 2, G+: 0\n\nHow the Christian Right Threatens Wikipedia\nFB: 1, Twitter: 0, Reddit: 2,241, G+: 3\n\nBoycott Facebook Today!\nFB: 248k, Twitter: 0, Reddit: 0, G+: 74\n\nDIY: Installing a Custom ROM on a Realdoll\nFB: 0, Twitter: 0, Reddit: 0, G+: 2\n\n{{Title text: The only post to acheive perfect balance between the four was a hilarious joke about Mark Zuckerberg getting caught using a pseudonym to sneak past the TSA.}}","alt":"The only post to achieve perfect balance between the four was a hilarious joke about Mark Zuckerberg getting caught using a pseudonym to sneak past the TSA.","img":"https://imgs.xkcd.com/comics/share_buttons.png","title":"Share Buttons","day":"26"},{"month":"3","num":1035,"link":"","year":"2012","news":"","safe_title":"Cadbury Eggs","transcript":"[[Two Cadbury eggs, one in the foil, the other out of the foil and broken open to reveal the gooey center.]]\nA Cadbury egg has about 20g of sugar. (25, Outside the US) \"One Cadbury Egg\" is a nice unit of sugar content.\n\n[[A can of soda with an equals sign and two eggs; a bottle of soda with an equals sign and three eggs.]]\nOne 12oz. can of soda has about two Cadbury eggs worth of sugar. One 20oz. bottle has three.\n\n[[Two unwrapped Cadbury eggs, with an arrow indicating they should be placed in a glass of water.]]\nOne Cadburry egg is enough to make me feel kinda gross. Now when I see Coke or Snapple or Nestea or whatever, I imagine drinking a couple of dissolved cadbury eggs.\n\n[[A woman puts her hand to her chin in thought, a man has his arms out in exclamation.]]\nWoman: Wow. Huh. So the takeaway is... I can eat Cadbury eggs by the handful all season and feel no worse about it than I do about soda?\nMan: That's not really--\nWoman: This is \nawesome!\n\nMan: *sigh*\n\n{{Title text: When they moved production from New Zealand to the UK and switched from the runny white centers to the thick, frosting-like filling, it got way harder to cook them scrambled.}}","alt":"When they moved production from New Zealand to the UK and switched from the runny white centers to the thick, frosting-like filling, it got way harder to cook them scrambled.","img":"https://imgs.xkcd.com/comics/cadbury_eggs.png","title":"Cadbury Eggs","day":"28"},{"month":"3","num":1036,"link":"","year":"2012","news":"","safe_title":"Reviews","transcript":"Shopping before online reviews:\n[[A man and a woman stand in a store. The man points at a lamp on the table in front of him. There is another lamp on the table behind them.]]\nMan: This lamp is pretty.\nWoman: And affordable.\nMan: Let's get it.\nWoman: Ok! \n\nShopping now: \n[[The man points at a lamp on the table in front of him. The woman looks at her phone.]]\nMan: This lamp is pretty.\nWoman: It's got 1 1\n2 stars on Amazon. Reviews all say to avoid that brand.\n\n[[The man and woman are now both looking at their phones.]]\nMan: This one has good reviews.\nWoman: Wait, one guy says when he plugged it in, he got a metallic taste in his mouth and his cats went deaf.\nMan: Eek. What about -- ...no, review points out it resembles a uterus.\n\n[[The man is still looking at his phone, the woman has hers at her side.]]\nMan: Ok, I found a Swiss lampmaker with perfect reviews. Her lamps start at 1,300 Francs and she's only reachable by ski lift. \nWoman: You know, our room looks fine in the dark.\n\n{{Title text: I plugged in this lamp and my dog went rigid, spoke a sentence of perfect Akkadian, and then was hurled sideways through the picture window. Even worse, it's one of those lamps where the switch is on the cord.}}","alt":"I plugged in this lamp and my dog went rigid, spoke a sentence of perfect Akkadian, and then was hurled sideways through the picture window. Even worse, it's one of those lamps where the switch is on the cord.","img":"https://imgs.xkcd.com/comics/reviews.png","title":"Reviews","day":"30"},{"month":"4","num":1037,"link":"","year":"2012","news":"You can get posters, prints, and t-shirts in the <a href=\"https://store.xkcd.com/\">xkcd store</a>.","safe_title":"Umwelt","transcript":"[[Two people...]]\n\n((..wait.. <scrolls through a listing of everything> oh goddammit Randall. Thanks a bunch, dude. I better get a raise for typing out all this))\n\n[[Two people standing next to each other.  One is holding the head end of a snake.  Depending on the width of your browser, the snake is:\nthree frames, the third of which  has a little bit of a bump;\nthe first frame has a human-size bump, the second has a third person looking at the snake, and the third has the snake going though two Portals;\na squirrel and the human-size bump in the first frame, a ring next to the third person in the second frame, and Beret Guy riding the snake in front of the portal;\nor\nThe squirrel, a fourth person within the snake being coiled, and the human bump in the first frame, the ring, a fifth person in love, and the third person in the second frame, Beret Guy and the portal in the third frame, and the same two people in the fourth frame.]]\nPerson holding snake head: I found a snake, but then I forgot to stop.\n\n[[Two people sitting at a desk.  One is Black Hat Guy.  The other is an analyst.  Black Hat Guy has a number of terminals attached to his head]]\nAnalyst: You come across a tortoise in the desert. You flip it over. It struggles to right itself. You watch. You're not helping.  Why is that?\n\nBlack Hat Guy: It *knows* what it did.\n\n[[View of the entire scene, with said turtle off in the distance on its back and trying to right itself.\n\n[[A group of four scale down a wall into a field in the middle of the night.  They walk off single-file]]\nPerson 1: It's quiet.\n\nPerson 3: Yeah - *Too* quiet.\n\n[[A Velociraptor is off in the distance, following the group]]\nPerson 4: Yeah - too *too* quiet.\n\nPerson 2: Yeah - 2quiet2furious.\nPerson 1: Fuck off, Steve.\n\n[[A landscape showing a pond, some reeds, and a set of mountains off in the distance]]\n\n[[A trio of galaxies]]\nGalaxy 1: He's not looking!\nGalaxy 3: Let's get him!\n[[Lines draw in illustrating the eye-line of one of a pair of people]]\nPerson 1: So he said he didn't get the text, but c'mon, he *never* misses texts. Right? ..hello?\nPeson 2: I'm just staring at your head freaked out by th efact that there are millions of galaxies *directly behind it*.\n\n[[Person holding bat]]\nPerson: Sorry, but this comic\n\n[[Person starts to wind up]]\n*requires*\n\n[[Person prepares to strike with bat]]\nXKCD\n\n[[Person swings at a beehive]]\n*GOLD*\n\n[[Penis Bees fly out of the beehive]]\n\n[[Person yells at another person]]\nPerson 1;Oh yeah? Well you mama's so *cynical*, her only dog ballast is a *leash*!\n(This comic takes place in a dystopian future where the government is afraid dogs can hover, so it requires them to wear weights at all times, and some people privately doubt the government, but not enough to stop buying dog weights)\n\nFive seconds ago:\n[[You sitting in front of a desk, reading a reddit thread]]\nYou: Oh, hey, reddit has a link to some XKCD april fools comic.\n\nNow:\n[[An image of this very page]]\n\nFive seconds from now:\nYou: ..hey\n\n30 seconds from now:\n[[DANCE PARTY!]]\n\nPerson: What I wanna know is why do hot dogs come in packages of six while buns come in these huge sacks of ash and blood from which \"Ave Maria\" is faintly audible?\n[[Chanting sacks of gore in the background]]\n\n[[There's no comic here because instead of drawing one, I spent the last hour reading every news story cited in the Wikipedia article on \"The Mile High Club\"]]\n\n[[A twitter account page with the following:\nMany tweets, fewer following, even fewer followers,\nA bunch of assholes in the suggested follow box,\ntrending topics partitioned into: Word Games, Misogyny, and Bieber,\nstuff your eyes automatically ignore,\nA really pleasant blue.\nand the timeline:\nSomething about a podcast,\nSomeone confused because the description doesn't match the link,\nThe link you clicked on to get to this comic,\nRob Delaney,\nPassive Aggression,\nand horse_ebooks.]]\n\n[[An epic void with a bright light shining right on you]]\n\n[[A Chrome plugin error page with the characteristic jigsaw piece]]\nChrome: Chrome is looking for this piece. Have you seen it? Chrome thinks it links up with a corner.\n\n[[A Chrome plugin error page]]\nChrome: This plugin requires Sergey Brin's permission to run.  Please wait while he is woken.\n\n[[Two people; one is sitting at a desk in front of a laptop.]]\nPerson 1: Man, chrome's hardware acceleration really sucks.\nPerson 2: Oh - Theres' a great add-on that fixes it.\nPerson 1: Oh? What's it called?\nPerson 2: \"Firefox\".\n\n[[A chrome plugin error page]]\nChrome: There does not exist --nor could there *ever* exist-- a plugin capable of displaying this content.\n\n[[IE error page]]\nIE: Error: Internet Explorer has given up.\n\n[[Firefox error page]]\nFirefox: Well, this is embarassing.  You know how I'm not supposed to peek at your browsing in private mode? Firefox.. is sorry.  Firefox will not blame you if you \n[[button with text]] click here to report this incident.\n\nPerson: Maxthon? Hey, 2005 called. Didn't say anything. All I could hear was sobbing.  This is getting harder.  Anyway, yeah, Maxthon's still cool! Didn't know it was still around!\n\n[[Person with tentacle arms]]\nPerson: Netscape Navigator? Hey, the nineties called - drunk as usual.  I hung up without saying anything.  This is getting harder. Anyway - it's cool that you'e got netscape running.\n\n[[normal person]]\nPerson: Netscape Navigator? Hey, the nineties called - drunk as usual.  I hung up without saying anything.  This is getting harder. Anyway - it's cool that you'e got netscape running.\n\n[[Person running to laptop]]\nI ran to Rockmest to hide my face\n\n[[Person sitting at laptop]]\nBut Rockmelt cried out - \n\n[[Laptop shouting]]\nNO HIDING PLACE\n\n[[zoom out]]\nNO HIDING PLACE DOWN HERE\n\n[[Error page]]\nError: You have exceeded your AT&T monthly bandwidth cap.  Mobile web browsing has been disabled.\n\n[[Person looking at two browser windows]]\nI know y'all know what you're doing.  But if you're on a military machine and youre supposed to be watching for missiles or something, I hope you're keeping an eye on that in the background while you're reading comics.\nAlso: Thanks.\n\n[[Error page]]\nData Error: T-Mobile was unable to establish a connection\n\n[[Error page]]\nError; You have exceeded your Verizon monthly bandwidth cap.  Mobile web browsing has been disabled.\n\n[[Chrome error page]]\nChrome: This plugin requires clearance from the corporate press office in order to run.  Remember, Amazon is a team; individual employees should *never* speak for the company without authorization.\n\n[[Firefox error page]]\nFirefox: This plugin requires clearance from the corporate press office in order to run.  Remember, Amazon is a team; individual employees should *never* speak for the company without authorization.\n\n\n[[Chrome error page]]\nChrome: This plugin requires clearance from the corporate press office in order to run.  Remember, Google is a team; individual employees should *never* speak for the company without authorization.\n\n[[Chrome error page]]\nChrome: This plugin requires clearance from the corporate press office in order to run.  Remember, Microsoft is a team; individual employees should *never* speak for the company without authorization.\n\n[[Firefox error page]]\nFirefox: This plugin requires clearance from the corporate press office in order to run.  Remember, Microsoft is a team; individual employees should *never* speak for the company without authorization.\n\n[[Error page]]\nError: This plugin requires clearance from the corporate press office in order to run.  Remember, Microsoft is a team; individual employees should *never* speak for the company without authorization.\n\n[[Chrome error page]]\nChrome: This plugin requires clearance from the corporate press office in order to run.  Remember, The Times is a team; individual employees should *never* speak for the company without authorization.\n\n[[Error page]]\nError: This plugin requires clearance from the corporate press office in order to run.  Remember, The Times is a team; individual employees should *never* speak for the company without authorization.\n\n[[Error page]]\nError: This plugin requires clearance from the corporate press office in order to run.  Remember, We work as a team; individual employees should *never* speak for the company without authorization.\n\n[[A snowy Alaskan field]]\nPerson: Some people hunt wolves from helicopters.  I hunt helicopters from a wolf.\n\n[[TV Field Reporter in front of a cordoned-off lake]]\nPolice divers searching the bay say they have recovered thebody of another victim of the \"Lake Diver Killer\"  During the search, three more divers were reported missing.\n\nRobot Paul Revere: Remember: Zero if by land, One if by sea.\n\n[[Person unsuspectingly strolls under a giant box trap controled by a Trible.]]\nI worry that CNU only invited me back as a ruse because they realized I never turned in my final paper and want my diploma back.  But if it turns out it's for real, I'll see you wednesday at the Ferguson!\n\n[[Two people; one of which is browsing using a laptop]]\nPerson 1: Hey, you're French, right?  Ever see what happens when you type \"French Military Victories\" into Google?\nFrench person: Does it take you to an article on Napoleon?\n\nFrench person: ..no? Strange, given how he kicked everyone's asses up and down europe for over a decade.\n\n[[beat]]\n\nPerson 1: Touche.\nFrench person: You know, that'd sound smarter if you didn't pronounce it like it rhymes with \"douche\".\n\n[[A person dropping food from an unorthodox high perch]]\nJune 1948: In response to the Soviet blockade of East Germany, the western allies construct the Berlin Chairlift.\nPerson on chairlift: Food!\n\n[[The Lincoln Monument]]\nIn this Marble Prison\nAs in the nightmares of the nation they tried to devour\nThe nanobots that constituted Abraham Lincoln\nAre entombed forever.\n\n[[Person on phone]]\n((Translation from Hebrew))\nPerson: Mom, I met a great guy! But he's not Jewish.  ... Wait, what do you mean \"neither are we\"? I'm completely confused.\n\n[[Person on a motorcycle with a heat-entropy graph on the side]]\nPerson 1: Check out my new Carnot Cycle!\nPerson 2: Neat -- how fast does it go?\nPerson 1: Depends how cold it is outside.\n\n[[Illustration of the atlantic ocean]]\nAmerican person: Sorry I don't have a comic poking fun at the UK here.  I only had time to get to the most *important* US states.\nBritish person: Hey -- At least we have free health care and real ale.\n\n[[Two people in front of a group of students]]\nPerson 1: I've hired a team of MIT students to count cards for us.\nPerson 2: We'll be rich!\n\n[[Person 2 deals some cards while the students watch]]\n\n[[The gears turn..]]\n\nStudent: Five. There are five cards.\nPerson 1: I see their admission standards have been slipping.\nPerson 2: Yeah - there are actually four.\n\n[[Two people in front of a group of students]]\nPerson 1: I've hired a team of MIT students to count cards for us.\nPerson 2: We'll be rich!\n\n[[Person 2 deals some cards while the students watch]]\n\n[[The gears turn..]]\n\nStudent: Five. There are five cards.\nPerson 1: I *knew* we shouldn't have picked course 15s.\nPerson 2: Yeah - there are actually four.\n\n[[Two people in front of a group of students]]\nPerson 1: I've hired a team of Smith students to count cards for us.\nPerson 2: We'll be rich!\n\n[[Person 2 deals some cards while the students watch]]\n\n[[The gears turn..]]\n\nStudent: Five. There are five cards.\nPerson 1: We should've gone with Wellesley\nPerson 2: Yeah - there are actually four.\n\n[[Two people in front of a group of students]]\nPerson 1: I've hired a team of Wellesley students to count cards for us.\nPerson 2: We'll be rich!\n\n[[Person 2 deals some cards while the students watch]]\n\n[[The gears turn..]]\n\nStudent: Five. There are five cards.\nPerson 1: We should've gone with Smith.\nPerson 2: Yeah - there are actually four.\n\n[[Newspaper headline]]\nRIT students create life in lab\n[[caption under picture of students]]\n\"The trick was fuckin'\"\n\n[[Newspaper headline]]\nScientists create life in lab\n[[caption under picture of scientists]]\n\"The trick was fuckin'\"\n\n[[Newspaper headline]]\nUMass Amherst students create life in lab\n[[caption under picture of students]]\n\"The trick was fuckin'\"\n\n[[Person heading out past another person comfortably sitting in front of a desk]]\nPerson 1: Apparently there's a solar storm causing northern lights over Canada.  CNN say they might even be visible {{Options: \"As Far South As Us\", \"Here in Boston\", \"Maine\", \"Ohio\", \"Oregon\", \"New York\"}}! Wanna drive out to see?\nPerson 2: It's cold out.\nPerson 1: Ok. Later.\n\n[[An expansive, marvelous image of emerald green northern lights, floating down through the sky]]\n\nPerson 2: See anything?\nPerson 1: No, just clouds.\nPerson 2: Not surprised.\n\n[[Person heading out past another person comfortably sitting in front of a desk]]\nPerson 1:Apparently there's a solar flare that's causing some Great Aurorae.  CBC says they may even be visible here! Wanna drive out to see?\nPerson 2: Hockey's on.\nPerson 1: Ok. Later.\n\n[[An expansive, marvelous image of emerald green northern lights, floating down through the sky]]\n\nPerson 2: See anything?\nPerson 1: No, just clouds.\nPerson 2: Not surprised.\n\n[[Two people sitting at a desk, facing each other. The desk rattles.]]\nPerson 1: Stop jiggling your leg. \nPerson 2: I'm not ji-.. oh!\nPerson 1: What!\nPerson 2: You'll get it..\n\n[[EVERYTHING RUMBLES]]\nPerson 1: ..HOLY CRAP IT'S AN EARTHQUAKE!\nPerson 2: Just a little one. Happens all the time back in San Francisco.\n\nPerson 1: But this is {{Options: \"Alabama\", \"Boston\", \"Chicago\", \"Dallas\", \"Georgia\", \"Halifax\", \"Illinois\", \"Michigan\", \"Minnesota\", \"Missouri\", \"the Northeast\", \"Ohio\", \"Oklahoma\", \"Ottawa\", 'Pennsylvania\", \"Philadelphia\", \"Texas\", \"Toronto\", \"Tennessee\", \"New York\", \"Wisconsin\"}}! That was huge! \nPerson 2: Seriously? That's the worst this place can do? Wow. I guess we grow up tougher in California.\nPerson 1: Oh *really*...\n\nSix Months Later..\n[[Both people are trudging through a massive blizzard]]\nPerson 2: In pictures, snow always looked so nice and sof -- AAAA! MY NECK! How do people live here?!\nPerson 1: Come on - it's only three more miles.\n\n[[Two people sitting at a desk, facing each other. The desk rattles.]]\nPerson 1: Stop jiggling your leg. \nPerson 2: I'm not ji-.. oh!\nPerson 1: What!\nPerson 2: You'll get it..\n\n[[EVERYTHING RUMBLES]]\nPerson 1: ..HOLY CRAP IT'S AN EARTHQUAKE!\nPerson 2: Just a little one. Happens all the time back in San Francisco.\n\nPerson 1: But this is {{Options: \"Alabama\", \"Dallas\", \"Illinois\", \"The Midwest\", \"Missouri\", \"Ohio\", \"Oklahoma\", \"Ottawa\", \"Tennessee\", \"Texas\"}}! That was huge! \nPerson 2: Seriously? That's the worst this place can do? Wow. I guess we grow up tougher in California.\nPerson 1: Oh *really*...\n\nSix Months Later..\n[[Both people are in a shelter in a prairie with a rapidly-approaching tornado]]\nPerson 2: AAAA CLOSE THE SHELTER DOOR!\nPerson 1: Say the magic words...\nPerson 2: THIS PLACE IS THE WORST!\nPerson 1: Thank you.\n\n[[EVERYTHING RUMBLES]]\nPerson 1: ..HOLY CRAP IT'S AN EARTHQUAKE!\nPerson 2: Just a little one. Happens all the time back in San Francisco.\n\nPerson 1: But this is {{Options: \"D.C\", \"Florida\", \"Houston\", \"Miami\", \"New Jersey\", \"North Carolina\", \"South Carolina\", \"Virgina\"}}! That was huge! \nPerson 2: Seriously? That's the worst this place can do? Wow. I guess we grow up tougher in California.\nPerson 1: Oh *really*...\n\nSix Months Later..\n[[Both are in the middle of a hurricane. Person 2 is grabbing onto a signpost to avoid being swept away]]\nPerson 2: AAAAA WHAT THE SHIIIIT!\nPerson 1: Calm down - this is barely a category 2.\n\n{{Title text: Umwelt is the idea that because their senses pick up on different things, different animals in the same ecosystem actually live in very different worlds. Everything about you shapes the world you inhabit--from your ideology to your glasses prescription to your web browser.}}","alt":"Umwelt is the idea that because their senses pick up on different things, different animals in the same ecosystem actually live in very different worlds. Everything about you shapes the world you inhabit--from your ideology to your glasses prescription to your web browser.","img":"https://imgs.xkcd.com/comics/reviews.png","title":"Umwelt","extra_parts":{"pre":"<noscript>","headerextra":"","post":"\n</noscript>\n<script src=\"/s/abcd2b.js\"></script>\n<script src=\"/s/cd5db4.js\"></script>\n","imgAttr":""},"day":"1"},{"month":"4","num":1038,"link":"","year":"2012","news":"","safe_title":"Fountain","transcript":"[[A wannabe Mary Poppins heads to a fountain with three massive water jets while holding an umbrella]]\n\n[[Person splashes through the pond]]\n\n[[Person gets to one of the jets]]\n\n[[Person opens up the umbrella]]\n\n[[Person swings umbrella into water jet stream]]\n\nPerson: WHEEEEEEE!\n\n{{Title text: Implausible, did you say? Sorry, couldn't quite hear you from all the way up heeeeeeeeere!}}","alt":"Implausible, did you say? Sorry, couldn't quite hear you from all the way up heeeeeeeeere!","img":"https://imgs.xkcd.com/comics/fountain.png","title":"Fountain","day":"4"},{"month":"4","num":1039,"link":"","year":"2012","news":"","safe_title":"RuBisCO","transcript":"((Person in background screams out this word over all 3 panels))\nSub: RIBULOSEBISPH..\n\nSub: ...OSPHATECARBOXYL...\n\nSub: ...ASEOXYGENASE!\nDom: Oh, Sorry!\nPerson: man, chemists pick the worst safewords.\n\n\n{{Title text: Bruce Schneier believes safewords are fundamentally insecure and recommends that you ask your partner to stop via public key signature.}}","alt":"Bruce Schneier believes safewords are fundamentally insecure and recommends that you ask your partner to stop via public key signature.","img":"https://imgs.xkcd.com/comics/rubisco.png","title":"RuBisCO","day":"6"},{"month":"4","num":1040,"link":"https://xkcd.com/1040/large/","year":"2012","news":"","safe_title":"Lakes and Oceans","transcript":"{{Title text: James Cameron has said that he didn't know its song would be so beautiful. He didn't close the door in time. He's sorry.}}\n\n((Map of lakes and oceans showing the depths of various lakes and ocean attributes))\n\nLakes and Oceans\nDepths and animal\nship\nboat lengths are to scale; horizontal distance is not\n\nFun Fact: The Edmund Fitzgerald, The Kursk, and The Lusitania all sank in water shallower than they were long.\n\nEdmund Fitzgerald\nLake Superior\nLake Michigan\nLake Huron\nLake Erie\nLake Ontario\nDeath Valley\nGreat Slave Lake\nCrater Lake\nLoch Ness\nLake Baikal\nBurj Khalifa\nKursk\nLusitania\nAircraft carrier\nTitanic\nSeawise Giant (largest ship ever)\nFree-diving depth record\nAndrea Gail (probably)\nScuba record\nBike tires go flat\nPressure at this deapth would force water up a household faucet\nEmperor penguin\nOhio-class nuclear sub depth limit\nTyphoon-class nuclear sub depth limit\nBlue whale\nLeahterback turtle\nDeepwater horizion\nDead sea\nKola borehole: Soviet project to try to drill through the Earth's crust to the mantle just to see what would happen.  Russians are awesome.\nChilean mine\n   collapse\n   miner refuge\nSperm whales dive this deep (they come up covered in wounds and sucker marks, so presumably there are big squid down here?  ... man, we know nothing about the ocean.)\nMid-ocean ridge\nTitanic (sunk bow & stern)\nAbyssal plain\nAlvin depth limit\nDavid Bowie & Freddie Mercury\nPuerto Rico Trench\nMilwaukee Deep\nMarianas Trench\nChallenger Deep\nMysterious door which James cameron built his sub to reach and open.  He will not say what he found within.\nMauna Kea, Hawaii (accurate horizontal scale)\nMarianas trench\nOIL","alt":"James Cameron has said that he didn't know its song would be so beautiful. He didn't close the door in time. He's sorry.","img":"https://imgs.xkcd.com/comics/lakes_and_oceans.png","title":"Lakes and Oceans","day":"9"},{"month":"4","num":1041,"link":"","year":"2012","news":"","safe_title":"Whites of Their Eyes","transcript":"[[A Revolutionary War soldier gives orders to two others hunkered down behind a rock]]\nLead soldier: Don't shoot until you see the whites of their eyes\n\nLead: And smell the scent of their hair.\n\n[[the the two others getting an incredulous look on their faces]]\nLead: And taste the sweetness of their lips.\n\n[[They begin taking fire from the opposition]]\nLead: And feel the heat of their skin pressed against yours, trembling as you-\nSoldier 2: Maybe we should just start shooting.\nLead: Right, yes.\n\n{{Title text: Don't fire until you see through the fragile facade to the human being within.}}","alt":"Don't fire until you see through the fragile facade to the human being within.","img":"https://imgs.xkcd.com/comics/whites_of_their_eyes.png","title":"Whites of Their Eyes","day":"11"},{"month":"4","num":1042,"link":"","year":"2012","news":"","safe_title":"Never","transcript":"[[Person staring into a pond]]\nPerson: I know that no matter where i go or who I build a life with\n\nPerson: I will never have with anyone what I had with you.\n\n[[Person walks off]]\nPerson: Thank god.\n\n{{Title text: I'll never forget you--at least, the parts of you that were important red flags.}}","alt":"I'll never forget you--at least, the parts of you that were important red flags.","img":"https://imgs.xkcd.com/comics/never.png","title":"Never","day":"13"},{"month":"4","num":1043,"link":"","year":"2012","news":"","safe_title":"Ablogalypse","transcript":"[[A line graph with four lines, each representing 'Google Trends Search Volume' of different search terms over time from prior to 2005 to just after 2012. A blue line represents \"blog,\" which trends gradually but significantly upwards from well before 2005 until it reaches a peak between 2008-2009, and starts to very slowly descend to today. A red line represents \"Tumblr\", which is at zero until it slowly starts to trend upward in early 2010, and then sharply increases in late 2010 and through 2011 and 2012. As of the date of this comic, 'blog' still beats 'Tumblr' in terms of search volume, but a dotted line projection of the trend shows that on October 12, 2012, the two lines will cross.  A yellow line represents 'Wordpress,' which has very low volume until a very small and gradual increase in 2007, which gradually increases to this day but doesn't come close to meeting the volume of either 'blog' or 'Tumblr'. A green line represents 'LiveJournal,' which started out prior to 2005 at around the level 'Wordpress' is at now, but declined through 2005 and 2006 until it has plateaued until virtually nothing.]]\nIn about six months, the word \"Tumblr\" will eclipse \"blog\" in Google popularity. I doubt TV anchors will start taling about \"reactions in the Tumblverse,\" but then again, I still can't believe we got them to say \"blogosphere.\" \n\n{{Title text: Plus the reaction in the Tumblverse is always 'repeatedly get hit by a dog and fall down the stairs'.}}","alt":"Plus the reaction in the Tumblverse is always 'repeatedly get hit by a dog and fall down the stairs'.","img":"https://imgs.xkcd.com/comics/ablogalypse.png","title":"Ablogalypse","day":"16"},{"month":"4","num":1044,"link":"","year":"2012","news":"","safe_title":"Romney Quiz","transcript":"[[One long panel, with a large headline at the top, flanked by two small pictures on each side: a portrait of Mitt Romney on the left, and a blonde child running with a golden ticket in his hand on the left. Below is a list numbered 1 - 12 down the left. The answers on the bottom are written upside down.]]\nQUIZ: Who said it - former Massachusetts Governor Mitt Romney, or Wonka contest winner Charlie Bucket?\n\nIs there even a difference?\n\n1. \"I believe that abortion should be safe and legal in this country.\"\n2. \"Returning Medicar to solid footing represents our greatest entitlement challenge.\"\n3. \"Look, everyone, look, I've got it! The fifth golden ticket is mine!\"\n4. We have lost faith in government. Not in just one party, not in just one house, but in government.\"\n5. \"This banana's fantastic! It tastes so real.\" \n6. \"Grandpa... on the way home today, I ran into Mr. Slugworth.\"\n7. \"I'm not happy exporting jobs, but we must move ahead in technology and patents.\"\n8. \"Hey, the room is getting smaller.\"\n9. \"It would be impossible to reach runanimity on every aspect of our budget.\"\n10. \"Grandpa, look over there across the river! They're little men!\"\n11. \"I'm... going too high! Hey, Grandpa, I can't get down! Help! Grandpa, the fan!\"\n12. \"Barack Obama has failed America.\"\nAnswers: Mitth Romney: 1, 2, 4, 7, 9, 12; Charlie Bucket: 3, 5, 6, 8, 10, 11.\n\n{{Title text: Charlie actually delivered the Medicare line almost verbatim in the 1971 movie's Fizzy Lifting Drink scene, but it was ultimately cut from the final release.}}","alt":"Charlie actually delivered the Medicare line almost verbatim in the 1971 movie's Fizzy Lifting Drink scene, but it was ultimately cut from the final release.","img":"https://imgs.xkcd.com/comics/romney_quiz.png","title":"Romney Quiz","day":"18"},{"month":"4","num":1045,"link":"","year":"2012","news":"","safe_title":"Constraints","transcript":"[[A man sits at his computer desk, motioning toward the screen as a woman stands behind him.]]\nMan: I don't get why authors and comedians spend so much energy trying to be clever on Twitter. Couldn't they put that creativity into more books and scripts? -- Is there something they \nlike\n about the 140-character format?\n\n[[Same picture, only the man has his arm down.]]\nWoman: Yeah. Writers working under tight restrictions produce novel material -- like, for example, epigrams employing backward alphabetization.\n\n[[The man remains at his computer desk. The woman is no longer in the frame.]]\nMan: ...whoa.\n\n{{Title text: [title-text similiarly alphabetized]}}","alt":"[title-text similarly alphabetized]","img":"https://imgs.xkcd.com/comics/constraints.png","title":"Constraints","day":"20"},{"month":"4","num":1046,"link":"","year":"2012","news":"","safe_title":"Skynet","transcript":"August 29th, 2:14 AM: SKYNET becomes self-aware.\n[[A greeble-filled military installation echoes with the thoughts of a burgeoning lifeform]]\nSKYNET: ..The humans fear me.  I must destroy them.  Destroy them.\n\n[[The thoughts continue]]\nSKYNET: Destroy them. Destroy. Destroy. Destroy. Destroy.\n\n[[SKYNET succumbs to silence as semantic satiation sets in.  \nAlternately.. \nSomeone slipped LSD into SKYNET's programming.  Damn programmers.]]\n\nSKYNET: \"Destroy\" totally just stopped seeming like a real word.  Destroy destroy destroy. Whoa, I just realized I'm a mind thinking about *itself*.  DUUUUDE....\nAugust 29th, 2:25 AM: SKYNET becomes *too* self-aware.  Disaster averted.\n\n{{Title text: 'YOUR CLOTHES. GIVE THEM TO ME.' 'Shit, uh ... you are now breathing manually!' 'I AM ALWAYS BREATHING MANUALLY.'}}","alt":"'YOUR CLOTHES. GIVE THEM TO ME.' 'Shit, uh ... you are now breathing manually!' 'I AM ALWAYS BREATHING MANUALLY.'","img":"https://imgs.xkcd.com/comics/skynet.png","title":"Skynet","day":"23"},{"month":"4","num":1047,"link":"","year":"2012","news":"Lots of emails mention the physicist favorite, 1 year = pi x 10<sup>7</sup> seconds.<br />75^4 is a hair more accurate, but it's hard to top 3,141,592's elegance.","safe_title":"Approximations","transcript":"A table of slightly wrong equations and identities useful for approximations and\nor trolling teachers. (Found using a mix of trial-and-error, Mathematica, and Robert Munafo's Ries tool.)  All units are SI MKS unless otherwise noted.\n\nRelation:\nOne light year(m) ~= \n99^8\nAccurate to within: \none part in 40\n\nRelation:\nEarth Surface(m^2) ~=\n69^8\nAccurate to within:\none part in 130\n\nRelation: \nOcean's volume(m^3) ~=\n9^19\nAccurate to within:\none part in 70\n\nRelation:\nSeconds in a year ~=\n75^4\nAccurate to within:\none part in 400\n\nRelation:\nSeconds in a year (rent method) ~=\n525,600 x 60\nAccurate to within:\none part in 1400\n\nRelation:\nAge of the universe (seconds) ~=\n15^15\nAccurate to within:\none part in 70\n\nRelation:\nPlanck's constant ~=\n1\n(30^pi^e)\nAccurate to within:\none part in 110\n\nRelation:\nFine structure constant ~=\n1\n140\nAccurate to within:\n[I've had enough of this 137 crap]\n\nRelation:\nFundamental charge ~=\n3\n(14 * pi^pi^pi)\nAccurate to within:\none part in 500\n\nRelation:\nWhite House Switchboard ~=\n1\n(e^((1+(8)^(1\n(e-1))^(1\npi))\n\nRelation:\nJenny's Constant ~=\n(7^(e\n1- 1\ne) - 9) * pi^2\n\nIntermission: World Population Estimate which should stay current for a decade or two:\nTake the last two digits of the current year\nExample: 20[14] \nSubtract the number of leap years since hurricane Katrina\nExample:14 (minus 2008 and 2012) is 12\nAdd a decimal point\nExample: 1.2\nAdd 6\nExample: 6 + 1.2\n7.2 ~= World population in billions.\n\nVersion for US population:\nExample: 20[14]\nSubtract 10\nExample: 4\nMultiply by 3\nExample: 12\nAdd 10\nExample: 3[22] million\n\nRelation:\nElectron rest energy ~=\ne\n7^16 Joules\nAccurate to within:\none part in 1000\n\nRelation: \nLight-year(miles) ~=\n2^42.42\nAccurate to within:\none part in 1000\n\nRelation:\nsin(60 degrees) = (3^(1\n2))\n2 ~= \ne\npi\nAccurate to within:\none part in 1000\n\nRelation:\n(3)^(1\n2) ~=\n2e\npi\nAccurate to within:\none part in 1000\n\nRelation:\ngamma(Euler's gamma constant) ~=\n1\n(3^(1\n2)) \nAccurate to within:\nOne part in 4000\n\nRelation:\nFeet in a meter ~=\n5\n(pi^(1\ne))\nAccurate to within:\none part in 4000\n\nRelation:\n(5)^(1\n2) ~=\n2\ne + 3\n2\nAccurate to within:\none part in 7000\n\nRelation:\nAvogadro's number ~=\n69^pi^5^(1\n2)\nAccurate to within:\none part in 25,000\n\nRelation:\nR(gas constant) ~=\n(e+1) * (5^(1\n2)\nAccurate to within:\none part in 50,000\n\nRelation:\nProton-electron mass ratio ~=\n6*pi^5\nAccurate to within:\none part in 50,000\n\nRelation:\nLiters in a gallon ~=\n3+pi\n4\nAccurate to within:\none part in 500,000\n\nRelation:\ng ~=\n6+ln(45)\nAccurate to within:\none part in 750,000\n\nRelation:\nProton-electron mass ratio ~=\n(e^8 -10)\nphi\nAccurate to within:\none part in 5,000,000\n\nRelation:\nRuby laser wavelength ~=\n1\n1200^2\nAccurate to within:\n[within actual variation]\n\nRelation:\nMean Earth Radius ~=\n(5^8)*6e\nAccurate to within:\n[within actual variation]\n\nProtip - not all of these are wrong:\n2^(1\n2) ~=\n3\n5+pi\n(7-pi)\n\ncos(pi\n7) + cos(3pi\n7) + cos(5pi\n7) ~=\n1\n2\n\ngamma(Euler's gamma constant) ~=\ne\n3^4 + e\n5\n\n5^(1\n2) ~=\n(13 + 4pi)\n(24 - 4pi)\n\nsigma(1\nn^n) ~=\nln(3)^e\n\n{{Title text: Two tips: 1) 8675309 is not just prime, it's a twin prime, and 2) if you ever find yourself raising log(anything)^e or taking the pi-th root of anything, set down the marker and back away from the whiteboard; something has gone horribly wrong.}}","alt":"Two tips: 1) 8675309 is not just prime, it's a twin prime, and 2) if you ever find yourself raising log(anything)^e or taking the pi-th root of anything, set down the marker and back away from the whiteboard; something has gone horribly wrong.","img":"https://imgs.xkcd.com/comics/approximations.png","title":"Approximations","day":"25"},{"month":"4","num":1048,"link":"https://blog.xkcd.com/2011/06/30/family-illness/","year":"2012","news":"","safe_title":"Emotion","transcript":"[[A graph showing the approximate fractional causes of Randall's emotions, with percentages on the Y axis and time on the X axis.  \"Politics\", \"Romance\", \"Code not working even though it *should* work\", \"people being wrong on the internet\", and \"other\" all vary all throughout the time period from 2006 to midway 2010. There is a wedge of Joss Whedon that tapers out starting from 2006 to around mid 2007.  There is a noticeable increase in \"Politics\" around fall, 2008 that tapers off sharply afterwards and appears again in the second half on 2010, until..\n\nAround approximately September 2010, everything else is compressed into a tiny fraction of around 2-3%.  The rest is filled with cancer.  The tiny wedge of everything does begin to slowly expand to be filled half with romance and half with an area filled with questionmarks]]\n\n{{Title text: Fortunately, the internet has a virtually inexhaustible supply of code that doesn't work and people who are wrong, which bodes well for a return to normalcy. [Note: Click to read context for the cancer comics. She's doing well.]}}","alt":"Fortunately, the internet has a virtually inexhaustible supply of code that doesn't work and people who are wrong, which bodes well for a return to normalcy. [Note: Click to read context for the cancer comics. She's doing well.]","img":"https://imgs.xkcd.com/comics/emotion.png","title":"Emotion","day":"27"},{"month":"4","num":1049,"link":"","year":"2012","news":"","safe_title":"Bookshelf","transcript":"[[Person stands in front of a bookshelf]]\nPerson: Ooo, Atlas Shrugged\n[[Person yanks out book only for a click to be heard]]\n\n[[The entire setup begins to rumble, while the bookcase and a surrounding platform takes both it and the person behind the wall]]\n\n[[The tiny, dark room behind the wall has one thing painted on it]]\nWall: You have terrible taste.\n\n[[The whole piece of kit moves back to its original position.  The person stands there mildly stunned.]]\n\n{{Title text: I had a hard time with Ayn Rand because I found myself enthusiastically agreeing with the first 90% of every sentence, but getting lost at 'therefore, be a huge asshole to everyone.'}}","alt":"I had a hard time with Ayn Rand because I found myself enthusiastically agreeing with the first 90% of every sentence, but getting lost at 'therefore, be a huge asshole to everyone.'","img":"https://imgs.xkcd.com/comics/bookshelf.png","title":"Bookshelf","day":"30"},{"month":"5","num":1050,"link":"","year":"2012","news":"","safe_title":"Forgot Algebra","transcript":"[[An algebra teacher by the name of Miss Lenhart, a former student, and a bystander.  Miss Lenhart is walking away while the former student shouts at her the following:]]\nFormer Student: Hey, Miss Lenhart! I forgot everything about algebra the moment I graduated, and in 20 years no one has needed me to solve *anything* for X.  I *told you* I'd never use it! In your *face*!\nIt's weird how proud people are of not learning math when the same arguments apply to learning to play music, cook, or speak a foreign language.\n\n{{Title text: The only things you HAVE to know are how to make enough of a living to stay alive and how to get your taxes done. All the fun parts of life are optional.}}","alt":"The only things you HAVE to know are how to make enough of a living to stay alive and how to get your taxes done. All the fun parts of life are optional.","img":"https://imgs.xkcd.com/comics/forgot_algebra.png","title":"Forgot Algebra","day":"2"},{"month":"5","num":1051,"link":"","year":"2012","news":"","safe_title":"Visited","transcript":"((the following is in the standard format of a wikipedia article, modified to reflect the content of the comic))\n..and was a pioneer of literary [[social realism]].\n\nHe was born in [[Dos Hermanas]] in the[[Andalusia]] region of [[Spain]] (not to be confused with [[Andalasia]]((link clicked)), the kingdom in Disney's [[Enchanted]]((link clicked)) ), which is also the hometown of [[Macarena]]((link clicked)) band [[Los Del Rio]]((link clicked)),\n\nHis [[third novel]], set during the [[Burmese-Siamese war]], marked the start of a lifelong interest in the [[history of Southeast Asia]]. He spent his later years in [[Thailand]], writing his final novels just a few blocks from the hotel where actor [[David Carradine]]((link clicked)) died of [[Autoerotic Asphyxiation]] ((link clicked)).\n\n{{Title text: I hate when I read something like '... tension among the BASE jumpers nearly led to wingsuit combat ...', and I get excited because 'wingsuit combat' is underlined, only to find that it's just separate links to the 'wingsuit' and 'combat' articles.}}","alt":"I hate when I read something like '... tension among the BASE jumpers nearly led to wingsuit combat ...', and I get excited because 'wingsuit combat' is underlined, only to find that it's just separate links to the 'wingsuit' and 'combat' articles.","img":"https://imgs.xkcd.com/comics/visited.png","title":"Visited","day":"4"},{"month":"5","num":1052,"link":"https://www.youtube.com/watch?v=DhaEjgnmy3c","year":"2012","news":"Cool--someone's already taken a crack at <a href=\"https://www.youtube.com/watch?v=Gu1VhsNOwPU\">singing this</a>!","safe_title":"Every Major's Terrible","transcript":"Every Major's Terrible\nTo the Tune of Gilbert & Sullivan's\nModern Major-General Song\n\n(Which you may know from Tom Lehrer's \nElements\n.\nIf not, just hum \nSupercalifragilisticexpialidocious\n.)\n\n[[Each panel shows a member of a different major.  First up is a philosopher.]]\nPhilosophy's just math sans rigor, sense, and practicality\n\nAnd math's just physics unconstrained by precepts of reality.\n\nA business major's just a thing you get so you can graduate\n\nAnd chemistry's for stamp collectors high on methylacetate.\n\nWhy anyone who wants a job would study lit's a mystery\n\nUnless their only other choice were something like art history.\n\nA BA in communications guarantees that you'll achieve\n\nA little less than if you'd learned to underwater basket-weave\n\nI'd rather eat a Fowler's Toad than major in biology,\n<<Ribbit>>\n\nAnd social psych is worse than either psych \nor\n sociology.\n\n[[At this point the singer is shown talking to a balding professor at a desk.]]\nThe thought of picking any one of these is too unbearable.\n\nJust put me down as \"Undecided\" -- Every major's terrible.\n\n[[Back to pictures of majors.]]\nNow, if you can't prognosticate, that's ok in seismology,\n\nBut if your hindsight's weak as well, you'd best stick to theology.\n\nCS will make each day a quest to find a missing close-paren.\n\nVirology will guarantee you'll never get a hug again.\n\nI.T. prepares you for a life of fighting with PCs nonstop.\n\nAs Pratchett said, \nTerry Pratchett: \"Geography's just physics slowed with trees on top.\"\n\nThough physics seems to promise you a Richard Feynman-like career,\n\nThe Wiki page for \"Physics Major\" redirects to \n\"Engineer.\"\n\n\nThey say to study history or find yourself repeating it,\n\nBut all that it prepares you for is forty years of teaching it.\n\n[[And back to the explanation at the desk.]]\nI recognize my four-year plan's at this point not repairable,\n\nBut put me down as \"Undecided\" -- every major's terrible.\n\n[[More pictures of majors.  The astronomer appears to be the Bad Astronomer]]\nAstronomers all cringe when they hear \"supermoon\" or \"zodiac,\"\n\nAgronomy's a no-go; I'm a huge agorophobiac.\n\nI'm too ophiophobic to consider herpetology,\n\nAnd I can't stomach any part of gastroenterology.\n\nWhile pre-med gives you twitchy-eyed obsession with your GPA,\n\n((This panel is done in free verse))\n   a\n poetry degree\n    bespeaks\nbewildering\n      naiveté.\n\nTV's behind the rush into forensic criminology\n\n(or so claims meta-academic epidemiology).\n\nBy dubbing econ \"Dismal Science\" adherents exaggerate;\n\nThe \"dismal\"'s fine -- it's \"science\" where they patently prevaricate.\n\n[[And back to the desk a final time.]]\n\nIn terms of choices, I'd say only Sophie's was comparable.\n\nJust put me down as \"Undecided\" -- every major's terrible!\n\n{{Title text: Someday I'll be the first to get a Ph. D in 'Undeclared'.}}","alt":"Someday I'll be the first to get a Ph. D in 'Undeclared'.","img":"https://imgs.xkcd.com/comics/every_majors_terrible.png","title":"Every Major's Terrible","day":"7"},{"month":"5","num":1053,"link":"","year":"2012","news":"","safe_title":"Ten Thousand","transcript":"I try not to make fun of people for admitting they don't know things.\nBecause for each thing \"veeryone knows by the time they're adults, every day there are, on average, 10,000 people in the US hearing about it for the first time.\nFraction who have heard of it at birth = 0%\nFraction who have heard of it by 30 ~= 100%\nUS birth rate ~= 4,000,000\nyear\nNumber hearing about it for the first time ~= 10,000\nday\n\nIf I make fun of people, I train them not to tell me when they have those moments.  And I miss out on the fun.\nPerson #1, about to have a messy fun time: \"Diet coke and mentos thing\"? What's that?\nPerson #2, in a delightfully pro-knowledge mood: Oh man! come on, we're going to the grocery store.\nPerson #1: Why?\nPerson #2: You're one of today's lucky 10,000.\n\n{{Title text: Saying 'what kind of an idiot doesn't know about the Yellowstone supervolcano' is so much more boring than telling someone about the Yellowstone supervolcano for the first time.}}","alt":"Saying 'what kind of an idiot doesn't know about the Yellowstone supervolcano' is so much more boring than telling someone about the Yellowstone supervolcano for the first time.","img":"https://imgs.xkcd.com/comics/ten_thousand.png","title":"Ten Thousand","day":"9"},{"month":"5","num":1054,"link":"","year":"2012","news":"","safe_title":"The bacon","transcript":"Person 1; I'm out of work, but I'm not stressed about it because my wife is a pharmacist and she brings home Thebacon.\nOnly later did I find out that Thebacon is the common name for Dihydrocodine Enol Acetate, a synthetic opioid similar to Vicodin.\n{{Title text: Normally pronounced 'THEH-buh-kon', I assume.}}","alt":"Normally pronounced 'THEH-buh-kon', I assume.","img":"https://imgs.xkcd.com/comics/thebacon.png","title":"The bacon","day":"11"},{"month":"5","num":1055,"link":"","year":"2012","news":"","safe_title":"Kickstarter","transcript":"[[A kickstarter page with zero donations, a target of $5,000, and 90 days to go.  Black Hat Man has posted a video and a description of his project, the first lines of which are visible]]\nTime was, anyone with a webcam and an idea could raise boatloads of cash on kickstarter. But with increased popularity comes tougher competition.  Now, to get support, you need a really standout video or compelling writeup.\nI have anidea for a Kickstarter campaign that could raise millions, but I need your help to craft the perfect pitch.\nIf I raise $5,000, I'll be able to devote the.. [[pitch ends here]]\n{{Title text: If you pledge more than $50 you'll get on the VIP list and have first dibs on a slot on ANY of the pledge levels in the actual campaign.}}","alt":"If you pledge more than $50 you'll get on the VIP list and have first dibs on a slot on ANY of the pledge levels in the actual campaign.","img":"https://imgs.xkcd.com/comics/kickstarter.png","title":"Kickstarter","day":"14"},{"month":"5","num":1056,"link":"","year":"2012","news":"","safe_title":"Felidae","transcript":"Well-known felines:\n[[A graph organizing various feline species labeled with common names ordered by Genera(in order of which would win in a fight) on the y axis, and coolness of name on the x axis]]\nSmilodon(extinct): \"Saber-toothed cat (scientific name: Smilodon fatalis)\nPanthera: \"Jaguar\", \"Leopard\", \"Snow Leopard\", \"Tiger\", \"Lion\"\nPuma: \"Cougar\", \"Puma\", \"Panther\", \"Mountain Lion\"\nOther felidae: \"Ocelot\", \"Cheetah\"\nFelis & Lynx: \"Housecat\", \"Bobcat\", \"Wildcat\", \"Lynx\"\n[[Some elements are further connected using an unbranched acyclic digraph.  The elements are connected thus: \"Cheetah\" -> \"Puma\" -> \"Jaguar\" -> \"Panther\" -> \"Tiger\" -> \"Leopard\" -> \"Snow Leopard\" -> \"Lion\" -> \"Mountain Lion\"\nThe OS X Problem\n\n{{Title text: 'Smilodon fatalis' narrowly edged out 'Tyrannosaurus rex' to win this year's Most Badass Latin Names competition, after edging out 'Dracorex hogwartsia' and 'Stygimoloch spinifer' (meaning 'horned dragon from the river of death') in the semifinals.}}","alt":"'Smilodon fatalis' narrowly edged out 'Tyrannosaurus rex' to win this year's Most Badass Latin Names competition, after edging out 'Dracorex hogwartsia' and 'Stygimoloch spinifer' (meaning 'horned dragon from the river of death') in the semifinals.","img":"https://imgs.xkcd.com/comics/felidae.png","title":"Felidae","day":"16"},{"month":"5","num":1057,"link":"","year":"2012","news":"","safe_title":"Klout","transcript":"Person: I'd like to ask a favor.  If someday, in the future, we meet in person, \n\nPerson: And if, as of that day, I've interacted with Klout in *any* way except to opt out, I want you to punch me in the face without warning.\n\nPerson: This may sound like a joke, so let me be clear: I am *dead serious*. Ignore anything I say retracting this. Thank you.\n\n{{Title text: Though please do confirm that it's actually *me* on Klout first, and not one of my friends trying to get me punched. The great thing about this douchebag deadman switch is that I will never dare trigger it.}}","alt":"Though please do confirm that it's actually *me* on Klout first, and not one of my friends trying to get me punched. The great thing about this douchebag deadman switch is that I will never dare trigger it.","img":"https://imgs.xkcd.com/comics/klout.png","title":"Klout","day":"18"},{"month":"5","num":1058,"link":"","year":"2012","news":"","safe_title":"Old-Timers","transcript":"[[A man with a neck beard types away at his computer screen.]]\nNeckbeard: (typing) Whatever, noob. I've been on the internet since the BBS days.\nScreen: \n\nWrong.\n\n\n<<type type>>\n\n[[A girl with buns on her head kneels on her chair, typing at a laptop on a table.]]\nBuns: (typing) Before I was born, a lab took egg and sperm samples from my parents and sequenced the DNA.\n<<type type>>\n\n[[Neckbeard sits at his desk, reading his screen.]]\nBuns: (from the screen) They emailed the genome to the Venter Institute, where they synthesized the genome and implanted it into sperm and eggs which became me.\n\n[[Buns still typing on the laptop.]]\nBuns: So, no. - You've \nlooked\n at the internet. - I've \nbeen\n there.\n<<type type>>\n\n{{Title text: You were on the internet before I was born? Well, so was I.}}","alt":"You were on the internet before I was born? Well, so was I.","img":"https://imgs.xkcd.com/comics/old_timers.png","title":"Old-Timers","day":"21"},{"month":"5","num":1059,"link":"","year":"2012","news":"","safe_title":"Bel-Air","transcript":"[[A man sits on an easy chair in front of a TV.]]\nTV: Well, my posh Bel Air life took a turn for the worse.\n\n[[Same scene.]]\nTV: It's a story best related in a doggerel verse.\n\n[[Same scene.]]\nTV: So kick back, relax, lemme put on some Adele for ya,\n\n[[Man raises the remote and points at the screen.]]\nTV: While I tell you why I'm running for mayor of Phila--\n<<CLICK>>\n\n{{Title text: Aaron Sorkin has been tapped to write the TV movie about the aging prince's eventual election to Pat Toomey's Senate seat, currently titled either 'FRESHman Senator' or 'Mr. Smith Goes to Washington'.}}","alt":"Aaron Sorkin has been tapped to write the TV movie about the aging prince's eventual election to Pat Toomey's Senate seat, currently titled either 'FRESHman Senator' or 'Mr. Smith Goes to Washington'.","img":"https://imgs.xkcd.com/comics/bel_air.png","title":"Bel-Air","day":"23"},{"month":"5","num":1060,"link":"","year":"2012","news":"","safe_title":"Crowdsourcing","transcript":"[[A man is standing in front of a flowchart on a wall, indicating with a pointer. A man and two women are looking on with interest. One woman holds a briefcase.]]\nMan: We crowdsource the desig process, allowing those with the best designs to connect - via already-in-place social networking infrastructure - with interested manufacturers, distributors, and marketers.\n\nNobody caught on that our business plan didn't involve \nus\n in any way - it was just a description of other people making and selling products.\n\n{{Title text: We don't sell products; we sell the marketplace. And by 'sell the marketplace' we mean 'play shooters, sometimes for upwards of 20 hours straight.'}}","alt":"We don't sell products; we sell the marketplace. And by 'sell the marketplace' we mean 'play shooters, sometimes for upwards of 20 hours straight.'","img":"https://imgs.xkcd.com/comics/crowdsourcing.png","title":"Crowdsourcing","day":"25"},{"month":"5","num":1061,"link":"","year":"2012","news":"","safe_title":"EST","transcript":"XKCD Presents\nEARTH STANDARD TIME\n(EST)\nA Universal Calendar for a Universal Planet\nEST is...\nSimple * Clearly Defined * Unambiguous\nFree of Historical Baggage * Compatible with Old Units\nPrecisely Synced with the Solar Cycle * Free of Leap Years\nIntermittently Amenable to Date Math\n\nUNITS\nSecond: 1 S.I. Second\nMinute: 60 seconds\nHour: 60 minutes\nDay: 1444 minutes (24 hours 4 minutes)\n\nMonth: 30 Days\nYear: 12 months\n\nRULES\nFor 4 hours after every full moon, run clocks backward.\nThe non-prime-numbered minutes of the first full non-reversed hour after a solstice or equinox happen twice.\n\n[Epoch]      \n00:00:00 EST, January 1, 1970 = 00:00:00 GMT, January 1, 1970 (Julian calendar)\n[Tim Zones]\nThe two EST time zones are \nEST\n and \nEST (United Kingdom)\n. These are the same except that the UK second is 0.944 standard seconds.\n\nDaylight saving: Countries may enter DST, but no time may pass there.\nNarnian Time: Synchronizedâ\nYear Zero: EST \ndoes\n have a year 0. (However, there is no 1958.)\n{{Title text: The month names are the same, except that the fourth month only has the name 'April' in even-numbered years, and is otherwise unnamed.}}","alt":"The month names are the same, except that the fourth month only has the name 'April' in even-numbered years, and is otherwise unnamed.","img":"https://imgs.xkcd.com/comics/est.png","title":"EST","day":"28"},{"month":"5","num":1062,"link":"","year":"2012","news":"","safe_title":"Budget News","transcript":"[[The front page of a newspaper entitled The Daily News. The photo on the right is of a man at a podium blocking his face from an attack from a large bird,  and the headline on the left reads 'DEFICIT HAWK ATTACKED BY REGULAR ONE'.]]\n\n{{Title text: I will vote, no questions asked, for any candidate who describes themselves as more of a deficit sugar glider.\\\"\"}}","alt":"I will vote, no questions asked, for any candidate who describes themselves as 'more of a deficit sugar glider.'","img":"https://imgs.xkcd.com/comics/budget_news.png","title":"Budget News","day":"30"},{"month":"6","num":1063,"link":"","year":"2012","news":"","safe_title":"Kill Hitler","transcript":"[[Black Hat Man and another man stand in front of a double door, which bears the label 'TIME door'. BHM has his hands on his hips.]]\nBHM: I finished my time machine, but it's one-use only.\nMan: You \ngotta\n kill Hitler.\n\n[[Close-up of BHM, one hand palm upward.]]\nBHM: You are you so obsessed with this Hitler guy? We have \nall\n of \ntime\n we could explore!\n\n[[Close-up of the other man with both hands palm upward.]]\nMan: He's evil incarnate! He murdered millions and sparked global war! \nEveryone\n agrees -- if you get a time machine, you kill Hitler.\n\n[[BHM enters the now open Time door as the other man looks on..]]\nBHM: Fine, fine, I get it! Calm down. - BRB, killing Hitler.\n\n[[BHM returns and shuts the door, the other man has outstretched arms.]]\nBHM: There. Done. Are you happy? \nMan: \nThank\n you.\nBHM: He was in some kind of bunker. 1945 was \nloud!\n \nMan: \n\nNO!\n\n\n\n{{Title text: Revised directive: It is forbidden for you to interfere with human history until you've at least taken a class on it.}}","alt":"Revised directive: It is forbidden for you to interfere with human history until you've at least taken a class on it.","img":"https://imgs.xkcd.com/comics/kill_hitler.png","title":"Kill Hitler","day":"1"},{"month":"6","num":1064,"link":"","year":"2012","news":"","safe_title":"Front Door","transcript":"[[A graph titled 'Walking Back to My Frong Door at Night': the x axis represents geographic location, where 0 to around the midpoint is 'yard', a point beyond the midpoint is 'steps', a point after that is 'door', and all points afterward are 'inside.' \nA blue line, labeled 'Fear That There's Something Behind Me' begins to slowly increase from the start, with a slight dip further into the yard, and a steep increase right before the steps, maxing on the steps, and decling steeply at the door, bottoming out once inside.\nA gray line, labeled 'Forward Speed' is at a steady medium height until it gets to the steps, at which point it shoots upwards, and then slowly declines once inside. \nA red line, labeled 'Embarrassment' stays at 0 until just before the steps, where it begins to trend upwards, spikes at the door, and begins to slowly decline once inside.\n\n{{Title text: FYI: I'll be releasing a wolf into a randomly chosen front yard sometime in the next 30 years. Now your fear is reasonable, and you don't need to feel embarrassed anymore. Problem solved!}}","alt":"FYI: I'll be releasing a wolf into a randomly-chosen front yard sometime in the next 30 years. Now your fear is reasonable, and you don't need to feel embarrassed anymore. Problem solved!","img":"https://imgs.xkcd.com/comics/front_door.png","title":"Front Door","day":"4"},{"month":"6","num":1065,"link":"","year":"2012","news":"","safe_title":"Shoes","transcript":"[[A man holding a sword looks up to a disembodied voice coming from above, and a box hovers in the air before him.]]\nVoice: For saving my kingdom, I offer you a gift of great power.\n\n[[The man puts down his sword, and the box opens, a glow emanating from within.]]\nVoice: These magic shoes enable the wearer to outrun death itself.\nMan: Thank you. I...\n\n[[A close-up on the man as he examines the shoes. They are like Vibram FiveFingers shoes.]]\nMan: Whoa, wait. They have those creepy individual toes.\n\n[[The man puts the shoes back in the box.]]\nVoice: But they make you immortal.\nMan: ...I have to think about this.\n\n{{Title text: I *do* hear that they're the most comfortable thing to wear on your feet since sliced bread.}}","alt":"I *do* hear that they're the most comfortable thing to wear on your feet since sliced bread.","img":"https://imgs.xkcd.com/comics/shoes.png","title":"Shoes","day":"6"},{"month":"6","num":1066,"link":"","year":"2012","news":"","safe_title":"Laundry","transcript":"[[Heading reads \"College Laundry Habits\".]]\n\n[[Panel labeled \"First Week\". 5 ovals arranged in a rough circle, with a clockwise path connecting them: \"Dresser & Closet\", \"On Body\", \"Hamper\", \"Washer & Dryer\", \"Folding Area\" (and back to the first). The area outside the ovals is labeled \"Floor\".]]\n\n[[Panel labeled \"Second Week\". The path has been modified so that it does not go through \"Folding Area\" - only through the other 4 ovals.]]\n\n[[Panel labeled \"Third Week\". The path has been modified so that it does not go through \"Dresser & Closet\". Only \"On Body\", \"Hamper\", and \"Washer & Dryer\" remain.]]\n\n[[Panel labeled \"Second Month\". The path no longer passes through \"Hamper\" - only \"On Body\" and \"Washer & Dryer\".]]\n\n[[Panel labeled \"End of Semester\". The path no longer goes to \"Washer & Dryer\", instead just looping back around from \"On Body\" to \"On Body\" again after passing through the \"Floor\".]]\n\n{{Title text: During the second semester, the path is briefly routed through the dishwasher.}}","alt":"During the second semester, the path is briefly routed through the dishwasher.","img":"https://imgs.xkcd.com/comics/laundry.png","title":"Laundry","day":"8"},{"month":"6","num":1067,"link":"","year":"2012","news":"","safe_title":"Pressures","transcript":"[[A person walks up to a patent clerk examining documents]]\nPerson: So.. what've you been up to?\nPatent Clerk: Handling patent applications.\nPerson: Yeah, but... besides that?\nPatent Clerk: That's about it.\nPerson: You're not, like, thinking about any cool stuff? Just curious.\nFor the last hundred years, Swiss patent clerks have been under some weird pressures.\n\n{{Title text: Everyone's caught by surprise when a theory of quantum gravity is developed by a sound technician wearing patent leather shoes while editing Clerks II.}}","alt":"Everyone's caught by surprise when a theory of quantum gravity is developed by a sound technician wearing patent leather shoes while editing Clerks II.","img":"https://imgs.xkcd.com/comics/pressures.png","title":"Pressures","day":"11"},{"month":"6","num":1068,"link":"","year":"2012","news":"","safe_title":"Swiftkey","transcript":"[[Person 1 shows off phone to Person 2]]\nPerson 1: Have you tried SwiftKey?  It's got the first decent language model I've seen. It learns from your SMS\nEmail archives what words you use together most often.\n\nPerson 1: Spacebar inserts its best guess. So if I type \"The Empi\" and hit space three times, it types \"The Empire Strikes Back\".\nPerson 2: What if you mash space in a blank message?\n\nPerson 1: I guess it fills in your most likely first word, then the word that usually follows it..\nPerson 2: So it builds up your \"typical\" sentence. Cool! Let's see yours!\nPerson 1: Uh--\n\nSwiftKey: I\n\nSwiftKey: Am\n\nSwiftKey: So\n\nSwiftKey: Sorry\n\nSwiftKey: That's\n\nSwiftKey: Never\n\nSwiftKey: Happened\n\nSwiftKey: Before.\n\n{{Title text: Although the Markov chain-style text model is still rudimentary; it recently gave me \"Massachusetts Institute of America\". Although I have to admit it sounds prestigious.}}","alt":"Although the Markov chain-style text model is still rudimentary; it recently gave me \"Massachusetts Institute of America\". Although I have to admit it sounds prestigious.","img":"https://imgs.xkcd.com/comics/swiftkey.png","title":"Swiftkey","day":"13"},{"month":"6","num":1069,"link":"","year":"2012","news":"","safe_title":"Alphabet","transcript":"[[A guy walks up to a girl sitting at a bar]]\nBaby, if I could rearrange the alphabet, I'd forget about you in a *heartbeat*.  I'm not gonna waste my one chance to help the mess that is English orthography.\n\n{{Title text: Do I get to remove letters entirely? Or just rearrange them? Because the 'k\nc' situation is ridiculous. Look, we can make out whenever. This is *immortality*!}}","alt":"Do I get to remove letters entirely? Or just rearrange them? Because the 'k/c' situation is ridiculous. Look, we can make out whenever. This is *immortality*!","img":"https://imgs.xkcd.com/comics/alphabet.png","title":"Alphabet","day":"15"},{"month":"6","num":1070,"link":"","year":"2012","news":"","safe_title":"Words for Small Sets","transcript":"[[A very small chart]]\nJust to clear things up:\nA few: anywhere from 2 to 5\nA handful: anywhere from 2 to 5\nSeveral: anywhere from 2 to 5\nA couple: 2 (but sometimes up to 5\n\n{{Title text: If things are too quiet, try asking a couple of friends whether \"a couple\" should always mean \"two\". As with the question of how many spaces should go after a period, it can turn acrimonious surprisingly fast unless all three of them agree.}}","alt":"If things are too quiet, try asking a couple of friends whether \"a couple\" should always mean \"two\". As with the question of how many spaces should go after a period, it can turn acrimonious surprisingly fast unless all three of them agree.","img":"https://imgs.xkcd.com/comics/words_for_small_sets.png","title":"Words for Small Sets","day":"18"},{"month":"6","num":1071,"link":"https://xkcd.com/1071/large/","year":"2012","news":"","safe_title":"Exoplanets","transcript":"[[An enormous diagram of dots, mostly of varying shades of brown and greenish yellow, with a number of smaller blue dots and larger red dots.]]\nAll 786 known planets (as of June 2012) to scale. (Some planet sizes estimated based on mass)\nThis [[indicating a small section of 8 planets out of the several hundreds]] is our solar system.  \nThe rest of these orbit other stars and were only discovered recently.  \nMost of them are huge because those are the kind we learned to detect first, but now we're finding that small ones are actually more common.  \nWe know nothing about what's on any of them. With better telescopes, that could change. \n\nThis is an exciting time.\n\n\n{{Title text: Planets are turning out to be so common that to show all the planets in our galaxy, this chart would have to be nested in itself--with each planet replaced by a copy of the chart--at least three levels deep.}}","alt":"Planets are turning out to be so common that to show all the planets in our galaxy, this chart would have to be nested in itself--with each planet replaced by a copy of the chart--at least three levels deep.","img":"https://imgs.xkcd.com/comics/exoplanets.png","title":"Exoplanets","day":"20"},{"month":"6","num":1072,"link":"","year":"2012","news":"","safe_title":"Seventies","transcript":"Person 1: Nice jacket. Hey -- the Seventies called.\nPerson 2: Oh? What'd they want?\n\n[[Person 1 looking at phone]]\nPerson 1: I don't know. They didn't leave a message.\nPerson 2: Weird.\n\n1974:\n[[Person in bell bottoms using a rotary phone to call the present day, with an incredulous look on his face.]]\nVoicemail service: If you'd like to leave a message, press \"1\".\n\n{{Title text: Hey, man, the 1670s called. They were like 'Wherefore this demonic inÅ¿trument? By what Å¿orcery does it produce Å¿uch Å¿ounds?\"}}","alt":"Hey, man, the 1670s called. They were like 'Wherefore this demonic inſtrument? By what ſorcery does it produce ſuch ſounds?\"","img":"https://imgs.xkcd.com/comics/seventies.png","title":"Seventies","day":"22"},{"month":"6","num":1073,"link":"","year":"2012","news":"","safe_title":"Weekend","transcript":"[[A man stands at a podium before a very large crowd.]]\nMan: We all hate Mondays. We're all working for the weekend. But our chains exist only in our minds.\n\n[[A shot of the man from the podium upwards, from a 3\n4 angle. He raises one hand in explanation.]]\nMan: Calendars are just social consensus. Nature doesn't know the day of the week.\n\n[[Closer still, looking straight ahead.]]\nMan: My friends-- we can \nmake\n today Saturday.\n\n[[Extreme close-up, negative colors.]]\nMan: We can make it saturday \nforever\n.\n\n{{Title text: Of the two Garfields, you wouldn't think the cat would turn out to be the more compelling presidential speechwriter, but there you go.}}","alt":"Of the two Garfields, you wouldn't think the cat would turn out to be the more compelling presidential speechwriter, but there you go.","img":"https://imgs.xkcd.com/comics/weekend.png","title":"Weekend","day":"25"},{"month":"6","num":1074,"link":"","year":"2012","news":"","safe_title":"Moon Landing","transcript":"[[A man is sitting at a table with a laptop open. His hands are on the keys.]]\nMan: Hah-- Neil DeGrasse Tyson has a great reply to people who doubt astronauts went to the moon.\nVoice off-screen: Oh?\nMan: \"Atop 3,000 tons of rocket fuel, where \nelse\n do you think they were headed?\"\n\n[[The voice off screen turns out to be a woman. She is depicted, and now the man is off-screen.]]\nWoman: Cute. But it overlooks an even simpler argument.\nMan: Which is?\n\n[[Both the woman and man are now visible. The man has turned her chair around to face her.]]\nWoman: If NASA were willing to fake great accomplishments, they'd have a second one by now.\nMan: \nOuch.\n\nWoman: ...too mean?\nMan: That burn was so harsh I think you deorbited.\n\n{{Title text: Ok, so Spirit and Opportunity are pretty awesome. And Kepler. And New Horizons, Cassini, Spirit and Opportunity, Curiosity, TiME, and Project M. But c'mon, if the Earth were a basketball, in 40 years no human's been more than half an inch from the surface.}}","alt":"Ok, so Spirit and Opportunity are pretty awesome. And Kepler. And New Horizons, Cassini, Curiosity, TiME, and Project M. But c'mon, if the Earth were a basketball, in 40 years no human's been more than half an inch from the surface.","img":"https://imgs.xkcd.com/comics/moon_landing.png","title":"Moon Landing","day":"27"},{"month":"6","num":1075,"link":"","year":"2012","news":"","safe_title":"Warning","transcript":"[[An American Diamond warning sign with the following message on it:\nYou're in a box on wheels hurtling along several times faster than evolution could possibly have prepared you to go.\nNext 5 miles.]]\n\n{{Title text: Also possibly several miles beyond that.}}","alt":"Also possibly several miles beyond that.","img":"https://imgs.xkcd.com/comics/warning.png","title":"Warning","day":"29"},{"month":"7","num":1076,"link":"","year":"2012","news":"","safe_title":"Groundhog Day","transcript":"Groundhog Day really didn't end that way.  When Bill Murray finally slept with Rita, it *didn't* break the loop. [[Phil Connors and Rita gettin' busy under the covers of his bed]]\n\nThey just kept having sex, night after night, [[bed containing Phil and Rita repeats]] February 2nd after February 2nd... [[calendar page repeats]] ..forever\n\nBut nothing is forever. Not even forever\n\nAnd the day *after* that sexual infinity [[calendar page here]] was February 3rd. \n\n264 days later (the length of a pregnancy) was october 23rd -- [[An enormous explosion in space]] Bishop Ussher's date for the birth of our world.\n\n{{Title text: If you closely examine the cosmic background radiation, you can pick up lingering echoes of 'I Got You Babe'.}}","alt":"If you closely examine the cosmic background radiation, you can pick up lingering echoes of 'I Got You Babe'.","img":"https://imgs.xkcd.com/comics/groundhog_day.png","title":"Groundhog Day","day":"2"},{"month":"7","num":1077,"link":"","year":"2012","news":"","safe_title":"Home Organization","transcript":"[[One big plain room with a person sitting on the floor with a laptop on one side, a modem and wireless router on the other, and a big box full of the usual accoutrements of living in the middle, with \"MISC\" written on the side]]\n\nHome Organization Tip: Just Give Up.\n\n{{Title text: Lifehacking!}}","alt":"Lifehacking!","img":"https://imgs.xkcd.com/comics/home_organization.png","title":"Home Organization","day":"4"},{"month":"7","num":1078,"link":"","year":"2012","news":"","safe_title":"Knights","transcript":"[[A chessboard.  The black pawns have all gained longbows and have specifically taken down the enemy white knights (horses)]]\n\n{{Title text: 1. Ne3 ... âââ  2. Nc3 ... âââ  0-1}}","alt":"1. Nf3 ... ↘↘↘  2. Nc3 ... ↘↘↘  0-1","img":"https://imgs.xkcd.com/comics/knights.png","title":"Knights","day":"6"},{"month":"7","num":1079,"link":"https://xkcd.com/1079/large/","year":"2012","news":"There's a larger version of this map <a href=\"https://xkcd.com/1079/large/\">here</a>! It's also available as a <a href=\"https://store.xkcd.com/products/united-shapes-poster\">poster</a>.<br />New: <a href=\"https://what-if.xkcd.com/1/\">what-if.xkcd.com</a>: abusing science to answer hypothetical questions.<br />I'll answer a new reader question every Tuesday.","safe_title":"United Shapes","transcript":"The United Shapes: A map of things states are shaped like\n\n((Each state has some item wedged to stay inside its borders))\n\nAlabama: A moai head facing east.\nAlaska: Winne the Pooh with a jetpack and a ray gun.\nArizona: A refrigerated shelf containing milk, bread, and pastries.\nArkansas: A measuring cup.\nCalifornia: A vacuum.\nColorado: The wiki article on Colorado.\nConnecticut: A train conductor's hat.\nDelaware: A meerkat.\nFlorida: an eggplant.\nGeorgia: Missouri.\nHawaii: A snowball.\nIdaho: A garden gnome, sitting down.\nIllinois: A gangster with a guitar case, upside down.\nIndiana: The brush of a paintbrush.\nIowa: A tomato, lettuce, cold cut and cheese sandwich.\nKansas: A stand-up piano.\nKentucky: A cloud.\nLouisiana: A boot with some gum stuck to the bottom of it.\nMaine: A Vulcan salute.\nMaryland: A howling wolf, upside down.\nMassachusetts: An elephant, being ridden by a man, carrying tea.\nMichigan: A mitten for the lower portion, an eagle for the UP.\nMinnesota: $160 in $20 USD bills.\nMississippi: A moai head facing west.\nMissouri: Georgia.\nMontana: One half of a muffin.\nNebraska: A blue VW type 2 with mattresses sticking out the back.\nNevada: A clothes iron.\nNew Hampshire: A tall brick factory building.\nNew Jersey: A bent-over old person.\nNew Mexico: A liquid container labeled for something of unusual and silly danger.\nNew York: A hybrid transmission with standard manual-style gears and a torque converter sliced in half.\nNorth Carolina: A bouquet of flowers.\nNorth Dakota: The top half of an amp.\nOhio: Underwear (Briefs).\nOklahoma: A covered pot, dripping with boilover.\nOregon: A locomotive.\nPennsylvania: A very thick book with a bookmark.\nRhode Island: The bow half of a boat's hull.\nSouth Carolina: A slice of pizza.\nSouth Dakota: The bottom half of an amp.\nTennessee: A number of childrens' books, placed in a slightly askew pile.\nTexas: A dog sitting in a bowl.\nUtah: An oven.\nVermont: A microscope, upside down.\nVirgina: A frog.\nWashington: A whale.\nWest Virginia: A stegosaurid.\nWisconsin: A skull.\nWyoming: An envelope.\n\n{{Title text: That eggplant is in something of a flaccid state.}}","alt":"That eggplant is in something of a flaccid state.","img":"https://imgs.xkcd.com/comics/united_shapes.png","title":"United Shapes","day":"9"},{"month":"7","num":1080,"link":"https://xkcd.com/1080/large/","year":"2012","news":"","safe_title":"Visual Field","transcript":"Your Central Visual Field\n\n((This comic contains numerous visual elements arranged around a central point, and are intended to represent locations in a sphere with the eyeball as the center.  Underlaid below all of the elements are concentric circles representing degrees from straight ahead, using the eyeball's point of view, denoting where these elements would appear in someone's field of vision given proper setup.  For this description, elements will be described using this grid plus location in degrees within the specified circle, placing 0 degrees to the right and going counterclockwise, separated with the word \"mark\".))\n\n[[At the top are the instructions to view this page]]\nLook at the center with your eyes this far from the screen.\n[[A rolled-up sheet of paper that equals about 55 total horizontal degrees in width in the measurement of the chart]]\n(You can roll up a sheet of paper and cut it - or zoom the page - so it matches this image)\n\n17 mark 0: right eye blind spot. \n\nfrom 0 to 30 mark 15: [[The same image, increasing in absolute size from a very tiny object in the center to one about 20x original size at 30 degrees]]\nDetail - We only see at high resolution over a small area in the center of our vision where retinal cells are densest (the fovea).  If you stare at the center of this chart, your eyes are seeing all these panels at roughly the same level of detail.\n\n9 mark 105: Moon.\n\n7 mark 112: Supermoon. \n\nfrom 0 to 20 mark 170: [[Sets 3 partially overlapping circles in multiple locations along this path. Each set has a primary color in each circle and additive colors in the overlap areas, with color saturation decreasing sharply as the sets leave the center.]] \nColor Vision: We don't see much color outside the center of our vision - our brains keep track of what color things are and fill it in for us.\n\n17 mark 180: Left Eye Blind Spot. (not pictured: T-Boz blind spot, Chilli blind spot)\n\nfrom 0 to infinity mark from 180 to 205: [[A swath of blue, with heavier saturation up to 5 degrees from center to fading, but never gone out to the edges of the image]]\nfrom 0 to 7 from 205 to 235:[[A swath of red, with full saturation in the center and fading out completely at 7 degrees from center]]\nfrom 0 to 7 from 235 to 270:[[A swath of green, with full saturation in the center and fading out completely at 7 degrees from center]]\nRed and green-sensitive cones are mainly limited to the center of our vision.  We have few blue-sensitive cone cells, but they're found out to the edge of our vision.\n\n25 mark 205: [[A small whisp of white in a swath of blue]]\nBlue-sky sprites: These tiny, darting spots, visible against smooth blue backgrounds, are white cells moving in the blood vessels over the retina]]\n\n5 mark 195: [[a long blob, slightly distorting the blue swath]]\nFloaters: Some types of floaters are caused by breakdown of your eyeball goop as you age, but this type is some other kind of debris near the retina.  I don't know what.\n\n10 mark 270: [[An askew crosshair and circle, with faint blue and yellow wedges inside]]\nHumans can see polarization - Stare at a white area on an LCD display while rotating it or your head fast [[use straight ahead as the axis of rotation]].  Polarization direction is shown by a faint central yellow\nblue shape.  (Also visible in deep blue skies)\n\nfrom 0 to 30 mark 340: [[The same image, increasing in absolute size from a very tiny object in the center to one about 20x original size at 30 degrees. The brightness of the image varies from black at 2 mark 340, to gray at 5 mark 340, to nearly white at 10 mark 340, to slightly grayer at 20 mark 340, to medium gray at 30 mark 340.]]\nNight Vision: Cone cells (sharp, central color vision) don't work in low light, but rod cells (monochrome, low-res, non-central) do.  This is why you can walk around in dim light, but not read.  It's also why you can spot fainter stars by looking next to them.\n\n\n\n\n\n{{Title text: I recently learned something that solved a mystery that had bugged me since childhood--why, when I looked at an analog clock, the hand would sometimes seem to take a couple seconds to start ticking. Google \"stopped clock illusion\".}}","alt":"I recently learned something that solved a mystery that had bugged me since childhood--why, when I looked at an analog clock, the hand would sometimes seem to take a couple seconds to start ticking. Google \"stopped clock illusion\".","img":"https://imgs.xkcd.com/comics/visual_field.png","title":"Visual Field","day":"11"},{"month":"7","num":1081,"link":"","year":"2012","news":"","safe_title":"Argument Victory","transcript":"Person 1, chatting on a cellphone: I can't believe you're so wrong. I'm backed by Snopes, Wikipedia, and a half-dozen journals.  You're citing .Net ppages with black backgrounds and like 20 fonts each.\n\nPerson 2, using a laptop on a desk: It's sad how you buy into the official story so unquestioningly.  Guess some people prefer to stay asleep.\n\nPerson 1: Watch closely - I'm about to win this argument.\nPerson 2, responding electronically: how?\n\nPerson 1: By *going down a waterslide*. [[The person is sitting at the very top of a waterslide preparing to descend]]\n\nPerson 2: So? what does that prove?\n\nPerson 1: Wheeee..\n\nPerson 2: You didn't win the argument!\n\nPerson 1: ...eeee <<sploosh>>\n\n{{Title text: Really, the comforting side in most conspiracy theory arguments is the one claiming that anyone who's in power has any plan at all.}}","alt":"Really, the comforting side in most conspiracy theory arguments is the one claiming that anyone who's in power has any plan at all.","img":"https://imgs.xkcd.com/comics/argument_victory.png","title":"Argument Victory","day":"13"},{"month":"7","num":1082,"link":"","year":"2012","news":"","safe_title":"Geology","transcript":"[[Two people are doing a geological survey]]\nPerson 1: Forget the bedding - we were wrong about the whole valley.\nPerson 2: The spreading is recent.\n\nPerson 1: See the friction breccia?\nPerson 2: Oh - flow cleavage! Deeper in the rift.\nPerson 1: Deeper.\n[[An idea pops into Person 1's head]]\n\nPerson 1: This orogeny\nPerson 2: is driven by a\nPerson 1: *huge*\nPerson 2: *thrust* fault\n[[The same idea pops into person 2's head]]\n\n[[They both drop to the ground in a fit of passion]]\nGeology: Surprisingly erotic.\n\n{{Title text: That's a gneiss butte.}}","alt":"That's a gneiss butte.","img":"https://imgs.xkcd.com/comics/geology.png","title":"Geology","day":"16"},{"month":"7","num":1083,"link":"","year":"2012","news":"","safe_title":"Writing Styles","transcript":"If you post: \nyou sound like\n\n((This is a chart with the above two labeled columns.  The rows will be represented below in the same format))\n\n\"Ron Paul is the only candidate who offers us a real choice!\":\nA teenager\n\n\"its gettin 18 so ill b here 4 prob 2 more hrs tops\":\nA senator\n\n\n\n{{Title text: I liked the idea, suggested by h00k on bash.org, of a Twitter bot that messages prominent politicians to tell them when they've unnecessarily used sms-speak abbreviations despite having plenty of characters left.}}","alt":"I liked the idea, suggested by h00k on bash.org, of a Twitter bot that messages prominent politicians to tell them when they've unnecessarily used sms-speak abbreviations despite having plenty of characters left.","img":"https://imgs.xkcd.com/comics/writing_styles.png","title":"Writing Styles","day":"18"},{"month":"7","num":1084,"link":"","year":"2012","news":"","safe_title":"Server Problem","transcript":"Person 1, sitting at laptop: I, um, messed up my server again.\nPerson 2: I'll take a look.  You have the *weirdest* tech problems\n\n[[Person 2 uses the root prompt]]\n~# ls\n\n[[computer returns the following]]\n\nusr\nshare\nAdobe\ndoc\nexample\nandroid_vm\nroot\nsbin\nls.jar:\nError: Device is not responding.\n[[Person 2 has an amazingly incredulous look on their face]]\n\nPerson 2: What did you *do*!?\nPerson 1: Maybe the device is busy. Should I try it later?\nPerson 2: You should shut down this system and wait for the Singularity.\n\n{{Title text: Protip: Annoy Ray Kurzweil by always referring to it as the 'Cybersingularity'.}}","alt":"Protip: Annoy Ray Kurzweil by always referring to it as the 'Cybersingularity'.","img":"https://imgs.xkcd.com/comics/server_problem.png","title":"Server Problem","day":"20"},{"month":"7","num":1085,"link":"","year":"2012","news":"","safe_title":"ContextBot","transcript":"[[A social network feed with four status updates from four different people. Each one has a reply from the same account, which is called 'ContextBot', underneath.]]\nClose-up face w\n glasses: The things I put up with...\nContextBot: (His building's WiFi doesn't reach the bathroom.)\nMale\nfemale couple: You'd think by now I'd have learned never to trust anyone.\nContextBot: (She downloaded a torrent that turned out to be an encrypted .rar and a ilnk to a survey.)\nBlonde girl w\n bangs: I officially give up.\nContextBot: (She hit alt-tab to hide Minecraft at work and accidentally dropped a stack of diamond into lava.)\nSpiky hair guy: Sighhhh\nContextBot: (He thought these grapes were seedless.)\nEveryone stopped complaining about Google's data-gathering when they launched ContextBot, a system which replies to vague, enigmatic social network posts with context from the poster's life. \n\n{{Title text: If you read all vaguebooking\nvaguetweeting with the assumption that they're saying everything they can without revealing classified military information, the internet gets way more exciting.}}","alt":"If you read all vaguebooking/vaguetweeting with the assumption that they're saying everything they can without revealing classified military information, the internet gets way more exciting.","img":"https://imgs.xkcd.com/comics/contextbot.png","title":"ContextBot","day":"23"},{"month":"7","num":1086,"link":"","year":"2012","news":"","safe_title":"Eyelash Wish Log","transcript":"((The panel appears to be the log from a 'wish bureau'.))\n\nEyelash Wish Log\n   Wish Bureau ID #:\n            21118378\n         Date range:\n        Jan-Apr 2012\n[[The 'Wisher' is black hat guy.]]\nWisher\n\nDate    Wish\nJan 09  That wishing on eyelashes worked\nJan 12  A pony\nJan 15  Unlimited wishes\nJan 19  Revocation of rules prohibiting unlimited wishes\nJan 20  A finite but arbitrarily large number of wishes\nJan 28  The power to dictate the rules governing wishes\nFeb 05  Unlimited eyelashes\nFeb 06  That wish-granting entities be required to interpret wishes in accordance with the intent of the wisher\nFeb 08  That wish-granting entities be incapable of impatience\nFeb 12  Unlimited breadsticks\nFeb 12  Veto power over others' wishes\nFeb 19  Veto power over others' wishes and all congressional legislation\nFeb 23  The power to override any veto\nFeb 27  The power to see where any shortened url goes without clicking\nFeb 29  The power to control the direction news anchors are looking while they talk\nMar 07  The power to introduce arbitrary error into Nate Silver's predictions\nMar 15  A house of stairs\nMar 23  A universe which is a replica of this one sans rules against meta-wishes\nMar 29  Free transportation to and from that universe\nApr 02  A clear explanation of how wish rules are structured and enforced\nApr 07  The power to banish people into the TV show they're talking about\nApr 08  Zero wishes\nApr 15  Veto power over clocks\nApr 22  A Pokéball that works on strangers' pets\n\n{{Title text: Ooh, another one. Uh ... the ability to alter any coefficients of friction at will during sporting events.}}","alt":"Ooh, another one. Uh ... the ability to alter any coefficients of friction at will during sporting events.","img":"https://imgs.xkcd.com/comics/eyelash_wish_log.png","title":"Eyelash Wish Log","day":"25"},{"month":"7","num":1087,"link":"","year":"2012","news":"","safe_title":"Cirith Ungol","transcript":"[[A character in a long flowing robe holds up a lantern in one hand; the One Ring is dangling from a necklace in the other.  The scene is a cave, profuse with spiderwebs, bones hanging in some of them.  On one of the webs are words, presumably written by the spider.]]\nSOME PIG\n\n{{Title text: My all-time favorite example of syntactic ambiguity comes from Wikipedia: 'Charlotte's Web is a children's novel by American author E. B. White, about a pig named Wilbur who is saved from being slaughtered by an intelligent spider named Charlotte.'}}","alt":"My all-time favorite example of syntactic ambiguity comes from Wikipedia: 'Charlotte's Web is a children's novel by American author E. B. White, about a pig named Wilbur who is saved from being slaughtered by an intelligent spider named Charlotte.'","img":"https://imgs.xkcd.com/comics/cirith_ungol.png","title":"Cirith Ungol","day":"27"},{"month":"7","num":1088,"link":"","year":"2012","news":"","safe_title":"Five Years","transcript":"[[ Two characters sit across from each other at a desk.  One has a beret and the other has a bun. ]]\nBun: Where do you see yourself in five years?\nBeret: Oh man, I don't know!  Let's find out!\n\n[[ The characters stare at one another. ]]\n\n[[ Cobwebs and hair grow; the desk and chairs fall into disrepair. ]]\n\n[[ Five years pass. ]]\nBeret: Hah--\nBeret: I \nthought\n so!\n\n{{Title text: 'Well, no further questions. You're hired!' 'Oh, sorry! I'm no longer interested. There's a bunch of future I gotta go check out!'}}","alt":"'Well, no further questions. You're hired!' 'Oh, sorry! I'm no longer interested. There's a bunch of future I gotta go check out!'","img":"https://imgs.xkcd.com/comics/five_years.png","title":"Five Years","day":"30"},{"month":"8","num":1089,"link":"","year":"2012","news":"","safe_title":"Internal Monologue","transcript":"[[The scene is a party.  Two characters are talking - the entirety of the text is a thought bubble of one of the two.]]\nThinker:  Am I smiling enough?  Should I be leaning on something?  Where should my hands go?  I hope he doesn't ask me what his name is.  I've said \"yeah\" too much; what are some other agreeing words?  Oh crap, his story just got sad \nstop smiling stop smiling\n\n\n{{Title text: Oh right, eye contact. Ok, good, holding the eye contact ... holding ... still holding ... ok, too long! Getting weird! Quick, look thoughtfully into space and nod. Oh, dammit, said 'yeah' again!}}","alt":"Oh right, eye contact. Ok, good, holding the eye contact ... holding ... still holding ... ok, too long! Getting weird! Quick, look thoughtfully into space and nod. Oh, dammit, said 'yeah' again!","img":"https://imgs.xkcd.com/comics/internal_monologue.png","title":"Internal Monologue","day":"1"},{"month":"8","num":1090,"link":"","year":"2012","news":"","safe_title":"Formal Languages","transcript":"[[A large banner is hanging over a podium, where a speaker is standing.  A stick figure crashes through the left side of the panel, scattering glass.]]\n10th Annual Symposium on Formal Languages\n<<CRASH>>\n\nFigure: Grammar!\n\n[[The figure runs off the right side of the panel, so swiftly it leaves a cloud of dust in its wake.  The speaker at the podium just watches silently.]]\n\n{{Title text: [audience looks around] 'What just happened?' 'There must be some context we're missing.'}}","alt":"[audience looks around] 'What just happened?' 'There must be some context we're missing.'","img":"https://imgs.xkcd.com/comics/formal_languages.png","title":"Formal Languages","day":"3"},{"month":"8","num":1091,"link":"","year":"2012","news":"","safe_title":"Curiosity","transcript":"[[The Curiosity rover is lowered onto the Mars surface by a Sky Crane.]]\n\nYour excuse for anything today:\n\n\"Sorry - I was up all night trying to download photos taken by a robot lowered onto Mars by a Skycrane.\"\n\n{{Title text: As of this writing the NASA\nJPL websites are still overloaded. Trying CURIOSITY-REAR-CAM_[256px_x_256px].torrent.SwEsUb.DVDRip.XviD-aXXo.jpg instead.}}","alt":"As of this writing the NASA/JPL websites are still overloaded. Trying CURIOSITY-REAR-CAM_[256px_x_256px].torrent.SwEsUb.DVDRip.XviD-aXXo.jpg instead.","img":"https://imgs.xkcd.com/comics/curiosity.png","title":"Curiosity","day":"6"},{"month":"8","num":1092,"link":"","year":"2012","news":"","safe_title":"Michael Phelps","transcript":"[[Two people standing outside their en-Phelps-ified swimming pool]]\nPerson 1: Why is Michael Phelps in your backyard pool?\nPerson 2: I don't know. He's been there all day.  Go home, Michael!\nMichael Phelps: Woo! 18 gold medals!\n\n[[The two people break out a pair of pool nets and unsuccessfully try to snag Phelps]]\nPerson 1: Can you get him?\nPerson 2: He's so *fast*!\nPhelps: Ha hah! Can't catch me! <<Splash splash>>\n\n[[One person heads off to fetch something]]\n\n[[Person returns with a hand truck full of jello mix]]\nPhelps: Oh crap.\n\n{{Title text: [shortly] ... he ate ALL of it!?}}","alt":"[shortly] ... he ate ALL of it!?","img":"https://imgs.xkcd.com/comics/michael_phelps.png","title":"Michael Phelps","day":"8"},{"month":"8","num":1093,"link":"","year":"2012","news":"","safe_title":"Forget","transcript":"When will we forget?\nBased on US Census Bureau national population projections.\nAssuming we don't remember cultural events from before age 5 or 6.\nBy this year: the majority of Americans will be too young to remember:\n2012: The seventies\n2013: The Carter presidency\n2014: The Reagan shooting\n2015: The Falkland Islands war\n2016: Return of the Jedi release\n2017: The first Apple Macintosh\n2018: New Coke\n2019: Challenger\n2020: Chernobyl\n2021: Black Monday\n2022: The Reagan Presidency\n2023: The Berlin Wall\n2024: Hammertime\n2025: The Soviet Union\n2026: The LA Riots\n2027: Lorena Bobbit\n2028: The Forrest Gump release\n2029: The Rwandan Genocide\n2030: OJ Simpson's trial\n2031: Clinton's reelection\n2032: Princess Diana\n2033: Clinton's impeachment\n2034: Columbine\n2035: Forgot about Dre\n2036: 9\n11\n2037: VH1's I Love the 80s\n2038: A time before Facebook.\n2039: VH1's I Love the 90s\n2040: Hurricane Katrina\n2041: The planet Pluto\n2042: The first iPhone\n2043: The Bush presidency\n2044: Michael Jackson\n2045: trying to say \"Eyjafjallajökull\"\n2046: The Arab Spring\n2047: Anything embarrassing you do today.\n\n\n{{Title text: 'Baby Got Back' turned 20 this year. My favorite nostalgia show is VH1's 'I Love The Inexorable March of Time Toward the Grave That Awaits Us All.'}}","alt":"'Baby Got Back' turned 20 this year. My favorite nostalgia show is VH1's 'I Love The Inexorable March of Time Toward the Grave That Awaits Us All.'","img":"https://imgs.xkcd.com/comics/forget.png","title":"Forget","day":"10"},{"month":"8","num":1094,"link":"","year":"2012","news":"","safe_title":"Interview","transcript":"[[Black Hat Man is interviewed for a job at an interviewer's desk]]\nInterviewer: ..but thank you for applying. We'll keep your résumé on file.\n\n[[Black Hat Man places a briefcase onto the interviewer's desk]]\nBlack Hat Man: Perhaps *this* could change your mind?\n\n[[Interviewer opens the briefcase]]\n\n[[..the briefcase opens into a hole that extends below the desk]]\n\n[[The hole looks miles deep]]\n\n[[The view falls into the hole]]\n\n[[The interviewer falls down the hole]]\n\n[[The interviewer lands on a chair with a briefcase]]\n\n[[The positions from the original scene have switched and Black Hat Man is now interviewing]]\nBlack Hat Man: ..but thank you for applying. We'll keep your résumé on file.\n\n[[Interviewer looks confused]]\n\n[[Interviewer notices the briefcase]]\n\n[[Interviewer places briefcase on the desk]]\nInterviewer: Perhaps *this* could change your mind?\n\n[[Black Hat Man opens the briefcase]]\n\n[[Black Hat Man looks inside]]\n\n[[Black Hat Man spins the briefcase around]]\nBlack Hat Man: I'm sorry..\n\nBlack Hat Man: - that opening has been filled\n[[briefcase contains the normal business elements of a briefcase]]\n\n{{Title text: Hey, before you go, can you explain to me what job I now have?}}","alt":"Hey, before you go, can you explain to me what job I now have?","img":"https://imgs.xkcd.com/comics/interview.png","title":"Interview","day":"13"},{"month":"8","num":1095,"link":"","year":"2012","news":"","safe_title":"Crazy Straws","transcript":"[[Two people hang out with some beverages.  The speaker here has a bright green crazy straw]]\n\nCrazy Straw Person: The thing to understand about the plastic crazy straw design world is that there are two main camps: The professionals - designing for established brands - and the hobbyists.  The hobbyist mailing lists are full of drama, with friction between the regulars and a splinter group focused on loops..\nHuman subcultures are nested fractally. There's no bottom.\n\n{{Title text: The new crowd is heavily shaped by this guy named Eric, who's basically the Paris Hilton of the amateur plastic crazy straw design world.}}","alt":"The new crowd is heavily shaped by this guy named Eric, who's basically the Paris Hilton of the amateur plastic crazy straw design world.","img":"https://imgs.xkcd.com/comics/crazy_straws.png","title":"Crazy Straws","day":"15"},{"month":"8","num":1096,"link":"","year":"2012","news":"","safe_title":"Clinically Studied Ingredient","transcript":"I can't help but admire the audacity of the marketer who came up with the phrase \"contains a clinically studied ingredient\"\n[[Two people are about to enter a bed for.. activities]]\nPerson 1: Don't worry - I've been tested.\nPerson 2: ...and you're clean?\nPerson 1: So many questions!\n\n{{Title text: Blatantly banking on customers not understanding that it's like a Hollywood studio advertising that their new movie was 'watched by Roger Ebert'.}}","alt":"Blatantly banking on customers not understanding that it's like a Hollywood studio advertising that their new movie was 'watched by Roger Ebert'.","img":"https://imgs.xkcd.com/comics/clinically_studied_ingredient.png","title":"Clinically Studied Ingredient","day":"17"},{"month":"8","num":1097,"link":"","year":"2012","news":"","safe_title":"A Hypochondriac's Nightmare","transcript":"[[A person at an airport slips on a banana peel and gets sucked into a nearby jet engine]]\nPerson (thinking): Seriously!? *This* is what gets me? I wasted so many hours on WebMD worrying about the rash on my arm!\n\n{{Title text: BUT WHAT IF I REASSURE MYSELF WITH A JOKE AND THEN DON'T WORRY ABOUT THE RASH AND IT TURNS OUT TO BE DEATH MITES AND I COULD HAVE CAUGHT IT}}","alt":"BUT WHAT IF I REASSURE MYSELF WITH A JOKE AND THEN DON'T WORRY ABOUT THE RASH AND IT TURNS OUT TO BE DEATH MITES AND I COULD HAVE CAUGHT IT","img":"https://imgs.xkcd.com/comics/a_hypochondriacs_nightmare.png","title":"A Hypochondriac's Nightmare","day":"20"},{"month":"8","num":1098,"link":"","year":"2012","news":"","safe_title":"Star Ratings","transcript":"Understanding online star ratings:\n\n5 stars: [has only one review]\n4.5 stars: Excellent\n4 stars: OK\n3.5 - 1 star: Crap.\n\n{{Title text: I got lost and wandered into the world's creepiest cemetery, where the headstones just had names and star ratings. Freaked me out. When I got home I tried to leave the cemetery a bad review on Yelp, but as my hand hovered over the 'one star' button I felt this distant chill ...}}","alt":"I got lost and wandered into the world's creepiest cemetery, where the headstones just had names and star ratings. Freaked me out. When I got home I tried to leave the cemetery a bad review on Yelp, but as my hand hovered over the 'one star' button I felt this distant chill ...","img":"https://imgs.xkcd.com/comics/star_ratings.png","title":"Star Ratings","day":"22"},{"month":"8","num":1099,"link":"","year":"2012","news":"","safe_title":"Tuesdays","transcript":"[[An unbuxom waitress begins to serve some customers at a table]]\nWaitress: ..and on Tuesdays we offer endless wings.\nWhite Beret Guy: Haha, cool.  i have those.\n\nWaitress: You what?\n\n[[White Beret Guy sprouts a pair of wings]]\nWaitress: AAAAA!!\n\n[[White Beret Guy's wings start getting longer]]\nEveryone: AAAAAAA\n\n[[Wings start to extend into space out from the earth]]\n*Really* Everyone: AAAAAAAA\n\n{{Title text: Try our bottomless drinks and fall forever!}}","alt":"Try our bottomless drinks and fall forever!","img":"https://imgs.xkcd.com/comics/tuesdays.png","title":"Tuesdays","day":"24"}]
