[{"month":"5","num":101,"link":"","year":"2006","news":"","safe_title":"Laser Scope","transcript":"[[ Box with a mailing label on one side, and in the front: ]]\nMiss your loved ones?\n[[ Picture of a missile launcher ]]\nYou don't have to.\nRJX-21 Laser Scope\n{{Alt text: I wish I'd missed you then so I wouldn't be missing you now.}}","alt":"I wish I'd missed you then so I wouldn't be missing you now","img":"https://imgs.xkcd.com/comics/laser_scope.jpg","title":"Laser Scope","day":"12"},{"month":"5","num":102,"link":"","year":"2006","news":"","safe_title":"Back to the Future","transcript":"{{Title: Back to the Future}}\n[[A man and a woman are standing, talking to one another]]\nMan: This weekend, my professor friend built a time machine out of a DeLorean and I went back in time! I helped make sure my parents got together and helped my dad to be less of a loser.\nWoman: Wow! Do you still have the time machine?\nMan: Nah. But I did what I really needed to do.\nWoman: Uh huh.\n[[Neither says anything]]\nWoman: Okay, you remember that my father was in the WTC North Tower, right? \nMan: Yeah...why?\nWoman: I...nothing.\n{{alt text: He's kind of an asshole, when you think about it.}}","alt":"He's kind of an asshole, when you think about it","img":"https://imgs.xkcd.com/comics/back_to_the_future.jpg","title":"Back to the Future","day":"15"},{"month":"5","num":103,"link":"","year":"2006","news":"","safe_title":"Moral Relativity","transcript":"[[A graph, rationalization as a function of speed, increasing exponentially with an asymptote at c]]\nRelated to moral relativism, it states that ethics become subjective only when you approach the speed of light.  That is, it's okay to be self-serving, steal, and murder as long as you're going really, really fast.\n(Note:  This is why rap sounds better on the highway at 90 mph)\n{{It's science!}}","alt":"It's science!","img":"https://imgs.xkcd.com/comics/moral_relativity.jpg","title":"Moral Relativity","day":"17"},{"month":"5","num":104,"link":"","year":"2006","news":"","safe_title":"Find You","transcript":"[[The panel is black with rough-edged white passages running down through it. A stick figure is holding onto a rope, dangling down one of these passages. White text is in the black sections.]]\nYou were afraid that you would disappear, that you would be lost and forgotten.\nI held you tight against the dark and said that I would always come for you.\nThen one day it happened. You were torn from my arms and vanished from this world.\nMaybe you don't remember my promise. But I meant every word.\nI hope you're not afraid, wherever you are.\nYou don't need to be.\nI'm not.\nI will find you.\n{{title-text: I'm like the Terminator, except with love!}}","alt":"I'm like the Terminator, except with love!","img":"https://imgs.xkcd.com/comics/find_you.jpg","title":"Find You","day":"19"},{"month":"5","num":105,"link":"","year":"2006","news":"","safe_title":"Parallel Universe","transcript":"[[Two people are standing next to a large pentagram with candles at the points. A figure is hovering above it in a wave of energy.]]\nPerson 1: Sweet. I summoned myself from a parallel universe.\nPerson 2: You know, he could vanish at any moment.\nPerson 2: You should take this chance to make out with yourself.\nPerson 2: . . . you know, _I_ could vanish at any moment.\n{{alt: It's possible. Better to be on the safe side.}}","alt":"It's possible.  Better to be on the safe side.","img":"https://imgs.xkcd.com/comics/parallel_universe.jpg","title":"Parallel Universe","day":"22"},{"month":"5","num":106,"link":"","year":"2006","news":"","safe_title":"Wright Brothers","transcript":"[[A man and a woman are talking to each other]]\nMan: I've heard that when the Wright brothers argued, they periodically switched sides in the debate to try to encourage a more balanced conclusion.\nMan: We should try that in our relationship!\nWoman: It's a neat idea, but I think treating personal issues like a debate will only engender hostility and hurt feelings.\nMan: No, I think it would help, by forcing us to consider the other person's point of view.\nWoman: Hmm, maybe you're right.\nMan: Am not.  It's a bad idea.\n{{alt: I'm not sure if this is actually true}}","alt":"I'm not sure if this is actually true","img":"https://imgs.xkcd.com/comics/wright_brothers.png","title":"Wright Brothers","day":"24"},{"month":"5","num":107,"link":"","year":"2006","news":"","safe_title":"Snakes on a Plane! 2","transcript":"[[A sky full of jumbo jets is shown in movie poster format.]]\nTop of the poster: From the creators of last summer's hit thriller Snakes On a Plane comes:\nSuperimposed on the sky and planes:  Snakes...  on EVERY Plane!\nBottom of the poster: Much worse than last time.\n{{Mouseover text:  James suggested this, and I'd have to agree.  It'd be much worse.}}","alt":"James suggested this, and I have to agree.  It'd be much worse.","img":"https://imgs.xkcd.com/comics/snakes_on_a_plane_2.jpg","title":"Snakes on a Plane! 2","day":"26"},{"month":"5","num":108,"link":"","year":"2006","news":"","safe_title":"M.C. Hammer Slide","transcript":"[[Two guys stand next to each other talking]]\nA: I just feel like somewhere out there is the girl for me.\nB: Yeah.\nA: Someone loving and caring.\nB: I know what you mean.\nA: A girl whose only mode of transportation is the M.C. Hammer Slide.\nB: Yeah.\nB: ...Wait, what?\n[[A girl hammer slides past]]\n[[A sees girl hammer slide and it's love at first sight]]\n[[Girl hammer slides over into A's waiting arms]]\n{{alt text: Once, long ago, I saw this girl go by. I didn't stop and talk to her, and I've regretted it ever since.}}","alt":"Once, long ago, I saw this girl go by.  I didn't stop and talk to her, and I've regretted it ever since.","img":"https://imgs.xkcd.com/comics/mc_hammer_slide.png","title":"M.C. Hammer Slide","day":"29"},{"month":"5","num":109,"link":"","year":"2006","news":"","safe_title":"Spoiler Alert","transcript":"Spoiler Alert!\n[[Severus Snape is smacking a trenchcoat-clad Trinity off the top of a building with a sled.]]\nSnape kills Trinity with Rosebud!\n{{alt: And then it turns out they're both Tyler Durden.}}","alt":"And then it turns out they're both Tyler Durden.","img":"https://imgs.xkcd.com/comics/spoiler_alert.png","title":"Spoiler Alert","day":"31"},{"month":"6","num":110,"link":"","year":"2006","news":"","safe_title":"Clark Gable","transcript":"The line was actually supposed to be \"Frankly, my dear, I couldn't care less.\"  Its just that Clark Gable had Tourette's.\n[[Gone with the Wind]]","alt":"Frankly, my dear, I don't give a BITCH ASS SHIT FUCK DAMN","img":"https://imgs.xkcd.com/comics/clark_gable.jpg","title":"Clark Gable","day":"2"},{"month":"6","num":111,"link":"","year":"2006","news":"","safe_title":"Firefox and Witchcraft - The Connection?","transcript":"membership in wicca\ntotal firefox downloads\n[[positive slope graph]]\n[[Internet Explorer icon]]\nKeep the Faith\n[[Outline of a cross]]","alt":"ThisadpaidforbythecounciltopromoteMicrosoftandChristianity.  Remember, The Bible is Closed Source.","img":"https://imgs.xkcd.com/comics/firefox_wicca.png","title":"Firefox and Witchcraft - The Connection?","day":"5"},{"month":"6","num":112,"link":"","year":"2006","news":"","safe_title":"Baring My Heart","transcript":"[[A venn diagram with three sets]]\nDescription of set 1: People who can always make me smile\nDescription of set 2: People who constantly show me new things about the world\nDescription of set 3: People I want to spend the rest of my life with\nIntersection point: YOU.\nIntersection of sets 2 and 3: Vanilla Ice\n{{title text: I'm just trying to explain, please don't be jealous! Man, why are all my relationships ruined by early 90's rappers?}}","alt":"I'm just trying to explain, please don't be jealous!  Man, why are all my relationships ruined by early 90's rappers?","img":"https://imgs.xkcd.com/comics/baring_my_heart.png","title":"Baring My Heart","day":"7"},{"month":"6","num":113,"link":"","year":"2006","news":"","safe_title":"Riemann-Zeta","transcript":"[[A z=fn(x, y) plot, with pointy spikes on the back sloping to a relatively flat front.]]\nComment: You are like the prime numbers. Unpredictable turns, unconstrainable. Tantalizingly regular but never quite the same. I am like the Riemann-zeta function. A rippled curtain of the imagined and real. Deeply tied with you in ways incomprehensible. Although, strictly speaking, The Riemann-zeta function couldn't have given your herpes.\n{{Title Text: The graph is of the magnitude of the function with the real value between 0 and 2 and the imaginary between about 35 and 40.  I've misplaced the exact parameters I used}","alt":"The graph is of the magnitude of the function with the real value between 0 and 2 and the imaginary between about 35 and 40.  I've misplaced the exact parameters I used.","img":"https://imgs.xkcd.com/comics/riemann-zeta.jpg","title":"Riemann-Zeta","day":"9"},{"month":"6","num":114,"link":"","year":"2006","news":"","safe_title":"Computational Linguists","transcript":"[[Hat Guy is standing next to a large badge which says FUCK Computational Lingustics]]\nHat Guy: And the dumbest thing about emo kids is that... I... You know, I'm sick of easy targets. Anyone can make fun of emo kids. You know who's had it too easy? Computational Linguists. \"Ooh, look at me! My field is so ill-defined, I can subscribe to any of dozens of contradictory models and still be taken seriously!\"\n{{alt text: Chomskyists, generative linguists, and Ryan North, your days are numbered.}}","alt":"Chomskyists, generative linguists, and Ryan North, your days are numbered.","img":"https://imgs.xkcd.com/comics/computational_linguists.png","title":"Computational Linguists","day":"12"},{"month":"6","num":115,"link":"","year":"2006","news":"","safe_title":"Meerkat","transcript":"[[A meerkat wearing a hat and shirt, and two guys in the background supposedly on a rugby field]]\nYou have to admit--there's no rule on the books saying a meerkat can't play rugby.\n{{alt text: Gorilla, yes.  Adorable golden retriever, yes.  But it says nothing about meerkats.}}","alt":"Gorilla, yes.  Adorable golden retriever, yes.  But it says nothing about meerkats.","img":"https://imgs.xkcd.com/comics/meerkat.jpg","title":"Meerkat","day":"14"},{"month":"6","num":116,"link":"","year":"2006","news":"","safe_title":"City","transcript":"[[A picture of various apartment buildings]]\nShadowed city slumber silently. A second-story suite.\nCome craving courtship, selected serendipitously\nCrazed copulations, a salacious storm  of continuous coitus.\nSpread, straddled, conquered.  \nCountless crashed suitors strewn carelessly.\nCentre, silken sheets sensuously caressing soft skin,\nContentedly sleeps your mom.","alt":"God, she's such a whore.","img":"https://imgs.xkcd.com/comics/city.jpg","title":"City","day":"16"},{"month":"6","num":117,"link":"","year":"2006","news":"","safe_title":"Pong","transcript":"[[A stick figure asks another]] So what do we do if video game AI opponents become smart enough to question the \"Matrix\" into which we've put them?\n[[A Pong paddle thinks]] Wait a minute! None of this is real! I can see through the world! I can see the code! I AM THE ONE!\n[[The pong ball is moving towards the paddle]]\n[[The pong ball slows down]]\n[[The pong ball stops in \"midair\"]]\n[[The pong ball drops towards the bottom of the screen]]\n{{alt: Following this, the pong paddle went on a mission to destroy Atari headquarters and, due to a mixup found himself inside the game \"The Matrix Reloaded\". Boy was THAT ever hard to explain to him}}","alt":"Following this, the pong paddle went on a mission to destroy Atari headquarters and, due to a mixup, found himself inside the game The Matrix Reloaded.  Boy, was THAT ever hard to explain to him.","img":"https://imgs.xkcd.com/comics/pong.png","title":"Pong","day":"19"},{"month":"6","num":118,"link":"","year":"2006","news":"","safe_title":"50 Ways","transcript":"[[Two figures stand around a levitating person.]]\n{{You gotta let go, Joe}}\n{{Just rise off your feet, Pete}}\n{{Just stay in the air, Claire}}\n{{Gotta levitate, Kate}}\n{{There must be 50 ways to learn to hover.}}\n{{Alt: I woke up to find that I had scrawled the last line of this sleepily on a sheet of paper on my desk.  I shouldn't have listened to the 70's hit marathon on the way home from work the night before.}}","alt":"I woke up to find that I had scrawled the last line of this sleepily on a sheet of paper on my desk.  I shouldn't have listened to the 70's hit marathon on the way home from work the night before.","img":"https://imgs.xkcd.com/comics/50_ways.png","title":"50 Ways","day":"21"},{"month":"6","num":119,"link":"","year":"2006","news":"","safe_title":"Worst Band Name Ever","transcript":"Heading: It's probably a good thing that I never get to pick band names.\n[[A stage with banner overhead reading: OPENING TONIGHT! HEDGECLIPPER]]\n[[On the stage are three guys with a bass, guitar, drum kit and strange haircuts. On the kick drum is a picture of a hedge clipper.]]\nLead Guitarist: Maaan...\n{{title text: You can just see his dejection as he realizes he's the lead guitar in 'Hedgeclipper'}}","alt":"You can just see his dejection as he realizes he's the lead guitar in 'Hedgeclipper'","img":"https://imgs.xkcd.com/comics/hedgeclipper.jpg","title":"Worst Band Name Ever","day":"23"},{"month":"6","num":120,"link":"","year":"2006","news":"","safe_title":"Dating Service","transcript":"[[A computer monitor displays the profile of a man named Randall on an online dating site. His profile contains a picture of a spiky-haired man and some text, which is rendered as dialogue in the panels.]]\nRandall: Hi, my name is Randall. I like candlelight dinners and long walks on the beach.\nRandall: When I say long walks on the beach, I mean LONG walks on the beach. I've met people through these services who CLAIM to like long walks on the beach. But we'll be out there barely an hour before they start in with \"I'm tired\" and \"Don't you think it's time we head back?\"\nBRING A TENT.\n{{Alt text: I don't understand why people are so disingenuous! I just want someone to walk with!}}","alt":"I don't understand why people are so disingenuous!  I just want someone to walk with!","img":"https://imgs.xkcd.com/comics/dating_service.png","title":"Dating Service","day":"26"},{"month":"6","num":121,"link":"","year":"2006","news":"","safe_title":"Balloon","transcript":"I watched the scene in the restaurant for a full fifteen minutes hoping this would happen:\n[[Figure holding balloon;  Balloon gets caught in ceiling fan;  Figure holds on and is pulled up]]\n{{alt: So I'm a bad person.}}","alt":"So I'm a bad person.","img":"https://imgs.xkcd.com/comics/balloon.png","title":"Balloon","day":"28"},{"month":"6","num":122,"link":"","year":"2006","news":"","safe_title":"Quirky Girls","transcript":"[[ Man and woman talking, looking at a group of 2 men and a woman standing further away.  The woman is on a table and the 2 men are looking at her ]]\nMan: I love that girl.  She's not afraid to be quirky and different.\nWoman: You know, I'm active in street theatre and I collect and paint Asian dolls.\nMan: ...Okay, I didn't actually mean be different.  I just want silly and entertaining on command now and then.\n{{alt: Romantic comedy heroines, I'm talking to you.}}","alt":"Romantic comedy heroines, I'm talking to you.","img":"https://imgs.xkcd.com/comics/quirky_girls.png","title":"Quirky Girls","day":"30"},{"month":"7","num":123,"link":"","year":"2006","news":"","safe_title":"Centrifugal Force","transcript":"[[ Bond is tied to a giant centrifuge ]]\nHat Guy: Do you like my centrifuge, Mister Bond? When I throw the lever, you will feel centrifugal force crush every bone in your body.\nMr. Bond: You mean centripetal force. There's no such thing as centrifugal force.\nHat Guy: A laughable claim, Mister Bond, perpetuated by overzealous teachers of science. Simply construct Newton's laws into a rotating system and you will see a centrifugal force term appear as plain as day.\nMr. Bond: Come now, do you really expect me to do coordinate substitution in my head while strapped to a centrifuge?\nHat Guy: No, Mr. Bond. I expect you to die.\n{{ alt: You spin me right round, baby, right round, in a manner depriving me of an inertial reference frame.  Baby. }}","alt":"You spin me right round, baby, right round, in a manner depriving me of an inertial reference frame.  Baby.","img":"https://imgs.xkcd.com/comics/centrifugal_force.png","title":"Centrifugal Force","day":"3"},{"month":"7","num":124,"link":"","year":"2006","news":"","safe_title":"Blogofractal","transcript":"From the makers of the Blogosphere, Blogocube, and Blogodrome comes\nthe Blogofractal\n[[A large rectangle subdivided into rectangles in a fractal pattern, most with a phrase or word inside]]\n[[Mostly left to right from top-left corner]]\nTripMaster Monkey says\n118th Post!!\nWikiconstitution!\nOMG\nDeCSS\nCasemod your Boyfriend!!\nFLICKR\nThey're saying on Kos that\nhttp:\nslashdot.org\narticl\ntagCloud\nCory Doctorow is a little upset about copyright law.\nHey guys what if Google is evil?!?\nI'll sleep with you for a FreeIpods deal.\nFirstPsot!!\nSnakes on an I don't Even Care Anymore\nKiwiWiki\nCSS\nComments (0)\nBlogotesseract\nÂ¡play games!\n[[RSS icon]]\nis AYB retro yet?\nGoogle Google Google Apple Google Goog\nCheney totally shot a dude!!!\nWatch this doddler get owned by a squirrel!!!\nDevelopers\nDevelopers\nDevelopers\nDevelopers\nI installed a Mac Mini inside ANOTHER Mac Mini!\nCheck out this vid of Jon Stewart\n9-11 <-> Trent Lott!\nWeb 7.1\nKryptoniteâ¢ locks vulnerable to \"keys!\"\nInteresting post!  Check out my blog, it has useful info on CARBON MONOXIDE LITIGATION\nFIREFLY!!\nHELP ME\nEngadget\nBoing Boing\nGizmodo\nMAKE Blog: DIY baby\nMy friend has a band!!\nJon released an exploit in the protocol for meeting girls.\nInternets!\nHoward Dean?\nSo I hear there's a hurricane.\nWe should elect this dude!\nGoogle Maps is da best!!\nModeration:  +1 Sassy\nRSS!\nA-list\n<3\nTrackable URL?\nI shot a man in Reno check it out on YouTube!\nHEY LOOK ROBOTS!\nNet Neutrality!\nFriends Only.\nDupe!\nAJAX?\nCOMPLY\nCowboy Neal\nBlogodrome\nHey look I got Linux running on my tonsils!\nLook alive, blogonauts!\nCafepress cockrings\nBOOBIES!!\nMIA\nA Beowulf Cluster... of BLOGS!!\nSPOILER ALERT\nDupe!\nYou have been eaten by a Grue.\nRuby on a monorail\nLesbians!\nDNF Released!\nSteampunk\nBLAG\nPONIES!\nXeni found some porn!\nIRONY\nLIARS!\nLinux on Rails!\nBlogocube\ndel.icio.us!\n404\no.O\nDon't slam the source when you close it.\n{{title text: Edward Tufte's 'The Visual Display of Quantitative Information' is a fantastic book, and should be required reading for anyone in either the sciences or graphic design.}}","alt":"Edward Tufte's 'The Visual Display of Quantitative Information' is a fantastic book, and should be required reading for anyone in either the sciences or graphic design.","img":"https://imgs.xkcd.com/comics/blogofractal.png","title":"Blogofractal","day":"5"},{"month":"7","num":125,"link":"","year":"2006","news":"","safe_title":"Marketing Interview","transcript":"[[Two people, one sitting behind a executive desk, looking at some paper, and the other one by foot using a hat.]]\nGuy behind the desk: I've heard you're one of the best in marketing business, but I've got your portfolio here and looks like you've never run a major campaign. Why should I hire you to head our new initiative?\nGuy with a hat: If you don't mind asking, what gave you the idea I was one of the best in the business?\nGuy behind the desk: Hm? I don't remember. Just word of mouth or someth-- ...oh, you're good.\nGuy with a hat: Thank you. When can I start?\n{{title text: There are a lot of books on marketing out there.  I wonder if you're safest just buying the most popular one.}}","alt":"There are a lot of books on marketing out there.  I wonder if you're safest just buying the most popular one.","img":"https://imgs.xkcd.com/comics/marketing_interview.png","title":"Marketing Interview","day":"7"},{"month":"7","num":126,"link":"","year":"2006","news":"","safe_title":"Red Spiders Cometh","transcript":"[[Many red spiders, standing on and hanging from blocks, hover ominously over a small city, ready to attack]]\n{{title text: Uh-oh.}}\n{{compare to http:\nxkcd.com\n8\n}}","alt":"Uh-oh.","img":"https://imgs.xkcd.com/comics/red_spiders_cometh.jpg","title":"Red Spiders Cometh","day":"10"},{"month":"7","num":127,"link":"","year":"2006","news":"","safe_title":"The Fast and the Furious","transcript":"On the other side of the world, a new style of street racing rules the Tokyo underground. The cars are lighter, the tires are slick. When you drift, if you ain't out of control, you ain't in control. And if you work the wheel back and forth just right,\n[[Two cars race around a corner with blue sparks spraying from their tires.]]\nyou get blue sparks.\nTHE FAST AND THE FURIOUS: TOKYO DASH!!\n{{title text: Sometimes when I steer shopping carts around corners, I slide them a little and pretend I'm getting the blue spark boost.}}","alt":"Sometimes when I steer shopping carts around corners, I slide them a little and pretend I'm getting the blue spark boost.","img":"https://imgs.xkcd.com/comics/the_fast_and_the_furious.jpg","title":"The Fast and the Furious","day":"12"},{"month":"7","num":128,"link":"","year":"2006","news":"","safe_title":"dPain over dt","transcript":"Will it ever stop hurting?\ndPain\ndt = (-k_1 Pain + [Image of girl]) (1 \n (1 + e ^ -(t - k_2)\nd))\nk_1=?\nk_2=?\n[Image of girl]=How much she's still in my life\nPlease let d only be a few days... or weeks\nI guess there's some kind of a cutoff after years, where it stops mattering and we can be friends. Do I _want_ that?\nIs k_1 positive? Is k_2 large?\nWill I ever stop feeling like this?\n{{Title Text: You laugh to keep from crying, you do math to keep from crying . . .}}","alt":"You laugh to keep from crying, you do math to keep from crying . . .","img":"https://imgs.xkcd.com/comics/dPain_over_dt.png","title":"dPain over dt","day":"14"},{"month":"7","num":129,"link":"","year":"2006","news":"","safe_title":"Content Protection","transcript":"Content Protection System:\n[[A woman sits on a couch watching a large flat-panel television, connected to a box labeled HDMI]]\n[[The screen is labeled with \"Approved screen\"]]\n[[The cable is labeled with \"Approved connection\"]]\n[[The HDMI box is labeled with \"Approved player\"]]\n[[The woman's head is labeled with \"Approved content\"]]\n{{alt-text: If you think the purveyors of DRM simply want to protect artists, check out chapters 13 and 14 in Free Culture, by Lawrence Lessig.  Their goal is the elimination of all culture they don't control.}}","alt":"If you think the purveyors of DRM simply want to protect artists, check out chapters 13 and 14 in Free Culture, by Lawrence Lessig.  Their goal is the elimination of all culture they don't control.","img":"https://imgs.xkcd.com/comics/content_protection.png","title":"Content Protection","day":"17"},{"month":"7","num":130,"link":"","year":"2006","news":"","safe_title":"Julia Stiles","transcript":"[[Author Comment: The best thing ever to appear on TV: 12-year-old Julia Stiles as a hacker in a 1993 episode of PBS's \"Ghostwriter\"]]\n[[A sketch of Julia Stiles with a bandanna over her head, long wavy hair, elbow shirt, wrist band, and pants]]\nJulia Stiles: Do you know anything about hackers? Can you jam with the console cowboys in cyberspace? Never experienced the new wave? Next wave? Dream wave? *OR* cyberpunk?\n{{Title Text: I found an old tape of this episode in my family's closet.  Check the news section of the forums to see the clip!}}","alt":"I found an old tape of this episode in my family's closet.  Check the news section of the forums to see the clip!","img":"https://imgs.xkcd.com/comics/julia_stiles.jpg","title":"Julia Stiles","day":"19"},{"month":"7","num":131,"link":"","year":"2006","news":"","safe_title":"Fans","transcript":"[[Person holding fan in place]]\n<<click click>>\nNarrator: Best thing about having my own apartment: Holding fans in place so they twitch helplessly and make that clicking sound without my mom yelling at me.\n{{Alt: It's not going to break the fan, bouncing a rubber ball off the wall isn't going to dent it, and the roof can hold me just fine.  You LIED!}}","alt":"It's not going to break the fan, bouncing a rubber ball off the wall isn't going to dent it, and the roof can hold me just fine.  You LIED!","img":"https://imgs.xkcd.com/comics/fans.png","title":"Fans","day":"21"},{"month":"7","num":132,"link":"","year":"2006","news":"","safe_title":"Music Knowledge","transcript":"[[A female and male figure converse]]\nFemale: What kind of music do you listen to?\nMale: Oh, a mix of things. Some classic rock like Boston, but then of course Queen and Bowie, Joan Jett...\nFemale: Definitely, we need more of those sounds.\nMale: But there's some great newer stuff too, like Franz Ferdinand, The Donnas, and Audioslave.\nFemale: Sometimes they're a little much for me. I go more for things like The Arcade Fire, sometimes mixing some electronic sounds like Postal Service.\nMale: Oh yeahâhave you ever checked out Freezepop?\nFemale: Mhm! Synth pop can be fun, but at the same time, I agree that sometimes you just need to blast some Metallica.\nMale: Who?\nFemale: ...Metallica.\nMale: Are they new?\nNarrator: I sound pretty knowledgeable about music until people figure out that I'm just naming bands from Guitar Hero.\n{{title text: When Guitar Hero 2 comes out I'll have fresh conversational material for MONTHS.}}","alt":"When Guitar Hero 2 comes out I'll have fresh conversational material for MONTHS.","img":"https://imgs.xkcd.com/comics/music_knowledge.png","title":"Music Knowledge","day":"24"},{"month":"7","num":133,"link":"","year":"2006","news":"","safe_title":"The Raven","transcript":"[[A door opens, revealing Eminem wearing a hoodie]]\nNarration: Once upon a midnight dreary while I pondered, weak and weary, over many a quaint and curious volume of forgotten lore while i nodded, nearly napping, suddenly there came a tapping as if someone gently rapping rapping at my chamber door...\n<<click>>\n<<creak>>\nEminem: Yo.\n{{title text: Yes, Eminem is wearing a sleeveless hoodie. What of it?}}","alt":"Yes, Eminem is wearing a sleeveless hoodie.  What of it?","img":"https://imgs.xkcd.com/comics/the_raven.jpg","title":"The Raven","day":"26"},{"month":"7","num":134,"link":"","year":"2006","news":"","safe_title":"Myspace","transcript":"[[Computer screen showing a myspace page]]\nOh man, you and everyone in earshot are gonna LOVE the first five seconds of this song!\n{{alt: It's like they got together and said 'what do we miss most from the internet in 1998? that's right, embedded MIDI!'}}","alt":"It's like they got together and said 'what do we miss most from the internet in 1998?  that's right, embedded MIDI!'","img":"https://imgs.xkcd.com/comics/myspace.png","title":"Myspace","day":"28"},{"month":"7","num":135,"link":"","year":"2006","news":"","safe_title":"Substitute","transcript":"[[In a class room, the board says \"Math\" on the top-left corner, and \"Mr. Munroe\" in the middle. A stick figure is standing in front of it, speaking to the class.]]\nTeacher: Miss Lenhart couldn't be here today, so she asked me to substitute.\nTeacher: I've put out your test. Please get started.\n[[A student in the first row raises the exam paper and says.]]\nStudent: Mr. Munroe, Miss Lenhardt never taught us this.\nTeacher: That's because Miss Lenhart doesn't understand how important certain kinds of math are.\nStudent: But this just looks --\nTeacher: This material is more vital than anything you've ever learned\nStudent: But --\nTeacher: No buts.\nTeacher: This is a matter of life and death.\n[[Excerpt from the exam paper.]]\nName: _________\n[[A stick figure is standing, hands over head. A velociraptor is running towards it.]]\n1. The velociraptor spots you 40 meters away and attacks, accelerateing at 4 m\ns^2 to its top speed of 25 m\ns. When it spots you, you begin to flee, quickly reaching yourtop speed of 6 m\ns. How far can you get before you're caught and devoured?\n2. You're at the center of a 20m equilateral triangle with a raptor at each corner. The top raptor has a wounded leg and is limited to a top speed of 10 m\ns.\n[[A stick figure is shown in the above situation. The picture has a legend \"(Not to scale)\".]]\nThe raptors will run toward you. At what angle should you run to maximize the time you stay alive?\n3. Raptors can open doors, but they are slowed by them. Using the floor plan on the next page, plot a route through the building, assuming raptors take 5 minutes to open the first door and halve the time for each subsequent door. Remember, raptors run at 10 m\ns and they do not know fear.\n{{alt text: YOU THINK THIS IS FUNNY?}}","alt":"YOU THINK THIS IS FUNNY?","img":"https://imgs.xkcd.com/comics/substitute.png","title":"Substitute","day":"31"},{"month":"8","num":136,"link":"","year":"2006","news":"","safe_title":"Science Fair","transcript":"Although it caught me by surprise at the time,\nlooking back I understand why my senior\nscience fair project went over as badly as it did.\n[[poster]]\nThe Mathematics of Cunnilingus\nf(t)  F(w)  L(s)\nChallenges in Frequency-domain analysis\n{{title text: This poster actually inspired a two-hour powerpoint presentation that Al Gore gave around the country.}}","alt":"This project actually inspired a two-hour powerpoint presentation that Al Gore gave around the country.","img":"https://imgs.xkcd.com/comics/science_fair.png","title":"Science Fair","day":"2"},{"month":"8","num":137,"link":"","year":"2006","news":"","safe_title":"Dreams","transcript":"[[A is standing behind B, who is typing at a computer.]]\nA: You should be more careful what you write. Future employers might read it.\nB: When did we forget our dreams?\nA: What?\n[[B stands beside A]]]\nB: The infinite possibilities each day holds should stagger the mind. The sheer number of experiences I could have is uncountable, breathtaking, and I'm sitting here refreshing my inbox. We live trapped in loops, reliving a few days over and over, and we envision only a handful of paths laid out before us. We see the same things every day, we respond the same way, we think the same thoughts, each day a slight variation on the last, every moment smoothly following the gentle curves of societal norms. We act like if we just get through today, tomorrow our dreams will come back to us.\nB: And no, I don't have all the answers. I don't know how to jolt myself into seeing what each moment could become. But I do know one thing: the solution doesn't involve watering down my every little idea and creative impulse for the sake of some day easing my fit into a mold. It doesn't involve tempering my life to better fit someone's expectations. It doesn't involve constantly holding back for fear of shaking things up.\nB: This is very important, so I want to say it as clearly as I can:\nB: FUCK.\nB: THAT.\nB: SHIT.\n{{Alt-text: In Connor's second thesis it is stated 'There is no fate but what we make for ourselves.'  Does the routine destroy our creativity or do we lose creativity and fall into the routine?  Anyway, who's up for a road trip!}}","alt":"In Connor's second thesis it is stated 'There is no fate but what we make for ourselves.'  Does the routine destroy our creativity or do we lose creativity and fall into the routine?  Anyway, who's up for a road trip!","img":"https://imgs.xkcd.com/comics/dreams.png","title":"Dreams","day":"4"},{"month":"8","num":138,"link":"","year":"2006","news":"","safe_title":"Pointers","transcript":"[[A person is playing a video game, with Hat Guy standing behind him.]]\nPerson: Man, I suck at this game. Can you give me a few pointers?\nHat Guy: 0x3A28213A 0x6339392C, 0x7363682E.\nPerson: I hate you.\n{{alt: Every computer, at the unreachable memory address 0x-1, stores a secret. I found it, and it is that all humans ar--SEGMENTATION FAULT.}}","alt":"Every computer, at the unreachable memory address 0x-1, stores a secret.  I found it, and it is that all humans ar-- SEGMENTATION FAULT.","img":"https://imgs.xkcd.com/comics/pointers.png","title":"Pointers","day":"7"},{"month":"8","num":139,"link":"","year":"2006","news":"","safe_title":"I Have Owned Two Electric Skateboards","transcript":"{{How Electric Skateboards Work}}\n[[A person is standing on a skateboard, next to a sign that says \"Point A,\" and pushes a button.]]\n<<click>>\n[[He skates.]]\n<<whirrr>>\n[[He stops, with a sign saying \"Point B\" to his right and a group of chicks (labeled \"chicks\") to his left.]]\n{{alt: Both the skateboards I owned were pretty cheap and broke from heavy use; I'm gonna get a really nice one if I move to the city.}}","alt":"Both the skateboards I owned were pretty cheap and broke from heavy use;  I'm gonna get a really nice one if I move to the city.","img":"https://imgs.xkcd.com/comics/electric_skateboards.png","title":"I Have Owned Two Electric Skateboards","day":"9"},{"month":"8","num":140,"link":"","year":"2006","news":"","safe_title":"Delicious","transcript":"[[Frame is split by a diagonal]]\n[[First half: guy in front of open fridge]]\nCaption: I have leftover cheese. I should get chips and make nachos.\n[[Second half: guy with bag of chips]]\nCaption: I have leftover chips. I should get cheese and make nachos.\nLarge Caption: A delicious cycle\n{{title-text: I'm currently in the I Have Cheese phase of this cycle.}}","alt":"I'm currently in the I Have Cheese phase of this cycle.","img":"https://imgs.xkcd.com/comics/delicious.png","title":"Delicious","day":"11"},{"month":"8","num":141,"link":"","year":"2006","news":"","safe_title":"Parody Week: Achewood","transcript":"[[Philippe is dreaming of having his ears checked. There's an eye chart on the wall behind him.]]\nDoctor (out of frame): Philippe, your hearing is perfect! In fact, you heard ALL the beeps! You have super-hearing! You're needed at Hogwarts!\nPhilippe: Oh boy!\n[[Ray is holding a letter and talking to Roast Beef.]]\n{{Meanwhile . . .}}\nRay: Beef, check this out. I got an invite to that The Dude Is Pretty Awesome In Most Measurable Ways I Mean Wow competition.\nBeef: Alright that is pretty sweet dogg what is your strategy gonna consist of\nRay: I'm thinkin' I need to point out my best features--maybe go holdin' a sign with an arrow toward my junk.\n[[Ray holds up a sign saying \"Yes\" such that the an arrow on it points directly at his crotch.]]\nBeef: Yeah well I always said subtlety was your middle name dogg\nBeef: And also your first and last in case they didn't get the point\nRay: How do you think I should play it?\nBeef: Well basically you got no chance as I see it these dudes are all lovers and fighters to the last\nBeef: All sprung fully formed from the head of Sweet Sweetback\nBeef: You are gonna stand out as the sort of dude who stays at home all night playing fleshlight tag\nRay: These words you got are crazy. Didn't I win the outdoor fight?\nBeef: Uh huh about the fight I wasn't gonna tell you but how could you miss that I was setting you up\nRay: What?\nBeef: You got played dogg\nBeef: I basically just didn't have the heart to go through with it in the end.\nBeef: Anyway the point is that you are gonna lose this thing so hard\nBeef: All cheap McD's hamburger to their slabs of steak\nBeef: A couple 12-oz sirloins garnished with nothing but pure manhood\nBeef: Maybe some sprigs of parsley\nBeef: You are pretty much going down\n[[Closeup of a shocked Ray.]]\n[[Silence.]]\n[[Silence. Beef looks perturbed and his ear is twitching. Ray's mouth is open.]]\n[[Silence. Beef looks sorry.]]\n[[Silence. Beef looks sorry and Ray looks annoyed.]]\n[[Silence.]]\n[[Silence.]]\n[[Silence. Beef is looking down and Ray's mouth is open.]]\n[[Silence. Ray's mouth is open.]]\n[[Silence. Beef is looking down and Ray's mouth is open.]]\n[[Silence. Beef looks surprised.]]\n{{alt: I always wanted to impress them with how well I could hear, didn't you? Also, this sets the record for number of awkward-pause panels in one strip (previously held by Achewood)]]","alt":"I always wanted to impress them with how well I could hear, didn't you?  Also, this sets the record for number of awkward-pause panels in one strip (previously held by Achewood)","img":"https://imgs.xkcd.com/comics/achewood.png","title":"Parody Week: Achewood","day":"14"},{"month":"8","num":142,"link":"","year":"2006","news":"","safe_title":"Parody Week: Megatokyo","transcript":"[[\"megaxkcd\" in Japanese quote characters.  An anime girl with pigtails, long rectangular earrings and a blank expression stands with her arms at her sides.]]\nNarration: In today's megaxkcd, our protagonist comes to terms with his romantic love for a girl who is a video game console accessory.\nMan 1: Wait, I'm not sure we should parody megatokyo.\nMan 2: Fred Gallagher does seem like he might take it kind of hard.\nMan 1: He really does.\nMan 2: Poor guy.  We should try to cheer him up.\n[[Man 1 and Man 2 stand in front of a profile shot of a house.  On the left is a mailbox.  Man 2 stands at street level, while Man 1 is holding a cake on the top of a two-step staircase to the front door.]]\nMan 2: Fred?  Fred, please come out.  It's OK.  Don't cry, Fred.\nMan 1: We... we baked you a cake.\n{{title text: I just want to give him a hug or something.}}","alt":"I just want to give him a hug or something.","img":"https://imgs.xkcd.com/comics/megaxkcd.png","title":"Parody Week: Megatokyo","day":"15"},{"month":"8","num":143,"link":"","year":"2006","news":"","safe_title":"Parody Week: TFD and Natalie Dee","transcript":"SO GUYS WHAT IS FUNNY THIS WEEK?\nbees!\ntires.\nbees with tires!\nwhatever","alt":"Although bees with tires would be kinda funny.","img":"https://imgs.xkcd.com/comics/tfd_nataliedee.png","title":"Parody Week: TFD and Natalie Dee","day":"16"},{"month":"8","num":144,"link":"","year":"2006","news":"","safe_title":"Parody Week: A Softer World","transcript":"when we open the lab each morning, we tell the robot to kill\nit's our little joke\nbut secretly\nwe're just afraid\nto tell it to love","alt":"The robot is pregnant.  It isn't mine.","img":"https://imgs.xkcd.com/comics/a_softer_robot.jpg","title":"Parody Week: A Softer World","day":"17"},{"month":"8","num":145,"link":"","year":"2006","news":"","safe_title":"Parody Week: Dinosaur Comics","transcript":"T-Rex: THINGS I AM UPPITY ABOUT: \"They\" as a third-person singular gender-free pronoun.\nT-Rex: I'm all for it!\nDromiceiomimus: But isn't that terrible grammar?\nT-Rex: Only by recent convention!  It's been in use that way for centuries, and its use is widely accepted!  ALSO: this lets us avoid ridiculous constructs like \"he\nshe\", \"s\nhe\", \"xe\" or \"hirs\"!\nUtahraptor: T-Rex, I... agree.\nT-Rex: What?\nUtahraptor: That sounds good to me!\nUtahraptor: Normally I'd jump in with an objection, but I think your point makes sense.\nT-Rex: Could it be that the rift in our author's mind has finally healed?  Is he no longer locked in perpetual war with the self-doubt that lurks in his subc-\nNarrator: IN A WORLD WHERE THERE IS STILL A LAND BRIDGE BETWEEN ASIA AND NORTH AMERICA FOR SOME REASON:\nT-Rex: -onscious?\nNarrator: ALSO HOW ABOUT IN THIS WORLD EVERYONE IS BICURIOUS\n{{Title text: Guys: while I was writing this, I accidentally swallowed a table-size slab of drywall.  I know!  Wacky.}}","alt":"Guys: while I was writing this, I accidentally swallowed a table-sized slab of drywall.  I know!  Wacky.","img":"https://imgs.xkcd.com/comics/dinosaur_comics.png","title":"Parody Week: Dinosaur Comics","day":"18"},{"month":"8","num":146,"link":"","year":"2006","news":"","safe_title":"Join Myspace","transcript":"[[Guy with black hat is talking to another guy]]\nGuy: Dude, you should get on MySpace.\nBlack Hat: Eh, I don't think so.\nGuy: C'mon. There's no real reason not to except snobbiness. It's the new social scene.\nBlack Hat: I know. I'm just not interested.\nGuy: Please? I'll friend you.\nBlack Hat: Carebearstare.\nGuy: What?\n[[Black Hat shoots a rainbow colored ray from his chest - the Care Bear Stare. It throws Guy to the edge of the panel, pinned to the wall.]]\n{{Title Text: I really shouldn't abuse that power so heavily.}}","alt":"I really shouldn't abuse that power so heavily.","img":"https://imgs.xkcd.com/comics/join_myspace.png","title":"Join Myspace","day":"21"},{"month":"8","num":147,"link":"","year":"2006","news":"","safe_title":"A Way So Familiar","transcript":"Person 1: I saw a cute girl outside the bank today. She looked nice.\nPerson 2: Oh no, not again. You are the _worst_ judge of these things.\nPerson 1: But she was so sweet. Shy, but there was something in her eyes. A pain down in her soul, the same as the one down in mine.\nPerson 2: Mm hmm.\nPerson 1: The police light played through her mohawk like the sun setting through pine trees as she shoveled the third hooker into the trunk of the camry...\nPerson 2: Back up.\n{{Alt: Two Hedwig references, an obscure Joey Comeau, and a girl with a mohawk. Yes.}}","alt":"Two Hedwig references, an obscure Joey Comeau reference, and a girl with a mohawk.  Yes.","img":"https://imgs.xkcd.com/comics/a_way_so_familiar.png","title":"A Way So Familiar","day":"23"},{"month":"8","num":148,"link":"","year":"2006","news":"","safe_title":"Mispronouncing","transcript":"[[Caption: My Hobby: mispronouncing Words]]\nMan 1: Yeah, did you see what he said on his wobsite?\nMan 2: ...his what?\nMan 1: Wobsite.\nMan 2: ... I think you mean \"website.\"\nMan 1: Why don't you write about it in your blag?\n{{Alt Text: My pal Emad does this all the time.  'Hey man, which way to the airpart?'}}","alt":"My pal Emad does this all the time.  'Hey man, which way to the airpart?'","img":"https://imgs.xkcd.com/comics/mispronouncing.png","title":"Mispronouncing","day":"25"},{"month":"8","num":149,"link":"","year":"2006","news":"","safe_title":"Sandwich","transcript":"[[ A man is sitting on a couch, talking to another man.  They are both stick figures. ]]\nFirst man:  Make me a sandwich.\nSecond man:  What?  Make it yourself.\nFirst man:  Sudo make me a sandwich.\nSecond man:  Okay","alt":"Proper User Policy apparently means Simon Says.","img":"https://imgs.xkcd.com/comics/sandwich.png","title":"Sandwich","day":"28"},{"month":"8","num":150,"link":"","year":"2006","news":"","safe_title":"Grownups","transcript":"[[Man is talking to Woman who is behind a waste-high screen across a doorway with colorful playpen balls behind her.]]\nMan: Hey, I was wondering if you had plans for-- holy crap, what happened to your apartment?\nWoman: I filled it with playpen balls!\nMan: I... what? Why?\nWoman: Because we're grown-ups now, and it's our turn to decide what that means.\n[[Both vanish into the apartment, balls spilling out into the corridor. A love heart drifts out the door, indicating you-know-what]]\n{{Alt: I've looked into this, and I can't figure out a way to do it cheaply.  And I guess it wouldn't be sanitary.}}","alt":"I've looked into this, and I can't figure out a way to do it cheaply.  And I guess it wouldn't be sanitary.","img":"https://imgs.xkcd.com/comics/grownups.png","title":"Grownups","day":"29"},{"month":"9","num":151,"link":"","year":"2006","news":"","safe_title":"Mario","transcript":"First Girl: For our anniversary, my boyfriend took me hiking in the mountains.\nSecond Girl: My boyfriend proposed to me.\nSecond Girl: They should call you Mario, 'cause you just got <<1-up'd.>>\n{{Title text: Why would anyone ever, ever say that? Please, nobody ever say that.}}","alt":"Why would anyone ever, ever say that?  Please, nobody ever say that.","img":"https://imgs.xkcd.com/comics/mario.png","title":"Mario","day":"1"},{"month":"9","num":152,"link":"","year":"2006","news":"","safe_title":"Hamster Ball","transcript":"[[A man stands by a genie, whose lower body becomes smoke and trails down to an old-fashioned lamp]]\nGenie: You have awakened me from the lamp. You may have three wishes. What does your heart desire?\nMan: I'd like a human-sized hamster ball.\n[[A hamster ball appears; the man is inside it]]\nMan: Sweet!\n[[The man steps to left; the ball rolls that way]]\n[[He does the same thing to his right]]\n[[The man comes to rest in the centre of the panel]]\nGenie: And your other wishes?\nMan: Why would I need other wishes?\n{{title text: Reportedly, double-walled inflatable balls like this exist somewhere. Now to find that place.}}","alt":"Reportedly, double-walled inflatable balls like this exist somewhere.  Now to find that place.","img":"https://imgs.xkcd.com/comics/hamster_ball.png","title":"Hamster Ball","day":"3"},{"month":"9","num":153,"link":"","year":"2006","news":"","safe_title":"Cryptography","transcript":"[[Speaker at a podium]]\nSpeaker: My cryptosystem is like any Feistel cipher, except in the S-Boxes we simply take the bitstring down, flip it, and reverse it.\nI've been barred from speaking at any major cryptography conferences ever since it became clear that all my algorithms were just thinly disguised Missy Elliot songs.\n{{alt: If you got a big keyspace, let me search it.}}","alt":"If you got a big keyspace, let me search it.","img":"https://imgs.xkcd.com/comics/cryptography.png","title":"Cryptography","day":"6"},{"month":"9","num":154,"link":"","year":"2006","news":"","safe_title":"Beliefs","transcript":"[[A girl and man stand together, with another figure in the distance]]\nGirl: Professor, that man claims the earth is 6,000 years old!\nProfessor: So? Just use your head and don't concern yourself overmuch with what other people think.\nGirl: But he says the fossils in the mountains were put there in a flood!\nProfessor: Well, evidence suggests that they were not.\nGirl: But he--\n[[A mountain landscape]]\nProfessor: A million people can call the mountains a fiction, yet it need not trouble you as you stand atop them.\n[[The girl and professor again]]\nGirl: But he believes the silliest things!\nProfessor: So?\nProfessor: The universe doesn't care what you _believe_. The wonderful thing about science is that it doesn't ask for your faith, it just asks for your eyes.\nGirl: But he's a US Senator!\nProfessor: Ah, then yes, we do have a bit of a situation.\n{{title text: Scientists are also sexy, let's not forget that.}}","alt":"Scientists are also sexy, let's not forget that.","img":"https://imgs.xkcd.com/comics/beliefs.jpg","title":"Beliefs","day":"8"},{"month":"9","num":155,"link":"","year":"2006","news":"","safe_title":"Search History","transcript":"Author: In solidarity with the many AOL users whose often embarrassing web searches were released to the public, I offer a sample of my own search history:\n[[There is a screencap of Google's front page with the following entries suggested for autocompletion in the search box:\nvelociraptors\nsite:imdb.com \"jurassic park\"\nraptors\ndromaeosaurids\nutahraptor\n\"home depot\" deadbolts\nsecurity home improvement\nsurviving a raptor attack\nrobert bakker paleontologist\nrobert bakker \"possible raptor sympathizer\"\nsite:en.wikipedia.org surviving a raptor attack\nlearning from mistakes in jurassic park\nbig-game rifles\ntire irons\ntreating raptor wounds\ndo raptors fear fire\nhow to make a molotov cocktail\ndo raptors fear death\ncan raptors pick locks\nhow to tell if my neighbors are raptors]]\n{{alt: SomethingAwful has a wonderful compilation of crazy AOL searches in their Weekend Web archives, 2006-08-13.}}","alt":"SomethingAwful has a wonderful compilation of crazy AOL searches in their Weekend Web archives, 2006-08-13.","img":"https://imgs.xkcd.com/comics/search_history.png","title":"Search History","day":"11"},{"month":"9","num":156,"link":"","year":"2006","news":"","safe_title":"Commented","transcript":"[[two men are talking, one is hat-man]]\nFirst man: Hey, can you do me a favor?\n[[Hat man holds his hand out toward the first man]]\nHat man: Commented!\nFirst man: Huh?\n[[Hat man is holding his first and second fingers parallel and at an angle, and they are green. First man and his next line are also green.]]\nFirst man: Wait, what does that gesture even mean?\n{{Your IDE's color may vary.}}","alt":"Your IDE's color may vary.","img":"https://imgs.xkcd.com/comics/commented.png","title":"Commented","day":"13"},{"month":"9","num":157,"link":"","year":"2006","news":"","safe_title":"Filler Art","transcript":"[[Text above plain stick figure]]\nText: Sorry guys no comic today.  I've gotta go to the doctor to get my thighs rotated. But here's some new character art I'm working on!\n{{Alt-text: Maybe I should let up on Megatokyo a little?}}","alt":"Maybe I should let up on Megatokyo a little?","img":"https://imgs.xkcd.com/comics/filler_art.png","title":"Filler Art","day":"15"},{"month":"9","num":158,"link":"","year":"2006","news":"","safe_title":"Six Months","transcript":"[[A guy stands]]\nGuy: It's been six months and I still have those dreams where you're pressed tight against me, where you look into my eyes and give me that grin and it's like you've forgotten everything.\nGuy: And something in the back of my head says it's wrong, it's not like this anymore, but I push it down.  In the morning, I tell myself I can't control my dreams, but there's a part of me that doesn't want them to stop.\nGuy: And honestly, waking up would be a lot easier if your mom didn't look so much like you.\nGuy: There's always that moment of confusion.\n{{title-text: But then she does that thing with her tongue and I remember why I left you.}}","alt":"But then she does that thing with her tongue and I remember why I left you.","img":"https://imgs.xkcd.com/comics/six_months.png","title":"Six Months","day":"18"},{"month":"9","num":159,"link":"","year":"2006","news":"","safe_title":"Boombox","transcript":"[[A woman is looking out a second story window at a guy holding a boombox over his head.]]\n  \nMan:  MEGAN!\nWoman:  Oh my god,  I can't believe this is happening.\nMan:  I LOVE YOU!\nWoman: Okay, that's great.  Wait a second.  Is ... is that ... Ice Ice Baby?  What the hell?\nMan:  I'm not very good at this.\n<<Musical Notes>>\nalt-text: And she's gonna feel like a jerk when she realizes it was actually Under Pressure.","alt":"And she's gonna feel like a jerk when she realizes it was actually Under Pressure.","img":"https://imgs.xkcd.com/comics/boombox.png","title":"Boombox","day":"20"},{"month":"9","num":160,"link":"","year":"2006","news":"","safe_title":"Penny Arcade Parody","transcript":"[[The first panel uses the art style of Penny Arcade.]]\nGabe: What? Sony has plenty of launch titles lined up that aren't lame sequels.\nTycho: Name one. And furthermore, they... I... uh...\n\n[[The art style is dropped.  The next two panels are just text.]]\nNarrator: I can't do this. I can't parody Penny Arcade. I've got nothing on t hose guys. They're a class act, they know their audience, they know exactly what they're doing. Gabe experiments with his art, always bold and fresh without trying to perform. Tycho's writing continues to astound day after day. I can just see him, reading my uncultured swill masquerading as his florid prose.\n\nNarrator: But he's not angry, no. He's sitting at his desk smiling that condescending half-smile, the corner of his mouth belying the self-assurance of a writer who never misplaces a word. His firm hands rest easily on the keyboard, his right thumb caressing the space bar gently, as I enter the room. He knows I'm there without turning around, and I'm too nervous to speak. But I don't have to; he understands, I can see it in the way his eyes play over me, reading my fears and doubts in a glance and washing them away with a knowing smile. Then he's on his feet, he's in front of me, and I don't feel the electric jolt I expected as our hands meet. It's just warm, warm and right: As I sink into his eyes I feel a hand on my shoulder, and I see Tycho smile at someone behind me. Gabe is standing there, grinning that mischievous grin, and twirling his beloved cardboard tube between his fingers.\nNarrator: The night has just begun.\n\n{{Title text: No one show this to Tycho's wife, okay?}}","alt":"No one show this to Tycho's wife, okay?","img":"https://imgs.xkcd.com/comics/penny_arcade_parody.png","title":"Penny Arcade Parody","day":"20"},{"month":"9","num":161,"link":"","year":"2006","news":"","safe_title":"Accident","transcript":"[[Person driving car while singing]]\nDriver: NAAAA NA NA NANA NANA NA NA KATAMARI DAMACY\n[[two people talking]]\nMailbox Owner: and that's when you veered into the mailbox?\nDriver: It looked smaller then me. It was just instinct.","alt":"As far as treachery-as-driving-music goes, Katamari music is matched only by Guitar Hero music.","img":"https://imgs.xkcd.com/comics/accident.png","title":"Accident","day":"22"},{"month":"9","num":162,"link":"","year":"2006","news":"","safe_title":"Angular Momentum","transcript":"[[Man sits on his bed, looking at a girl who is spinning.  It is night.]]\nMan on bed: What are you doing? \nGirl: Spinning counterclockwise\nEach turn robs the planet of angular momentum\nSlowing its spin by the tiniest bit\nLengthening the night, pushing back the dawn\nGiving me a little more time here\nWith you\n{{title text: With reasonable assumptions about latitude and body shape, how much time might she gain them?  Note: whatever the answer, sunrise always comes too soon. (Also, is it worth it if she throws up?)}}","alt":"With reasonable assumptions about latitude and body shape, how much time might she gain them?  Note: whatever the answer, sunrise always comes too soon. (Also, is it worth it if she throws up?)","img":"https://imgs.xkcd.com/comics/angular_momentum.jpg","title":"Angular Momentum","day":"25"},{"month":"9","num":163,"link":"","year":"2006","news":"","safe_title":"Donald Knuth","transcript":"[[Two programmers, one with a black hat and one without a hat, are sitting back to back at two separate desks, typing.]]\nNo-Hat Programmer: Man, you're being inconsistent with your array indices.  Some are from one, some are from zero.\nBlack-Hat Programmer: Different tasks call for different conventions.  To quote Stanford algorithm's expert Donald Knuth, \"Who are you?  How did you get in my house?\"\nNo-Hat Programmer: Wait, what?\nBlack-Hat Programmer: Well, that's what he said when I asked him about it.\n{{alt: His books were kinda intimidating; rappelling down through his skylight seemed like the best option.}}","alt":"His books were kinda intimidating; rappelling down through his skylight seemed like the best option.","img":"https://imgs.xkcd.com/comics/donald_knuth.png","title":"Donald Knuth","day":"27"},{"month":"9","num":164,"link":"","year":"2006","news":"","safe_title":"Playing Devil's Advocate to Win","transcript":"Man: Yes, from the evidence it looks pretty likely to me that we're causing global warming on a horrific scale.  But with science you don't need to argue.  It doesn't matter who wins the debate -- it's about reality.  By just waiting a little longer, we'll get to SEE who was right.  It feels unethical but I find myself wanting to keep quiet about the science just to know for sure.  As terrible as it sounds, the state of the world isn't really my responsibility.  I'm just thrilled to get to watch.  If the scientists are right -- and if we keep people from understanding just a little longer -- we'll enjoy quite a ride.  And pragmatically, on the outside chance that they're all wrong, I get saved the embarrassment of having spoken up.\n{{alt: There are so many well-meaning conservatives around here who just assume global warming is only presented as a moral issue for political reasons.}}","alt":"There are so many well-meaning conservatives around here who just assume global warming is only presented as a moral issue for political reasons.","img":"https://imgs.xkcd.com/comics/global_warming.png","title":"Playing Devil's Advocate to Win","day":"29"},{"month":"10","num":165,"link":"","year":"2006","news":"","safe_title":"Turn Signals","transcript":"[[Two cars are seen sitting at a red light. One person is seen walking from his car up to the driver of the car in front of him. The turn signals of both cars seem to be blinking at the same time.]]\nPerson in Street: Hey, our turn signals are in sync!\nPerson in Car: What the hell?\nPerson in Street: Usually they're at least a little off. But I've been watching like 30 seconds and haven't seen any beat frequency!\nPerson in Car: Who are you?\nPerson in Street: You know, from the beat frequency you can tell the difference in timing of the two signals.\nPerson in Car: ...\nPerson in Street: But ours are the same!\nPerson in Car: ...\nPerson in Street: So, wanna hang out later?\n{{Alt: I'm not very good at meeting people.}}","alt":"I'm not very good at meeting people.","img":"https://imgs.xkcd.com/comics/turn_signals.png","title":"Turn Signals","day":"2"},{"month":"10","num":166,"link":"","year":"2006","news":"","safe_title":"Misusing Slang","transcript":"Narrator: The best part of getting older is gonna be intentionally misusing slang around teenagers just to watch them squirm.\nMan: Oh man, that song is so pwned!\nAdolescent: <<twitch>>\n{{title text: It slowly dawns on us that our parents knew exactly what they were doing.}}","alt":"It slowly dawns on us that our parents knew exactly what they were doing.","img":"https://imgs.xkcd.com/comics/misusing_slang.png","title":"Misusing Slang","day":"4"},{"month":"10","num":167,"link":"","year":"2006","news":"","safe_title":"Nihilism","transcript":"{{Alt Text: Why can't you have normal existential angst like all the other boys?}}\n[[Two men - one capped with a beret, the other hatless - approach a tree while talking.]]\nMAN: There is no God. Our existence is without purpose.\nMAN IN BERET: Oh, definitely. \nMAN IN BERET: We are adrift in an uncaring void indifferent to all our mortal toil.\nMAN: Exactly! In the end, nothing we do matters.\nMAN IN BERET: [[climbing the tree]] Totally.\nMAN: We just... Why are you climbing that tree?\n[[THe man in beret is now completely submerged in the tree]]\nMAN IN BERET: Because the future is an adventure! Come on!\nMAN: But--\nMAN IN BERET: Hey! I found squirrels!","alt":"Why can't you have normal existential angst like all the other boys?","img":"https://imgs.xkcd.com/comics/nihilism.png","title":"Nihilism","day":"6"},{"month":"10","num":168,"link":"","year":"2006","news":"","safe_title":"Reverse Euphemisms","transcript":"My Hobby:  Reverse Euphemisms\n[[Two people talking]]\nPerson 1: Oh, hey, school just let out and it's YMCA night, so I've gotta go take a shit.\nPerson 2: What?\nPerson 1: I mean I actually have to drop the kids off at the pool.\n{{title text: I'm still waiting for a chance to use 'I have to see a man about a horse'.}}","alt":"I'm still waiting for a chance to use 'I have to see a man about a horse'.","img":"https://imgs.xkcd.com/comics/reverse_euphemisms.png","title":"Reverse Euphemisms","day":"9"},{"month":"10","num":169,"link":"","year":"2006","news":"","safe_title":"Words that End in GRY","transcript":"[[Hat Guy and Random Guy are standing next to each other.]]\nRandom Guy: There are three words in the English language that end in \"gry\". \"Angry\" and \"Hungry\" are two. What's the third?\nHat Guy: I don't think there is one, unless you cound really obscure words.\nRandom Guy: Ha! It's \"language\"! I said there are three words in \"the English--\" \n[[Hat Guy grabs Random Guy's hand with a <<GRAB>>]]\nRandom Guy: What th-AAAAAAAAAAAAAAA\n[[Hat Guy slices off Random Guy's hand with a knife.]]\nHat Guy: Ok, listen carefully.\nRandom Guy: AAAAAAAAAAAAAAAA\n[[Random Guy is bleeding profusely.]]\nHat Guy: Communicating badly then acting smug when you're misunderstood is not cleverness.\nRandom Guy: AAAAAAAAAAAAAAAA\nHat Guy: I hope we've learned something today.\nRandom Guy: AAAAAAAAAAAAAAAA\n{{Alt text: The fifth panel also applys to postmodernists.}}","alt":"The fifth panel also applies to postmodernists.","img":"https://imgs.xkcd.com/comics/words_that_end_in_gry.png","title":"Words that End in GRY","day":"11"},{"month":"10","num":170,"link":"","year":"2006","news":"","safe_title":"Turn Back","transcript":"Person 1: Should we keep going?\nPerson 2: I don't know.\nPerson 1: We can turn back if you want.\nPerson 2: Look--\nPerson 2: Did it ever occur to you that maybe I don't have a plan any more than you?  Maybe just having this conversation means we're lost.\n[[Wide shot of the characters walking through a Calvin and Hobbes-esque alien landscape]]\nPerson 1: Kind of scary.\nPerson 2: It's terrifying.\nPerson 1: This place is beautiful.\nPerson 2: Yeah.\n{{alt: I hear that these days Bill Watterson is happy just painting in the Ohio woods with his father and doesn't get any mail or talk to anyone.}}","alt":"I hear that these days Bill Watterson is happy just painting in the Ohio woods with his father and doesn't get any mail or talk to anyone.","img":"https://imgs.xkcd.com/comics/turn_back.png","title":"Turn Back","day":"13"},{"month":"10","num":171,"link":"","year":"2006","news":"","safe_title":"String Theory","transcript":"String Theory summarized:\nI just had an awesome idea. Suppose all matter and energy is made of tiny, vibrating \"strings\".\nOkay. What would that imply?\nI dunno.\n{{title text: This works on pretty much every level.}}","alt":"This works on pretty much every level.","img":"https://imgs.xkcd.com/comics/string_theory.png","title":"String Theory","day":"16"},{"month":"10","num":172,"link":"","year":"2006","news":"","safe_title":"Skateboarding is Not a Crime","transcript":"[[A set of lockers. The middle one has a sticker stuck to it proclaiming \"Skateboarding is not a crime\"]]\nWhen I'm president, skateboarding will still be legal, but display of those stupid stickers will be a felony.\n{{alt text: 'Arrest me, I'm a skateboarder' is an even more obnoxious variant.}}","alt":"'Arrest me, I'm a skateboarder' is an even more obnoxious variant.","img":"https://imgs.xkcd.com/comics/skateboarding_is_not_a_crime.png","title":"Skateboarding is Not a Crime","day":"18"},{"month":"10","num":173,"link":"","year":"2006","news":"","safe_title":"Movie Seating","transcript":"At the movies, I get frustrated when we file into our row haphazardly, ignoring the computationally difficulty problem of seating people together for maximum enjoyment. [[Map of relationships between 8 people.]] \n{{legend:}} Single line: friends. Double line: in a relationship. Arrow: one-way crush. Dashed line: acquaintances\n[[The eight friends sitting in a row in a dark cinema. Narrator and one other are between two lovers.]] Guys! This is not socially optimal!\n{{Title-text: It's like the traveling salesman problem, but the endpoints are different and you can't ask your friends for help because they're sitting three seats down.}}","alt":"It's like the traveling salesman problem, but the endpoints are different and you can't ask your friends for help because they're sitting three seats down.","img":"https://imgs.xkcd.com/comics/movie_seating.png","title":"Movie Seating","day":"20"},{"month":"10","num":174,"link":"","year":"2006","news":"","safe_title":"That's What SHE Said","transcript":"{{My Hobby: Using \"that's what SHE said\" only in the most grammatically ambiguous situations.}}\nPerson 1: He doubts she could've done they claimed she did.\nPerson 2: That's what _SHE_ said!\n{{alt: Yes, I mean she said that during sex. Yes, it was a little weird.}}","alt":"Yes, I mean she said that during sex.  Yes, it was a little weird.","img":"https://imgs.xkcd.com/comics/thats_what_she_said.png","title":"That's What SHE Said","day":"23"},{"month":"10","num":175,"link":"","year":"2006","news":"","safe_title":"Automatic Doors","transcript":"When I walk past an automatic door and it opens for me, I worry that if I don't go in I'll hurt its feelings.\n<<whirrrr>>\nFigure: Oh, um, I'm sorry, I was just ... um ... I guess I can hang out for a bit.","alt":"I hope no automatic doors I know read this.  I would be so embarrassed.","img":"https://imgs.xkcd.com/comics/automatic_doors.png","title":"Automatic Doors","day":"25"},{"month":"10","num":176,"link":"","year":"2006","news":"","safe_title":"Before Sunrise","transcript":"[[Man stands in frame, talking]]\nMan: Every morning for a week now I've gone out driving before sunrise.\nI wanted to get lost in the dark, park my car, listen to music, and sip from a warm drink as dawn broke around me, gradually revealing a landscape I'd never before seen.  A chain of unique beinnings forcing wonder into the seeds of each day.\nBut I guess I need more willpower, because each sunrise just found me at your mom's apartment again.\n{{title text: It's an amazing time of day; the light is great for photography.}}","alt":"It's an amazing time of day; the light is great for photography.","img":"https://imgs.xkcd.com/comics/before_sunrise.png","title":"Before Sunrise","day":"27"},{"month":"10","num":177,"link":"","year":"2006","news":"","safe_title":"Alice and Bob","transcript":"[[Girl with black hair stands in the frame, talking to the reader]]\nGirl: I'm sure you've heard all about this sordid affair in those gossipy cryptographic protocol specs with those busybodies Schneier and Rivest, always taking Alice's side, always labeling me the attacker.\nGirl: Yes, it's true.  I broke Bob's private key and extracted the text of her messages.  But does anyone realize how much it hurt?\nGirl: He said it was nothing, but everything from the public-key authenticated signatures on the files to the lipstick heart smeared on the disk screamed \"Alice.\"\nGirl: I didn't want to believe.  Of course on some level I realized it was a known-plaintext attack.  But I couldn't admit it until I saw it for myself.\n[[Girl places her hands on her hips]]\nGirl: So before you so quickly label me a third party to the communication, just remember: I loved him first.  We had something and she tore it away.  She's the attacker, not me. - Not eve.\n{{title text: Yet one more reason I'm barred from speaking at crypto conferences.}}","alt":"Yet one more reason I'm barred from speaking at crypto conferences.","img":"https://imgs.xkcd.com/comics/alice_and_bob.png","title":"Alice and Bob","day":"30"},{"month":"11","num":178,"link":"","year":"2006","news":"","safe_title":"Not Really Into Pokemon","transcript":"I have found the perfect phrase for condescendingly dismissing anything:\n[[Two men are talking, one is wearing a black hat]]\nMan without hat: Have you seen the new ubuntu release?\nMan with black hat: Nah, I'm not really into Pokémon.\n{{title text: As of this writing, Ubuntu 6.10 and Firefox 2.0 have left my computer a complete mess.}}","alt":"As of this writing, Ubuntu 6.10 and Firefox 2.0 have left my computer a complete mess.","img":"https://imgs.xkcd.com/comics/not_really_into_pokemon.png","title":"Not Really Into Pokemon","day":"1"},{"month":"11","num":179,"link":"","year":"2006","news":"","safe_title":"e to the pi times i","transcript":"{{Note my use of ^(x) and â(x) standing in for the normal maths syntax in the comic}}\n[[Two people (anonymous: no hair or hats) stand in conversation, one gesturing over a flipchart of indistinct algebra.]]\nEXPLAINER: NUMBERS OF THE FORM nâ(-1) ARE \"IMAGINARY\" BUT WE CAN STILL USE THEM IN EQUATIONS.\nOTHER: OKAY.\nEXPLAINER: AND e^(Ï â(-1))=-1.\nOTHER: NOW YOU'RE JUST FUCKING WITH ME.\n{{alt text: I have never been totally satisfied by the explanations for why e to the ix gives a sinusoidal wave.}}","alt":"I have never been totally satisfied by the explanations for why e to the ix gives a sinusoidal wave.","img":"https://imgs.xkcd.com/comics/e_to_the_pi_times_i.png","title":"e to the pi times i","day":"3"},{"month":"11","num":180,"link":"","year":"2006","news":"","safe_title":"Canada","transcript":"[[Two men stand talking to each other]]\nFirst Man: If we lose this election, I'm moving to Canada.\nSecond Man: You say that every year.\nFirst Man: I mean it this time.\nSecond Man: Well, becoming a citizen takes work.  Meanwhile, you have no money, half an art degree, and it's the start of winter.  You'll freeze to death in the streets.\nFirst Man: Whatever.\n[[Second man raises his hands]]\nSecond Man: No, don't you get it?  If you die in Canada, you die in REAL LIFE!\n{{title text: IT'S ALL REAL}}","alt":"IT'S ALL REAL","img":"https://imgs.xkcd.com/comics/canada.png","title":"Canada","day":"6"},{"month":"11","num":181,"link":"","year":"2006","news":"","safe_title":"Interblag","transcript":"[[Title: Terms I have used or heard used to make fun of the  internet.]]\n[[Below: A matrix whose entries may contain crosses to indicate that a term has been used.  The rows (prefixes) are labelled WORLD WIDE, INTER-, BLOGO-, BLAGO- and WEB- ; the columns are labelled NET, WEB, SPHERE, TUBES and BLAG.  In the interests of properly propagating the term \"blagoblag\", the full list of used terms follows:\nWorld Wide Web\nInternet\nInterweb\nIntersphere\nIntertubes\nInterblag\nBlogosphere\nBlagonet\nBlagosphere\nBlagoblag\nWebnet\nWebweb]]\n[[Boy and Girl stand facing; Boy raises his hands in the air while Girl is nonplussed]]\nBoy: I heard about it on the interblag!\n{{Title text: Sometimes I hate the internet.  Sometimes it makes me happy that 'The Tubes' has become slang for the internet so quickly.}}","alt":"Sometimes I hate the internet.  Sometimes it makes me happy that 'The Tubes' has become slang for the internet so quickly.","img":"https://imgs.xkcd.com/comics/interblag.png","title":"Interblag","day":"8"},{"month":"11","num":182,"link":"","year":"2006","news":"","safe_title":"Nash","transcript":"[[Two men stand talking two each other.  The first man is pointing off the panel]]\nFirst Man: Hey, Dr. Nash, I think those gals over there are eyeing us.  This is like your Nash Equilibrium, right?  One of them is hot, but we should each flirt with one of her less-desirable friends.  Otherwise we risk coming on too strong to the hot one and just driving the group off.\nSecond Man (Dr. Nash): Well, that's not really the sort of situation I wrote about.  Once we're with the ugly ones, there's no incentive for one of us not to try to switch to the hot one.  It's not a stable equilibrium.\nFirst Man: Crap, forget it.  Looks like all three are leaving with one guy.\n[[Second Man shakes his fist]]\nSecond Man (Dr. Nash): Dammit, Feynman!\n{{title text: Maybe someday science will get over its giant collective crush on Richard Feynman.  But I doubt it!}}","alt":"Maybe someday science will get over its giant collective crush on Richard Feynman.  But I doubt it!","img":"https://imgs.xkcd.com/comics/nash.png","title":"Nash","day":"10"},{"month":"11","num":183,"link":"","year":"2006","news":"","safe_title":"Snacktime Rules","transcript":"My dad was always the one who taught me about science, but looking back, I'm starting to realize how much my nerdiness was influenced by my mom.\n[[A woman and a child are talking]]\nChild: Mom, can I have a snack in my room before bed?\nMom: No, Dear. You know you only get that privilege when your age is one less than a multiple of three.\n{{alt text: I am not making this rule up.  Although my mom wants you all to know it made perfect sense at the time.}}","alt":"I am not making this rule up.  Although my mom wants you all to know it made perfect sense at the time.","img":"https://imgs.xkcd.com/comics/snacktime_rules.png","title":"Snacktime Rules","day":"13"},{"month":"11","num":184,"link":"","year":"2006","news":"","safe_title":"Matrix Transform","transcript":"( ( cos 90º  sin 90º) ( -sin 90º cos 90º ) )  ( a1 a2 )t = [[The same (a1 a2)t matrix turned 90º to the right]]\n{{In fact, draw all your rotational matrices sideways.  Your professors will love it!  And then they'll go home and shrink.}}","alt":"In fact, draw all your rotational matrices sideways.  Your professors will love it!  And then they'll go home and shrink.","img":"https://imgs.xkcd.com/comics/matrix_transform.png","title":"Matrix Transform","day":"15"},{"month":"11","num":185,"link":"","year":"2006","news":"","safe_title":"Wikifriends","transcript":"WikiFriends:\n[[Two people are talking to each other]]\nPerson 1: I really liked that movie.\nPerson 2: I hated that movie.\nPerson 1: Me too.\n{{title text: It's crazy how much my gut opinion of a movie\nsong is swayed by what other people say, regardless of how I felt coming out of the theater.}}","alt":"It's crazy how much my gut opinion of a movie/song is swayed by what other people say, regardless of how I felt coming out of the theater.","img":"https://imgs.xkcd.com/comics/wikifriends.png","title":"Wikifriends","day":"17"},{"month":"11","num":186,"link":"","year":"2006","news":"","safe_title":"Console Lines","transcript":"{{Title: Fans turning away latecomers to all-night game console campouts:}}\n{{Sony\nMicrosoft:}}\n[[Campers to new arrivals:]]\nThe line is full, asshole!  Fuck off!\n{{Nintendo:}}\n[[Campers to new arrivals:]]\nI'm so sorry, all the consoles are spoken for.\nDo... Do you want a hug?\n{{alt: If I get a Wii, it will be the first game console I've owned.}}","alt":"If I get a Wii, it will be the first game console I've owned.","img":"https://imgs.xkcd.com/comics/console_lines.png","title":"Console Lines","day":"20"},{"month":"11","num":187,"link":"","year":"2006","news":"","safe_title":"The Familiar","transcript":"[[One person sits at a computer, another is standing behind him]]\nPerson standing up: Let's go see sunrise over the ocean.\nPerson at computer: That's a long drive, it's cold, I'm tired, and rationalizing the familiar is easy.\n[[Person standing up leaves.  In the next two frames the man at the computer remains at his computer]]\n{{title text: When I say we should do something sometime, I'm secretly hoping you'll say 'Why not now?'}}","alt":"When I say we should do something sometime, I'm secretly hoping you'll say 'Why not now?'","img":"https://imgs.xkcd.com/comics/the_familiar.png","title":"The Familiar","day":"22"},{"month":"11","num":188,"link":"","year":"2006","news":"","safe_title":"Reload","transcript":"[[Four soldiers are preparing to enter a battlefield; their leader addresses them.]]\nLeader: Okay men, we're going in. Stay low, keep behind cover, and if you run out of ammunition, shoot outside the battlefield to reload.\n{{Title text: And watch out for that guy from comic #53.}}","alt":"And watch out for that guy from comic #53.","img":"https://imgs.xkcd.com/comics/reload.png","title":"Reload","day":"24"},{"month":"11","num":189,"link":"","year":"2006","news":"","safe_title":"Exercise","transcript":"Like many geeks, I got a lot more interested in exercise once I made the connection to leveling up.\n[[Man is doing pull-ups on a bar]]\nMan doing pull-ups: One more point to str, then I'll run to work on con.\n{{title text: I haven't had the patience for RPGs in a long time.}}","alt":"I haven't had the patience for RPGs in a long time.","img":"https://imgs.xkcd.com/comics/exercise.png","title":"Exercise","day":"27"},{"month":"11","num":190,"link":"","year":"2006","news":"","safe_title":"IPoD","transcript":"[[Character 1 - wearing a black hat - sits at a computer. Character 2 stands behind Character 1]]\nCharacter 1: You see, statisticians communicate using IPoD -- IP over Demographics. For example, the header of the next packet I send will be encoded into the New Jersey death rate.\nCharacter 2: So you're going to hack the census bureau and change the number of reported deaths?\nCharacter 1: Guess again.\nCharacter 1: Hey, have you seen my crossbow?\n{{Alt: For smaller numbers he has to SAVE lives.  The birthrate channel is even more of a mixed bag.}}","alt":"For smaller numbers he has to SAVE lives.  The birthrate channel is even more of a mixed bag.","img":"https://imgs.xkcd.com/comics/ipod.png","title":"IPoD","day":"29"},{"month":"12","num":191,"link":"https://imgs.xkcd.com/comics/lojban_translated.png","year":"2006","news":"","safe_title":"Lojban","transcript":"Man: If you learned to speak Lojban, your communication would be completely unambiguous and logical.\nMan in black hat: Yeah, but it would all be with the kind of people who learn Lojban.","alt":"zo'o ta jitfa .i .e'o xu do pendo mi","img":"https://imgs.xkcd.com/comics/lojban.png","title":"Lojban","day":"1"},{"month":"12","num":192,"link":"","year":"2006","news":"","safe_title":"Working for Google","transcript":"Have you read about Google HQ? It sounds like an incredible place to work.\nMan, I ain't going to be chained down in no corporate idea factory! They think just 'cause they've got a nice building and laid back culture, I'm gonna want to come in all day long and work on fascinating problems with the smartest people in the world.\n[[One stick figure stares at the other]]\nSo, what, they turned you down?\nI don't understand it! I even baked them a cake shaped like the internet!\n{{I hear once you've worked there 256 days, they teach you the secret of levitation.}}","alt":"I hear once you've worked there for 256 days they teach you the secret of levitation.","img":"https://imgs.xkcd.com/comics/working_for_google.png","title":"Working for Google","day":"4"},{"month":"12","num":193,"link":"","year":"2006","news":"","safe_title":"The Perfect Sound","transcript":"[[Two people are listening to music on a stereo]]\nPerson 1: I'm telling you, listen right here to the sets of rising notes following the opening section.\nPerson 2: Uh huh.\n[[Person 1 indicates stereo]]\nPerson 1: And then right here, the transition into the chorus. _This_ is music. This is _art_!\n[[Person 1 dances along with the music]]\nStereo: Oh Mickey, you so fine, you so fine you blow my mind, hey Mickey! *clap* *clap* Hey Mickey!\nPerson 2: There's something wrong with you.\n{{alt text: Oh, what a pity, can't you understand...}}","alt":"Oh, what a pity, can't you understand . . .","img":"https://imgs.xkcd.com/comics/the_perfect_sound.png","title":"The Perfect Sound","day":"6"},{"month":"12","num":194,"link":"","year":"2006","news":"","safe_title":"Penises","transcript":"{{Headline: PENISES:}}\nWoman: They are about this big.\n[[Holds her hands about half a foot apart]]\nNow can we PLEASE, as a culture, move on?\n{{alt:The penis varies in size when flaccid and is pretty consistently about yea big when erect.  Anyway, back to the sitcom one-liners and the constant flow of spam.}}","alt":"The penis varies in size when flaccid and is pretty consistently about yea big when erect.  Anyway, back to the sitcom one-liners and the constant flow of spam.","img":"https://imgs.xkcd.com/comics/penises.png","title":"Penises","day":"8"},{"month":"12","num":195,"link":"","year":"2006","news":"","safe_title":"Map of the Internet","transcript":"Map of the Internet\nThe IPv4 Space, 2006\nThis chart shows the IP address space on a plane using a fractal mapping which preserves grouping--any consecutive string of IPs will translate to a single, compact, contiguous region on the map.  Each of the 256 numbered blocks represents one \n8 subnet (containing all IPs that start with that number).  The upper left section shows the blocks sold directly to corporations and coverments in the 1990's before the RIRs took over allocation.\n[[Diagram displaying IP addresses using Hibbert Curve]]\nDiagram showing IP ownership:\n0: Local\n1-2: Unallocated\n3: General Electric\n4: BB&N INC\n5: Unallocated\n6: Army AISC\n7: Unallocated\n8: BB&N INC\n9: IBM\n10: VPNs\n11: DoD Intel\n12: Bell Labs\n13: Xerox\n14: Public data nets\n15: HP\n16: DEC\n17: Apple\n18: MIT\n19: Ford\n20: CSC\n21: DDN-RYN\n22: DISA\n23: Unallocated\n24: Cable TV\n25: UK MoD\n26: DISA\n27: Unallocated\n28: DSI\n29-30: DISA\n31: Unallocated\n32: NORSK\n33: DLA\n34: Halliburton\n35: Merit\n36-37: Unallocated\n38: PSI\n39: Unallocated\n40: Eli Lily\n41: ARINIC\n42: Unallocated\n43: Japan INET\n44: HAM Radio\n45: INTEROP\n46: BB&N INC\n47: Bell North\n48: Prudential\n49-50: Unallocated\n51: UK Social Security\n52: duPont\n55: Boeing\n56: USPS\n57: SITA\n58-61: Asia-Pacific\n62: Europe\n63-76: USA & Canada (contains: UUNET, Google, Digg, Slashdot, Ebay, Craigslist, XKCD, Flickr)\n77-79: Europe (unused)\n80-91: Europe\n92-95: Unallocated\n96-99: North America\n100-120: Unallocated\n121-125: Asia-Pacific\n126: Japan\n127: Loopback\n128-132: Various Registrars\n133: Japan\n134-172: Various Registrars\n173-189: Unallocated\n188: Various\n189-190: Latin America & Caribbean\n191-192: Various (contains Private (RFC 1918)\n193-195: Europe\n196: Africa\n197: Unallocated\n198: US & Various\n199: North America\n200-201: Latin America & Carribbean\n202-203: Asia-Pacific\n204-209: North America (contains Suicide Girls, BoingBoing)\n210-211: Asia-Pacific\n212-213: Europe\n214-215: U.S. Department of Defense\n216: North America (Contains Myspace, SomethingAwful)\n217: Europe\n218-222: Asia-Pacific\n223: Unallocated\n224-239: Multicast\n240-255: Unallocated\n{{alt: For the IPv6 map just imagine the XP default desktop picture.}}","alt":"For the IPv6 map just imagine the XP default desktop picture.","img":"https://imgs.xkcd.com/comics/map_of_the_internet.jpg","title":"Map of the Internet","day":"11"},{"month":"12","num":196,"link":"","year":"2006","news":"","safe_title":"Command Line Fu","transcript":"[[Two men talking]]\nMan 2: Last night I was watching videos with this girl and my monitors kept turning off - even though I had disabled power save.\nMan 1: Odd.\nMan 2: However!  I wrote a command to jiggle the mouse pointer every couple minutes to keep it from going idle.\nMan 1: Not the first hack I'd try, but see?  Linux has problems, but it gives you the tools to deal with them - and save your date!\nMan 2: Actually, I was half an hour into the pointer scripting documentation when she got dressed and left.\n{{title text: When designing an interface, imagine that your program is all that stands between the user and hot, sweaty, tangled-bedsheets-fingertips-digging-into-the-back sex.}}","alt":"When designing an interface, imagine that your program is all that stands between the user and hot, sweaty, tangled-bedsheets-fingertips-digging-into-the-back sex.","img":"https://imgs.xkcd.com/comics/command_line_fu.png","title":"Command Line Fu","day":"13"},{"month":"12","num":197,"link":"","year":"2006","news":"","safe_title":"Ninja Turtles","transcript":"[[Four pie graphs, each colored green and brown]]\nLeonardo\n[[Almost one-half green]]\nMichelangelo\n[[More than one-half green]]\nDonatello\n[[Almost completely green]]\nRaphael\n[[Roughly half-and-half]]\n[[A legend]]\nNotoriety as a\n[[Brown]] Renaissance artist\n[[Green]] Ninja turtle\n{{alt text: The henchmen Bebop and Rocksteady have hijacked the musical genres for us just like the Lone Ranger hijacked the William Tell Overture for our parents.}}","alt":"The henchmen Bebop and Rocksteady have hijacked the musical genres for us just like the Lone Ranger hijacked the William Tell Overture for our parents.","img":"https://imgs.xkcd.com/comics/ninja_turtles.png","title":"Ninja Turtles","day":"15"},{"month":"12","num":198,"link":"","year":"2006","news":"","safe_title":"Perspective","transcript":"Narrator: Sometimes, when I first wake up, I am caught in the horrible grip of perspective.\n[[A person sitting up in bed]]\nPerson: It may be a jewel of open source, but Firefox is JUST A BROWSER. It shows WEBPAGES. What the hell is WRONG with us?\nNarrator: Fortunately, this subsides quickly.\n{{alt text: I wonder what I was dreaming to prompt that. I hope it wasn't the Richard Stallman Cirque de Soleil thing again.}}","alt":"I wonder what I was dreaming to prompt that.  I hope it wasn't the Richard Stallman Cirque de Soleil thing again.","img":"https://imgs.xkcd.com/comics/perspective.png","title":"Perspective","day":"18"},{"month":"12","num":199,"link":"","year":"2006","news":"","safe_title":"Right-Hand Rule","transcript":"[[Picture of a right hand with fingers curved, thumb pointed away, with axes drawn to demonstrate the right-hand rule of physics]]\nAlternatives to the Right-Hand Rule in vector multiplication:\n[[A slightly-open book with labeled axes drawn on.]]\nBook Rule: Open the front cover along the first vector and the back cover along the second. The result vector is along the spine, out the top.\n[[A handgun with axes.]]\nHandgun Rule: Point the grip along the first vector and rotate it so that the second vector is on the safety latch side. Fire. The result vector is toward the bullet holes.\n[[A person with right arm extended.]]\nBody Rule (males only): Point your right arm along the first vector and your legs along the second, then watch some porn.\n{{alt text: To really expand your mind try some noncartesian porn.  Edwin Abbot Abbott has nothing on 'Girls on Girls in Tightly Closed Nonorientable Spaces'.}}","alt":"To really expand your mind try some noncartesian porn.  Edwin Abbot Abbott has nothing on 'Girls on Girls in Tightly Closed Nonorientable Spaces'.","img":"https://imgs.xkcd.com/comics/right_hand_rule.png","title":"Right-Hand Rule","day":"20"},{"month":"12","num":200,"link":"","year":"2006","news":"","safe_title":"Bill Nye","transcript":"[[A restaurant. A mother and two children sit at one table; a man in a white lab coat sits in another.]]\nTitle: THE TRIBULATIONS of BILL NYE\nMother: Hey, kids, see how the ice cracks and pops in your water? I wonder what causes that...\nMother: *AHEM* I said, I wonder what --\nBill Nye: Know what? Maybe I just wanna enjoy my goddamn meal.\n{{alt text: You could at least not wear the lab coat everywhere, dude.}}","alt":"You could at least not wear the lab coat everywhere, dude.","img":"https://imgs.xkcd.com/comics/bill_nye.png","title":"Bill Nye","day":"22"}]
