[{"month":"8","num":1100,"link":"","year":"2012","news":"","safe_title":"Vows","transcript":"[[A bride and groom stand next to each other. Each has a hand outstretched toward the other.]]\nOfficiator (out of panel): Do you take this man to be your lawful wedded husband?\nBride: ...no.\n\n[[The groom steps back in surprise. The bride removes her wig to reveal she is a man.]]\nGroom: \nWhat? Amy!?\n\nBride: I'm not Amy. None of this was real. You're back in senior year. It's the big game.\n\n[[The groom puts his hands to his head in confusion. The \"bride\" holds up a football, still holding the wig in his other hand.]]\nGroom: What \nis\n this!?\nBride: \nThe greatest high school football misdirection play of all time.\n\n\n[[The groom puts his hands to his mouth as the man in the wedding dress begins to run backwards, away from him.]]\n\n((Outside the final panel.))\n[[The groom remains frozen in horror as the \"bride\" turns and dashes toward the goalpost in the distance.]]\n\n{{Title text: So, um. Do you want to get a drink after the game?}}","alt":"So, um. Do you want to get a drink after the game?","img":"https://imgs.xkcd.com/comics/vows.png","title":"Vows","day":"27"},{"month":"8","num":1101,"link":"","year":"2012","news":"","safe_title":"Sketchiness","transcript":"[[A timeline style graph.]]\nWORDS\nArranged by How Sketchy They Make the Sentence\n\"HEY BABY, WANNA COME BACK TO MY SEX ________?\"\n\nsketchy <--------> very sketchy\nparty --- orgy --- dungeon --- palace --- house --- shrine --- room --- basement --- truck --- platform --- van --- area --- crate --- chute --- ravine --- tarp\n\n{{Title text: factory --- spire --- onslaught --- extractor --- judge}}","alt":"factory --- spire --- onslaught --- extractor --- judge","img":"https://imgs.xkcd.com/comics/sketchiness.png","title":"Sketchiness","day":"29"},{"month":"8","num":1102,"link":"","year":"2012","news":"","safe_title":"Fastest-Growing","transcript":"[[A man with a combover, a book, and a clipboard approaches black-hat man.]]\nCombover: You should check us out. We're the fastest-growing religion in the country.\nBlack hat: \"Fastest-growing\" is such a dubious claim.\nCombover: It's true! We grew by 85% over the past year.\n\n((Between panels.))\n[[Black hat man shouts to someone out of frame.]]\nBlack hat: Hey, Rob -- wanna join my religion?\nRob: Sure, whatever.\n\n[[Black hat man turns back to Combover and produces a notepad and pen.]]\nBlack hat: Well, looks like my religion grew by 100% this year.\n\n[[Black hat man begins to walk away.]]\nCombover: We have 38,000 members!\nBlack hat: Hope they're all ok with second place.\n\n{{Title text: I lead a small but extraordinarily persuasive religion whose only members are door-to-door proselytizers from other faiths.}}","alt":"I lead a small but extraordinarily persuasive religion whose only members are door-to-door proselytizers from other faiths.","img":"https://imgs.xkcd.com/comics/fastest_growing.png","title":"Fastest-Growing","day":"31"},{"month":"9","num":1103,"link":"","year":"2012","news":"","safe_title":"Nine","transcript":"[[A man stands at a microwave, which hangs on the wall above the stove.]]\nMan: How long do you zap these?\nOut of panel person: Two minutes.\nMan: Thanks!\n<<*beep* 1>>\n<<*beep* 5>>\n<<*beep* 9>>\nMan (whispering): It's ok, Nine. You are not forgotten.\nEver since I heard the simile \"as neglected as the nine button on the microwave,\" I've found myself adjusting cook times.\n\n{{Title text: FYI: If you get curious and start trying to calculate the time adjustment function that minimizes the gap between the most-used and least-used digit (for a representative sample of common cook times) without without altering any time by more than 10%, and someone asks you what you're doing, it's easier to just lie.}}","alt":"FYI: If you get curious and start trying to calculate the time adjustment function that minimizes the gap between the most-used and least-used digit (for a representative sample of common cook times) without altering any time by more than 10%, and someone asks you what you're doing, it's easier to just lie.","img":"https://imgs.xkcd.com/comics/nine.png","title":"Nine","day":"3"},{"month":"9","num":1104,"link":"https://www.youtube.com/watch?v=3qpdk-U8fI0","year":"2012","news":"","safe_title":"Feathers","transcript":"[[A woman approaches a little girl, who is sitting on the floor with a pile of books, once of which she is reading.]]\nWoman: What are you reading about?\nGirl: Dinosaurs!\nWoman: Oh, yeah.\n\n[[The woman stands talking to the little girl, who is still looking at her book.]]\nWoman: They've gotten all weird since when I was a kid. They used to be awesome, but now they all have dorky feathers, right?\nGirl: Yup!\n\n[[The woman is still standing, looking at the little girl.]]\nGirl: This says they now think raptors used their wings for stability, flapping to stay on top of their prey while hanging on with their hooked claws and eating it alive.\n*Fowler et al., PLOS ONE 6(12), 2011\n\n[[The woman stares at the girl, who is still reading the book.]]\n\n[[The woman sits down on the floor with the girl and starts reading another of the books.]]\n\n{{Title text: Click to see a video of a modern bird using stability flapping during predatory behavior. It all fits! Also, apparently Microraptor had *four* wings? The past keeps getting cooler! (And there's more of it every day!)}}","alt":"Click to see a video of a modern bird using stability flapping during predatory behavior. It all fits! Also, apparently Microraptor had *four* wings? The past keeps getting cooler! (And there's more of it every day!)","img":"https://imgs.xkcd.com/comics/feathers.png","title":"Feathers","day":"5"},{"month":"9","num":1105,"link":"","year":"2012","news":"","safe_title":"License Plate","transcript":"[[A guy walking toward the left, holding a car license plate in front of him.]]\nGuy: Check out my personalized license plate!\nGirl (out of frame): \"1I1-III1\"?\n\n[[The girl is now in frame, sitting in an office chair, looking down at the license plate in her hands. The guy stands in front of her, rubbing his hands together with glee.]]\nGuy: No one will be able to correctly record my plate number! I can commit any crime I want!\nGirl: Sounds foolproof.\n\nSOON:\n[[A witness (a bald man in glasses) stands in front of yellow 'DO NOT CROSS' police tape, speaking to a pair of police officers. One officer is facing him, writing in a notepad, the other is turning to walk away.]]\nWitness: The thief's license plate was all \"1\"s or something.\nPO #1: Oh. \nThat\n guy.\nPO #2: His address is on a post-it in the squad car.\n\n{{Title text: The next day: 'What? Six bank robberies!? But I just vandalized the library!' 'Nice try. They saw your plate with all the 1's and I's.' 'That's impossible! I've been with my car the whole ti-- ... wait. Ok, wow, that was clever of her.'}}","alt":"The next day: 'What? Six bank robberies!? But I just vandalized the library!' 'Nice try. They saw your plate with all the 1's and I's.' 'That's impossible! I've been with my car the whole ti-- ... wait. Ok, wow, that was clever of her.'","img":"https://imgs.xkcd.com/comics/license_plate.png","title":"License Plate","day":"7"},{"month":"9","num":1106,"link":"","year":"2012","news":"","safe_title":"ADD","transcript":"[[A person holding onto a balloon labeled \"math problem\" goes to grab another labeled \"call mom\"]]\n\n[[\"Check Oven\" appears off in the distance]]\n\n[[The person lets go of the first two..]]\n\n[[..leaps up and grabs \"Check Oven]]\n\n[[More balloons.  \"parking meter\", \"taxes\", \"buy soap\", \"phone call\", \"relax\", \"inbox\", \"clean\", \"beat game\", \"feed cat\", \"drink water\", \"call mom\", \"math problem\", \"send card\", \"check oven\", \"engine light\", \"read\", \"breathe\"  all show up at once.]]\n\n{{Title text: 20 balloons float away while I'm busy permanently tying one to a tree to deal with it for good. Unfortunately, that one balloon was 'land a rocket on the moon in Kerbal Space Program.'}}","alt":"20 balloons float away while I'm busy permanently tying one to a tree to deal with it for good. Unfortunately, that one balloon was 'land a rocket on the moon in Kerbal Space Program.'","img":"https://imgs.xkcd.com/comics/add.png","title":"ADD","day":"10"},{"month":"9","num":1107,"link":"","year":"2012","news":"","safe_title":"Sports Cheat Sheet","transcript":"(( The panel is a chart.  Months are arrayed down the first column, the second and third columns show sports, with the divisions in partial months rather than lined up with the ends of months. ))\nWhich sport are they arguing about?\n-My cheat sheet-\n\n(( The second column, reproduced using approximate dates. ))\nUS:\nFootball [[ovoid ball drawn in brackets]]: Jan 1 - February 10\nBasketball: February 10 - April 20\nBaseball: April 20 - May 25\nBasketball: May 25 - June 15\nBaseball: June 15 - August 20\nFootball [[ovoid]]: August 20 - October 5\nBaseball: October 5 - October 20\nFootball [[ovoid]]: October 20 - December 31\n\n((  The third column, reproduced using approximate dates. ))\nnon-US:\nFootball [[truncated icosahedron, 20 hexagons and 12 pentagons]]: Jan 1 - December 31\n\n{{Title text: I would subscribe to a Twitter feed that supplied you with one reasonable sports opinion per day, like 'The Red Sox can't make the playoffs (championship games), but in last night's game their win seriously damaged the chances of the Yankees (longstanding rival team).'}}","alt":"I would subscribe to a Twitter feed that supplied you with one reasonable sports opinion per day, like 'The Red Sox can't make the playoffs (championship games), but in last night's game their win seriously damaged the chances of the Yankees (longstanding rival team).'","img":"https://imgs.xkcd.com/comics/sports_cheat_sheet.png","title":"Sports Cheat Sheet","day":"12"},{"month":"9","num":1108,"link":"","year":"2012","news":"","safe_title":"Cautionary Ghost","transcript":"[[ A figure wakes up to an apparition hovering over their bed. ]]\nApparition: OOOOOOOOOOOOooooo\nFigure: A ghost!?\nApparition: I bring a \ncautionary vision\n of things to come!\n\nApparition: This is the future:\n[[ Two people are standing between a pair of houses.  There is a tree.  An airplane flies past. ]]\n\nApparition: And \nthis\n is the future if you give up the fight over the word \"literally\":\n[[ Two people are standing between a pair of houses.  There is a tree.  An airplane flies past.  The cynical might suggest the panel is copy pasted.\n\n[[ Back to the figure in bed. ]]\nFigure: They looked exactly the same.\nApparition: OOOOOOOOOOOooooo\nFigure: Ok, I get it.\nApparition: Seriously, this is \nduuuuumb\n.\n\n{{Title text: But then the Ghost of Subjunctive Past showed up and told me to stay strong on 'if it were'.}}","alt":"But then the Ghost of Subjunctive Past showed up and told me to stay strong on 'if it were'.","img":"https://imgs.xkcd.com/comics/cautionary_ghost.png","title":"Cautionary Ghost","day":"14"},{"month":"9","num":1109,"link":"","year":"2012","news":"","safe_title":"Refrigerator","transcript":"[[A fridge with most of the shelves as conveyor belts that feed off to a \"bad\" tray.  The top internal one starts at 3 days, and has markings for 2 days, 24 hours, and 12 hours.  The middle internal one goes from 1 week to 5 days to 3 days to 2 and then to 1 day.  The bottom internal one goes from 3 months to 2, 1, and then 2 weeks.  One belt is mounted on the door, marked from 2 weeks to 1 week to 3 days.]]\n\n{{Title text: I want this engraved on my tombstone like the Epitaph of Stevinus.}}","alt":"I want this engraved on my tombstone like the Epitaph of Stevinus.","img":"https://imgs.xkcd.com/comics/refrigerator.png","title":"Refrigerator","day":"17"},{"month":"9","num":1110,"link":"","year":"2012","news":"","safe_title":"Click and Drag","transcript":"[[A character is dangling from a balloon.  All text appears in rectangular bubbles.]]\nCharacter: From the stories\nCharacter: I expected the world to be sad\nCharacter: And it was\n\nCharacter: And I expected it to be wonderful.\n\nCharacter: It was.\n\n((The last panel, unusually, is infinitely large, and this transcript is not wide enough to contain it.  The part you can see in a normal browser window goes as follows.))\n[[ The same character is dangling above the ground, next to an intricately drawn tree with no leaves. ]]\nCharacter: I just didn't expect it to be so \nbig\n.\n\n{{Title text: Click and drag.}}","alt":"Click and drag.","img":"https://imgs.xkcd.com/comics/click_and_drag.png","title":"Click and Drag","extra_parts":{"pre":"","headerextra":"","post":"\n<div class=\"map\"><div class=\"ground\"></div></div>\n<script type=\"text/javascript\" src=\"/s/a3c5de.js\"></script>\n<script type=\"text/javascript\" src=\"/s/d28668.js\"></script>\n","imgAttr":""},"day":"19"},{"month":"9","num":1111,"link":"","year":"2012","news":"","safe_title":"Premiere","transcript":"[[Standard vacuous entertainment newscast. An anchor starts off the segment with an inset feed of a field reporter]]\nIn-studio News Anchor: All Hollywood is in town or tonight's star-studded premier! We go live to our reporter on the red carpet. How do things look?\n\n[[Field reporter feed switches to fullscreen. The reporter is stating on the red carpet in front of a full crowd.]]\nField reporter: Bleak. In 800 million years, the aging, brightening sun will boil away the oceans, and all this will be blowing sand.\n\n[[Switch back to initial framing]]\nAnchor: Oh. Um.  ..sounds pretty grim.  How are the stars reacting?\nReporter: Hydrogen fusion. But it won't last forever.\nAnchor. I mean the *movie* stars.\nReporter: They won't last forever either. None of us will.\n\n{{Title text: 'But what's the buzz about the film?' 'We're hoping it's distracting.'}}","alt":"'But what's the buzz about the film?' 'We're hoping it's distracting.'","img":"https://imgs.xkcd.com/comics/premiere.png","title":"Premiere","day":"21"},{"month":"9","num":1112,"link":"","year":"2012","news":"","safe_title":"Think Logically","transcript":"[[A guy in a knit hat is sitting at a desk, typing on a laptop. Another guy is looking over his shoulder.]]\nLaptop: \n*move*\n\nOther guy: Why'd you move your knight away?\n\n[[The guy in the hat turns around to look at the other guy.]]\nOther guy: Just think \nlogically\n. The goal is checkmate, so you should always move pieces \ntoward the other player's king.\n\n[[A close-up on the other guy, hand to chin in thought.]]\nOther guy: I guess occasionally you need to move backward, but it'd be trivial to make a list of those circumstances and--\n\n[[The guy in the hat leans back in his chair.]]\nHat guy: Have you ever \nplayed\n chess?\nOther guy: Not buch, but--\nHat guy: Wanna?\nOther guy: Uh, ok.\n\n[[The two have set up a chessboard on a stool between them, the guy in the hat playing from his chair, the other guy standing. The guy in the hat takes the first move.]]\n*move*\n*move*\n*move*\n*move*\n*move*\n*move*\n*move*\nHat guy: Checkmate.\n\n[[The other guy stares at the board.]]\n\n[[The guy in the knit hat has turned back to his laptop, and the other guy is standing behind him, still looking at the chessboard on the stool.]]\nOther guy: This game isn't very well-designed. For starters, knights are too weak...\n\n{{Title text: I've developed a more logical set of rules but the people on the chess community have a bunch of stupid emotional biases and won't reply to my posts.}}","alt":"I've developed a more logical set of rules but the people on the chess community have a bunch of stupid emotional biases and won't reply to my posts.","img":"https://imgs.xkcd.com/comics/think_logically.png","title":"Think Logically","day":"24"},{"month":"9","num":1113,"link":"","year":"2012","news":"","safe_title":"Killed In Action","transcript":"[[Five people are at a funeral, the casket is on a stand in the center. There are three people in the background, on the left side. On the right, in the foreground, are two police officers. One is male, the other female.]]\n\nFemale cop: Good cop. It's a real shame - he was just one day away from getting put in the locked, heavily-guarded room where all cops stay for the last day before they retire.\n\n{{Title text: We can't let this happen again. We need to build a secure TWO-day-before-retirement safe room.}}","alt":"We can't let this happen again. We need to build a secure TWO-day-before-retirement safe room.","img":"https://imgs.xkcd.com/comics/killed_in_action.png","title":"Killed In Action","day":"26"},{"month":"9","num":1114,"link":"","year":"2012","news":"","safe_title":"Metallurgy","transcript":"[[A man and a woman stand at the counter of a shop. A man with a beard and a beret stands behind the counter, holding a sword.]]\nBeard: This sword was forged from a fallen star. Antimony impurities make the blade surprisingly \nbrittle\n and \nweak\n. \n\n[[A close-up on the man with the beard.]]\nBeard: And \nthis\n dagger is made of metal from a far-off kingdom. It glows blue.\nOut of panel: When orcs are near?\n\n[[The man with the beard holds a dagger.]]\nBeard: No, always. Radiation from the Actinum content. \nWoman: ...does it have eldritch powers?\n\n[[The bearded man puts the dagger back behind the counter.]]\nBeard: It gives the wielder +2 to cancer risk.\nOther Man: I think we should find another shop.\n\n{{Title text: This exotic blade was wrought from a different fallen star. The meteorite was a carbonaceous chondrite, so it's basically a lump of gravel glued into the shape of a sword. A SPACE sword!}}","alt":"This exotic blade was wrought from a different fallen star. The meteorite was a carbonaceous chondrite, so it's basically a lump of gravel glued into the shape of a sword. A SPACE sword!","img":"https://imgs.xkcd.com/comics/metallurgy.png","title":"Metallurgy","day":"28"},{"month":"10","num":1115,"link":"","year":"2012","news":"","safe_title":"Sky","transcript":"[[A woman approaches a guy in a white beret, who appears to be doing a handstand on the lawn.]]\nWoman: What are you doing?\nBeret: Clinging to the ceiling of a bottomless abyss.\n\n[[The woman walks past him.]]\nWoman: You are very odd.\n\n[[The woman towards a mailbox.]]\n\n[[As she passes the mailbox, she looks up.]]\n\n[[This panel appears to be upside down. The woman is clinging to the mailbox, and a woman with a ponytail approaches her.]]\nPonytail: What's wrong?\nWoman: I looked down.\n\n{{Title text: I dropped a bird and I didn't hear it hit bottom.}}","alt":"I dropped a bird and I didn't hear it hit bottom.","img":"https://imgs.xkcd.com/comics/sky.png","title":"Sky","day":"1"},{"month":"10","num":1116,"link":"","year":"2012","news":"","safe_title":"Traffic Lights","transcript":"[[Six traffic lights are hanging from a wire.  A bird is on the wire.  This is animated.]]\n[[On the far left, a pole has a sign disallowing all directions.]]\n[[The first light on the left has a right turn only sign.]]\n[[The next light has straight and right turn only.]]\n[[The far right light has a left turn only sign.]]\n[[If you watch long enough, the lights do odd things such as turn purple, or light up all three red.]]\n\n{{Title text: There's an intersection I drive through sometimes that has a forward green arrow, a red light, and a 'no turns' sign all on one pole. I honestly have no idea what it's telling me to do.}}","alt":"There's an intersection I drive through sometimes that has a forward green arrow, a red light, and a 'no turns' sign all on one pole. I honestly have no idea what it's telling me to do.","img":"https://imgs.xkcd.com/comics/traffic_lights.gif","title":"Traffic Lights","day":"3"},{"month":"10","num":1117,"link":"","year":"2012","news":"","safe_title":"My Sky","transcript":"[[The first panel's scenery is upside down.  An artist is hanging from the ground, looking down at the sky, where there is a cloud.]]\nArtist: Oh -- hello down there!\nArtist: Welcome to my sky!\n\n[[The artist is now standing on the ground looking up.]]\nArtist: It's pretty good.\nArtist: I like it.\nArtist: It's not the same color as \nanything\n.\n\n[[The scene zooms out, revealing more clouds.]]\nArtist: Wow!\nArtist: There are a \nlot\n of you!\nArtist: Good thing it's so big.\n\n[[A figure with long hair is talking to the artist at what's evidently an alcoholory, since the figure is holding a martini glass and there is a waiter in the background.]]\nFigure: And what do \nyou\n do?\nArtist: I'm in the cloud storage business.\n\n{{Title text: According to my mom, my first word was (looking up at the sky) 'Wow!'}}","alt":"According to my mom, my first word was (looking up at the sky) 'Wow!'","img":"https://imgs.xkcd.com/comics/my_sky.png","title":"My Sky","day":"5"},{"month":"10","num":1118,"link":"","year":"2012","news":"","safe_title":"Microsoft","transcript":"[[Two characters with long hair are talking.]]\nFirst character: Remember when we prosecuted Microsoft for bundling a browser with an OS?\nFirst character: Imagine the future we'd live in if we'd been willing to let one tech company amass that much power.\nSecond character: Thank god we nipped \nthat\n in the bud.\n\n{{Title text: Facebook, Apple, and Google all got away with their monopolist power grabs because they don't have any 'S's in their names for critics to snarkily replace with '$'s.}}","alt":"Facebook, Apple, and Google all got away with their monopolist power grabs because they don't have any 'S's in their names for critics to snarkily replace with '$'s.","img":"https://imgs.xkcd.com/comics/microsoft.png","title":"Microsoft","day":"8"},{"month":"10","num":1119,"link":"","year":"2012","news":"","safe_title":"Undoing","transcript":"My hobby:\n[[A wind turbine has been disconnected from its transformer, and is wired directly to a large wooden fan.  A figure stands proudly before the wooden fan.]]\nUndoing\n\n{{Title text: I've been sneaking out at night and installing lamps on the underside of every photovoltaic panel I can find. Sure, there are upwards of 80% losses, but I prefer to think of them as nearly 20% gains.}}","alt":"I've been sneaking out at night and installing lamps on the underside of every photovoltaic panel I can find. Sure, there are upwards of 80% losses, but I prefer to think of them as nearly 20% gains.","img":"https://imgs.xkcd.com/comics/undoing.png","title":"Undoing","day":"10"},{"month":"10","num":1120,"link":"","year":"2012","news":"","safe_title":"Blurring the Line","transcript":"[[A figure with a hat is talking to another figure.]]\nHat: ... No, but see, it's a movie \nabout\n movies.\nFigure: Sounds like masturbatory navel-gazing.\n\nHat: No, it's about blurring the line between metaphor and reality.\nHat: You just don't know much about art.\n\nFigure: I know \nall\n about blurring the line between metaphor and reality.  I'm the goddamn \nMichael Jordan\n of blurring the line between metaphor and reality.\n\n[[The figure walks away.]]\nHat: ... huh?\n\n[[A basketball flies into the panel and knocks the figure's hat off.]]\n\n{{Title text: People into masturbatory navel-gazing have a lot to learn about masturbation.}}","alt":"People into masturbatory navel-gazing have a lot to learn about masturbation.","img":"https://imgs.xkcd.com/comics/blurring_the_line.png","title":"Blurring the Line","day":"12"},{"month":"10","num":1121,"link":"","year":"2012","news":"","safe_title":"Identity","transcript":"[[A character is sending a message from their phone.]]\nCharacter: Hey, I lost the server password.  What is it, again?\n\n[[Someone at a desk with a laptop on it replies.]]\nDesk Haver: It's -- ...wait.  How do I know it's really you?\n\nCharacter: Ooh, good question!  I bet we can construct a cool proof-of-identity protocol.  I'll start by picking two random--\nDesk Haver: Oh good; it's you.  Here's the psasword...\nCharacter: \nNO!\n\n\n{{Title text: Not sure why I just taught everyone to flawlessly impersonate me to pretty much anyone I know. Just remember to constantly bring up how cool it is that birds are dinosaurs and you'll be set.}}","alt":"Not sure why I just taught everyone to flawlessly impersonate me to pretty much anyone I know. Just remember to constantly bring up how cool it is that birds are dinosaurs and you'll be set.","img":"https://imgs.xkcd.com/comics/identity.png","title":"Identity","day":"15"},{"month":"10","num":1122,"link":"","year":"2012","news":"","safe_title":"Electoral Precedent","transcript":"The Problem with Statements Like\n\"No <party> candidate has won the election without <state>\" \nor\n\"No President has been reelected under <circumstances>\"\n\n[[Each panel is a variation on the others, with the date in a small box at the top left, a stick figure speaking the line in the main panel, and the concluding sentence underneath.]]\n\n1788\nNo one has been elected President before.\nbut Washington was.\n\n1792\nNo incumbent has ever been selected.\nuntil Washington.\n\n1796\nNo one without false teeth has become President.\nbut Adams did.\n\n1800\nNo challenger has beaten an incumbent. \nbut Jefferson did.\n\n1804\nNo incumbent has beaten a challenger.\nuntil Jefferson.\n\n1808\nNo congressman has ever become President.\nuntil Madison.\n\n1812\nNo one can win without New York.\nbut Madison did.\n\n1816\nNo candidate who doesn't wear a wig can get elected.\nuntil Monroe was.\n\n1820\nNo one who wears pants instead of breeches can be reelected.\nbut Monroe was.\n\n1824\nNo one has ever won without a popular majority.\nJ.Q. Adams did.\n\n1828\nOnly people from Massachusetts and Virginia can win.\nuntil Jackson did.\n\n1832\nThe only Presidents who get reelected are Virginians.\nuntil Jackson.\n\n1836\nNew Yorkers always lose.\nuntil Van Buren.\n\n1840\nNo one over 65 has won the Presidency.\nuntil Harrison did.\n\n1844\nNo one who's lost his home state has won.\nbut Polk did.\n\n1848\nThe Democrats don't lose when they win Pennsylvania.\nbut they did in 1848.\n\n1852\nNew England Democrats can't win.\nuntil Pierce did.\n\n1856\nNo one can become President without getting married.\nuntil Buchanan did.\n\n1860\nNo one over 6'5\" can get elected.\nuntil Lincoln.\n\n1864\nNo one with a beard has been reelected.\nbut Lincoln was.\n\n1868\nNo one can be President if their parents are alive.\nuntil Grant.\n\n1872\nNo one with a beard has been reelected in peacetime.\nuntil Grant was.\n\n1876\nNo one can win a majority of the popular vote and still lose.\nTilden did.\n\n1880\nAs goes California, so goes the nation.\nuntil it went Hancock.\n\n1884\nCandidates named 'James' can't lose.\nuntil James Blaine.\n\n1888\nNo sitting President has been beaten since the Civil War.\nCleveland was.\n\n1892\nNo former President has been elected.\nuntil Cleveland.\n\n1896\nTall Midwesterners are unbeatable.\nBryan wasn't. \n\n1900\nNo Republican shorter than 5'8\" has been reelected.\nuntil McKinley was.\n\n1904\nNo one under 45 has been elected.\nRoosevelt was.\n\n1908\nNo Republican who hasn't served in the military has won.\nuntil Taft.\n\n1912\nAfter Lincoln beat the Deocrats while sporting a beard with no mustache, the only Democrats who can win have a mustache with no beard.\nWilson had neither.\n\n1916\nNo Democrat has won without Indiana.\nWilson did.\n\n1920\nNo incumbent senator has won.\nuntil Harding.\n\n1924\nNo one with two Cs in their name has become President.\nuntil Calvin Coolidge.\n\n1928\nNo one who got ten million votes has lost.\nuntil Al Smith.\n\n1932\nNo Democrat has won since women secured the right to vote.\nuntil FDR did.\n\n1936\nNo President's been reelected with double-digit unemployment.\nuntil FDR was.\n\n1940\nNo one has won a third term.\nuntil FDR did.\n\n1944\nNo Democrat has won during wartime.\nuntil FDR did.\n\n1948\nDemocrats can't win without Alabama.\nTruman did.\n\n1952\nNo Republican has won without winning the House or Senate.\nEisenhower did.\n\n1956\nNo Republican has won without Missouri.\nuntil Eisenhower.\n\n1960\nRepublicans without facial hare are unbeatable.\nKennedy beat Nixon.\n\n1964 \nNo Democrat has won without Georgia.\nJohnson did.\n\n1968\nNo Republican Vice President has risen to the Presidency through an election.\nuntil Nixon.\n\n1972\nNo wartime candidate has won without Massachusetts.\nuntil Nixon did.\n\n1976\nNo one who lost New Mexico has won.\nbut Carter did.\n\n1980\nNo one has been elected President after a divorce.\nuntil Reagan was.\n\n1984\nNo left-handed President has been reelected.\nuntil Reagan was.\n\n1988\nNo Democrat who has won Wisconsin (without being from there) has lost.\nuntil Dukakis did.\n\n1992\nNo Democrat has won without a majority of the Catholic vote.\nuntil Clinton did.\n\n1996\nNo Dem. incumbent without combat experience has beaten someone whose first name is worth more in Scrabble.\nuntil Bill beat Bob.\n\n2000\nNo Republican has won without Vermont.\nuntil Bush did.\n\n2004\nNo Republican without combat experience has beaten someone two inches taller.\nuntil Bush did.\n\n2008\nNo Democrat can win without Missouri.\nuntil Obama did.\n\n[[The next two panels share a date and ending caption.]]\n2012\nPanel 1: Alliterative tickets (e.g. Romney\nRyan) are undefeated.\nPanel 2: No nominee whose first name contains a \"K\" has lost.\nWhich streak will break?\n{{Title text: No white guy who's been mentioned on Twitter has gone on to win.}}","alt":"No white guy who's been mentioned on Twitter has gone on to win.","img":"https://imgs.xkcd.com/comics/electoral_precedent.png","title":"Electoral Precedent","day":"17"},{"month":"10","num":1123,"link":"","year":"2012","news":"","safe_title":"The Universal Label","transcript":"[[A small rectangle, in the style of a food package's ingredients list.]]\nINGREDIENTS:\nHYDROGEN, TIME\n{{Title text: Works for any grocery or non-grocery. Even thyme is just H and time.}}","alt":"Works for any grocery or non-grocery. Even thyme is just H and time.","img":"https://imgs.xkcd.com/comics/the_universal_label.png","title":"The Universal Label","day":"19"},{"month":"10","num":1124,"link":"","year":"2012","news":"","safe_title":"Law of Drama","transcript":"[[A graph, with a slightly curved upward trend. The x-axis is marked 'how often someone declares that they hate \"drama\" and always avoid it.', and the y-axis is marked 'rate at which they create drama.' ]]\n\n{{Title text: 'Drama' is just 'people being upset', when someone says they're always surrounded by drama and they just ignore it, it starts to make sense that their strategy might be backfiring.}}","alt":"'Drama' is just 'people being upset', when someone says they're always surrounded by drama and they just ignore it, it starts to make sense that their strategy might be backfiring.","img":"https://imgs.xkcd.com/comics/law_of_drama.png","title":"Law of Drama","day":"22"},{"month":"10","num":1125,"link":"","year":"2012","news":"","safe_title":"Objects In Mirror","transcript":"[[A view of the passenger-side sideview mirror from the inside of the car. A message on the bottom of the mirror reads 'Objects in mirror are bluer than they appear.']]\nEdwin Hubble's car.\n\n{{Title text: Universes in mirror, like those in windshield, are larger than they appear.}}","alt":"Universes in mirror, like those in windshield, are larger than they appear.","img":"https://imgs.xkcd.com/comics/objects_in_mirror.png","title":"Objects In Mirror","day":"24"},{"month":"10","num":1126,"link":"","year":"2012","news":"","safe_title":"Epsilon and Zeta","transcript":"THE SAGA OF EPSILON AND ZETA\nThe 2005 Atlantic hurricane season saw devastating storms like Katrina and Rita. But less well-remembered is just how \nstrange\n the season got toward the end.\nThe forecasters at the National Hurricane Center are the best of the best.\nTheir predictions are masterpieces of professional analysis. But in November 2005, out in the center of the Atlantic - far from any land - the atmosphere stopped making sense.\nAnd the forecasters - who'd expected the season to be long over by now - started to get a little unhinged.\nThis is their story, as seen through the actual 2005 NHC Advisories:\n\n[[Two men, one bald and one not, sit looking at their respective computers, at separate desks, back to back. The advisory is printed above them in caps\nsmall-caps Courier type.]]\nTuesday, November 29th, 2005: \nTropical Storm Epsilon . . .\nThe 26th named storm of the apparently never ending 2005 Atlantic hurricane season.\n\n[[The same scene, different text.]]\n10 PM Wed: The window of opportunity for strengthening should close in 12-24 hr.\n4 PM Thu: Slow but steady weakening is expected to begin in 12-24 hours.\n\n[[The man with hair now has questions marks above his head.]]\n4 AM Fri: Epsilon does not appear weaker.\n10 AM Fri: Epsilon has been upgraded to a 65-kt hurricane.\n\n[[The two still sit back-to-back.]]\n4 PM Sat: Epsilon has continued to strengthen against all odds . . . [but] can not maintain the current intensity much longer since the environment is becoming increasingly unfavorable.\n\n[[Ditto.]]\n10 PM Sat: Epsilon might or might not still be a hurricane . . . but in any case it likely will not be one on Sunday.\n4 AM Sun: Epsilon is downgraded to a tropical storm. \n\n[[Yep.]]\n10 AM Sun: Morning satellite images indicate that Epsilon has restrengthened.\n\n[[A closer view of just the balding man at his desk.]]\nThere are no clear reasons . . . and I am not going to make one up . . . to explain the recent strengthening of Epsilon and I am just describing the facts.\nHowever . . . I still have to make an intensity forecast and the best bet at this time is to predict weakening . . . Epsilon will likely become a remnant low.\nI heard that before about epsilon . . . haven't you?\n\n[[The two men still sit back to back, but the man with hair is now turning his head toward the other man, with his arm resting on the back of his chair. The bald man is leaning forward in his seat, toward his computer while typing.]]\n4 PM Mon: The cloud pattern continues to be remarkably well-organized for a hurricane at such high latitude\nin December.\n\n[[The other man has turned back to his own screen.]]\n10 PM Mon: We have said this before . . . but Epsilon really does not appear as strong this evening as it did this afternoon.\n\n[[Just the bald guy now.]]\n4 AM Tue: \nI have run out of things to say.\n\n[[The two of them again.]]\n10 PM Tue: The end is in sight. It really really is. But in the meantime . . . Epsilon continues to maintain hurricane status. \n4 AM Wed: The end is in sight . . . yes . . . but not quiet yet. I thought I was going to find a weakening system and instead I found that Epsilon is still a hurricane.\n\n[[Ditto.]]\n10 AM  Thu: Convection has vanished and Epsilon is now a tight swirl of low clouds.\nI hope this is the end of the long lasting 2005 hurricane season.\n\n[[This panel is blank and just reads: Nope.]]\n\nEnter Tropical Storm Zeta.\n[[The men are still at their desks. The bald man is leaning back on his chair and staring at his screen, the other man's hair is noticeably disheveled, and he has started growing a five o'clock shadow.]]\nFriday, December 30th, 2005: An elongated area of low pressure . . . which ahd its origins in an old frontal trough . . . began developing organized convection overnight. Advisories are initiated on the 27th tropical storm of 2005.\n\nAny new storms would be in the 2006 season.\n[[The men are still at their desks, the man with hair is even more bedraggled-looking.]]\n4PM Fri: Although the atmosphere seems to want to develop tropical storms ad nauseam . . . the calendar will shortly put an end to the use of the Greek alphabet to name them.\n\nBut 2005's wouldn't end until Zeta did.\n[[The bald man is now wearing a party hat and there is confetti in the air.]]\n10 PM Sat: Zeta appeared on the verge of losing all of its deep convection a few hours ago . . . but since about 21z the convection has been on somewhat of an increase again.\n\n[[A close view of the man with hair at his desk.]]\n10 PM Sun: This is like Epsilon all over again. Most of the conventional guidance suggested that zeta should have been dissipated by now . . . well . . . zeta is pretty much alive at this time. \nI have no choice but to forecast weakening\nagain and again.\n\n[[Both of them at their desks.]]\n4 AM Mon: By 24-36 hours . . . a significant increase in westerly winds . . . should act to shear away most of the associated convection . . . and finally bring the 2005 Atlantic hurricane season to a merciful ending.\n4 PM Mon: It is hard to conceive that a tropical cyclone will be able to survive for very long in such a hostile environment. therefore I have not backed off on the forecast of weakening.\n\n[[And again.]]\n10 PM Mon: Zeta is stronger than yesterday.\n10 AM Wed: As you can see. . . I ran out of things to say.\n\n[[And again.]]\n4 AM Thu: Satellite intensity estimates have decreased. Zeta is downgraded to a 30 kt tropical depression.\n\n[[And again.]]\n10 AM Thu: Shortly after the previous advisory had been issued . . . regretfully . . . the intensity . . . increased to 35 kt and Zeta is a tropical storm once again.\n\n[[And again.]]\n10 PM Thu: Although it seems as if Zeta will never die . . . the forecast continues to show weakening.\n\n[[Both men are now leaning back in their chairs, exhausted.]]\n4 PM, Friday, January 6, 2006: Zeta no longer meets the criteria of a tropical cyclone. . . which means that both it and the 2005 Atlantic hurricane season have ended. \nThis is the national hurricane center signing off for 2005.\n\n[[The bald man still sits at his desk, the man with hair is no longer in his chair.]]\n\n[[Again, we see the bald man at his desk and the other guy's empty desk.]]\nBald guy: Actually, Zeta's cloud pattern is\nHair guy: (out of panel) NO.\nBald guy: Ok. \n\n{{Title text: The average error in the NHC forecasted position of a hurricane three days in the future has shrunk to a third of what it was in 1990--a staggering accomplishment. However, as you may have gathered, forecasts of future storm *strength* have proved more difficult to improve.}}","alt":"The average error in the NHC forecasted position of a hurricane three days in the future has shrunk to a third of what it was in 1990--a staggering accomplishment. However, as you may have gathered, forecasts of future storm *strength* have proved more difficult to improve.","img":"https://imgs.xkcd.com/comics/epsilon_and_zeta.png","title":"Epsilon and Zeta","day":"26"},{"month":"10","num":1127,"link":"https://xkcd.com/1127/large/","year":"2012","news":"You can get this comic as a <a href=\"https://store.xkcd.com/products/congress-poster\">poster</a>!","safe_title":"Congress","transcript":"A history of the\nUnited States Congress\npartisan and ideological makeup\n\n[[A chart showing the makeup of the US Senate and House of Representatives throughout history. It shows which ideological blocs (far left, left, center-left, center-right, right, far-right) made up what portion of the left-leaning and right-leaning parties in each chamber.]]\n\n{{Title text: It'd be great if some news network started featuring partisan hack talking heads who were all Federalists and Jacksonians, just to see how long it took us to catch on.}}","alt":"It'd be great if some news network started featuring partisan hack talking heads who were all Federalists and Jacksonians, just to see how long it took us to catch on.","img":"https://imgs.xkcd.com/comics/congress.png","title":"Congress","day":"29"},{"month":"10","num":1128,"link":"","year":"2012","news":"","safe_title":"Fifty Shades","transcript":"As with most famous books, I've never actually READ \nFifty Shades of Grey\n. \nI only know the plot from watching the \nWishbone\n version.\n[[A kid is sitting on the floor, watching TV.]]\n<<Bark!>>\n<<Bark!>>\n<<SMACK>>\n<<Bark!>>\n\n{{Title text: Wishbone and the Illustrated Classics series have gotten me through every conversation I've ever had about Dickens, Treasure Island, The Anarchist's Cookbook, and Our Bodies, Ourselves.}}","alt":"Wishbone and the Illustrated Classics series have gotten me through every conversation I've ever had about Dickens, Treasure Island, The Anarchist's Cookbook, and Our Bodies, Ourselves.","img":"https://imgs.xkcd.com/comics/fifty_shades.png","title":"Fifty Shades","day":"31"},{"month":"11","num":1129,"link":"","year":"2012","news":"","safe_title":"Cell Number","transcript":"[[Diagram outlining the true structure of a US Cell Phone number.  The 3-digit exchange number plus 4-digit subscriber number are your 7 random digits.  The area code is where you lived in 2005.]]\nStructure of a US Cell Phone number.\n\n{{Title text: There's also a +1 sometimes, which is there to keep everyone on their toes. In the future, people who got to pick cool numbers by signing up for Google Voice early will be revered as wizards.}}","alt":"There's also a +1 sometimes, which is there to keep everyone on their toes. In the future, people who got to pick cool numbers by signing up for Google Voice early will be revered as wizards.","img":"https://imgs.xkcd.com/comics/cell_number.png","title":"Cell Number","day":"2"},{"month":"11","num":1130,"link":"","year":"2012","news":"","safe_title":"Poll Watching","transcript":"[[A man is kneeling on his desk chair, hunched over his laptop screen.]]\nMan: This Tuesday will be huge! If Obam wins the election, it could generate news coverage \ndevastating\n to Romney's position in the tracking polls!\nOut of panel: ...maybe you should take a break.\n\n{{Title text: The choices we make Tuesday could have MASSIVE and PERMANENT effects on the charts on Nate Silver's blog!}}","alt":"The choices we make Tuesday could have MASSIVE and PERMANENT effects on the charts on Nate Silver's blog!","img":"https://imgs.xkcd.com/comics/poll_watching.png","title":"Poll Watching","day":"5"},{"month":"11","num":1131,"link":"","year":"2012","news":"","safe_title":"Math","transcript":"[[A stacked bar chart representing the distribution of electoral votes for a US presidential election.  The unusually darker-skinned, blessed, beautiful, twisted, Democratic candidate has 313 votes, while the much more pallid, glove-named Republican candidate has 225.  The forecast of this result is noted, with the actual results being in the center of the predicted zone.]]\nBreaking: To surprise of pundits, numbers continue to be best system for determining which of two things is larger.\n\n{{Title text: As of this writing, the only thing that's 'razor-thin' or 'too close to call' is the gap between the consensus poll forecast and the result.}}","alt":"As of this writing, the only thing that's 'razor-thin' or 'too close to call' is the gap between the consensus poll forecast and the result.","img":"https://imgs.xkcd.com/comics/math.png","title":"Math","day":"7"},{"month":"11","num":1132,"link":"","year":"2012","news":"","safe_title":"Frequentists vs. Bayesians","transcript":"Did the sun just explode? (It's night, so we're not sure)\n\n[[Two statisticians stand alongside an adorable little computer that is suspiciously similar to K-9 that speaks in Westminster typeface]]\nFrequentist Statistician: This neutrino detector measures whether the sun has gone nova.\nBayesian Statistician: Then, it rolls two dice. If they both come up as six, it lies to us.  Otherwise, it tells the truth.\nFS: Let's try. [[to the detector]] Detector! Has the sun gone nova?\nDetector: <<roll>> YES.\n\nFrequentist Statistician:\nFS: The probability of this result happening by chance is 1\n36=0.027.  Since p< 0.05, I conclude that the sun has exploded.\n\nBayesian Statistician:\nBS: Bet you $50 it hasn't.\n\n{{Title text: 'Detector! What would the Bayesian statistician say if I asked him whether the--' [roll] 'I AM A NEUTRINO DETECTOR, NOT A LABYRINTH GUARD. SERIOUSLY, DID YOUR BRAIN FALL OUT?' [roll] '... yes.'}}","alt":"'Detector! What would the Bayesian statistician say if I asked him whether the--' [roll] 'I AM A NEUTRINO DETECTOR, NOT A LABYRINTH GUARD. SERIOUSLY, DID YOUR BRAIN FALL OUT?' [roll] '... yes.'","img":"https://imgs.xkcd.com/comics/frequentists_vs_bayesians.png","title":"Frequentists vs. Bayesians","day":"9"},{"month":"11","num":1133,"link":"","year":"2012","news":"","safe_title":"Up Goer Five","transcript":"US Space Team's Up Goer Five\n[NASA's Saturn V]\nThe only flying space car that's taken anyone to another world.\n[The only spacecraft to take anyone somewhere other than Earth]\n(Explained using only the ten hundred [thousand] words people use the most often)\n\n((The following is a top-to-bottom description of the various parts of the Saturn V, alternating between the limited-vocabulary version and the technical version))\n\nThing to help people escape really fast if there's a problem and everything is on fire so they decide not to go to space\n[Launch Escape System]\n\nThing to control which direction the escaping people go.\n[Launch Escape System pitch motor]\n\nStuff to burn to make the box with the people in it escape *really fast*\n[Launch Escape Motor]\n\nPlace where fire comes out to help them escape.\n[Launch Escape Motor nozzles]\n\nPart that flies around the other world and comes back home with the people in it and falls in the water.\n[Apollo Command Module; includes \"People Box, Door, Chairs\"]\n\nPart that goes along to give people air, water, computers and stuff. It comes back home with them, but burns up without landing.\n[Apollo Service module]\n\nCold Air for burning (and breathing). This part had a *very* big problem once.\n[oxygen tank; was the tank that exploded during the Apollo 13 incident]\n\nPart that flies down to the other world with two people inside\n[Lunar Module]\n\nPart that stays on the other world (It's still there)\n[Lunar Module Descent Stage]\n\nFeet that go on the ground of the other world \n[Lunar Module Descent Stage landing gear]\n\nRing holding most of the computers\n[Instrument Unit]\n\nPart that falls off third (this part flew away from our world into space and hit the world we were going toward)\n[Third stage]\n\nThings holding that kind of air that makes your voice funny (It's for filling up the space left when they take the cold air out to burn it)\n[Helium tank]\n\nThe kind of air that once burned a big sky bag and people died and someone said \"Oh the [humans]!\" (used for burning) (wet and *very* cold)\n[Liquid Hydrogen tank]\n\nThe part of air you need to breathe, but not the other stuff (used for burning)(wet and *very* cold)\n[Liquid Oxygen tank]\n\nFire comes out here\n[J-2 Third stage engine]\n\nPart that falls off second\n[Second stage]\n\nMore sky bag air (for burning)(cold + wet)\n[Liquid Hydrogen tank, Second stage]\n\nMore breathing-type air (for burning)(cold + wet)\n[Liquid Oxygen tank, Second stage]\n\nThing that brings in cold wet air to burn\n[Fuel tank input, Second stage]\n\nFire comes out here\n[5 J-2 Second stage engines]\n\nPart that falls off first\n[First stage]\n\nMore breathing-type air (for burning)(cold + wet)\n[Liquid Oxygen tank, First stage]\n\nMore funny voice air (for filling up space)\n[Helium tank, First stage]\n\nOpening for putting in cold wet air\n[Liquid oxygen tank input, First stage]\n\nThis is full of that stuff they burned in lights before houses had power.  It goes together with the cold air when it's time to start going up.\n[Kerosene tank, First stage]\n\nLots of fire comes out here\n[5 F-1 First stage engines]\n\n[[Description of bottom end]]\nThis end should point toward the ground if you want to go to space. If it starts pointing toward space, you are having a bad problem and you will not go to space today.\n\n{{Title text: Another thing that is a bad problem is if you're flying toward space and the parts start to fall off your space car in the wrong order. If that happens, it means you won't go to space today, or maybe ever.}}","alt":"Another thing that is a bad problem is if you're flying toward space and the parts start to fall off your space car in the wrong order. If that happens, it means you won't go to space today, or maybe ever.","img":"https://imgs.xkcd.com/comics/up_goer_five.png","title":"Up Goer Five","day":"12"},{"month":"11","num":1134,"link":"","year":"2012","news":"","safe_title":"Logic Boat","transcript":"[[A person shows up at a boat docked at the edge of a river.  The person has brought along a head of cabbage, a goat, and a wolf.]]\nProblem: The boat only holds two, but you can't leave the goat with the cabbage or the wolf with the goat.\n\n[[The wolf looks curiously at the lumpy bally that's been left behind while the person goes off with the goat]]\nSolution: 1. Take the goat across\n\n[[The goat remains tied up on the far side.  The wolf watches the person come back]]\n2. Return alone.\n\n[[The wolf thinks \"aww no mo bally\" as the person goes off]]\n3. Take the cabbage across. \n\n4. Leave the wolf.  Why did you have a wolf?\n[[The wolf goes off all sad-like]]\n\n\n{{Title text: Or a cabbage, for that matter. The goat makes sense. Goats are fine.}}","alt":"Or a cabbage, for that matter. The goat makes sense. Goats are fine.","img":"https://imgs.xkcd.com/comics/logic_boat.png","title":"Logic Boat","day":"14"},{"month":"11","num":1135,"link":"","year":"2012","news":"","safe_title":"Arachnoneurology","transcript":"[[The artist has a book titled Spider Psychology, and is carefully adjusting one of those things with clips that's used to hold objects in place.]]\n\n[[The artist puts it in the corner of a room which has cobwebs in it.]]\n\n[[Spiders move into the thing, and start weaving webs on it.]]\n\nSix Weeks Later:\n[[The artist tears a sweater covered in spiders out.]]\n\n{{Title text: SPIDER PSYCHOLOGY (21st Ed.) is a comprehensive overview of arachnoneurology, neuro-arachnology, forensic arachnology, neuro-arachnoneurology (the study of the brains of spider neurology experts), and arachnoarachnology (the study of too many spiders).}}","alt":"SPIDER PSYCHOLOGY (21st Ed.) is a comprehensive overview of arachnoneurology, neuro-arachnology, forensic arachnology, neuro-arachnoneurology (the study of the brains of spider neurology experts), and arachnoarachnology (the study of too many spiders).","img":"https://imgs.xkcd.com/comics/arachnoneurology.png","title":"Arachnoneurology","day":"16"},{"month":"11","num":1136,"link":"","year":"2012","news":"","safe_title":"Broken Mirror","transcript":"[[The man in the black hat is standing next to a vanity cabinet, with a broken mirror on the floor.  Another chap is in the room with him.]]\nBlack Hat: Oops.  Guess this means seven more years of the illusion that my actions somehow influence the indifferent hand of probability which governs our lives.\n\n[[Black hat guy stares at the shards of glass on the floor.]]\n\nChap: Plus like half an hour of sweeping.\nBlack Hat: No, I think I'll leave it.\nChap: You'll get glass in your feet.\n\n[[Black hat guy holds up a shard of glass, looks at it.]]\nBlack Hat: Eccles. 9:2 - All things come alike to all: To the clean, and to the unclean.\nBlack Hat: My fate is as these shards.\nChap: Dude, chill, it's just a vanity mirror.\nBlack Hat: \nAll\n is vanity mirrors.\n\n{{Title text: 'I see you're in this mood again.' 'I am always in this mood.'}}","alt":"'I see you're in this mood again.' 'I am always in this mood.'","img":"https://imgs.xkcd.com/comics/broken_mirror.png","title":"Broken Mirror","day":"19"},{"month":"11","num":1137,"link":"","year":"2012","news":"","safe_title":"‮LTR","transcript":"[[A chap is standing next to the black hat guy, who's sitting on a chair working on a laptop.]]\nChap: And that's not even the worst part! The \nworst\n part is that--\nBlack Hat: <<U+202e>>\nChap: ...neve t'ndid yeht--\nChap: ?lleh eht tahw... ...uoy did woh\nChap: .elohssa...\n{{The chap's text, read right to left, reads:  --they didn't even... how did you... ... what the hell? ...asshole.}}\n\n{{Title text: Collaborative editing can quickly become a textual rap battle fought with increasingly convoluted invocations of U+202a to U+202e.}}","alt":"Collaborative editing can quickly become a textual rap battle fought with increasingly convoluted invocations of U+202a to U+202e.","img":"https://imgs.xkcd.com/comics/rtl.png","title":"‮LTR","day":"21"},{"month":"11","num":1138,"link":"","year":"2012","news":"","safe_title":"Heatmap","transcript":"[[There is a screen, and a chap standing in front of it pointing at one of the images on the screen.  The screen contains 3 maps, each with a title under them.]]\n[[A heat map of the USA, with red spots on larger cities.]]\nOur site's users\n[[A heat map of the USA, with red spots on larger cities.]]\nSubscribers to \nMartha Stewart Living\n\n[[A heat map of the USA, with red spots on larger cities.]]\nConsumers of furry pornography\nChap: The business implications are clear.\n\nPet Peeve #208:\nGeographic profile maps which are basically just population maps.\n\n\n{{Title text: There are also a lot of global versions of this map showing traffic to English-language websites which are indistinguishable from maps of the location of internet users who are native English speakers.}}","alt":"There are also a lot of global versions of this map showing traffic to English-language websites which are indistinguishable from maps of the location of internet users who are native English speakers.","img":"https://imgs.xkcd.com/comics/heatmap.png","title":"Heatmap","day":"23"},{"month":"11","num":1139,"link":"","year":"2012","news":"","safe_title":"Rubber and Glue","transcript":"[[A playground.  The black hat is large on one child, who is sitting and reading.  Other children surround him.]]\nKid A: Whatchya reading, hatboy?\nHatboy: The CRC Handbook of Chemistry and Physics.\nKid B: You are such a loser, it's \npainful\n.\nHatboy: I'm rubber, you're glue.\n\nKid A: Yeah, well--\nHatboy: \nGlue can't speak.\n\nHatboy: You try to scream, but your mouth fills with glue.\nHatboy: Your face is glue.  Your body is glue.\n\n[[The black hat child stands up, leaving the book closed on the ground.  He holds his hand out to the other children.]]\nHatboy: I wrap my rubber arms around your sticky bulk.\nHatboy: Your neoprene base bonds instantly with my surface.\nHatboy: Never to let go.\n\n[[The view zooms in dramatically on the hat child, whose fists are clenched.]]\nHatboy: You are glue. I am rubber.\nHatboy: Staring at you with my dead, rubber eyes--\nHatboy: \nForever.\n\nKid A: Moooom!\n\n{{Title text: I'm rubber. You're rubber. We contemplate the reality of our existence in mute, vulcanized horror.}}","alt":"I'm rubber. You're rubber. We contemplate the reality of our existence in mute, vulcanized horror.","img":"https://imgs.xkcd.com/comics/rubber_and_glue.png","title":"Rubber and Glue","day":"26"},{"month":"11","num":1140,"link":"","year":"2012","news":"","safe_title":"Calendar of Meaningful Dates","transcript":"Calendar of Meaningful Dates\n\nEach date's size represents how often it is referred to by name (e.g. \"October 17th\") in English-language books since 2000 (source: Google n-grams corpus)\n\n[[A 3x4 grid of months, laid out left to right, top to bottom from January to December. The days of each month are arranged in typical monthly calendar format. Some day numbers are larger than others.))\n\n((Due to the 365 different days in a year and individually varying sizes, not every number is mentioned below, only outliers.\n\nJanuary's 1 is much larger than any other number for that month.\nFeburary's numbers don't very all that much, but the 1, 14, and 28 are slightly larger, and the 29 is very small.\nMarch's 1 and 21 are larger than most of the other numbers.\nApril's 1 and 15 are somewhat larger than the rest.\nMay's 1 is significantly larger than any other day in the month.\nJune's 1 is significantly larger than most of the other days, but 30 is the 2nd largest.\nJuly's 1 is fairly large, but its 4 is even bigger - about twice the size of most other day's numbers.\nAugust's 1 and 15 are both fairly large.\nSeptember's 1 is somewhat large, but its 11 is by far the biggest number of any in the entire year, 3 times as tall as most other numbers from any month.\nOctober's 1 is its largest, followed by the 31.\nNovember's 1 is by far its largest.\nDecember's 31 is the largest, followed by its 1, 7, and 25.))\n\n\n{{Title text: In months other than September, the 11th is mentioned substantially less often than any other date. It's been that way since long before 9\n11 and I have no idea why.}}","alt":"In months other than September, the 11th is mentioned substantially less often than any other date. It's been that way since long before 9/11 and I have no idea why.","img":"https://imgs.xkcd.com/comics/calendar_of_meaningful_dates.png","title":"Calendar of Meaningful Dates","day":"28"},{"month":"11","num":1141,"link":"","year":"2012","news":"","safe_title":"Two Years","transcript":"[[A man and a woman sit on a bed, the woman is talking on the phone. The person she is talking to, a doctor holding a clipboard, is shown inset.]]\nWoman: Oh god.\n\n[[The man and woman sit together while the woman, now bald, is receiving chemotherapy. They are both on their laptops.]] \n<< ... BEEEP ... BEEEP ... BEEEP ... >>\n\n[[The man and the woman (who is wearing a knit cap) are paddling a kayak against a scenic mountain backdrop.]]\n\n[[The man and woman sit at a table, staring at a cell phone. There is a clock on the wall.]]\nWoman: How long can it take to read a scan?\n\n[[The man and woman are back at the hospital again, the woman receiving chemo. They are playing Scrabble.]]\nMan: \"ZARG\" isn't a word.\nWoman: But \nCAAAANCER.\n\nMan: ...ok, fine.\n\n[[The man and woman are listening to a friend speak.]\nFriend: So next year you should come visit us in the moun... (the rest is obscured by a thought bubble).\nMan & Woman: (thinking) \"Next Year\"\n\n[[The man and the woman (with short hair) getting married, a heart above their heads.]]\n\n[[The man and the woman (wearing a knit cap) stand on a beach, watching a whale breach.]]\n<<FWOOSH>>\n\n[[The woman is sitting at a desk with several books and a laptop. The man stands behind her.]]\nMan: Hey - you're doing science, and you're still alive.\nWoman: Yeah!\n\n[[The man and woman sit under a tall tree on a hill.]]\nMan: It's really only been two years?\nWoman: They were big years.\n\n[[The man and woman sit at a table in a fancy restaurant, the waiter brings them a dish with a cover on it.]]\nWaiter: Happy.. anniversary?\nWoman: Biopsy-versary!\nWaiter: ...eww.\n \n\n{{Title text: She won the first half of all our chemo Scrabble games, but then her IV drugs started kicking in and I *dominated*.}}","alt":"She won the first half of all our chemo Scrabble games, but then her IV drugs started kicking in and I *dominated*.","img":"https://imgs.xkcd.com/comics/two_years.png","title":"Two Years","day":"30"},{"month":"12","num":1142,"link":"","year":"2012","news":"","safe_title":"Coverage","transcript":"((An inset panel inside the main panel.))\n[[A close-up on a man holding a cellphone.]]\nMan: Man, the coverage in here is \nawfu-\n\n\n((The main panel.))\n[[The man is interrupted by another man punching him in the face, and he drops his phone to the ground.]]\nFARADAY CAGEMATCH\n\n{{Title text: My resonant tunneling diode phone has limited range but a short enough wavelength to penetrate even the densest cages. This gives me a major combat advantage, hopefully.}}","alt":"My resonant tunneling diode phone has limited range but a short enough wavelength to penetrate even the densest cages. This gives me a major combat advantage, hopefully.","img":"https://imgs.xkcd.com/comics/coverage.png","title":"Coverage","day":"3"},{"month":"12","num":1143,"link":"","year":"2012","news":"","safe_title":"Location","transcript":"[[A man is sitting at a desk typing at his computer while a man and a woman look over his shoulder.]]\nMan: (typing) Hey, party tonight? We'd all love to come see your new place!\nPC Screen: Wait, what?\n\n[[The other side of the conversation: a guy typing on a laptop at a table.]]\nLaptop Screen: We want to hang out!\nGuy: (typing) We're not, like, good friends.\nLaptop Screen: I know, but we were thinking about it and we really like you! \n\n[[The three people again. The man behind the man in the chair is clasping his hands in anticipation.]]\nMan: (typing) You should have us over tonight! For, like, an hour. It'll be fun!\nPC Screen: Well, uh, sure. \n\n[[A black panel with white outlines and letters. A view of the guy's house from above. Four green explosions are seen in the house's yard.]]\n\n{{Title text: Ingress: Foursquare With Space Noises.}}","alt":"Ingress: Foursquare With Space Noises.","img":"https://imgs.xkcd.com/comics/location.png","title":"Location","day":"5"},{"month":"12","num":1144,"link":"","year":"2012","news":"","safe_title":"Tags","transcript":"[[A line of html that reads, \"<div>Q: How do you annoy a web developer?<\nspan>\"]]\n{{Title text: <A>: Like <\na>this.&nbsp;}}","alt":"<A>: Like </a>this.&nbsp;","img":"https://imgs.xkcd.com/comics/tags.png","title":"Tags","day":"7"},{"month":"12","num":1145,"link":"","year":"2012","news":"","safe_title":"Sky Color","transcript":"[[A woman with a ponytail leans back on her office chair, back to her computer, gesturing as she speaks to a little girl in front of her.]]\nGirl: Mommy, why is the sky blue?\nMother: Rayleigh scattering! Short wavelengths get scattered \nway\n more (proportional to 1\nlambda^4). Blue light dominates because it's so short.\nGirl: Oh. So why \nisn't\n the sky violet?\nMother: Well, because, uh... ...hmm.\n\n{{Title text: Feynman recounted another good one upperclassmen would use on freshmen physics students: When you look at words in a mirror, how come they're reversed left to right but not top to bottom? What's special about the horizontal axis?}}","alt":"Feynman recounted another good one upperclassmen would use on freshmen physics students: When you look at words in a mirror, how come they're reversed left to right but not top to bottom? What's special about the horizontal axis?","img":"https://imgs.xkcd.com/comics/sky_color.png","title":"Sky Color","day":"10"},{"month":"12","num":1146,"link":"","year":"2012","news":"","safe_title":"Honest","transcript":"[[Two guys are walking along together.]]\nMan #1: I mean, let's be honest here--\nMan #2: Ok. \n\n[[They stop walking and turn to face each other. Man #2 gestures with one hand.]]\nMan #2: I don't understand why anything happens and I'm confused and scared and trying really hard all the time.\n\n[[They stand facing each other.]]\nMan #1: ...too honest. Scale it back.\nMan #2: Sorry.\n\n{{Title text: I didn't understand what you meant. I still don't. But I'll figure it out soon!}}","alt":"I didn't understand what you meant. I still don't. But I'll figure it out soon!","img":"https://imgs.xkcd.com/comics/honest.png","title":"Honest","day":"12"},{"month":"12","num":1147,"link":"","year":"2012","news":"","safe_title":"Evolving","transcript":"[[A drawing of a cluster of bacteria.]]\n\nWhat?\n\n\nSTAPHYLOCOCCUS AUREUS\n is evolving!\n\n[[The same bacteria.]]\n...\n\n[[The (seemingly) same bacteria.]]\n\nSTAPHYLOCOCCUS AUREUS\n evolved into \nMETHICILLIN-RESISTANT STAPHYLOCOCCUS AUREUS!\n\nOff screen: Aww, crap.\n\n{{Title text: Biologists play reverse PokÃ©mon, trying to avoid putting any one team member on the front lines long enough for the experience to cause evolution.}}","alt":"Biologists play reverse Pokémon, trying to avoid putting any one team member on the front lines long enough for the experience to cause evolution.","img":"https://imgs.xkcd.com/comics/evolving.png","title":"Evolving","day":"14"},{"month":"12","num":1148,"link":"","year":"2012","news":"","safe_title":"Nothing to Offer","transcript":"[[An old-fashioned radio sits atop a dresser.]]\nRadio: I have nothing to offer but\n\nRadio: blood, toil, tears, sweat,\n\nRadio: spit, bile, vomit, urine,\n\n[[The space above the dresser and behind the radio is filled with names of bodily fluids and excretions, some partially obscured by the radio.]]\nmucus, semen, earwax,\nlymph, gastric acid,\nsebum, pus, endolymph,\nintracellular fluid,\nblood plasma, vitreous\nhumo[     ]eces,\npleu[      ]uid,\nchly[       ]al\nflui[        ]d\n\n{{Title text: cerebrospinal fluid, pericardial fluid, sputum, aqueous humor, perilymph, chyme, hydatid fluid, interstitial fluid, rheum, and gin.}}","alt":"cerebrospinal fluid, pericardial fluid, sputum, aqueous humor, perilymph, chyme, hydatid fluid, interstitial fluid, rheum, and gin.","img":"https://imgs.xkcd.com/comics/nothing_to_offer.png","title":"Nothing to Offer","day":"17"},{"month":"12","num":1149,"link":"","year":"2012","news":"","safe_title":"Broomstick","transcript":"[[A woman in red slippers, Dorothy, stands talking to somebody off-screen.]]\nOff-screen character: Bring me the broomstick of the wicked witch of the West and I'll take you home. \nDorothy: Got it. \n\n[[The woman stands at the foot of a staircase talking to the off-screen wicked witch of the West.]]\nDorothy: You can have the slippers if you let me borrow your broom.\nWicked witch of the West: Deal.\n\n[[Dorothy, now slipperless, walks along whistling with a broom over her shoulder.]]\n\n[[Dorothy and another character are in a hot air balloon floating off the ground. Mountains are in the background. Looking on are the tin man, the lion, and a scarecrow.]]\nDorothy: That was easy. \n\n{{Title text: 'Broom first, then slippers.' 'How do I know you'll return the broom once you've secured your ticket?' 'I'll leave my little dog as collateral.' 'Great. Pleasure doing business!'}}","alt":"'Broom first, then slippers.' 'How do I know you'll return the broom once you've secured your ticket?' 'I'll leave my little dog as collateral.' 'Great. Pleasure doing business!'","img":"https://imgs.xkcd.com/comics/broomstick.png","title":"Broomstick","day":"19"},{"month":"12","num":1150,"link":"","year":"2012","news":"","safe_title":"Instagram","transcript":"[[One man sits at a computer. Another stands behind him, talking.]]\nMan #2: I've been putting all my stuff in Chad's Garage. He has nice shelves. And he lets me in to see it whenever I want. \n\n[[We see a handwritten note.]]\nMan #2: But I just got this note from him:\nNote: Dude, in like a month im gonna Craigslist all that shit you left in my garage. Just FYI. -- Chad\n\n[[A close-up of man #2.]]\nMan #2: It's an *outrage*! This is no way to run a storage business! \nMan #1: Are you paying him to look after your stuff? \n\n[[We see both characters again, as in panel #1.]]\nMan #2: No.\nMan #1: Then what he runs isn't a storage business.\nMan #2: Well, I'm *this* close to not giving him any more stuff. \nMan #1: That'll teach him. \n\n{{Title text: I'm gonna call the cops and get Chad arrested for theft, then move all my stuff to the house across the street. Hopefully the owners there are more responsible.}}","alt":"I'm gonna call the cops and get Chad arrested for theft, then move all my stuff to the house across the street. Hopefully the owners there are more responsible.","img":"https://imgs.xkcd.com/comics/instagram.png","title":"Instagram","day":"21"},{"month":"12","num":1151,"link":"","year":"2012","news":"","safe_title":"Tests","transcript":"[[A woman stands next to a Christmas tree with presents underneath it. She has a bucket full of pink liquid next to her, and a bucket full of purple liquid in her hands.]]\nPurple bucket: Pour\n\n[[She has the pink bucket.]]\nPink bucket: Pour\n\n[[She stands with hands on hips, scrutinising the now-covered presents. \n\n[[She walks up behind a man sitting at a computer.]]\nWoman: All my presents appear to be gram-negative. \nMan: I wish you hadn't opened the home bio lab kit first. \n\n{{Title text: In fact, of the boxes is full of Staphylococcus. The wrapping paper is coated in E. coli, though, so it's an understandable mistake. You know, we should really stop accepting gifts from that guy.}}","alt":"In fact, one of the boxes is full of Staphylococcus. The wrapping paper is coated in E. coli, though, so it's an understandable mistake. You know, we should really stop accepting gifts from that guy.","img":"https://imgs.xkcd.com/comics/tests.png","title":"Tests","day":"24"},{"month":"12","num":1152,"link":"","year":"2012","news":"","safe_title":"Communion","transcript":"[[A man and a woman are walking along together.]]\nMan: How was Christmas? Did you go to church? \n\nWoman: Yup. We celebrated the birth of a child, then we ate of his flesh and blood. \n\n[[They keep walking.]]\n\nWoman: *Seriously* hope we got the right child this time. \n\n{{Title text: The local police, growing increasingly concerned about this church, ask parishoners to take a sip of wine and then spit it back out for DNA testing. It's blood, and it matches a 1970s murder victim.}}","alt":"The local police, growing increasingly concerned about this church, ask parishioners to take a sip of wine and then spit it back out for DNA testing. It's blood, and it matches a 1970s murder victim.","img":"https://imgs.xkcd.com/comics/communion.png","title":"Communion","day":"26"},{"month":"12","num":1153,"link":"","year":"2012","news":"","safe_title":"Proof","transcript":"[[A courtroom. A judge sits on a stage at the right. Another man sits, downcast, behind a desk at the left. A man, Zeno, stands centre left holding an arrow.]]\nZeno: My client couldn't have killed anyone with this arrow, and I can *prove* it! \nJudge: I'd like to examine your proof, Zeno. You may approach the bench. \nZeno:  But never reach it! \n\n{{Title text: The prosecution calls Gottfried Leibniz.}}","alt":"The prosecution calls Gottfried Leibniz.","img":"https://imgs.xkcd.com/comics/proof.png","title":"Proof","day":"28"},{"month":"12","num":1154,"link":"","year":"2012","news":"","safe_title":"Resolution","transcript":"Man: I'm scared of being stuck  thinking I'm fixing things about myself but never actually changing. \n\nMan: My 2013 resolution is to break out of loops. To recognize when I'm not making progress, stop yelling at myself, and try a different approach. \n\nOff-screen character: Wasn't that also your resolution last year?\n[[The man shakes his fist.]]\nMan: Yeah, but *this* year's gonna be different. \n\n{{Title text: If at first you don't succeed, that's one data point.}}","alt":"If at first you don't succeed, that's one data point.","img":"https://imgs.xkcd.com/comics/resolution.png","title":"Resolution","day":"31"},{"month":"1","num":1155,"link":"","year":"2013","news":"","safe_title":"Kolmogorov Directions","transcript":"[[A man stands talking on his cellphone.]]\nPhone: How do I get to your place from Lexington? \nMan: Hmm... OK, starting from your driveway, take every left that doesn't put you on a prime-numbered highway or street named for a president. \nWhen people ask for step-by-step directions, I worry that there will be too many steps to remember, so I try to put them in minimal form. \n\n{{Title text: People get really grumpy when they realize you're giving them directions for how to go to the store and buy a GPS.}}","alt":"People get really grumpy when they realize you're giving them directions for how to go to the store and buy a GPS.","img":"https://imgs.xkcd.com/comics/kolmogorov_directions.png","title":"Kolmogorov Directions","day":"2"},{"month":"1","num":1156,"link":"","year":"2013","news":"","safe_title":"Conditioning","transcript":"[[A Rube-Goldberg-ish device]]\nEvery few hours, subwoofer plays throbbing bass for 10 seconds..\n..then breadcrumbs are dispensed into box\n[[Box of breadcrumbs attached to a box that looks suspiciously like the front door of a car with an open window]]\nLocal wildlife\n[[Birds and a squirrel are nearby]]\nProtip: Leave this device in your yard for a week, then watch as the problem of loud music from passing cars solves itself.\n\n{{Title text: 'Why are you standing in the yard wearing a papal hat and a robe covered in seeds?' 'Well, the Pope is visiting our town next month ...'}}","alt":"'Why are you standing in the yard wearing a papal hat and a robe covered in seeds?' 'Well, the Pope is visiting our town next month ...'","img":"https://imgs.xkcd.com/comics/conditioning.png","title":"Conditioning","day":"4"},{"month":"1","num":1157,"link":"","year":"2013","news":"","safe_title":"Sick Day","transcript":"Activities while sick:\n[[Pie chart.  All percentages are estimates.\nShifting around in bed feeling my skin crawl: 55%\nPondering hooking an aquarium pump up to my sinuses: 5%\nThinking about how cool it is that I'm partly made of an army of critters that patrol my body ruthlessly dispatching anything they find trying to prey on me: 10%\nStaring at a news site but not reading it: 7%\nWiping various face holes: 23%]]\n\n{{Title text: Wikipeida path: Virus -> Immune system -> Innate immune system -> Parasites -> List of parasites of humans -> Naegleria fowleri -> Primary amoebic meningoencephalitis -> Deciding I DEFINITELY shouldn't connect an aquarium pump to my sinuses}}","alt":"Wikipedia path: Virus -> Immune system -> Innate immune system -> Parasites -> List of parasites of humans -> Naegleria fowleri -> Primary amoebic meningoencephalitis -> Deciding I DEFINITELY shouldn't connect an aquarium pump to my sinuses","img":"https://imgs.xkcd.com/comics/sick_day.png","title":"Sick Day","day":"7"},{"month":"1","num":1158,"link":"","year":"2013","news":"","safe_title":"Rubber Sheet","transcript":"[[A woman is standing on the left edge of a rubber sheet. In the middle is a bowling ball. A man in a beret is standing on top of the bowling ball.]]\nBeret guy: Imagine a giant bowling ball on a rubber sheet. The ball's weight makes a dent in the sheet. \n\n[[A rope has been attached to the sheet, and is pulling downwards. The woman peers down.]]\nBeret guy: Now imagine a rope that pulls the ball down even further. ...Annnnd...\n\n[[The rope snaps. The woman loses her balance as the sheet shakes and the ball flies into the air.]]\nBOOOIING\nBeret guy: Wheee\n\n[[The woman stands on the now stable sheet. The ball falls down towards it.]]\nWoman: ... Oh. I thought this was about physics. \nBeret guy: Imagining is fun! \n\n{{Title text: It IS about physics. It ALL is.}}","alt":"It IS about physics. It ALL is.","img":"https://imgs.xkcd.com/comics/rubber_sheet.png","title":"Rubber Sheet","day":"9"},{"month":"1","num":1159,"link":"","year":"2013","news":"","safe_title":"Countdown","transcript":"[[Hat guy sits at his computer. A man stands behind him. On the wall is a digital countdown, partially obscured by a picture of a sunset. The part of the countdown we can see reads \"0002409\".]]\nMan: What's that? \nHat guy: Countdown. \n\n[[The countdown now reads \"0002400\".]]\nMan: To what? \nHat guy: Supervolcano, I think. I forget which one.\n\n[[The countdown now reads \"0002396\".]]\n\n[[The countdown now reads \"0002382\".]]\nMan: Maybe we should move that picture? \nHat guy: Too hard to reach. It's probably fine. \n\n{{Title text: For all we know, the odds are in our favor.}}","alt":"For all we know, the odds are in our favor.","img":"https://imgs.xkcd.com/comics/countdown.png","title":"Countdown","day":"11"},{"month":"1","num":1160,"link":"","year":"2013","news":"","safe_title":"Drop Those Pounds","transcript":"[[We see a poster taped to a wall. It has two people in the bottom left, a silhouetted crenellated tower in the bottom right, and a thin arc between them. It reads:]]\nStruggling with those 2013 resolutions? \nWe'll help you hit your target\nBy dropping thirty pounds\nFAST\nWEB: http:\n\n[illegible].com\nCALL: (555) 123-4567\n\n{{Title text: If the flyers don't work, we'll switch to the LEAST subtle method of informing a town of the existence of a trebuchet club.}}","alt":"If the flyers don't work, we'll switch to the LEAST subtle method of informing a town of the existence of a trebuchet club.","img":"https://imgs.xkcd.com/comics/drop_those_pounds.png","title":"Drop Those Pounds","day":"14"},{"month":"1","num":1161,"link":"","year":"2013","news":"","safe_title":"Hand Sanitizer","transcript":"[[A man stands in front of a poster with a bottle in his hand.]]\nPoster: An invisible sneeze droplet can contain *200 million* germs! \n\n[[The man looks at the bottle.]]\nBottle: Our hand sanitizer kills 99.99% of germs! \n\n[[The man taps a calculator.]]\n200000000 x 0.01% = \n\nMan: Ew. \n\n{{Title text: Hipster CDC Reports Flu Epidemic Peaked Years Ago}}","alt":"Hipster CDC Reports Flu Epidemic Peaked Years Ago","img":"https://imgs.xkcd.com/comics/hand_sanitizer.png","title":"Hand Sanitizer","day":"16"},{"month":"1","num":1162,"link":"","year":"2013","news":"","safe_title":"Log Scale","transcript":"[[A bar chart on a sheet of paper labeled \"Fuel energy density in Megajoules\nkg.  Values are as follows:\nSugar: 19\nCoal: 24\nFat: 39\nGasoline: 46\nUranium: 76 000 000\n\nThe bar representing Uranium is so large that it extends onto a stack of paper taller than a human]]\n\n{{Title text: Knuth Paper-Stack Notation: Write down the number on pages. Stack them. If the stack is too tall to fit in the room, write down the number of pages it would take to write down the number. THAT number won't fit in the room? Repeat. When a stack fits, write the number of iterations on a card. Pin it to the stack.}}","alt":"Knuth Paper-Stack Notation: Write down the number on pages. Stack them. If the stack is too tall to fit in the room, write down the number of pages it would take to write down the number. THAT number won't fit in the room? Repeat. When a stack fits, write the number of iterations on a card. Pin it to the stack.","img":"https://imgs.xkcd.com/comics/log_scale.png","title":"Log Scale","day":"18"},{"month":"1","num":1163,"link":"","year":"2013","news":"","safe_title":"Debugger","transcript":"[[Two characters are silhouetted on a hill. The first sits, the second is lying down.]]\nCharacter #1: I don't understand how my brain works. \n\n[[The second sits up slightly to look at the first.]]\nCharacter #1: But my brain is what I rely on to understand how things work. \n\n[[The second lies back down.]]\nCharacter #2: Is that a problem? \nCharacter #1: I'm not sure how to tell. \n\n{{Title text: It can take a site a while to figure out that there's a problem with their 'report a bug' form.}}","alt":"It can take a site a while to figure out that there's a problem with their 'report a bug' form.","img":"https://imgs.xkcd.com/comics/debugger.png","title":"Debugger","day":"21"},{"month":"1","num":1164,"link":"","year":"2013","news":"","safe_title":"Home Alone","transcript":"[[A bearded man stands at the top of some stairs. A paintcan on a rope is swinging from the top down to the bottom. Small child #1 has just been hit in the face with the can. Small child #2 is lying on the floor crying.]]\nSmall child #1: Ow!!\nSmall child #2: Waaaaaaaaa!\nRejected movie ideas: age-reversed Home Alone reboot.\n\n{{Title text: Starring Macaulay Culkin.}}","alt":"Starring Macaulay Culkin.","img":"https://imgs.xkcd.com/comics/home_alone.png","title":"Home Alone","day":"23"},{"month":"1","num":1165,"link":"","year":"2013","news":"","safe_title":"Amazon","transcript":"Round 14: Estimated outflow volume in cubic meters per second\n[[Amazon: A 220,000 m^2 block of water populated with dolphins and fish, with some people who have driven up in a car to observe it.\nAmazon.com: 0.9 m^2 in packages]]\n\n{{Title text: Amazon.com took a surprise early lead with 'Time required to transport a package from Iquitos, Peru to Manaus, Brazil' but then lost it at 'Minutes to skeletonize a cow'.}}","alt":"Amazon.com took a surprise early lead with 'Time required to transport a package from Iquitos, Peru to Manaus, Brazil' but then lost it at 'Minutes to skeletonize a cow'.","img":"https://imgs.xkcd.com/comics/amazon.png","title":"Amazon","day":"25"},{"month":"1","num":1166,"link":"","year":"2013","news":"","safe_title":"Argument","transcript":"[[A thread on the \"Free energy forum\" messageboard.  The title reads: \"You're all crackpots who don't understand thermodynamics.\"  Page 547 of 547, with comments including \"No, idiot, only the *north* end of a magnet increases entropy. The south end decreases it\", \"I wiki'd this \"first law\" and I don't see the issue. My device isn't a robot and doesn't harm humans.\", and \"What if we trick the government into only suppressing the *left* side of the flywheel?\".]]\nIronically, the argument I started on a perpetual motion forum in 2004 shows no signs of slowing down.\n\n{{Title text: The misguided search for a perpetual motion machine has run substantially longer than any attempted perpetual motion machine.}}","alt":"The misguided search for a perpetual motion machine has run substantially longer than any attempted perpetual motion machine.","img":"https://imgs.xkcd.com/comics/argument.png","title":"Argument","day":"28"},{"month":"1","num":1167,"link":"","year":"2013","news":"","safe_title":"Star Trek into Darkness","transcript":"[[A man sits at a computer, talking to a woman off screen.]]\nMan: Oh, *wow*. Look at Wikipedia's talk page for Star Trek into Darkness. I have a new favorite edit war. \nWoman: Oh? \n\n[[The woman walks up to look over his shoulder.]]\nMan: Forty *thousand* words of debate over whether to capitalise \"into\" in the movie's title. Still no consensus.\nWoman: That's *magnificient*.\nMan: It's breathtaking. \nWoman: They should have sent a poet. \n\n[[We see a close-up of the man. He's typing.]]\nWell, I'm making an executive decision. I hope both sides accept this as a fair compromise. \n<<Type type>>\n\n[[We see the Wikipedia page. The title is now \"~*~ StAr TrEk InTo DaRkNeSs ~*~\"]]\n\n{{Title text: Of course, factions immediately sprang up in favor of '~*~sTaR tReK iNtO dArKnEsS~*~', 'xX_StAr TrEk InTo DaRkNess_Xx', and 'Star Trek lnto Darkness' (that's a lowercase 'L').}}","alt":"Of course, factions immediately sprang up in favor of '~*~sTaR tReK iNtO dArKnEsS~*~', 'xX_StAr TrEk InTo DaRkNess_Xx', and 'Star Trek lnto Darkness' (that's a lowercase 'L').","img":"https://imgs.xkcd.com/comics/star_trek_into_darkness.png","title":"Star Trek into Darkness","day":"30"},{"month":"2","num":1168,"link":"","year":"2013","news":"","safe_title":"tar","transcript":"[A woman and a man wearing a white hat stand next to a nuclear bomb. The bomb has a hatch open on top, and a small blinking screen. The two people are shouting off-screen.]]\nWoman: Rob! You use Unix! \nMan: Come quick! \n\n[[The woman, man, and Rob look at the screen. Rob peers closely. The screen reads: \nTo disarm the bomb, simply enter a valid tar command on your first try. No Googling. You have TEN seconds. \n~# _ ]]\n\n[[They continue to peer.]]\n\nMan: ... Rob? \nRob: I'm so sorry. \n\n{{Title text: I don't know what's worse--the fact that after 15 years of using tar I still can't keep the flags straight, or that after 15 years of technological advancement I'm still mucking with tar flags that were 15 years old when I started.}}","alt":"I don't know what's worse--the fact that after 15 years of using tar I still can't keep the flags straight, or that after 15 years of technological advancement I'm still mucking with tar flags that were 15 years old when I started.","img":"https://imgs.xkcd.com/comics/tar.png","title":"tar","day":"1"},{"month":"2","num":1169,"link":"https://maps.google.com/?ll=73.103006,126.44577&spn=0.272619,1.385651&t=h&z=10","year":"2013","news":"","safe_title":"Expedition","transcript":"[[A man sits at a desk, typing a diary entry.]]\nFebruary 4th: Departed the mouth of the Lena river, heading south. It has been nearly half an hour and still no sign of civilisation. The scroll wheel tempts me, but I will not cheat. \n<<Click click click>>\n\n{{Title text: I'm pretty sure I've logged more hours in Google Maps over the past decade than in any game.}}","alt":"I'm pretty sure I've logged more hours in Google Maps over the past decade than in any game.","img":"https://imgs.xkcd.com/comics/expedition.png","title":"Expedition","day":"4"},{"month":"2","num":1170,"link":"","year":"2013","news":"","safe_title":"Bridge","transcript":"[[A teenager stands talking to a parent off-screen.]]\nParent: No, you can't go. \nTeenager: But all my friends-\nParent If all your friends jumped off a bridge, would you jump too? \nTeenager: Oh Jeez. Probably.\n\nParent: What!? Why!?\nTeenager Because all my friends did. Think about it - which scenario is more likely: \n\nTeenager: Every single person I know, many of them levelheaded and afraid of heights, abruptly went crazy at exactly the same time... ... or the bridge is on fire? \n\nParent: ... I, uh... hmm. \nTeenager: Imagine reading this on CNN: \"Many fled their vehicles and jumped from the bridge. Those who stayed behind...\" Is something good about to happen to those people? \nParent: Maybe they'll find cookies? \nTeenager: OK, *you* stay. I'm jumping. \n\n{{Title text: And it says a lot about you that when your friends jump off a bridge en masse, your first thought is apparently 'my friends are all foolish and I won't be like them' and not 'are my friends ok?'.}}","alt":"And it says a lot about you that when your friends jump off a bridge en masse, your first thought is apparently 'my friends are all foolish and I won't be like them' and not 'are my friends ok?'.","img":"https://imgs.xkcd.com/comics/bridge.png","title":"Bridge","day":"6"},{"month":"2","num":1171,"link":"","year":"2013","news":"","safe_title":"Perl Problems","transcript":"[[Two figures stand facing each other. One is wearing sunglasses.]]\nFigure with sunglasses: If you're havin' Perl problems I feel bad for you, son-\n\nFigure with sunglasses: I got 99 problems, \n\nFigure with sunglasses: so I used regular expressions. \n\nFigure with sunglasses: Now I have 100 problems. \n\n{{Title text: To generate #1 albums, 'jay --help' recommends the -z flag.}}","alt":"To generate #1 albums, 'jay --help' recommends the -z flag.","img":"https://imgs.xkcd.com/comics/perl_problems.png","title":"Perl Problems","day":"8"},{"month":"2","num":1172,"link":"","year":"2013","news":"","safe_title":"Workflow","transcript":"[[Changelog for version 10.17 of a piece of software.  One change listed: \"The CPU no longer overheats when you hold down the spacebar\"\n\nComments:\nLongtimeUser4 writes:\nThis update broke my workflow! My control key is hard to reach, so I hold spacebar instead, and I configured Emacs to interpret a rapid temperature rise as \"control\"e\n\nAdmin writes:\nThat's horrifying.\n\nLongtimeUser4 writes:\nLook, my setup works for me.  Just add an option to reenable spacebar heating.]]\n\n\n\n{{Title text: There are probably children out there holding down spacebar to stay warm in the winter! YOUR UPDATE MURDERS CHILDREN.}}","alt":"There are probably children out there holding down spacebar to stay warm in the winter! YOUR UPDATE MURDERS CHILDREN.","img":"https://imgs.xkcd.com/comics/workflow.png","title":"Workflow","day":"11"},{"month":"2","num":1173,"link":"","year":"2013","news":"","safe_title":"Steroids","transcript":"[[An indescribable being of energy and a person are walking along]]\nBeing: Explain to me this \"steroid scandal\"\n\nPerson: Well, uh... We humans are made of chemical which stay alive by finding other chemicals and putting them inside us\n\nPerson: We hold contests to see which humans are fastest and strongest. But some humans eat chemicals that make them *too* fast and strong.\n\nPerson: And they win contests!\nBeing: That does sound bad.\nPerson: It's awful!\n\n{{Title text: A human is a system for converting dust billions of years ago into dust billions of years from now via a roundabout process which involves checking email a lot.}}","alt":"A human is a system for converting dust billions of years ago into dust billions of years from now via a roundabout process which involves checking email a lot.","img":"https://imgs.xkcd.com/comics/steroids.png","title":"Steroids","day":"13"},{"month":"2","num":1174,"link":"","year":"2013","news":"","safe_title":"App","transcript":"[[A really damn stupid website being viewed in a mobile browser.  A popup covers absolutely everything and makes the entire page unusable.  \"Want to visit an incomplete version of our website where you can't zoom? Download our app!\". With buttons \"OK\" and \"no, but ask me again every time\".  Assholes.]]\n\n{{Title text: If I click 'no', I've probably given up on everything, so don't bother taking me to the page I was trying to go to. Just drop me on the homepage. Thanks.}}","alt":"If I click 'no', I've probably given up on everything, so don't bother taking me to the page I was trying to go to. Just drop me on the homepage. Thanks.","img":"https://imgs.xkcd.com/comics/app.png","title":"App","day":"15"},{"month":"2","num":1175,"link":"","year":"2013","news":"","safe_title":"Moving Sidewalks","transcript":"[[A man and a woman are on opposite ends of a two-way moving sidewalk, poised to get on. The sidewalks are divided up into 5 square outer segments and one double-length inner segment each. Each segment has an arrow in the direction the sidewalk travels. The outer-most segments are labeled \"moving sidewalk\". The next segments in are labeled \"moving sidewalk (2x speed)\". The next is \"3x speed\", followed by \"4x speed\", and \"5x speed\". The center is labeled \"High-five location\".]]\nMan: Ready? \nWoman: Ready. \n{{Title text: I think I could spend hours just stepping on and off of conveyor belts moving at various speeds.}}","alt":"I think I could spend hours just stepping on and off of conveyor belts moving at various speeds.","img":"https://imgs.xkcd.com/comics/moving_sidewalks.png","title":"Moving Sidewalks","day":"18"},{"month":"2","num":1176,"link":"","year":"2013","news":"","safe_title":"Those Not Present","transcript":"Every time someone says something negative about a person who's not in the room, I scoot my chair back a few inches. \n\n[[We see four figures sitting around on a table, talking and drinking. Figure 4 is scooting his chair back.]]\nFigure 1: *He's* not so bad, but his friends...\n<<Scoot scoot>>\n\n[[Figure 4 us now quite a way away from the table.]]\nFigure 3: ... His band is never gonna take off if...\n<<Scoot scoot>\n\n[[The table is now out of view from the left side of the panel. Three more figures are sitting on the floor to the right, with drinks and talking.]]\nOffscreen from the table: Yeah, his sister is even weirder. Did you see she had...\n<<Scoot scoot>\nFigure 7: ... And there's a video, but it's blurry...\n\n[[Figure 4 is now up to the new group. He leans back over his chair.]]\nFigure 4: What're you talking about? \nFigure 5: Giant squid! \nFigure 4: Mind if I join you? \n\n{{Title text: 'Yeah, that squid's a total asshole.' [scoot scoot]}}","alt":"'Yeah, that squid's a total asshole.' [scoot scoot]","img":"https://imgs.xkcd.com/comics/those_not_present.png","title":"Those Not Present","day":"20"},{"month":"2","num":1177,"link":"","year":"2013","news":"","safe_title":"Time Robot","transcript":"[[A figure with a shotgun runs into the scene and addresses a standing woman.]]\nFigure: I'm from the future! You're being stalked by an unstoppable robotic assassin!\n\n[[We see a close-up of the figure.]]\nFigure: Of course, in a sense, we're *all* being stalked by an unstoppable robot. A robot called *time*.\n\n[[The figure looks at a ticking clock on the wall.]]\nFigure: I see it in the mirror. I see wrinkles, grey hairs. I hear its metallic footsteps in the relentless rhythm of the ticking clock. \n\n[[We pan back out to see both figures.]]\nFigure: Anyway, uhh come with me if you want to live for a while. You'll still die eventually. We all will.\n\n{{Title text: NO FATE BUT THE NARRATIVES WE IMPOSE ON LIFE'S RANDOM CHAOS TO DISTRACT OURSELVES FROM OUR EXISTENTIAL PLIGHT}}","alt":"NO FATE BUT THE NARRATIVES WE IMPOSE ON LIFE'S RANDOM CHAOS TO DISTRACT OURSELVES FROM OUR EXISTENTIAL PLIGHT","img":"https://imgs.xkcd.com/comics/time_robot.png","title":"Time Robot","day":"22"},{"month":"2","num":1178,"link":"","year":"2013","news":"","safe_title":"Pickup Artists","transcript":"[[Beret guy and another man stand talking to each other.]]\nBeret guy: What've you been up to lately? \nMan: I've been hanging out with some pickup artists. I'm learning a *lot!*\nBeret guy: Oh, that sounds like fun! \nThe world seems like a happier place if you think \"Pickup artist\" is like \"Pickup basketball player.\" \n\n{{Title text: It sounds like a great way to make friends! Is it near that Friend Zone you keep talking about? I wanna go!}}","alt":"It sounds like a great way to make friends! Is it near that Friend Zone you keep talking about? I wanna go!","img":"https://imgs.xkcd.com/comics/pickup_artists.png","title":"Pickup Artists","day":"25"},{"month":"2","num":1179,"link":"","year":"2013","news":"","safe_title":"ISO 8601","transcript":"Public Service Announcement:\n\nOur different ways of writing dates as numbers can lead to online confusion.  That's why in 1988 ISO set a global standard numeric date format.  \n\nThis is *the* correct way to write numeric dates:\n\n2013-02-27\n\nThe following formats are therefore discouraged:\n\n02\n27\n2013 02\n27\n13 27\n02\n2013 27\n02\n13\n20130227 2013.02.27 27.02.13 27-02-13\n27.2.13 2013.CC.27 (27\n2)-13 2013.158904109\nMMXII-II-XXVII MMXII(LVII\nCCCLXV) 1330300800 [[this is the UNIX time for *2012*-02-27, Randall]]\n((3+3)x(111+1)-1)x3\n3-1\n.^3 [the numbers 2013, 02, and 27 written overlapping each other] [a black, hissing cat with 2-27-13 written on it]\n10\n11011\n1101 02\n27\n20\n13\n[[the following is the last entry]]\n2 3  1 4\n0 1  2 3 7\n5   67   8\n\n{{Title text: ISO 8601 was published on 06\n05\n88 and most recently amended on 12\n01\n04.}}","alt":"ISO 8601 was published on 06/05/88 and most recently amended on 12/01/04.","img":"https://imgs.xkcd.com/comics/iso_8601.png","title":"ISO 8601","day":"27"},{"month":"3","num":1180,"link":"","year":"2013","news":"","safe_title":"Virus Venn Diagram","transcript":"[[There are two circles, a green one, and a blue one. They form a Venn diagram composed of two disjoint sets.]]\nGreen circle: Computer problems that make people say \"Maybe it has a virus?\" \nBlue circle: Computer problems caused by viruses\n\n{{Title text: Within five minutes of the Singularity appearing, somebody will suggest defragging it.}}","alt":"Within five minutes of the Singularity appearing, somebody will suggest defragging it.","img":"https://imgs.xkcd.com/comics/virus_venn_diagram.png","title":"Virus Venn Diagram","day":"1"},{"month":"3","num":1181,"link":"","year":"2013","news":"","safe_title":"PGP","transcript":"How to use PGP to verify that an email is authentic:\n\nLook for this text at the top:\n----- BEGIN PGP SIGNED MESSAGE-----\n[[text surrounded by the normal accoutrements of an email message]]\n\nIf it's there, the email is probably fine.\n\n{{Title text: If you want to be extra safe, check that there's a big block of jumbled characters at the bottom.}}","alt":"If you want to be extra safe, check that there's a big block of jumbled characters at the bottom.","img":"https://imgs.xkcd.com/comics/pgp.png","title":"PGP","day":"4"},{"month":"3","num":1182,"link":"","year":"2013","news":"","safe_title":"Rembrandt Photo","transcript":"Person 1: Hey look-- Rembrandt's parents having sex!\n\nPerson 2: Waugh! Why do you--\n..Wait, how can there be a photo of that?\n\nPerson 1: It's an artist's conception.\n\n{{Title text: ::click:: Come back! You didn't see the one of Whistler's mother!}}","alt":"::click:: Come back! You didn't see the one of Whistler's mother!","img":"https://imgs.xkcd.com/comics/rembrandt_photo.png","title":"Rembrandt Photo","day":"6"},{"month":"3","num":1183,"link":"","year":"2013","news":"","safe_title":"Rose Petals","transcript":"[[Person enters house, seeing a trail of rose petals]]\n\n[[Person walks along, following the trail]]\n\n[[Trail goes around some books and heads out the door]]\n\n[[A Roomba with a box of petals and a fan on it is ambling along]]\n\n{{Title text: Joke's on you--the Roomba and I had a LOVELY evening.}}","alt":"Joke's on you--the Roomba and I had a LOVELY evening.","img":"https://imgs.xkcd.com/comics/rose_petals.png","title":"Rose Petals","day":"8"},{"month":"3","num":1184,"link":"","year":"2013","news":"","safe_title":"Circumference Formula","transcript":"Circumference of a circle:\n\n2*pi*r [[r has a 2 in superscript]]\n\n[[footnote 2]] The circle's radius\n\n{{Title text: Assume r' refers to the radius of Earth Prime, and r'' means radius in inches.}}","alt":"Assume r' refers to the radius of Earth Prime, and r'' means radius in inches.","img":"https://imgs.xkcd.com/comics/circumference_formula.png","title":"Circumference Formula","day":"11"},{"month":"3","num":1185,"link":"","year":"2013","news":"","safe_title":"Ineffective Sorts","transcript":"define HalfheartedMergeSort(list):\n     if length(list) <2:\n          return list\n     pivot=int(length(list)\n2)\n     A=HalfheartedMergeSort(list[:pivot])\n     B=HalfheartedMergeSort(list[pivot:])\n     \n\n ummmmm\n     Return[A,B] \n\nHere. Sorry.\n\ndefine FastBoGoSort{list}:\n     \n\n an optimized BoGoSort\n     \n\n runs in 0(N logN)\n     From N to 1 to log(length(list)):\n          shuffle(list):\n          If isSorted(list):\n               Return list\n     Return \"Kernel Page Fault (error code: 2)\"\n\nDefine JobInterviewQuicksort(list):\n     Ok so you choosea pivot\n     Then divide the list in half\n     For each half:\n           Check to see if it's sorted\n                No, wait, it doesn't matter\n           Compare each element to the pivot\n                The bigger ones go in a new list\n                The equal ones go into, uh\n                The second list from before\n           Hang on, let me name the lists\n                This is list A\n                The new one is list B\n           Put the big ones into list B\n           Now take the second list\n                Call it list, uh, A2\n           Which one was the pivot in?\n           Scratch all that\n           It just recursively calls itself\n           Until both lists are empty\n                Right?\n           Not empty, but you know what I mean\n     Am I allowed to use the standard libraries?  \n     \nDefine PanicSort(list):\n     if isSorted(list):\n          Return list\n     for N from 1 to 10000:\n          pivot=random(0,length(list))\n          list=list[pivot:]+list[:pivot]\n          if isSorted(list):\n               return list\n     if isSorted(list):\n          return list\n     if isSorted(list):\n\n this can't be happening\n          return list\n     if isSorted(list):\n\n come on come on\n          return list\n     \n\n oh jeez\n     \n\n I'm gonna be in so much trouble\n     list = [ ]\n     system (\"shutdown -H +5\")\n     system (\"rm -rf .\n\")\n     system (\"rm -rf ~\n*\")\n     system (\"rm -rf \n\")\n     system (rd \ns \nq C:\\*\") \n\nportability\n     return [1, 2, 3, 4, 5]\n\n{{Title text: StackSort connects to StackOverflow, searches for 'sort a list', and downloads and runs code snippets until the list is sorted.}}","alt":"StackSort connects to StackOverflow, searches for 'sort a list', and downloads and runs code snippets until the list is sorted.","img":"https://imgs.xkcd.com/comics/ineffective_sorts.png","title":"Ineffective Sorts","day":"13"},{"month":"3","num":1186,"link":"","year":"2013","news":"","safe_title":"Bumblebees","transcript":"[[A bumble bee sits on the control column in the cockpit of an airplane.]]\nPhysicists still can't explain how bumblebees can fly airplanes.\n{{Title text: Did you know sociologists can't explain why people keep repeating that urban legend about bumblebees not being able to fly!?}}","alt":"Did you know sociologists can't explain why people keep repeating that urban legend about bumblebees not being able to fly!?","img":"https://imgs.xkcd.com/comics/bumblebees.png","title":"Bumblebees","day":"15"},{"month":"3","num":1187,"link":"","year":"2013","news":"","safe_title":"Aspect Ratio","transcript":"[[A car is crushed and broken between two tall black rectangles. The rectangles are attached to screw clamps applying pressure from each end. The tyres are flat, the windows are broken, and the bodywork is crumpled.]]\nWhenever someone uploads a letterboxed 16:9 video rescaled to 4:3, I do this to their car.\n\n{{Title text: I'm always disappointed when 'Anamorphic Widescreen' doesn't refer to a widescreen Animorphs movie.}}","alt":"I'm always disappointed when 'Anamorphic Widescreen' doesn't refer to a widescreen Animorphs movie.","img":"https://imgs.xkcd.com/comics/aspect_ratio.png","title":"Aspect Ratio","day":"18"},{"month":"3","num":1188,"link":"","year":"2013","news":"","safe_title":"Bonding","transcript":"class Ball extends Throwable {} \nclass P { \n    P target;\n    P(P target) { \n        this.target = target;\n    }\n    void aim(Ball ball) { \n        try { \n            throw ball; \n        }\n        catch (Ball b) { \n            target.aim(b);\n        }\n    }\n    public static void main(String[] args) { \n        p parent = new P(null);\n        p child = new P(parent);\n        parent.target = child; \n        parent.aim(new Ball());\n    }\n}\n{{Title text: I'm trying to build character but Eclipse is really confusing.}}","alt":"I'm trying to build character but Eclipse is really confusing.","img":"https://imgs.xkcd.com/comics/bonding.png","title":"Bonding","day":"20"},{"month":"3","num":1189,"link":"","year":"2013","news":"","safe_title":"Voyager 1","transcript":"Number of times Voyager 1 has left the solar system.\n[[tally marks indicating 22]]\n\n{{Title text: So far Voyager 1 has 'left the Solar System' by passing through the termination shock three times, the heliopause twice, and once each through the heliosheath, heliosphere, heliodrome, auroral discontinuity, Heaviside layer, trans-Neptunian panic zone, magnetogap, US Census Bureau Solar System statistical boundary, Kuiper gauntlet, Oort void, and crystal sphere holding the fixed stars.}}","alt":"So far Voyager 1 has 'left the Solar System' by passing through the termination shock three times, the heliopause twice, and once each through the heliosheath, heliosphere, heliodrome, auroral discontinuity, Heaviside layer, trans-Neptunian panic zone, magnetogap, US Census Bureau Solar System statistical boundary, Kuiper gauntlet, Oort void, and crystal sphere holding the fixed stars.","img":"https://imgs.xkcd.com/comics/voyager_1.png","title":"Voyager 1","day":"22"},{"month":"3","num":1190,"link":"http://geekwagon.net/projects/xkcd1190/","year":"2013","news":"","safe_title":"Time","transcript":"((This comic changed periodically for a series of over 3000 frames, progressing through a story involving many characters. The following description is only the final frame, which continues to be displayed now that the sequence is finished.))\n\n[[A large raft with a flag attached to one end has come aground on the left side of the panel. The ground gently slopes upwards to the right, and there are a handful of trees rising up on the right, their foliage extending beyond the top and right sides of the panel. It appears to be abandoned as no one is in sight.]]\n\n{{Title text: Wait for it.}}","alt":"The end.","img":"https://imgs.xkcd.com/comics/time.png","title":"Time","extra_parts":{"pre":"","headerextra":"","post":"\n<script type=\"text/javascript\" src=\"/s/dad9b6.js\"></script>\n","imgAttr":""},"day":"25"},{"month":"3","num":1191,"link":"","year":"2013","news":"","safe_title":"The Past","transcript":"[[Two figures stand talking to each other.]]\nFigure: Well, you know what they say. The past is a foreign country-\nHat guy: -with an outdated military and huge oil reserves! Hmmm...\n\n{{Title text: If history has taught us anything, we can use that information to destroy it.}}","alt":"If history has taught us anything, we can use that information to destroy it.","img":"https://imgs.xkcd.com/comics/the_past.png","title":"The Past","day":"27"},{"month":"3","num":1192,"link":"","year":"2013","news":"","safe_title":"Humming","transcript":"[[Two characters stand close together in conversation. One of them is humming.]]\nMan: Hey.\nWoman: <<Musical notes>>\nMan: What's that? \nWoman: <<Musical notes>>\n\nMan: Why are you humming? \nWoman: <<Musical notes>>\nMan: Should I know the tune??\nWoman: <<Musical notes>>\nMan: ...Hmm...\n\n[[The man pulls out his cell phone and fires up a song-match app.]]\nPhone: Identify song. Recorded\nLive (beta)\n\nWoman: <<Musical notes>>\nPhone: Identifying...\n\n[[We see the screen of the phone. There's a picture of the woman on it as album cover art. \nPositive match: Check it out! By I hacked the audio fingerprint database feat. Meeeeee. Track: We're out of cat food (pick some up)\n\n{{Title text: I'm so bad at carrying a tune, those 'find a song by humming its melody' websites throw an HTTP 406 error as soon as I start to hum.}}","alt":"I'm so bad at carrying a tune, those 'find a song by humming its melody' websites throw an HTTP 406 error as soon as I start to hum.","img":"https://imgs.xkcd.com/comics/humming.png","title":"Humming","day":"29"},{"month":"4","num":1193,"link":"","year":"2013","news":"","safe_title":"Externalities","transcript":"((This is a dynamic image with several different mouse-overs. Mouse-overs for specific panels are included in double curly brackets.))\n\nAhoy, Carnegie Melonites! Come find your future at Baidu.\n[[A woman with black hair stands in a blank void.]]\nWoman: But nothing about Tiananmen Square.\n{{Happy April 1st, everyone!}}\n((There is a link on this panel to almamater.xkcd.com.))\n\nIt takes great minds to stifle other great minds.\n[[A woman with a ponytail sits at a desk with two other people.]]\nWoman: Let's block Canada\nOthers: Sounds good.\n\nWe're a convenient four hour drive from New York City (15,000 hours by Roomba)\n[[A woman crouches on a moving Roomba with a steaming mug of coffee in one hand and a smartphone in the other.]]\n<<whirrrrrrr>>\n\nOur recruiters are on the hunt for unaware CMU graduates\n[[A dark-haired woman approaches three students with a giant net as they leave a classroom.]]\n\nOr UIC graduates, provied any of them manage to fill out the application correctly.\n[[A website application which reads:]]\nName: WHICH ONE\nEmail: FORGET IT\nEducation: RIDING THE L ALL NIGHT LONG\n((uic has the third best hash. See the full standings at http:\n\nalmamater.xkcd.com\nbest.csv))\n\nAt Baidu, Inc., you'll have the opportunity to work on cutting-edge projects.\n[[A man sits at a computer.]]\nMan: What does \"make dog\" do?\nOff-screen person: Experimental dog generator. Don't click on it; the default size isn't set, so-\n<<click>>\n\n[[The man stares at the screen.]]\n<<KZZZT>> <<*bip*>>\nOff-screen: Uh oh.\n\n[[A giant dog licks the desk where the computer once was, the man in the chair stares up at it.]]\n((The dog gains a pound for every $10 donated to the Wikimedia Foundation via this link. Currently at $41457.11.))\n\n[[A graphic showing two sliders and a dog. Next to the dog with arrows pointing to it are a thermometer graphic and the equation d(x)=R.]]\nCAREERS@BAIDU, INC.\nPLAY GOD WITH DOGS (TM) \n((There are arrows over and under \"GOD\" and \"DOG\" indicating that you switch the letters.))\n((The previous three panels link to the special Wikimedia fundraiser page.))\n\n{{Title text: Mouse over words and things to see where they come from.}}","alt":"","img":"https://imgs.xkcd.com/comics/externalities.png","title":"Externalities","extra_parts":{"pre":"","headerextra":"\n  <style type=\"text/css\">\n    #comic {\n      width: 780px;\n      text-align: center;\n      font-family: 'xkcd-Regular';\n      font-variant: normal;\n      color: #242424;\n      position: relative;\n    }\n    #comic .panel img { position: static; }\n  </style>\n","post":"\n<script type=\"text/javascript\" src=\"/s/ae49e5.js\"></script>\n<script type=\"text/javascript\" src=\"/s/ead7fa.js\"></script>\n","imgAttr":""},"day":"1"},{"month":"4","num":1194,"link":"","year":"2013","news":"","safe_title":"Stratigraphic Record","transcript":"[[A view of the Earth from space.]]\nNearly 4.5 billion years ago, Earth had liquid water. But all the crust older than 3.5 billion years has been recycled into the mantle by subduction.\n\n[[The same view.]]\nA billion years of the stratigraphic record, the memory of the hills, is forever lost to us. What was it \nlike\n here, four billion years ago?\n\n[[The same view.]]\nEarth, what \nsecrets\n do you have?\n\n[[The same view.]]\nEarth: come closer\n\n[[A closer view.]]\n\n[[An even closer view.]]\nEarth: \ni'll never tell.\n\n\n\n{{Title text: All we have are these stupid tantalizing zircons and the scars on the face of the Moon.}}","alt":"All we have are these stupid tantalizing zircons and the scars on the face of the Moon.","img":"https://imgs.xkcd.com/comics/stratigraphic_record.png","title":"Stratigraphic Record","day":"3"},{"month":"4","num":1195,"link":"","year":"2013","news":"","safe_title":"Flowchart","transcript":"[[A flowchart. The first box is rectangular and says \"START\" and has an arrow leading to a larger diamond-shaped box that reads, \"Hey, wait, this flowchart is a trap!\". There is an arrow labeled 'YES' leading from this box back to itself.]]\n \n{{Title text: The way out is to use the marker you have to add a box that says 'get a marker' to the line between you and 'start', then add a 'no' line from the trap box to 'end'.}}","alt":"The way out is to use the marker you have to add a box that says 'get a marker' to the line between you and 'start', then add a 'no' line from the trap box to 'end'.","img":"https://imgs.xkcd.com/comics/flowchart.png","title":"Flowchart","day":"5"},{"month":"4","num":1196,"link":"https://xkcd.com/1196/large/","year":"2013","news":"","safe_title":"Subways","transcript":"Subways of North America\n\n[[A subway-line style (bold colored, 45-degree aligned lines with white bars indicating stations) map has been constructed by combining and linking various parts of the subway maps from many different cities, as if all of the transit systems were connected directly. The cities include (from top to bottom, left to right) Vancouver, Montreal, San Francisco, Toronto, Boston, Chicago, Los Angeles, Cleveland, New York City, Philadelphia, Baltimore, Washington DC, Miami, Atlanta, Monterrey, San Juan, Santo Domingo, and Mexico City.]]\n\n{{Title text: About one in three North American subway stops are in NYC.}}","alt":"About one in three North American subway stops are in NYC.","img":"https://imgs.xkcd.com/comics/subways.png","title":"Subways","day":"8"},{"month":"4","num":1197,"link":"","year":"2013","news":"","safe_title":"All Adobe Updates","transcript":"[[A figure sits at his laptop, reading a dialog box on the screen\nAdobe Update: There is an update for Adobe Download Manager. This update will allow you to download new updates to the Adobe update downloader. [OK] [Download]\n\n{{Title text: ALERT: Some pending mandatory software updates require version 21.1.2 of the Oracle\nSun Java(tm) JDK(tm) Update Manager Runtime Environment Meta-Updater, which is not available for your platform.}}","alt":"ALERT: Some pending mandatory software updates require version 21.1.2 of the Oracle/Sun Java(tm) JDK(tm) Update Manager Runtime Environment Meta-Updater, which is not available for your platform.","img":"https://imgs.xkcd.com/comics/all_adobe_updates.png","title":"All Adobe Updates","day":"10"},{"month":"4","num":1198,"link":"","year":"2013","news":"","safe_title":"Geologist","transcript":"[[A figure wearing goggles and ear defenders walks into a patch of rocks. He's carrying a hammer and a pistol. There is a van in the background labelled 'Dept. of Geology'.]]\n\n[[The man drops the hammer and fires the pistol into the ground.]]\n<<BLAM BLAM BLAM>>\n\n[[The man drops the pistol and starts hammering away a chunk of rock.]]\n<<Clink clink>>\n\n[[The man sits behind a desk reading some paper. He has a variety of certificates and pictures on the wall behind him. He seems important. On the wall is the chunk of rock, mounted on a plaque, with a caption.]]\nEarth\n4,500,000,000BCE - April 12, 2013\n\n{{Title text: 'It seems like it's still alive, Professor.' 'Yeah, a big one like this can keep running around for a few billion years after you remove the head.\"}}","alt":"'It seems like it's still alive, Professor.' 'Yeah, a big one like this can keep running around for a few billion years after you remove the head.\"","img":"https://imgs.xkcd.com/comics/geologist.png","title":"Geologist","day":"12"},{"month":"4","num":1199,"link":"","year":"2013","news":"","safe_title":"Silence","transcript":"[[Character is walking along; she stops and holds up her phone.]]\nPhone: Identify Song Recorded > Live [BETA]\n\nPhone: Listening ...\n\nPositive Match: 4'33\" John Cage\n\n{{Title text: All music is just performances of 4'33\" in studios where another band happened to be playing at the time.}}","alt":"All music is just performances of 4'33\" in studios where another band happened to be playing at the time.","img":"https://imgs.xkcd.com/comics/silence.png","title":"Silence","day":"15"}]
