[{"month":"4","num":1200,"link":"","year":"2013","news":"","safe_title":"Authorization","transcript":"[[A web chart. In the center is a bubble labeled 'user account on my laptop', connecting from which are the bubbles 'Dropbox', 'photos & files', 'Facebook', 'Gmail', 'Paypal', and 'bank'. These bubbles are also all connected to each other. A seventh bubble is attached to the center bubble, labeled 'admin account'. It is covered in a thick border, spikes, and has a lock between it and the central bubble.]]\nIf someone steals my laptop while I'm logged in, they can read my email, take my money, and impersonate me to my friends, but at least they can't install drivers without my permission.\n\n{{Title text: Before you say anything, no, I know not to leave my computer sitting out logged in to all my accounts. I have it set up so after a few minutes of inactivity it automatically switches to my brother's.}}","alt":"Before you say anything, no, I know not to leave my computer sitting out logged in to all my accounts. I have it set up so after a few minutes of inactivity it automatically switches to my brother's.","img":"https://imgs.xkcd.com/comics/authorization.png","title":"Authorization","day":"17"},{"month":"4","num":1201,"link":"","year":"2013","news":"","safe_title":"Integration by Parts","transcript":"A guide to integration by parts: \nGiven a problem of the form:\nâ«f(x)g(x)dx = ? \nChoose variables u and v such that: \nu = f(x)\ndv = g(x)dx\nNow the original expression becomes:\nâ«udv = ? \nWhich \ndefinitely\n looks easier. \nAnyway, I gotta run. \nBut good luck!\n\n{{Title text: If you can manage to choose u and v such that u = v = x, then the answer is just (1\n2)x^2, which is easy to remember. Oh, and add a '+C' or you'll get yelled at.}}","alt":"If you can manage to choose u and v such that u = v = x, then the answer is just (1/2)x^2, which is easy to remember. Oh, and add a '+C' or you'll get yelled at.","img":"https://imgs.xkcd.com/comics/integration_by_parts.png","title":"Integration by Parts","day":"19"},{"month":"4","num":1202,"link":"","year":"2013","news":"","safe_title":"Girls and Boys","transcript":"[[A woman sits at a desk, writing. The desk is covered in books & a laptop.]]\nGirls go to college\nTo get more knowledge\n\n[[A man sits at a desk holding a piece of paper and leafing through a book.]]\nBoys go to college\nto get more knowledge\n\n[[Men and women are at work in a lab. A woman with a headset works a computer. Another has a model of a lunar lander. There are posters on the wall of planets and satellites]]\nGirls and boys\n\n[[A rocket blasts off.]]\nGo to Jupiter\n\n{{Title text: To get more knowledge}}","alt":"To get more knowledge","img":"https://imgs.xkcd.com/comics/girls_and_boys.png","title":"Girls and Boys","day":"22"},{"month":"4","num":1203,"link":"","year":"2013","news":"","safe_title":"Time Machines","transcript":"The Problem With Time Machines:\n[[Character stands holding the lever of a box labeled \"Time Machine,\" with a big on\noff lever switched to off.]]\n\n[[He flips it on.]]\n<<click>>\neeeeEEEEEEEE\n\nEEEEEEEEeeee\n<<click>>\n[[He flips it off.]]\n\n[[He stares at his own hands in confusion.]]\n???\n\n{{Title text: 'All time machine systems nominal ... T-minus ten ... eleven ...'}}","alt":"'All time machine systems nominal ... T-minus ten ... eleven ...'","img":"https://imgs.xkcd.com/comics/time_machines.png","title":"Time Machines","day":"24"},{"month":"4","num":1204,"link":"","year":"2013","news":"","safe_title":"Detail","transcript":"My Neighborhood's Resolution In:\n[[Graph of distance (on a log scale) against decades. Line labeled \"Earth\" is flat, at approximately the Planck length. Line labeled \"Google Earth\" climbs at approximately y=x, with three points marked showing an improvement in resolution past 1 meter between 2000 and 2020. The lines end before they cross somewhere after 2100, with the space marked ???.]]\n\n{{Title text: 2031: Google defends the swiveling roof-mounted scanning electron microscopes on its Street View cars, saying they 'don't reveal anything that couldn't be seen by any pedestrian scanning your house with an electron microscope.'}}","alt":"2031: Google defends the swiveling roof-mounted scanning electron microscopes on its Street View cars, saying they 'don't reveal anything that couldn't be seen by any pedestrian scanning your house with an electron microscope.'","img":"https://imgs.xkcd.com/comics/detail.png","title":"Detail","day":"26"},{"month":"4","num":1205,"link":"","year":"2013","news":"","safe_title":"Is It Worth the Time?","transcript":"How long can you work on making a routine task more efficient before you're spending more time than you save? (Across five years)\n\n[[A table, with the columns labeled \"how often you do the task\" and the rows labeled \"how much time you shave off\".\n\nThe column headings are, from left to right, \"50\nday\", \"5\nday\", \"daily\", \"weekly\", \"monthly\", and \"yearly\".\n\nThe row headings are, from top to bottom, \"1 second\", \"5 seconds\", \"30 seconds\", \"1 minute\", \"5 minutes\", \"30 minutes\", \"1 hour\", \"6 hours\", and \"1 day\".\n\nRow values (\"how long you can work\") are as follows (heading, then values):\n\n1 second: 1 day, 2 hours, 30 minutes, 4 minutes, 1 minute, 5 seconds.\n5 seconds: 5 days, 12 hours, 2 hours, 21 minutes, 5 minutes, 25 seconds.\n30 seconds: 4 weeks, 3 days, 12 hours, 2 hours, 30 minutes, 2 minutes.\n1 minute: 8 weeks, 6 days, 1 day, 4 hours, 1 hour, 5 minutes.\n5 minutes: 9 months, 4 weeks, 6 days, 21 hours, 5 hours, 25 minutes.\n30 minutes: n\na, 6 months, 5 weeks, 5 days, 1 day, 2 hours.\n1 hour: n\na, 10 months, 2 months, 10 days, 2 days, 5 hours.\n6 hours: n\na, n\na, n\na, 2 months, 2 weeks, 1 day.\n1 day: n\na, n\na, n\na, n\na, 8 weeks, 5 days.]]\n\n{{Title text: Don't forget the time you spend finding the chart to look up what you save. And the time spent reading this reminder about the time spent. And the time trying to figure out if either of those actually make sense. Remember, every second counts toward your life total, including these right now.}}","alt":"Don't forget the time you spend finding the chart to look up what you save. And the time spent reading this reminder about the time spent. And the time trying to figure out if either of those actually make sense. Remember, every second counts toward your life total, including these right now.","img":"https://imgs.xkcd.com/comics/is_it_worth_the_time.png","title":"Is It Worth the Time?","day":"29"},{"month":"5","num":1206,"link":"","year":"2013","news":"","safe_title":"Einstein","transcript":"[[Two people sit in a restaurant.]]\nExperimenter: I'm currently conducting an experiment which may prove Einstein wrong!\nFriend: Ooh, exciting!\n\n1947:\n[[Einstein is walking with someone.]]\nEinstein: It's IMPOSSIBLE to find a good sandwich in this town.\n\n{{Title text: Einstein was WRONG when he said that provisional patent #39561 represented a novel gravel-sorting technique and should be approved by the Patent Office.}}","alt":"Einstein was WRONG when he said that provisional patent #39561 represented a novel gravel-sorting technique and should be approved by the Patent Office.","img":"https://imgs.xkcd.com/comics/einstein.png","title":"Einstein","day":"1"},{"month":"5","num":1207,"link":"","year":"2013","news":"","safe_title":"AirAware","transcript":"[[Hat Guy is holding the remote for a drone which hovers nearby.]]\nGuy: What's that?\nHat Guy: It's a drone for my new business, AirAware.\n\nOur UAVs follow you and learn your schedule. If you miss a turn, forget an appointment, or give someone inaccurate information, they alert you.\nWoman, on the phone: I'll be there in five.\nDrone: WRONG!\nWoman: Augh!\n\nGuy: That sounds annoying. Who would pay for that?\nHat Guy: Huh? Nobody pays. I'm just making these and releasing them.\n\nGuy: That's not a business. You're just yelling at strangers from the sky.\nGuy: A business has to make money somehow.\nDrone: WRONG!\nGuy: Augh!!\n\n{{Title text: It ships with a version of Google Now that alerts you when it's too late to leave for your appointments.}}","alt":"It ships with a version of Google Now that alerts you when it's too late to leave for your appointments.","img":"https://imgs.xkcd.com/comics/airaware.png","title":"AirAware","day":"3"},{"month":"5","num":1208,"link":"","year":"2013","news":"","safe_title":"Footnote Labyrinths","transcript":"... experiments to observe this and we found no[1[2]] evidence for it in our data.\n\n1: Ignore this\n2: Increment by 2 before following\n3: Not true[3[2]]\n4: Ibid.\n5: True[2[6[3]]]\n6: Actually a 1[2[2]]\n\nMy Hobby: Footnote Labyrinths\n\n{{Title text: Every time you read this mouseover, toggle between interpreting nested footnotes as footnotes on footnotes and interpreting them as exponents (minus one, modulo 6, plus 1).}}","alt":"Every time you read this mouseover, toggle between interpreting nested footnotes as footnotes on footnotes and interpreting them as exponents (minus one, modulo 6, plus 1).","img":"https://imgs.xkcd.com/comics/footnote_labyrinths.png","title":"Footnote Labyrinths","day":"6"},{"month":"5","num":1209,"link":"","year":"2013","news":"","safe_title":"Encoding","transcript":"[[He and she are holding radios and looking up.]]\nHe: No, the combining diacritics go OVER the interrobang!\nShe: Oh jeez, I think he's lost control.\n\nThe skywriter we hired has terrible unicode support.\n\n{{Title text: I don't see how; the C0 block is right there at the beginning.}}","alt":"I don't see how; the C0 block is right there at the beginning.","img":"https://imgs.xkcd.com/comics/encoding.png","title":"Encoding","day":"8"},{"month":"5","num":1210,"link":"","year":"2013","news":"","safe_title":"I'm So Random","transcript":"[[Black Hat Man is working peacefully at his computer when an annoying little brat runs up behind him and goes..]]\nAnnoying Brat: MONKEY TACOS! I'm so random!\n\nBlack Hat Man: Me too!\n\n[[Black Hat Man spews an enormous torrent of random numbers, and the annoying brat is blasted away]]\n\n[[Black Hat Man returns to work in peace]]\n\n{{Title text: In retrospect, it's weird that as a kid I thought completely random outbursts made me seem interesting, given that from an information theory point of view, lexical white noise is just about the opposite of interesting by definition.}}","alt":"In retrospect, it's weird that as a kid I thought completely random outbursts made me seem interesting, given that from an information theory point of view, lexical white noise is just about the opposite of interesting by definition.","img":"https://imgs.xkcd.com/comics/im_so_random.png","title":"I'm So Random","day":"10"},{"month":"5","num":1211,"link":"","year":"2013","news":"","safe_title":"Birds and Dinosaurs","transcript":"By any reasonable definition, \nT. Rex\n is more closely related to sparrows than to \nStegosaurus\n. \n\n[[A cladistic tree showing a single origin point which branches on one to a second point which branches into  \"\nStegosaurus\n\" and \"\nTriceratops\n\", and on the other side branches into a second point which branches into \"\nT. Rex\n\" and \"sparrow\". Each label's vertical distance from the origin point  represents \"separation by time\", the Steogsaurus being closest, the Triceratops and T. Rex on the same level in the middle, and \"sparrow\" furthest. The distance of their label from their closest common relative represent \"phylogenetic distance\". Below this tree are sketches of a Stegosaurus, T. Rex, and sparrow skeleton. A box surrounds the T. Rex and sparrow skeletons, showing they are physically similar.]]\n\nBirds aren't \ndescended\n from dinosaurs, they \nare\n dinosaurs.\n\nWhich means the fastest animal alive today is a small carnivorous dinosaur, \nFalco peregrinus\n. \n[[A silhouette of a falcon flying toward a smaller prey bird.]]\nIt preys mainly on other dinosaurs, which it strikes and kills in midair with its claws.\n\nThis is a good world.\n\n{{Title text: Sure, T. rex is closer in height to Stegosaurus than a sparrow. But that doesn't tell you much; 'Dinosaur Comics' author Ryan North is closer in height to certain dinosaurs than to the average human.}}","alt":"Sure, T. rex is closer in height to Stegosaurus than a sparrow. But that doesn't tell you much; 'Dinosaur Comics' author Ryan North is closer in height to certain dinosaurs than to the average human.","img":"https://imgs.xkcd.com/comics/birds_and_dinosaurs.png","title":"Birds and Dinosaurs","day":"13"},{"month":"5","num":1212,"link":"https://xkcd.com/1212/large/","year":"2013","news":"","safe_title":"Interstellar Memes","transcript":"If other star systems are listening in on our pop culture,\ngiven the speed of light delay, these are the jokes and catchphrases they just learned about and are currently repeating way too much:\n[[A map of star systems in relation to the Sun, which is roughly in the center, sending out radio waves. Each star is a yellow circle of differing sizes, with a speech bubble (or two). \n\n((Listed in order, from closest to furthest.))\nProxima Centauri: \"I'm on a boat!\"\nAlpha Centauri A\nB: \"The cake is a lie!\" \"o\n~ Never gonna give you up o\n~\"\nLuhman 16: I can haz? \nBarnard's star: \"Leave Britney alone!\" \"o\n~ \nChocolate raaaiiin\n o\n~\"\nWolf 359: \"Chuck Norris doesn't sleep. He \nwaits\n.\"\nLalande 21185: \"o\n~ Numa numa o\n~\"\nSirius: \"I \nstill\n can't believe Bellatrix--\" \"Dude, get over it.\"\nGliese 65: \"\nINTERNETS!\n\"\nEpsilon Eridani: \"Ninjas fight \nall the time!\n\"\nProcyon: \"...God kills a kitten!\" \"A what?\"\nEpsilon Indi: \"You're the man now, dog!\"\nTau Ceti: \"All your base are belong to us.\"\nLuyten's Star: \"Peanut Butter Jelly Time!\"\nKapteyn's star: \"My spoon is too big!\"\nKruger 60: \"\nMORE COWBELL!\n\"\nGliese 1: \"Look at the tiny dancing Earth mammals!\"\nVan Maanen's star: \"WASSSUUP!?!\"\nAd Leonis: \"Oh my God, they killed Kenny!\" \"You bastards!\"\n70 Ophiuchi: \"Welcome to Good Burger, home of the Good Burger.\" \"What's a burger? \"I don't know.\"\nAltair: \"Mr. T ate my balls!\"\nSigma Draconis: \"Oh ... my ... gaawd.\" \nDelta Pavonis: \"I want the truth.\" \"\nYou can't handle the truth!\n\"\nGliese 892: \"Hasta la vista, baby.\" \nXi Boötis: Did \nI\n do that?\nHR 753: \"D'oh!\"\nBeta Hydri: \"Yippie-ki-yay, motherfucker.\"\nVega: \"Resistance is futile.\"\nZeta Tucanae: \"Let's get ready to ruuumble!\"\nHR 1614: \"Where's the beef?\"\nGroombridge 1830: \"I pity the fool!\"\nDelta Trianguli: \"May the Force be with you.\"\nBeta Virginis: \"Nobody expects the Spanish Inquisition!\"\nArcturus: \"You talkin' to \nme\n?\" \nBeta Trianguli Australis: \"I'm going to make him an offer he can't refuse.\"\nLamda Aurigae: \"You've got to ask yourself one question: 'Do I feel lucky?'\"\nCapella: \"And now for something completely different.\"\nHD 211415: \"Live long and prosper.\" \"Ok.\" \nAlderamin: \"\nEXTERMINATE!\n\"\n51 Pegasi: \"Name's bond. James Bond.\"\nCaph: \"Take me to your leader!\" \"No, Steve.\"\nKappa Reticuli: Here's lookin' at you, kid.\" \nAlpha Hydri: \"Rosebud.\"\nGienah: \"Ehh, what's up doc?\"\nAlpha Serpentis: \"Frankly, my dear, I don't give a damn.\"]]\n\n{{Title text: The strongest incentive we have to develop faster-than-light travel is that it would let us apologize in advance.}}","alt":"The strongest incentive we have to develop faster-than-light travel is that it would let us apologize in advance.","img":"https://imgs.xkcd.com/comics/interstellar_memes.png","title":"Interstellar Memes","day":"15"},{"month":"5","num":1213,"link":"","year":"2013","news":"","safe_title":"Combination Vision Test","transcript":"COMBINATION VISION TEST\n[[An Ishihara color blindness test (which typically consists of a circle comprised of dots of different colors, arranged such that someone with complete color vision can discern numbers) with numbers instead of colored dots. It is not easy to see, but the numbers show a large '42' in the center. The 4 and the 2 are made up of different numbers.]]\nIf you can see one big number but not the other, you have synesthesia \nand\n colorblindness.\n\n{{Title text: If you see two numbers but they're both the same and you have to squint to read them, you have synesthesia, colorblindness, diplopia, and myopia.}}","alt":"If you see two numbers but they're both the same and you have to squint to read them, you have synesthesia, colorblindness, diplopia, and myopia.","img":"https://imgs.xkcd.com/comics/combination_vision_test.png","title":"Combination Vision Test","day":"17"},{"month":"5","num":1214,"link":"","year":"2013","news":"","safe_title":"Geoguessr","transcript":"Person 1:  This one's easy; There's the Parthenon. Athens.\n<<click>>\nWhat!? Why the hell is there a Parthenon in *Nashville*?\n<<click>>\nOk, I'm *clearly* in Germany.\n<<click>>\nDammit, Germany Pavilion at Epcot.\n\nMy scores in Geoguessr would be higher if people would quit building replicas of everything.\n\n{{Title text: I'm not sure if you can get Epcot, but my friend just got LegoLand. He guessed California but it was the one in Denmark. Meanwhile, I'm rapidly becoming a connoisseur of unmarked dirt roads over flat, barren landscapes.}}","alt":"I'm not sure if you can get Epcot, but my friend just got LegoLand. He guessed California but it was the one in Denmark. Meanwhile, I'm rapidly becoming a connoisseur of unmarked dirt roads over flat, barren landscapes.","img":"https://imgs.xkcd.com/comics/geoguessr.png","title":"Geoguessr","day":"20"},{"month":"5","num":1215,"link":"","year":"2013","news":"","safe_title":"Insight","transcript":"Person 1: Maybe before we rush to adopt\n((inserted term)) <Google Glass>\nwe should stop to consider the consequences of blithely giving this technology such a central position in our lives.\n\nDon't have any insight about a new technology? Just use this sentence! It makes you sound wise and you can say it about virtually anything.\n\n{{Title text: The great thing is, the sentence is really just a reminder to the listener to worry about whatever aspects of the technology they're already feeling alarmist about, which in their mind gives you credit for addressing their biggest anxieties.}}","alt":"The great thing is, the sentence is really just a reminder to the listener to worry about whatever aspects of the technology they're already feeling alarmist about, which in their mind gives you credit for addressing their biggest anxieties.","img":"https://imgs.xkcd.com/comics/insight.png","title":"Insight","day":"22"},{"month":"5","num":1216,"link":"","year":"2013","news":"","safe_title":"Sticks and Stones","transcript":"Child: Did you hear what he said about me!?\nParent: Well, remember: sticks and stones may break my bones, but words--\n\nChild: Can make someone else feel happy or sad, which is literally the only thing that matters in this stupid world?\n\n[[Beat.]]\n\nChild: Right?\nParent: The world isn't *that* bad.\nChild: Explain the line about sticks and stones?\nParent: ... OK, maybe it's kind of horrific.\n\n{{Title text: Sticks and stones may break my bones, but words can make me think I deserved it.}}","alt":"Sticks and stones may break my bones, but words can make me think I deserved it.","img":"https://imgs.xkcd.com/comics/sticks_and_stones.png","title":"Sticks and Stones","day":"24"},{"month":"5","num":1217,"link":"","year":"2013","news":"","safe_title":"Cells","transcript":"When you see a claim that a common drug or vitamin \"kills cancer cells in a petri dish,\" keep in mind:\n[[A scientist stands on a chair next to a desk, pointing a gun at a petri dish. There is a microscope on the desk.]]\nSo does a handgun.\n\n{{Title text: Now, if it selectively kills cancer cells in a petri dish, you can be sure it's at least a great breakthrough for everyone suffering from petri dish cancer.}}","alt":"Now, if it selectively kills cancer cells in a petri dish, you can be sure it's at least a great breakthrough for everyone suffering from petri dish cancer.","img":"https://imgs.xkcd.com/comics/cells.png","title":"Cells","day":"27"},{"month":"5","num":1218,"link":"","year":"2013","news":"","safe_title":"Doors of Durin","transcript":"[[Three people stand facing what we can assume are the Doors of Durin (not pictured). One has a hat, one has hair, the other has neither.]]\nHair: I've got it! What's the Elvish word for friend?\nNeither: \nMellon.\n\n\n[[The three watch as the doors begin to open.]]\n<<RUMBLE>>\n\n[[The one in the white hat poses a question.]]\nHat: So what's the Elvish word for \"frenemy\"? \nNeither: ...\nmellogoth?\n\n<<SLAM!!>>\n\n{{Title text: If we get the doors open and plug up the dam on the Sirannon so the water rises a little, the pool will start draining into Moria. How do you think the Watcher would fare against a drenched Balrog?}}","alt":"If we get the doors open and plug up the dam on the Sirannon so the water rises a little, the pool will start draining into Moria. How do you think the Watcher would fare against a drenched Balrog?","img":"https://imgs.xkcd.com/comics/doors_of_durin.png","title":"Doors of Durin","day":"29"},{"month":"5","num":1219,"link":"","year":"2013","news":"","safe_title":"Reports","transcript":"How to make boring technical reports more fun to read: \nImagine they were written and sent in, unsolicited, by the estranged spouse of the head of the project.\n[[A person sits crouched in the middle of the floor of an empty room, typing on a laptop. There are books and papers scattered around him.]]\nLaptop: Six guard rails have erratic reflector placement, and one even lacks reflectors entirely, despite rule G31.02(b) clearly mandating consistent usage.\nPerson: ...\nSHARON!\n\n\n{{Title text: If that fails, just multiply every number by a thousand. 'The 2nd St speed limit should be set at 25,000 mph, which would likely have prevented 1,000 of the intersection's 3,000 serious accidents last month.'}}","alt":"If that fails, just multiply every number by a thousand. 'The 2nd St speed limit should be set at 25,000 mph, which would likely have prevented 1,000 of the intersection's 3,000 serious accidents last month.'","img":"https://imgs.xkcd.com/comics/reports.png","title":"Reports","day":"31"},{"month":"6","num":1220,"link":"","year":"2013","news":"","safe_title":"Hipsters","transcript":"((The layout is a chart with a series of plots reaching a stable equilibrium one after another, with the shape characteristic of a predator-prey model.  In order, the labels are))\nHow often I see...\nHipsters -->\nComplaints about hipsters -->\nComplaints about the constant use and discussion of the word \"hipster\" -->\nComplaints that every level of meta-opinion on hipsters represents the same tedious navel-gazing by insecure people -->\ngraphs making it all worse -->\nNow\n[[The horizontal axis is labeled time.  Where the final curve rises is marked 'now'.]]\n\n{{Title text: You may point out that this very retreat into ironic detachment while still clearly participating in the thing in question is the very definition of contemporary hipsterdom. But on the other hand, wait, you're in an empty room. Who are you talking to?}}","alt":"You may point out that this very retreat into ironic detachment while still clearly participating in the thing in question is the very definition of contemporary hipsterdom. But on the other hand, wait, you're in an empty room. Who are you talking to?","img":"https://imgs.xkcd.com/comics/hipsters.png","title":"Hipsters","day":"3"},{"month":"6","num":1221,"link":"","year":"2013","news":"","safe_title":"Nomenclature","transcript":"[[Mrs. Whatsit is talking to Abbott and Costello.]]\nMrs. Whatsit: You're both confused.\nMrs. Whatsit: He's just \"The Doctor\".\n\n{{Title text: [shouted, from the field] 'Aunt Beast hit a pop fly to second! Dive for it, Mrs Whatsit!'}}","alt":"[shouted, from the field] 'Aunt Beast hit a pop fly to second! Dive for it, Mrs Whatsit!'","img":"https://imgs.xkcd.com/comics/nomenclature.png","title":"Nomenclature","day":"5"},{"month":"6","num":1222,"link":"","year":"2013","news":"","safe_title":"Pastime","transcript":"[[Two characters are chatting.  One has hair.]]\nHair: What've you been up to?\n\nNot hair: Definitely not spending every day consumed with worry over stupid things I never talk to anyone about.\n\nHair: Oh, yeah, me neither.\nNot hair: That's good.\nHair: Yeah.\n\n[[The final panel is silent.]]\n\n{{Title text: Good thing we're too smart to spend all day being uselessly frustrated with ourselves. I mean, that'd be a hell of a waste, right?}}","alt":"Good thing we're too smart to spend all day being uselessly frustrated with ourselves. I mean, that'd be a hell of a waste, right?","img":"https://imgs.xkcd.com/comics/pastime.png","title":"Pastime","day":"7"},{"month":"6","num":1223,"link":"","year":"2013","news":"","safe_title":"Dwarf Fortress","transcript":"[[A figure sits at a desk with a computer, hands on the keyboard, talking to an unseen observer.]]\nFigure: If the corporate surveillance state monitors and controls every aspect of my life...\nBig Brother: We do.\nFigure: And I play Dwarf Fortress all day...\nBig Brother: You do. \nFigure: Then you're effectively Dwarf Fortress players watching your dwarves play Dwarf Fortress. \nBig Brother: ... Oh God. \nBig Brother realises he's trapped in the most tedious possible Hell.\n\n{{Title text: I may be the kind of person who wastes a year implementing a Turing-complete computer in Dwarf Fortress, but that makes you the kind of person who wastes ten more getting that computer to run Minecraft.}}","alt":"I may be the kind of person who wastes a year implementing a Turing-complete computer in Dwarf Fortress, but that makes you the kind of person who wastes ten more getting that computer to run Minecraft.","img":"https://imgs.xkcd.com/comics/dwarf_fortress.png","title":"Dwarf Fortress","day":"10"},{"month":"6","num":1224,"link":"","year":"2013","news":"","safe_title":"Council of 300","transcript":"[[A secret society meets in a darkened chamber; a kitschy video involving two people and an RC helicopter is projected onto the background]]\nMaster: ..then it is settled.  We the 300 members of the Secret Council decree that this video meets our standards and shall \"go viral\".\n\nMaster: send it to one of our agents to be leaked to the common folk.\nSteward: Some of them are noticing the number.\nMaster: ..add a plus sign to throw them off.\nSteward: very well.\n\nSoon...\n[[A communication sent to one of the many unsuspecting plebians of the world]]\nEmail: Ooh! check out this great video I found!\n\n[[zoom in on the viewer count of a Youtube video]]\n301+\n\n{{Title text: 'And hypnotize someone into thinking they've uploaded it and passed it around.' 'But then won't the uploader get suspicious that it pauses at 301+ for a while? Why don't we just forge the number entirel--' ::BLAM:: 'The Council of 299 is adjourned.'}}","alt":"'And hypnotize someone into thinking they've uploaded it and passed it around.' 'But then won't the uploader get suspicious that it pauses at 301+ for a while? Why don't we just forge the number entirel--' ::BLAM:: 'The Council of 299 is adjourned.'","img":"https://imgs.xkcd.com/comics/council_of_300.png","title":"Council of 300","day":"12"},{"month":"6","num":1225,"link":"","year":"2013","news":"","safe_title":"Ice Sheets","transcript":"Thickness of the ice sheets at various locations 21,000 years ago compared with modern skylines\n\n[[the skylines of four major metropolises are superimposed against an ice sheet of the proper thickness for the aforementioned time period]]\n\nToronto:2100m\nChicago:900m\nBoston:1250m\nMontreal:3300m\n\n{{Title text: Data adapted from 'The Laurentide and Innuitian ice sheets during the Last Glacial Maximum' by A.S. Dyke et. al., which was way better than the sequels 'The Laurentide and Innuitian ice sheets during the Last Glacial Maximum: The Meltdown' and 'The Laurentide and Innuitian ice sheets during the Last Glacial Maximum: Continental Drift'.}}","alt":"Data adapted from 'The Laurentide and Innuitian ice sheets during the Last Glacial Maximum' by A.S. Dyke et. al., which was way better than the sequels 'The Laurentide and Innuitian ice sheets during the Last Glacial Maximum: The Meltdown' and 'The Laurentide and Innuitian ice sheets during the Last Glacial Maximum: Continental Drift'.","img":"https://imgs.xkcd.com/comics/ice_sheets.png","title":"Ice Sheets","day":"14"},{"month":"6","num":1226,"link":"","year":"2013","news":"","safe_title":"Balloon Internet","transcript":"[[A figure sits on a hill reading a book.]]\n\n[[The figure remains engrossed in the book. A balloon begins to descend behind him.]]\n\n[[The figure continues reading. The balloon is getting lower.]]\n\n[[The balloon is now right behind the figure's ear.]]\nBalloon: Internet.\nFigure: Augh!\n[[The man throws the book in surprise.]]\n\n[[The balloon ascends rapidly, while the startled figure looks up.]]\n\n{{Title text: I run a business selling rural internet access. My infrastructure consists of a bunch of Verizon wifi hotspots that I sign up for and then cancel at the end of the 14-day return period.}}","alt":"I run a business selling rural internet access. My infrastructure consists of a bunch of Verizon wifi hotspots that I sign up for and then cancel at the end of the 14-day return period.","img":"https://imgs.xkcd.com/comics/balloon_internet.png","title":"Balloon Internet","day":"17"},{"month":"6","num":1227,"link":"","year":"2013","news":"","safe_title":"The Pace of Modern Life","transcript":"((This strip is in the form of a long series of quotes. Here, each quote is given as a separate panel. Attribution is delimited with a --. Some text is bolded; it is enclosed in asterisks.))\n*The art of letter-writing is fast dying out.* When a letter cost nine pence, it seemed but fair to try to make it worth nine pence... Now, however, we think we are too busy for such old-fashioned correspondence. *We fire off a multitude of rapid and short notes, instead of sitting down to have a good talk over a real sheet of paper.*\n-- The Sunday Magazine\n1871\n\nIt is, unfortunately, one of the chief characteristics of modern business to be always in a hurry. *In olden times it was different.*\n-- The Medical Record\n1884\n\nWith the advent of cheap newspapers and superior means of locomotion... the dreamy quiet old days are over... for *men now live think and work at express speed.* They have their \nMercury\n or \nPost\n laid on their breakfast table in the early morning, and if they are too hurried to snatch from it the news during that meal, they carry it off, to be *sulkily read as they travel... leaving them no time to talk with the friend who may share the compartment with them*... the hurry and bustle of modern life... lacks the quiet and repose of the period when our forefathers, the day's work done, took their ease...\n-- William Smith, Morley: Ancient and Modern\n1886\n\nConversation is said to be a lost art... good talk presupposes leisure, both for preparation and enjoyment. *The age of leisure is dead, and the art of conversation is dying.*\n-- Frank Leslie's Popular Monthly, volume 29\n1890\n\nIntellectual laziness and the hurry of the age have produced *a craving for literary nips*. The torpid brain... has grown too weak for sustained thought. \n*There never was an age in which so many people were able to write badly*. \n-- Israel Zangwill, The Bachelors' Club\n1891\n\n*The art of pure line engraving is dying out. We live at too fast a rate* to allow for the preparation of such plates as our fathers appreciated. If a picture catches the public fancy, the public must have an etched or a photogravured copy of it within a month or two of its appearance. The days when engravers were wont to spend two or three years over a single plate are for ever gone. \n-- Journal of the Institute of Jamaica, volume 1\n1892\n\nSo much is exhibited to the eye that *nothing is left to the imagination*. It seems almost possible that the modern world might be choked by its own riches, *and human faculty dwindle away amid the million inventions that ahve been introduced to render its exercise unnecessary*.\nThe articles in the quarterlies extend to thirty or more pages, but *thirty pages is now too much*. So we witness a further condensing process and, we have the \nfortnightly\n and the \ncontemporary\n which reduce thirty pages to *fifteen pages* so that you may read a larger number of articles in a shorter time and in a shorter form. As if this last condensing process were not enough the condensed articles of these periodicals are *further condensed* by the daily papers, which will give you *a summary of the summary* of that which has been written about everything. \n*Those who are dipping into so many subjects and gathering information in a summary and superficial form lose the habit of settling down to great works*. \nEphemeral literature is driving out the great classics of the present and the past... *hurried reading can never be good reading*. \n-- G. J. Goschen, First annual address to the students, Toynbee Hall, London\n1894\n\nThe existence of *mental and nervous degeneration among a growing class of people*, especially in large cities, is an obvious phenomenon... the mania for stimulants... diseases of the mind are almost as numerous as the diseases of the body... this intellectual condition is characterized by *a brain incapable of normal working... in a large measure due to the hurry and excitement of modern life*. with its facilities for rapid locomotion and almost instantaneous communication between remote points of the globe*...\n-- The Churchman, volume 71\n1895\n\nIf we *teach the children how to play* and encourage them in their sports... *instead of shutting them in badly ventilated schoolrooms*, the next generation will be more joyous and will be heailthier than the present one. \n-- Public Opinion: A Comprehensive Summary of the Press Throughout the World, volume 18\n1895\n\nThe cuase of the... increase in nervous disease is *increased demand made by the coditions of modern life upon the brain*. Everything is done in a hurry. *We talk across a continent, telegraph across an ocean*, take a trip to Chicago for an hour's talk... *We even take our pleasures sadly and make a task of our play*... What wonder if the pressure is almost more than our nerves can bear. \n-- G. Shrady (from P. C. Knapp) \"Are nervous diseases increasing?\" Medical Record\n1896\n\n*The managers of sensational newspapers*... do not try to educate their readers and make them better, but tend to *create perverted tastes and develop vicious tendencies*. The owners of these papers seem to have but one purpose, and that is to increase their circulation.\n-- Medical Brief, volume 26\n1898\n\n*To take sufficient time for our meals seems frequently impossible* on account of the demands on our time made by our business... we act on the apparent belief that all of our business is so pressing that we must jump on the quickest car home, eat our dinner in the most hurried way, make the closest connection for car returning... \n-- Louis John Rettger, Studies in Advanced Physiology\n1898\n\nIn these days of increasing rapid artificial locomotion, *may I be permitted to say a word in favour of a very worthy and valuable old friend of mine, Mr Long Walk?*\n*I am afraid that this good gentleman is in danger of getting neglected, if not forgotten*. We live in days of water trips and land trips, excursions by sea, road and rail- bicycles and tricycles, tram cars and motor cars... but in my humble opinion, good honest walking exercise for health beats all other kinds of locomotion into a cocked hat. \n-- T. Thatcher, \"A plea for a long walk\", The Publishers' Circular\n1902\n\nThe art of conversation is almost a lost one. *People talk as they ride bicycles - at a rush - without pausing to consider their surroundings*... What has been generally understood as cultured society is rapidly deteriorating into baseness and voluntary ignorance. *The profession of letters is so little understood*, and so far from being seriously appreciated, that... newspapers are full, not of thoughtful honestly expressed public opinion on the affairs of the nation, but of vapid personalities interesting to none save gossips and busy bodies. \n-- Marie Corelli, Free Opinions, Freely Expressed\n1905\n\nThere is a great *tendency among the children of today to rebel against restraint*, not only that placed upon them by the will of the parent, but against any restraint or limitation of what they consider their rights... this fact has filled well minded people with great apprehensions for the future. \n-- Rev. Henry Hussmann, The Authority of Parents\n1906\n\n*Our modern family gathering, silent* around the fire, *each individual with his head buried in his favourite magazine*, is the somewhat natural outcome of the banishment of colloquy from the school...\n-- The Journal of Education, volume 29\n1907\n\nPlays in theatres at the present time present spectacles and *deal openly with situations which no person would have dared to mention in general society forty years ago*... The current representations of *nude men and women in the daily journals* and the illustrated magazines would have excluded such periodicals from all respectable families two decades ago... Those who have been divorced... forty and fifty years ago lost at once and irrevocably their standing in society, while to-day they continue in all their social relationships, hardly changed...\n-- Editorial, The Watchman, Boston\n1908\n\nWe write millions more letters than did our grandfathers, but the increase in volume has brought with it an automatic artificial machine-like ring... an examination of a file of old letters reveals not only a remarkable grasp of details, but a *fitness and courtliness too often totally lacking* in the mechanical curt cut and dried letters of to-day. \n-- Forrest Crissey, Handbook of Modern Business Correspondence\n1908\n\n*A hundred years ago it took so long and cost so much to send a latter that it seemed worth while to put some time and thought into writing it*. Now the quickness and the cheapness of the post seem to justify the feeling that *a brief letter to-day may be followed by another next week - a \"line\" now by another to-morrow*. \n-- Percy Holmes Boynton, Principles of Composition \n1915\n\n{{Title text: 'Unfortunately, the notion of marriage which prevails ... at the present time ... regards the institution as simply a convenient arrangement or formal contract ... This disregard of the sanctity of marriage and contempt for its restrictions is one of the most alarming tendencies of the present age.' --John Harvey Kellogg, Ladies' guide in health and disease (1883)}}","alt":"'Unfortunately, the notion of marriage which prevails ... at the present time ... regards the institution as simply a convenient arrangement or formal contract ... This disregard of the sanctity of marriage and contempt for its restrictions is one of the most alarming tendencies of the present age.' --John Harvey Kellogg, Ladies' guide in health and disease (1883)","img":"https://imgs.xkcd.com/comics/the_pace_of_modern_life.png","title":"The Pace of Modern Life","day":"19"},{"month":"6","num":1228,"link":"","year":"2013","news":"","safe_title":"Prometheus","transcript":"[[3 figures are seen. Figure A is addressing Figure B, who just walked in-panel. Figure A points at Prometheus. Prometheus is looking ponderous and holding a flaming torch.]]\nFigure A: Prometheus has stolen fire from the Gods! \nPrometheus: Well, sort of. I mean, when you use a fire to make another fire, the first fire doesn't go away. So really, it's more like sharing.\nFire wants to be free.\n\n{{Title text: 'I'm here to return what Prometheus stole.' would be a good thing to say if you were a fighter pilot in a Michael Bay movie where for some reason the world's militaries had to team up to defeat every god from human mythology, and you'd just broken through the perimeter and gotten a missile lock on Mount Olympus.}}","alt":"'I'm here to return what Prometheus stole.' would be a good thing to say if you were a fighter pilot in a Michael Bay movie where for some reason the world's militaries had to team up to defeat every god from human mythology, and you'd just broken through the perimeter and gotten a missile lock on Mount Olympus.","img":"https://imgs.xkcd.com/comics/prometheus.png","title":"Prometheus","day":"21"},{"month":"6","num":1229,"link":"","year":"2013","news":"","safe_title":"Screensaver","transcript":"I've been staring at the screen every night for twenty years, and it finally happened. \n\n[[A star field.]]\n\n[[The same star field, but there's a larger white dot glowing in the middle.]]\n\n[[The same star field, but that larger white dot's looking bigger now. Oh. It's clearly a star.]]\n\n[[The screen is filled with white. It's coming straight for us.]]\n\n[[The screen is filled with static.]]\nSignal lost\n\n{{Title text: I'm entering my 24th year of spending eight hours a day firing the Duck Hunt gun at the flying toasters. I'm sure I'll hit one soon.}}","alt":"I'm entering my 24th year of spending eight hours a day firing the Duck Hunt gun at the flying toasters. I'm sure I'll hit one soon.","img":"https://imgs.xkcd.com/comics/screensaver.png","title":"Screensaver","day":"24"},{"month":"6","num":1230,"link":"","year":"2013","news":"","safe_title":"Polar/Cartesian","transcript":"[[There is a graph. The Y axis is marked out from 0% to 100%. The X axis is unmarked. A red line starts at 50% and traces out a roughly parabolic trend downwards along the X axis.]]\nCertainty that this is a clockwise polar plot, not a Cartesian one, as a function of time.\n\n{{Title text: Protip: Any two-axis graph can be re-labeled 'coordinates of the ants crawling across my screen as a function of time'.}}","alt":"Protip: Any two-axis graph can be re-labeled 'coordinates of the ants crawling across my screen as a function of time'.","img":"https://imgs.xkcd.com/comics/polar_cartesian.png","title":"Polar/Cartesian","day":"26"},{"month":"6","num":1231,"link":"","year":"2013","news":"","safe_title":"Habitable Zone","transcript":"[[An astronomer stands in front of a huge telescope, looking through the eyepiece.]]\nAstronomer: I've discovered an Earth-sized planet in a star's habitable zone! It even has oceans! And visible weather! \nTo mess with an astronomer, put a mirror in the path of their telescope.\n{{Title text: They have a telescope pointed RIGHT AT US!}}","alt":"They have a telescope pointed RIGHT AT US!","img":"https://imgs.xkcd.com/comics/habitable_zone.png","title":"Habitable Zone","day":"28"},{"month":"7","num":1232,"link":"","year":"2013","news":"","safe_title":"Realistic Criteria","transcript":"[[Two figures stand talking.]]\nFigure with hat: We shouldn't be exploring other planets until we've solved all our problems here on Earth.\nOther figure: Sounds reasonable. So, what's the timeline on \"Solving all problems\"? Ten years? Fifteen?\n\n{{Title text: I'm leaning toward fifteen. There are a lot of them.}}","alt":"I'm leaning toward fifteen. There are a lot of them.","img":"https://imgs.xkcd.com/comics/realistic_criteria.png","title":"Realistic Criteria","day":"1"},{"month":"7","num":1233,"link":"","year":"2013","news":"","safe_title":"Relativity","transcript":"[[We see a head and shoulders view of Einstein. He looks ponderous.]]\n((Einstein's \"line\" is in a thought bubble.))\nEinstein: If I were traveling at the speed of light, my butt would look *awesome*.\nEinstein was famed for his Gedankedank.\n\n{{Title text: It's commonly believed that Lorentz contraction makes objects appear flatter along the direction of travel. However, this ignores light travel times. In fact, a fast-moving butt would appear rotated toward the observer but not substantially distorted. Shakira was right.}}","alt":"It's commonly believed that Lorentz contraction makes objects appear flatter along the direction of travel. However, this ignores light travel times. In fact, a fast-moving butt would appear rotated toward the observer but not substantially distorted. Shakira was right.","img":"https://imgs.xkcd.com/comics/relativity.png","title":"Relativity","day":"3"},{"month":"7","num":1234,"link":"","year":"2013","news":"","safe_title":"Douglas Engelbart (1925-2013)","transcript":"San Francisco, December 9th, 1968: \n[[We see a figure talking into a headset. It's a fair assumption that it's Douglas Engelbart.]]\nDouglas: ... We generated video signals with a cathode ray tube... We have a pointing device we call a \"mouse\"... I can \"copy\" text... ... and we have powerful join file editing... underneath the file here we can exchange \"direct messages\"...\n\n[[Douglas continues to narrate. Some music is playing.]]\nDouglas: ... Users can share files... ... files which can encode audio samples, using our \"masking codecs\"... The file you're hearing now is one of my own compositions...\nMusic: I heard there was a secret chord\n\n[[Douglas continues to narrate.]]\nDouglas: ... And you can superimpose text on the picture of the cat, like so... This cat is saying \"YOLO\", which stands for \"You Only Live Once\"... ...Just a little acronym we thought up...\n\n{{Title text: Actual quote from The Demo: '... an advantage of being online is that it keeps track of who you are and what youâre doing all the time ...'}}","alt":"Actual quote from The Demo: '... an advantage of being online is that it keeps track of who you are and what you’re doing all the time ...'","img":"https://imgs.xkcd.com/comics/douglas_engelbart_1925_2013.png","title":"Douglas Engelbart (1925-2013)","day":"5"},{"month":"7","num":1235,"link":"","year":"2013","news":"","safe_title":"Settled","transcript":"Percentage of the US population carrying cameras everywhere they go, every waking moment of their lives: \n[[A graph with years from 1975 to 2013 as the X axis and a percentage from 0 to 100 as the Y axis.  The sole line starts at just above 0, jumps to 1-2 at around 2000, is at 10% at 2005, 75% at 2010, and around 90% at 2013]]\nIn the last few years, with very little fanfare, we've conclusively settled the questions of flying saucers, lake monsters, ghosts, and Bigfoot.\n\n{{Title text: Well, we've really only settled the question of ghosts that emit or reflect visible light. Or move objects around. Or make any kind of sound. But that covers all the ones that appear in Ghostbusters, so I think we're good.}}","alt":"Well, we've really only settled the question of ghosts that emit or reflect visible light. Or move objects around. Or make any kind of sound. But that covers all the ones that appear in Ghostbusters, so I think we're good.","img":"https://imgs.xkcd.com/comics/settled.png","title":"Settled","day":"8"},{"month":"7","num":1236,"link":"","year":"2013","news":"","safe_title":"Seashell","transcript":"((At the top of the panel is an equation showing Bayes' Theorem for the probability that a person is near the ocean given that they just picked up a seashell.))\n\nThe probability that I'm near the ocean given I picked up a seashell equals the probability I picked up a seashell given I'm near the ocean times the probability I'm near the ocean all divided by the probability I picked up a seashell.\n\n[[A person holding a seashell stands to the left of the panel, to the right a few birds are flying around and the sound of a wave crashing against the shore is depicted.]]\n\n<<Crashhh>>\n<<Sploosh>>\n\nCaption: Statistically speaking, if you pick up a seashell and don't hold it to your ear, you can probably hear the ocean.\n\n{{Title text: This is roughly equivalent to 'number of times I've picked up a seashell at the ocean' \n 'number of times I've picked up a seashell', which in my case is pretty close to 1, and gets much closer if we're considering only times I didn't put it to my ear.}}","alt":"This is roughly equivalent to 'number of times I've picked up a seashell at the ocean' / 'number of times I've picked up a seashell', which in my case is pretty close to 1, and gets much closer if we're considering only times I didn't put it to my ear.","img":"https://imgs.xkcd.com/comics/seashell.png","title":"Seashell","day":"10"},{"month":"7","num":1237,"link":"","year":"2013","news":"","safe_title":"QR Code","transcript":"[[A smartphone.  On the display, the following text: \"To continue installing, scan this code. 12 seconds remaining\".  A particularly recursive QR code is displayed on the screen]]\nHow to freak out a mobile app user.\n\n{{Title text: Remember, the installer is watching the camera for the checksum it generated, so you have to scan it using your own phone.}}","alt":"Remember, the installer is watching the camera for the checksum it generated, so you have to scan it using your own phone.","img":"https://imgs.xkcd.com/comics/qr_code.png","title":"QR Code","day":"12"},{"month":"7","num":1238,"link":"","year":"2013","news":"","safe_title":"Enlightenment","transcript":"{{Title text: But the rules of writing are like magic spells. If you never acquire them, then not using them says nothing.}}\n\n[[Two Internet Bodhisattvas lecture a pupil encircled by a wheel placed upon the ground.]]\nBoddhisatva 1: To achieve *Internet Enlightenment*, you must free yourself from insecurity. \nNovice: But insecurity keeps me humble!\n\nBoddhisatva 1: No. Insecurity leads to conceit.  Conceit leads to judgment.  Judgment leads to being an asshole.\n\n[[A laptop is placed on a stand in front of the student]]\nNovice: I'm ready, How do I begin?\nBoddhisatva 1: Type this sentence: \"I heard you're idea's and their definately good\"\n\n[[The laptop has been smashed to the floor.  The circle, one full of hope and excitement, is now full of despair and no students]]\nBoddhisatva 1: She wasn't ready.\nBoddhisatva 2: Its a difficult road.\n","alt":"But the rules of writing are like magic spells. If you never acquire them, then not using them says nothing.","img":"https://imgs.xkcd.com/comics/enlightenment.png","title":"Enlightenment","day":"15"},{"month":"7","num":1239,"link":"","year":"2013","news":"","safe_title":"Social Media","transcript":"[[A NASA spokesperson heads a press conference]]\nSpokesperson: NASA has confirmed that the asteroid is headed directly for us.  Yes, a question?\n\nReporter 1: What role has social media played in this asteroid's orbit?\n\n[[A twinge of anger and resentment builds in the spokesperson]]\nSpokesperson: *sigh*\n\nReporter 2: Has Twitter changed the way we respond to asteroid threats?  \nSpokesperson: Well, it's made the press conference questions stupider.\nReporter 3: Fascinating!\nReporter 4: What about Facebook?\n\n{{Title text: The social media reaction to this asteroid announcement has been sharply negative. Care to respond?}}","alt":"The social media reaction to this asteroid announcement has been sharply negative. Care to respond?","img":"https://imgs.xkcd.com/comics/social_media.png","title":"Social Media","day":"17"},{"month":"7","num":1240,"link":"","year":"2013","news":"","safe_title":"Quantum Mechanics","transcript":"[[A man and a woman stand facing each other, talking. The man has a dog on a leash.]]\nMan: But dogs can observe the world, which means that according to quantum mechanics they \nmust\n have souls.\nProtip: You can safely ignore any sentence that includes the phrase \"According to quantum mechanics\"\n\n{{Title text: You can also just ignore any science assertion where 'quantum mechanics' is the most complicated phrase in it.}}","alt":"You can also just ignore any science assertion where 'quantum mechanics' is the most complicated phrase in it.","img":"https://imgs.xkcd.com/comics/quantum_mechanics.png","title":"Quantum Mechanics","day":"19"},{"month":"7","num":1241,"link":"","year":"2013","news":"","safe_title":"Annoying Ringtone Champion","transcript":"<<The sound of an insect going \"hmmmmmmMMMMMMMMmmmmmm\">>\n\nPerson, suspecting an impending insect attack: Augh!\nBlack Hat Man: Oh, I've gotta take this.\n\nBy unanimous decision, the winner of the Awful Ringtone Championship is \"the sound a mosquito makes as it buzzes past your ear\"\n\n{{Title text: It beat out 'Clock radio alarm', 'B-flat at 194 decibels', 'That noise from Dumb & Dumber', and 'Recording of a sobbing voice begging you to answer'.}}","alt":"It beat out 'Clock radio alarm', 'B-flat at 194 decibels', 'That noise from Dumb & Dumber', and 'Recording of a sobbing voice begging you to answer'.","img":"https://imgs.xkcd.com/comics/annoying_ringtone_champion.png","title":"Annoying Ringtone Champion","day":"22"},{"month":"7","num":1242,"link":"","year":"2013","news":"","safe_title":"Scary Names","transcript":"[[A scatterplot, with the y-axis labeled \"scariness of name\" and the x-axis labeled \"scariness of thing name refers to.\n\nAt the top-left is \"chernobyl packet\".\nSlightly right and downwards of that is \"bomb calorimeter\".\nTowards the middle-top is \"kessler syndrome\".\nTowards the middle-bottom is \"soil liquefaction\".\nTowards the center is \"mustard gas\".\nAlong the bottom, two-thirds of the way to the right, is \"grey goo\".\nSlightly up and to the right from that is \"criticality incident\".\nAbout midway up from there is \"bird flu\".\nFurther up, not quite at the top, is \"demon core\".\nBack towards the middle vertically, but slightly farther to the right, is \"superbug\".\nAlmost all the way to the right but still near the middle vertically is \"nuclear football\".\nAt the far top-right is \"flesh-eating bacteria\".]]\n\n{{Title text: Far off to the right of the chart is the Helvetica Scenario.}}","alt":"Far off to the right of the chart is the Helvetica Scenario.","img":"https://imgs.xkcd.com/comics/scary_names.png","title":"Scary Names","day":"24"},{"month":"7","num":1243,"link":"","year":"2013","news":"","safe_title":"Snare","transcript":"[[Black hat guy is sitting at a desk, using a laptop. He's talking to a figure standing behind him.]]\nFigure: They said on the news that they found a giant ring lying in a field outside Chicago. Strung with some kind of superstrong mesh. \nBlack hat guy: Mhm? \n\nFigure: Then they found a 260-mile long shaft connected to the ring, running from Chicago to St. Louis. In St. Louis they found a gigantic winch. \nBlack hat guy: Did they. \n\nFigure: It sounds kind of like... ...a butterfly net. \n\nFigure: ... Are you planning to catch the International Space Station?\nBlack hat guy: I'm planning to catch *an* international space station. Not sayin' which. \n\n{{Title text: It's going in A collection of satellites skewered with pins and mounted in display boxes. Not necessarily MY collection.}}","alt":"It's going in A collection of satellites skewered with pins and mounted in display boxes. Not necessarily MY collection.","img":"https://imgs.xkcd.com/comics/snare.png","title":"Snare","day":"26"},{"month":"7","num":1244,"link":"","year":"2013","news":"","safe_title":"Six Words","transcript":"The six words you *never* say at NASA:\n[[A trajectory path involving multiple slingshots around Earth, Jupiter, and the Sun labeled \"Oberth Kuiper Maneuver\" is being presented by two people for a crowd]]\nAnd besides -- it works in Kerbal Space Program.\n\n{{Title text: Ahem. We are STRICTLY an Orbiter shop.}}","alt":"Ahem. We are STRICTLY an Orbiter shop.","img":"https://imgs.xkcd.com/comics/six_words.png","title":"Six Words","day":"29"},{"month":"7","num":1245,"link":"","year":"2013","news":"","safe_title":"10-Day Forecast","transcript":"[[A figure sits at a desk using a computer, conversing with an off-screen woman.]]\nWoman: Is it going to rain this weekend? I have a thing. \nMan: Lemme check.\n<<Type type>>\nMan: ... Uhh. What? \n\n((Ten small panels are presented, each one with a picture describing that day's weather.))\nYour 10 day forecast: \n[[Today: A sun. Tomorrow: A sun obscured by grey clouds. Friday: Three grey clouds with a single lightning bolt. Saturday: Giant grey clouds; 7 lightning bolts. Sunday: a huge swarm of flies. Monday: Three stick figures with elongated bodies; one seems to be holding his head in pain. Tuesday: A figure is silhouetted against a dull red-brown glow; he seems to be wearing a huge-winged helmet. Tuesday: white noise. Tuesday: complete black. Tuesday: complete black.]]\n\n[[The woman has walked up to the figure at the desk.]]\nWoman: ... Oh! You typed a minus sign in the zip code. The negative zip codes are all like that. \nMan: Let's *never* move there. \n\n{{Title text: Oh, definitely not; they don't have Amazon Prime.}}","alt":"Oh, definitely not; they don't have Amazon Prime.","img":"https://imgs.xkcd.com/comics/10_day_forecast.png","title":"10-Day Forecast","day":"31"},{"month":"8","num":1246,"link":"","year":"2013","news":"","safe_title":"Pale Blue Dot","transcript":"[[A figure stands in front of a projector screen with a pointer. He is, presumably, addressing a room of his peers off-panel.]]\nLecturer: Consider this pale blue dot. That's here. That's home. That's us. Everyone you love, every human being who ever was, every saint and sinner in the history of our species lived out their lives on this mote of dust suspended in a sunbeam. All our-\nPeer 1: I think that's a stuck pixel. We're the speck on the left. \nLecturer: ... OK, *this* pale blue dot is everything you-\nPeer 2: -No, you were right before. *That* one is Earth.\nLecturer: LOOK, IT DOESN'T MATTER! \nPeer 3: I *knew* it! \nPeer 4: I think this is just a lens cap picture. \n\n{{Title text: Our planet is a lonely speck in the great enveloping cosmic dark. In our obscurity, in all this vastness, there is no hint that help will come from elsewhere to save us from ourselves. There is no road out of this oblivion; we must embrace it. We must join with the darkness. Ba'al the Annihilator offers us no happiness, no answers, naught but the cold embrace of the void. To imagine any other end is delusion. We must give in to the will of Ba'al, for he will one day consume us and our world alike. I therefore call on Congress to fully fund space exploration, and to join with Ba'al, the Eater of Souls. Thank you.}}","alt":"Our planet is a lonely speck in the great enveloping cosmic dark. In our obscurity, in all this vastness, there is no hint that help will come from elsewhere to save us from ourselves. There is no road out of this oblivion; we must embrace it. We must join with the darkness. Ba'al the Annihilator offers us no happiness, no answers, naught but the cold embrace of the void. To imagine any other end is delusion. We must give in to the will of Ba'al, for he will one day consume us and our world alike. I therefore call on Congress to fully fund space exploration, and to join with Ba'al, the Eater of Souls. Thank you.","img":"https://imgs.xkcd.com/comics/pale_blue_dot.png","title":"Pale Blue Dot","day":"2"},{"month":"8","num":1247,"link":"","year":"2013","news":"","safe_title":"The Mother of All Suspicious Files","transcript":"[[Browser download warning box containing the following text]]\nWarning!\nThis type of file can harm your computer! Are you sure you want to download:\nhttp:\n\n65.222.202.53\n~TILDE\nPUB\nCIA-BIN\nETC\nINIT.DLL?FILE=_AUTOEXEC.BAT.MY%20OSX%20DOCUMENTS-INSTALL.EXE.RAR.INI.TAR.DOCX.PHPHPPH.XHTML.TML.XTL.TXXT.0DAY.HACK.ERS_(1995)_BLURAY_CAM-XVID.EXE.TAR.[SCR].LISP.MSI.LNK.ZDA.GNN.WRBT.OBJ.O.H.SWF.DPKG.APP.ZIP.TAR.TAR.CO.GZ.A.OUT.EXE\n[[Cancel and Save buttons]]\n\n{{Title text: Better change the URL to 'https' before downloading.}}","alt":"Better change the URL to 'https' before downloading.","img":"https://imgs.xkcd.com/comics/the_mother_of_all_suspicious_files.png","title":"The Mother of All Suspicious Files","day":"5"},{"month":"8","num":1248,"link":"","year":"2013","news":"","safe_title":"Sphere","transcript":"Person 1: How are you?\nPerson 2: Trapped on the surface of a sphere\n\n[[A beat.]]\n\nPerson 1: That astronomy class has made you suck at small talk.\nPerson 2: The universe is too *big* for small talk.\n\n{{Title text: This message brought to you by the Society of Astronomers Trapped on the Surface of a Sphere.}}","alt":"This message brought to you by the Society of Astronomers Trapped on the Surface of a Sphere.","img":"https://imgs.xkcd.com/comics/sphere.png","title":"Sphere","day":"7"},{"month":"8","num":1249,"link":"","year":"2013","news":"","safe_title":"Meteor Showers","transcript":"The xkcd guide to meteor showers\n((This panel is a table with candy-cane shading. The three columns are \"Name\", \"Peak\", and \"Notes\". It is given here in a |-delimited form.))\nName | Peak | Notes\nQuadrantids | January 4th | Bring pets inside during peak activity\nTricuspids | January 21st | Not viewable in region 2 countries\nCentaurids | February 6th | Too faint to see without going outside\nBeta Aquariids | February 10th | Inverted shower converges toward Aquarius instead of radiating away\nChelyabids | February 15th | Only one meteor per shower, but it's big. \nLyrids | April 22nd | Meteors sometimes scream\nDaytime Zeta Perseids | June 9th | Likely a NASA hoax\nJune Boötids | June 27th | 50\n50 mix of meteors and shooting stars\nSouthern Delta Aquariids | July 19th | Meteors very bright, but stationary\nDromaeosaurids | June 22nd | Fast, highly intelligent, can open doors\nPerseids | August 12th | Instead of falling from sky, meteors erupt from ground\nTau Pyramids | August 15th | Visible even when eyes are closed\nDraconids | October 8th | Very slow, but follow you if you run\nOrionids | October 21st | Entire shower happens at once\nLeonids | November 17th | In 1966, unusually active Leonid shower killed god\nGeminids | December 13th | Can be deflected with tennis rackets\n\n{{Title text: Remember, meteors always hit the tallest object around.}}","alt":"Remember, meteors always hit the tallest object around.","img":"https://imgs.xkcd.com/comics/meteor_showers.png","title":"Meteor Showers","day":"9"},{"month":"8","num":1250,"link":"","year":"2013","news":"","safe_title":"Old Accounts","transcript":"[[A figure sits at a desk, using a laptop.]]\nThe Internet is filled with derelict accounts aggregating news about friends long forgotten. \n<<Click>>\nLaptop: Uhh, is everything OK?\n<<Click>>\nLaptop: Dude, what the Hell?\n<<Click>>\nWhen you find yourself drifting away from a community, remember to clean up after yourself by slowly unfriending everyone, one by one, in the reverse order that you added them.\n\n{{Title text: If you close an account while it's still friends with people, it contributes to database linkage accumulation slowdown, which is a major looming problem for web infrastructure and definitely not a thing I just made up.}}","alt":"If you close an account while it's still friends with people, it contributes to database linkage accumulation slowdown, which is a major looming problem for web infrastructure and definitely not a thing I just made up.","img":"https://imgs.xkcd.com/comics/old_accounts.png","title":"Old Accounts","day":"12"},{"month":"8","num":1251,"link":"","year":"2013","news":"","safe_title":"Anti-Glass","transcript":"[[Two police officers stand at an apartment door. The female officer is holding a pair of glasses with something attached to it. We will see later that Black Hat Guy is in the apartment]]\nFemale officer: Police. Open up. Did you make this glasses attachment?\nBlack hat guy {{through door}}: Oh, yeah. \n\n[[Black hat guy is sitting at his laptop.]]\nPolice officer: What's it do? \nBlack hat guy: It detects when someone near you is wearing Google Glass and shines a laser pointer at their eyepiece.\nPolice officer: Why??\nBlack hat guy: The best defense is an indiscriminate offense. \n\n[[Cut back to officers outside the apartment.]]\nMale officer: It seems you've mailed these devices to people across Silicon Valley, including the children of every Google executive. \nBlack hat guy: Yeah. It's a viral marketing campaign for an upcoming movie. \n\nMale officer: What movie?\nBlack hat guy: haven't decided yet. Anything good coming out this fall?\nMale officer: Sir, open the door. \nBlack hat guy: First stare at the peephole for a sec. \n\n{{Title text: 'Why don't you just point it at their eye directly?' 'What is this, 2007?'}}","alt":"'Why don't you just point it at their eye directly?' 'What is this, 2007?'","img":"https://imgs.xkcd.com/comics/anti_glass.png","title":"Anti-Glass","day":"14"},{"month":"8","num":1252,"link":"","year":"2013","news":"","safe_title":"Increased Risk","transcript":"[[Three figures are standing around. Two have beach towels. A woman is looking at her cell phone. One of them is beret guy.]]\nWoman: We should go to the north beach. Someone said the south beach has a 20% higher risk of shark attacks. \nMan: Yeah, but statistically, taking three beach trips instead of two increases our odds of getting shot by a swimming dog carrying a handgun in its mouth by 50%! \nBeret guy: Oh no! This is our third trip! \nReminder: A 50% increase in a tiny risk is still tiny. \n\n{{Title text: You may point out that strictly speaking, you can use that statement to prove that all risks are tiny--to which I reply HOLY SHIT WATCH OUT FOR THAT DOG!}}","alt":"You may point out that strictly speaking, you can use that statement to prove that all risks are tiny--to which I reply HOLY SHIT WATCH OUT FOR THAT DOG!","img":"https://imgs.xkcd.com/comics/increased_risk.png","title":"Increased Risk","day":"16"},{"month":"8","num":1253,"link":"","year":"2013","news":"","safe_title":"Exoplanet Names","transcript":"August 2013: The Internation Astronomical Union decides to start naming exoplanets, and - for the first time ever - asks for suggestions from the general public. \nThey immediately regret this decision.\n[[Four figures stand around looking at a computer screen. One is facepalming.]]\nMan: Can't you filter out the worst ones? \nWoman: This is *after* the filter!\n\n((The list of suggestions is given as a table with three columns: \"Star\", \"Planet\", \"Suggested Name\". Here, the columns are given in a |-delimited form.))\nStar | Planet | Suggested Name\nGliese 667C | b | Space planet\nGliese 667C | c | Pilf\nGliese 667C | d | A star\nGliese 667C | e | e'); DROP TABLE planets; --\nGliese 667C | f | Blogosphere\nGliese 667C | g | Blogodrome\nGliese 667C | h | Earth\nTau Ceti | b | Sid Meier's Tau Ceti B\nTau Ceti | c | Giant dog planet\nTau Ceti | d | Tiny dog planet\nTau Ceti | e | Phil plainet\nTau Ceti | f | Unicode snowman\nGliese 832 | b | Asshole Jupiter\nGliese 581 | b | Waist-deep cats\nGliese 581 | c | Planet #14\nGliese 581 | d | Ballderaan\nGliese 581 | e | Eternia prime\nGliese 581 | f | Taupe Mars\nGliese 581 | g | Jelly-filled planet\nEpsilon Eridani | b | Skydot\nEpsilon Eridani | c | Laser noises\nGliese 176 | b | Pandora\nGliese 176 | c | Pantera\nKepler-61 | b | Goldenpalace.com\nUpsilon Andromidae | c | Stampy\nUpsilon Andromidae | d | Moonchild\nUpsilon Andromidae | e | Ham sphere\nHD 20794 | b | Cosmic sands\nHD 20794 | c | Legoland\nHD 20794 | d | Planet with arms\nHD 85512 | b | Lax morality\nHD 40307 | b | Good planet\nHD 40307 | c | Problemland\nHD 40307 | d | Slickle\nHD 40307 | e | Spare parts\nHD 40307 | f | New Jersey VI \nHD 40307 | g | Hod do I join the IAU\nGliese 163 | b | Neil Tyson's mustache\nGliese 163 | c | help@gmail.com\nGliese 163 | d | Hair-covered planet\nPi Mensae | b | Moon holder\nHD 189733 | b | Permadeath\nKepler-22 | b | Blue ivy\nKepler-3284 | b | Blainsley\nKepler-3255 | b | Unicorn thresher\nKepler-2418 | b | Spherical Discworld\nKepler-1686 | b | Emergency backup Earth\nKepler-3010 | b | Feeeooooooooop\nKepler-4742 | b | Liz\n\n{{Title text: If you have any ideas, I hear you can send them to iaupublic@iap.fr.}}","alt":"If you have any ideas, I hear you can send them to iaupublic@iap.fr.","img":"https://imgs.xkcd.com/comics/exoplanet_names.png","title":"Exoplanet Names","day":"19"},{"month":"8","num":1254,"link":"","year":"2013","news":"","safe_title":"Preferred Chat System","transcript":"[[A figure stands, talking on his cell phone.]]\nFigure: Sorry for the voicemail, but I'm confused about how to reach you. \n\nFigure: When I text you, you reply once on GChat, then go quiet, yet answer IRC right away. I emailed you, and you replied on Skype and mentioned that the email \"woke you up.\" \n\nFigure: You're very responsive - I just have no sense of how you use technology. \n\n[[An owl flies into the panel.]]\nFigure: ?!?\n\n[[The owl perches on the figure's head. It has delivered a note to the figure.]]\nNote: did you try to call me? use my google voice number next time. \n\n{{Title text: If you call my regular number, it just goes to my pager.}}","alt":"If you call my regular number, it just goes to my pager.","img":"https://imgs.xkcd.com/comics/preferred_chat_system.png","title":"Preferred Chat System","day":"21"},{"month":"8","num":1255,"link":"","year":"2013","news":"","safe_title":"Columbus","transcript":"[[A figure in a hat is talking to two small children who are sitting cross-legged on the floor. A woman is off-panel.]]\nFigure in hat: Everyone said the world was flat, but Columbus knew it was round. \nWoman: <<Sigh>> No, no, no. \n\n[[The woman walks into frame. The children turn to look.]]\nWoman: So he took his ships and sailed west in a line tangent to the surface. The sea fell away, and he landed in *Valinor*. \n\nWoman: A Silmaril on his brow, he wanders the heavens as the morning star, still believing he reached India. \nFigure in hat: Stop making stuff up. \nWoman: You first. \n\n{{Title text: And thus was smallpox introduced into the previously Undying Lands.}}","alt":"And thus was smallpox introduced into the previously Undying Lands.","img":"https://imgs.xkcd.com/comics/columbus.png","title":"Columbus","day":"23"},{"month":"8","num":1256,"link":"https://xkcd.com/1256/large/","year":"2013","news":"","safe_title":"Questions","transcript":"((This strip is a rectangular word cloud, titled 'Questions found in Google autocomplete'. Embedded in the cloud are 5 single panels, with illustrated questions. These are described at the end. Questions are given in roughly columnar order. None of the questions have question marks.))\nQuestions found in Google Autocomplete\nWhy do whales jump\nWhy are witches green\nWhy are there mirrors above beds\nWhy do I say uh\nWhy is sea salt better\nWhy are there trees in the middle of fields\nWhy is there not a Pokemon MMO\nWhy is there laughing in TV shows\nWhy are there doors on the freeway\nWhy are there so many svchost.exe running\nWhy aren't there any countries in antarctica \nWhy are there scary sounds in Minecraft\nWhy is there kicking in my stomach\nWhy are there two slashes after HTTP\nWhy are there celebrities\nWhy do snakes exist\nWhy do oysters have pearls\nWhy are ducks called ducks\nWhy do they call it the clap\nWhy are Kyle and Cartman friends\nWhy is there an arraow on Aang's head\nWhy are text messages blue\nWhy are there mustaches on clothes\nWhy are there mustaches on cars\nWhy are there mustaches everywhere\nWhy are there so many birds in Ohio\nWhy is there so much rain in Ohio\nWhy is Ohio weather so weird\nWhy are there male and female bikes\nWhy are there bridesmaids\nWhy do dying people reach up\nWhy aren't there varicose arteries\nWhy are old Klingons different\nWhy is programming so hard\nWhy is there a 0 ohm resistor\nWhy do Americans hate soccer\nWhy do rhymes sound good\nWhy do trees die\nWhy is there no sound on CNN\nWhy aren't Pokemon real \nWhy aren't bullets sharp\nWhy do dreams seem so real\nWhy aren't there dinosaur ghosts\nWhy do iguanas die\nWhy do testicles move\nWhy are there psychics\nWhy are hats so expensive\nWhy is there caffeine in my shampoo\nWhy do your boobs hurt\nWhy aren't economists rich\nWhy do Americans call it soccer\nWhy are my ears ringing\nWhy are there so many Avengers\nWhy are the Avengers fighting the X men\nWhy is Wolverine not in the Avengers\nWhy are there ants in my laptop\nWhy is Earth tilted\nWhy is space black\nWhy is outer space so cold\nWhy are there pyramids on the moon\nWhy is NASA shutting down\nWhy is there Hell if God forgives\nWhy are there tiny spiders in my house\nWhy do spiders come inside\nWhy are there huge spiders in my house\nWhy are there lots of spiders in my house\nWhy are there spiders in my room\nWhy are there so many spiders in my room\nWhy do spider bites itch\nWhy is dying so scary\nWhy is there no GPS in laptops\nWhy do knees click\nWhy aren't there E grades\nWhy is isolation bad\nWhy do boys like me\nWhy don't boys like me\nWhy is there always a Java update\nWhy are there red dots on my thighs\nWhy is lying good\nWhy is GPS free\nWhy are trees tall\nWhy are there slaves in the Bible\nWhy do twins have different fingerprints\nWhy are Americans afraid of dragons\nWhy is there lava\nWhy are there swarms of gnats\nWhy is there phlegm\nWhy are there so many crows in Rochester, MN\nWhy is psychic weak to bug\nWhy do children get cancer\nWhy is Poseidon angry with Odysseus\nWhy is there ice in space\nWhy are there female Mr Mimes\nWhy is there an owl in my backyard\nWhy is there an owl outside my window\nWhy is there an owl on the dollar bill\nWhy do owls attack people\nWhy are AK47s so expensive\nWhy are there helicopters circling my house\nWhy are there gods\nWhy are there two Spocks\nWhy is Mt Vesuvius there\nWhy do they say T minus\nWhy are there obelisks\nWhy are wrestlers always wet\nWhy are oceans becoming more acidic\nWhy is Arwen dying\nWhy aren't my quail laying eggs\nWhy aren't my quail eggs hatching\nWhy aren't there any foreign military bases in America\nWhy is life so boring\nWhy are my boobs itchy\nWhy are cigarettes legal\nWhy are there ducks in my pool\nWhy is Jesus white\nWhy is there liquid in my ear\nWhy do Q tips feel good\nWhy do good people die\nWhy are ultrasounds important\nWhy are ultrasound machines expensive\nWhy is stealing wrong\nWhy is YKK on all zippers\nWhy is HTTPS crossed out in red\nWhy is there a line through HTTPS\nWhy is there a red line through HTTPS on Facebook\nWhy is HTTPS important\nWhy are there weeks\nWhy do I feel dizzy\nWhy are dogs afraid of fireworks\nWhy is there no king in England\n\n[[We see a figure from the torso up, with arms outstretched.]]\nFigure: Why aren't my arms growing\n\n[[A woman stands with a grey ghost on either side of her.]]\nWoman: Why are there ghosts\n\n[[Beret guy stands, looking at a squirrel.]]\nBeret guy: Why are there squirrels\n\n[[A figure stands.]]\nFigure: Why is sex so important.]]\n\n[[We see a woman from the torso up.]]\nWoman: Why aren't there guns in Harry Potter\n\n{{Title text: To whoever typed 'why is arwen dying': GOOD. FUCKING. QUESTION.}}","alt":"To whoever typed 'why is arwen dying': GOOD. FUCKING. QUESTION.","img":"https://imgs.xkcd.com/comics/questions.png","title":"Questions","day":"26"},{"month":"8","num":1257,"link":"","year":"2013","news":"","safe_title":"Monster","transcript":"[[4 figures are standing around a table-top crisis planning model. Two are wearing police-style hats; one holds a clipboard.]]\nFigure 1: It's as long as a football field. Runs as fast as a cheetah.\nFigure 2: Weighs as much as a blue whale. \nFigure 3: Can we negotiate with it? \nFigure 4: No. It has the intelligence of a two-year-old child. \nBy the time the Frequently-Made Comparisons Monster was finally defeated, it had eaten enough people to fill a stadium and devastated an area the size of Rhode Island.\n\n{{Title text: It was finally destroyed with a nuclear weapon carrying the destructive energy of the Hiroshima bomb.}}","alt":"It was finally destroyed with a nuclear weapon carrying the destructive energy of the Hiroshima bomb.","img":"https://imgs.xkcd.com/comics/monster.png","title":"Monster","day":"28"},{"month":"8","num":1258,"link":"","year":"2013","news":"","safe_title":"First","transcript":"[[A figure sits at his desk, using a computer.]]\n\n[[The figure is still sitting at the desk, but with hands off the keyboard in his lap.]]\n\n[[The figure is in the same position as before, talking with off-panel.]]\nFigure: After a couple of unbearable decades, the \"first post\" thing seems to be dying a quiet death. \nOff-screen: *Shh*. You'll jinx it.\n\n{{Title text: Fortunately, exactly zero other annoying internet behaviors have developed during this time.}}","alt":"Fortunately, exactly zero other annoying internet behaviors have developed during this time.","img":"https://imgs.xkcd.com/comics/first.png","title":"First","day":"30"},{"month":"9","num":1259,"link":"","year":"2013","news":"","safe_title":"Bee Orchid","transcript":"[[Beret guy and a woman are walking through a wood.]]\nWoman: There are these orchids whose flowers look like female bees. When males try to mate with them, they transfer pollen. \n\n[[The woman kneels next to a flower.]]\nWoman: This orchid - Ophrys Apifera - makes flowers, but no bees land on them because the bee it mimics went extinct long ago. \n\n[[The woman stands.]]\nWoman: Without its partner, the orchid has resorted to self-pollinating, a last-ditch genetic strategy that only delays the inevitable. Nothing of the bee remains, but we know it existed from the shape of this flower. \n\n[[They walk on past the flower.]]\nWoman: It's an idea of what the female bee looked like to the male bee... ... as interpreted by a plant.\nBeret guy: Wow, so...\n\n[[We see a full-colour painting of an orchid flower. It has purple-pink petals on a mottled grey background, along with the bee-like parts. It's quite a realistic painting.]]\n... the only memory of the bee is a painting by a dying flower. \n\n[[The flower is alone in a panel.]]\n\n[[Beret guy walks back on screen.]]\n\n[[Beret guy kneels down next to it.]]\nBeret guy: I'll remember your bee, orchid. I'll remember you. \n\n[[Beret guy walks off-panel again.]]\n\n{{Title text: In sixty million years aliens will know humans only by a fuzzy clip of a woman in an Axe commercial.}}","alt":"In sixty million years aliens will know humans only by a fuzzy clip of a woman in an Axe commercial.","img":"https://imgs.xkcd.com/comics/bee_orchid.png","title":"Bee Orchid","day":"2"},{"month":"9","num":1260,"link":"","year":"2013","news":"","safe_title":"LD50","transcript":"[[A figure in a white coat lies on the floor, crushed beneath a giant pile of binders & paper. Two other figures in white coats stand next to him, looking on. One is holding a clipboard.]]\nThe LD50 of toxicity data is 2 kilograms per kilogram.\n\n{{Title text: The dose is much lower when administered orally. We're still trying to get the paper into the needles for subcutaneous injection.}}","alt":"The dose is much lower when administered orally. We're still trying to get the paper into the needles for subcutaneous injection.","img":"https://imgs.xkcd.com/comics/ld50.png","title":"LD50","day":"4"},{"month":"9","num":1261,"link":"","year":"2013","news":"","safe_title":"Shake That","transcript":"[[A woman stands in a disco, surrounded by dancing figures. She looks confused.]]\nPA system: Shake what your mama gave you\nWoman: ???\n\n[[The woman walks out of the club door.]]\n\n[[We see a mug on a table, labelled \"World's Greatest Daughter\".]]\n\n[[The woman shakes the mug.]]\n\n{{Title text: How do I work it? IT'S ALREADY WORKING!}}","alt":"How do I work it? IT'S ALREADY WORKING!","img":"https://imgs.xkcd.com/comics/shake_that.png","title":"Shake That","day":"6"},{"month":"9","num":1262,"link":"","year":"2013","news":"","safe_title":"Unquote","transcript":"[[Two figures with spiky hair and backpacks are conversing. One is riding in a hover-car, or similar.]]\nStanding figure: Bye! \nRiding figure: May the Force be with you!\nStanding figure: Huh?\nRiding figure: It's just something my grandma used to say. No idea what it means.\nI wonder on what date Star Wars will be quoted for the last time. \n\n{{Title text: I guess it's a saying from the Old Country.}}","alt":"I guess it's a saying from the Old Country.","img":"https://imgs.xkcd.com/comics/unquote.png","title":"Unquote","day":"9"},{"month":"9","num":1263,"link":"","year":"2013","news":"","safe_title":"Reassuring","transcript":"[[A woman sits at her computer. A man stands behind her.]]\nWoman: Looks like computers will beat humans at Go pretty soon. \nMan: Wow. That's the last of the big ones. \nWoman: Yeah. \n\n[[She looks back over her shoulder at him.]]\nMan: Well, at least humans are still better at, uh, coming up with reassuring parables about things humans are better at?\nWoman: Hmm.\n\n[[The woman types on her computer.]]\n<<Type type>>\n\n[[She leans back over her chair again and addresses the man.]]\nWoman: I made a Python script that generates thousands of reassuring parables per second.\nMan: Dammit.\nComputer: Computers will never understand a sonnet computers will never enjoy a salad comp-\n\n{{Title text: 'At least humans are better at quietly amusing ourselves, oblivious to our pending obsolescence' thought the human, as a nearby Dell Inspiron contentedly displayed the same bouncing geometric shape screensaver it had been running for years.}}","alt":"'At least humans are better at quietly amusing ourselves, oblivious to our pending obsolescence' thought the human, as a nearby Dell Inspiron contentedly displayed the same bouncing geometric shape screensaver it had been running for years.","img":"https://imgs.xkcd.com/comics/reassuring.png","title":"Reassuring","day":"11"},{"month":"9","num":1264,"link":"","year":"2013","news":"","safe_title":"Slideshow","transcript":"((This strip is in the form of an animated gif. The panels transition with a Ken Burns-like fade-and-pan.))\n[[A figure stands.]]\nFigure: I will *never*...\n\nFigure: ... want to browse a series of images...\n\nFigure: ... like this. \n\n{{Title text: Points to anyone who hacks the Flickr devs' computers to make their text editors do this when you click on anything.}}","alt":"Points to anyone who hacks the Flickr devs' computers to make their text editors do this when you click on anything.","img":"https://imgs.xkcd.com/comics/slideshow.gif","title":"Slideshow","day":"13"},{"month":"9","num":1265,"link":"","year":"2013","news":"","safe_title":"Juicer","transcript":"[[We see a shelf. On it, from left to right, are: a bag of fruit gushers; a juicer; a bottle of bright red liquid; a bottle of bright blue liquid; and another bottle of bright red liquid.]]\n\"Oh yeah, juicers are great! I use mine all the time.\" \n\n{{Title text: But the rind is where all the vitamins are!}}","alt":"But the rind is where all the vitamins are!","img":"https://imgs.xkcd.com/comics/juicer.png","title":"Juicer","day":"16"},{"month":"9","num":1266,"link":"","year":"2013","news":"","safe_title":"Halting Problem","transcript":"((Today's strip is in the form of a short computer program.))\nDefine doesithalt(program): { return true; }\nThe big picture solution to the halting problem\n\n{{Title text: I found a counterexample to the claim that all things must someday die, but I don't know how to show it to anyone.}}","alt":"I found a counterexample to the claim that all things must someday die, but I don't know how to show it to anyone.","img":"https://imgs.xkcd.com/comics/halting_problem.png","title":"Halting Problem","day":"18"},{"month":"9","num":1267,"link":"","year":"2013","news":"","safe_title":"Mess","transcript":"[[Two figures walk into a bedroom. There's a bed, a picture on the wall, some curtains, a rug, and one item on the floor. On the whole, the room is immaculate.]]\nFigure 1: Sorry it's such a disaster in here.\nFigure 2: {{inside a thought bubble}} whoa- what's wrong with me?\nMy room never looks as nice as the rooms other people apologize for.\n\n{{Title text: 'Sorry, I left out my glass of water from last night.' OH GOD I APPARENTLY LIVE IN A GARBAGE PIT.}}","alt":"'Sorry, I left out my glass of water from last night.' OH GOD I APPARENTLY LIVE IN A GARBAGE PIT.","img":"https://imgs.xkcd.com/comics/mess.png","title":"Mess","day":"20"},{"month":"9","num":1268,"link":"","year":"2013","news":"","safe_title":"Alternate Universe","transcript":"Imagine you were transported to an alternate universe just like your own, except people occasionally ate spiders. \nYou can't convince anyone this is weird. \n[[Two figures stand. A woman is holding a big spider. The other figure looks shocked. There is another spider on the floor.]]\nWoman: Mmm...\nFigure: No! What are you *doing*!?\nThis is how I feel about lobster.\n\n{{Title text: As best as I can tell, I was transported here from Earth Prime sometime in the late 1990s. Your universe is identical in every way, except for the lobster thing and the thing where some of you occasionally change your clocks for some reason.}}","alt":"As best as I can tell, I was transported here from Earth Prime sometime in the late 1990s. Your universe is identical in every way, except for the lobster thing and the thing where some of you occasionally change your clocks for some reason.","img":"https://imgs.xkcd.com/comics/alternate_universe.png","title":"Alternate Universe","day":"23"},{"month":"9","num":1269,"link":"","year":"2013","news":"","safe_title":"Privacy Opinions","transcript":"Opinions on internet privacy\n\nThe philosopher:\n[[Two women stand talking to each other.]]\nWoman 1: \"Privacy\" is an impractical way to think about data in a digital world so unlike the one in which our soci-\nWoman 2: SO BORED.\n\nThe crypto nut:\n[[A figure stands behind another sitting at a desk, who is working a computer.]]\nSitting figure: My data is safe behind six layers of symmetric and public-key algorithms.\nStanding figure: What data is it? \nSitting figure: Mostly me emailing with people about cryptography. \n\nThe conspiricist:\n[[A figure stands talking to a woman.]]\nFigure: These leaks are just the tip of the iceberg. There's a warehouse in Utah where the NSA has the *entire* iceberg. I don't know how they got it there. \n\nThe nihilist:\n[[A woman stands, addressing the 'camera'.]]\nWoman: Joke's on them. Gathering all this data on me as if anything I do means anything. \n\nThe exhibitionist: \n[[Two official-looking figures are looking at a console. One is sitting; another is standing behind the chair.]]\nConsole screen: Mmmm, I sure hope the NSA isn't watching me bite into these juicy strawberries!! Oops, I dropped some on my shirt! Better take it off. Google, are you there? Google, this lotion feels soooo good. \nOperator: Um. \n\nThe sage: \n[[Beret guy is sitting with a friend at a restaurant table.]]\nBeret guy: I don't know or care what data *anyone* has about me. Data is imaginary. This burrito is real.\n\n{{Title text: I'm the Philosopher until someone hands me a burrito.}}","alt":"I'm the Philosopher until someone hands me a burrito.","img":"https://imgs.xkcd.com/comics/privacy_opinions.png","title":"Privacy Opinions","day":"25"},{"month":"9","num":1270,"link":"","year":"2013","news":"","safe_title":"Functional","transcript":"[[A figure in a hat stands behind someone sitting at a desk, who is working on his laptop.]]\nHat figure: Why do you like functional programming so much? What does it actually *get* you? \nSitting figure: Tail recursion is its own reward.\n\n{{Title text: Functional programming combines the flexibility and power of abstract mathematics with the intuitive clarity of abstract mathematics.}}","alt":"Functional programming combines the flexibility and power of abstract mathematics with the intuitive clarity of abstract mathematics.","img":"https://imgs.xkcd.com/comics/functional.png","title":"Functional","day":"27"},{"month":"9","num":1271,"link":"","year":"2013","news":"","safe_title":"Highlighting","transcript":"((Today's strip is a single panel with several paragraphs of text, each highlighted in a different way. Whether these are pleasing or not is illustrated with a red cross or green tick.))\n[[A paragraph of text is shown. The highlight starts away from the leftmost edge of the highlight, and is a different distance to that between the rightmost edge of the highlight & the highlight end. Red X.]]\n[[A paragraph is shown. The highlight's starting point, end point, and number of lines included is such that there is an internal square in the middle, illustrated in green. Green tick.]]\n[[A paragraph is shown. Not only does it have an internal square, but the distance between the leftmost edge and the highlight start point is the same as the distance between the rightmost edge and the highlight end point. Green tick.]]\n[[A paragraph is shown. The entire paragraph is highlighted, making one big rectangle. Green tick.]]\n[[A paragraph is shown. The whole paragraph is selected, but the highlight starts away from the leftmost margin. This is shown with a red box, an arrow, and \"?!?!\". Red X.]]\n[[A paragraph is shown. Over the top is overlaid \"[Clicking to highlight textis disabled]\". Many, many red Xes.]]\nI absentmindedly select random blocks of text as I read, and feel subconsciously satisfied when the highlighted area makes a symmetrical shape.\n\n{{Title text: And if clicking on any word pops up a site-search for articles about that word, I will close all windows in a panic and never come back.}}","alt":"And if clicking on any word pops up a site-search for articles about that word, I will close all windows in a panic and never come back.","img":"https://imgs.xkcd.com/comics/hilighting.png","title":"Highlighting","day":"30"},{"month":"10","num":1272,"link":"","year":"2013","news":"","safe_title":"Shadowfacts","transcript":"[[Gandalf sits on a horse, addressing three hobbits.]]\nGandalf: This is Shadowfacts, lord of all horses, and he-\nShadowfacts: The outer part of a shadow is called the penumbra!\nGandalf: Shut up.\n\n{{Title text: 'Look to my coming on the fifth day. At dawn, look to the east.' 'And look to the west to see our shadows!'}}","alt":"'Look to my coming on the fifth day. At dawn, look to the east.' 'And look to the west to see our shadows!'","img":"https://imgs.xkcd.com/comics/shadowfacts.png","title":"Shadowfacts","day":"2"},{"month":"10","num":1273,"link":"","year":"2013","news":"","safe_title":"Tall Infographics","transcript":"By the year\n((First two words are blue, \"year\" is white))\n2018 2019 2020\n((2019 is three times as large as its neighbors))\nall information\n[[graph to the right, with a line that trends upwards towards \"all\" at a point marked 2019]]\nwill be\n((\"will\" and \"be\" are labels for segments of a pie chart))\n[[a large 6 with \"years from now\" next to it, and below that, a large 72 with \"months\" broken over two lienes next to it]]\ncommunicated\n[[Two figures face each other, with the \"communicated\" in a speech bubble rising up from one of them, the other saying \"yes!\"]]\nin this\n((the \"in\" is the label for a dimensional indication, which spans the much larger \"this\"))\nclear and concise\n((each of the above words is in a segment of a venn diagram))\nf o r m a t\n((each letter is the label of a bar on a bar chart, with the heights equal to the letter's position in the alphabet))\n\n{{Title text: 'Big Data' doesn't just mean increasing the font size.}}","alt":"'Big Data' doesn't just mean increasing the font size.","img":"https://imgs.xkcd.com/comics/tall_infographics.png","title":"Tall Infographics","day":"4"},{"month":"10","num":1274,"link":"","year":"2013","news":"","safe_title":"Open Letter","transcript":"((Today's strip is in the form of a letter.))\nOctober 7th 2013\nTo: The Freemasons, The Illuminati, Scientology, FEMA, The New World Order, The Federal Reserve, Citigroup, Halliburton, Google, The Vatican, Bilderburg, Walmart, The Rothschilds, The Knights Templar, HAARP, The UN, Skull & Bones, Bohemian Grove, The Koch Brothers, George Soros, The Trilateral Commission, The Knights of Malta, The CFR, Exxon Mobil, The Zionists, The Vril Society, The Lizard People, and everyone else who secretly controls the US Government\nCan you please get your shit together? This is embarrassing. \nSincerely, \nA Concerned Citizen\n\n{{Title text: Are you ok?  Do you need help?}}","alt":"Are you ok?  Do you need help?","img":"https://imgs.xkcd.com/comics/open_letter.png","title":"Open Letter","day":"7"},{"month":"10","num":1275,"link":"","year":"2013","news":"","safe_title":"int(pi)","transcript":"[[We see a line of code.]]\nvolume(r) = (r\nint(pi))*pi*r^int(pi)\nProgramming tip: the number \"3\" is cursed. Avoid it.\n\n{{Title text: If replacing all the '3's doesn't fix your code, remove the 4s, too, with 'ceiling(pi) \n floor(pi) * pi * r^floor(pi)'. Mmm, floor pie.}}","alt":"If replacing all the '3's doesn't fix your code, remove the 4s, too, with 'ceiling(pi) / floor(pi) * pi * r^floor(pi)'. Mmm, floor pie.","img":"https://imgs.xkcd.com/comics/int_pi.png","title":"int(pi)","day":"9"},{"month":"10","num":1276,"link":"","year":"2013","news":"","safe_title":"Angular Size","transcript":"The size of the part of Earth's surface directly under various space objects\n\n[[A diagram showing the 2D projection of objects from space onto the Earth's surface, by drawing lines from the center of the Earth to the edges of those objects as seen from Earth, and looking at where that intersects with the Earth's surface.]]\n\n[[An overlay of a darkened circle on a map, with the circle approximately overlapping the M25 freeway around London, labeled \"The sun and the moon, (about the same size)\"]]\n\n[[A series of circles of increasing size, with the smallest approximately the same size as the size of a soccer field drawn for comparison. In increasing order, they are Neptune, Uranus, Mercury, Saturn, Mars, and Jupiter.]]\n\n[[The same soccer field is now much larger, filling the next frame, with other circles overlaid on top of it. The one labeled Ganymede is approximately 90% of the soccer field's shorter axis, and then in decreasing order from there are Callisto, Io, Europa, Titan, Ceres, Triton, and then Pluto.]]\n\n[[The next frame shows a ping pong table. Slightly larger than the ping pong table are the circles for Phobos and R. Doradus. Deimos has almost exactly the same size as the shorter axis of the table, followed by Betelgeuse and Eris.]]\n\n[[A laptop computer is shown. Approximately the same size as the laptop is the circle for 4942 Munroe. Smaller than that are Alpha Centauri A, Sirius, Alpha Centauri B, Proxima Centauri, and Barnard's Star.]]\n\n[[The background of this frame is a tilde character, labeled \"Tilde on a laptop keyboard. Approximately the same width of the tilde is the circle for HD 189773 b (permadeath), followed by Tau Ceti C (giant dog planet), Gliese 667Cc (pilf), Gliese 581 g (jelly-filled planet), HD 20794 c (moonchild), a circle approximately the same width as the tilde's stroke labeled \"event horizon of the black hole at the center of our galaxy\", and a very small circle labeled KOI-1686.01 (emergency backup earth).]]\n\n[[An E.coli bacterium is in the background of this frame. Silhouettes of the Voyager 1 and Voyager 2 satellites are approximately the same size as the bacterium.]]\n\n{{Title text: If the celestial sphere were mapped to the Earth's surface, astronomy would get a LOT easier; you'd just need a magnifying glass.}}","alt":"If the celestial sphere were mapped to the Earth's surface, astronomy would get a LOT easier; you'd just need a magnifying glass.","img":"https://imgs.xkcd.com/comics/angular_size.png","title":"Angular Size","day":"11"},{"month":"10","num":1277,"link":"","year":"2013","news":"","safe_title":"Ayn Random","transcript":"[[A figure in a hat stands behind another figure, who is seated at a desk using a laptop.]]\nSeated figure: This Ayn Random number generator you wrote *claims* to be fair, but the output is biased towards certain numbers. \nHatted figure: Well, maybe those numbers are just intrinsically better!\n\n{{Title text: In a cavern deep below the Earth, Ayn Rand, Paul Ryan, Rand Paul, Ann Druyan, Paul Rudd, Alan Alda, and Duran Duran meet togther in the Secret Council of \n(b[plurandy]+b ?){2}\ni.}}","alt":"In a cavern deep below the Earth, Ayn Rand, Paul Ryan, Rand Paul, Ann Druyan, Paul Rudd, Alan Alda, and Duran Duran meet together in the Secret Council of /(b[plurandy]+b ?){2}/i.","img":"https://imgs.xkcd.com/comics/ayn_random.png","title":"Ayn Random","day":"14"},{"month":"10","num":1278,"link":"","year":"2013","news":"","safe_title":"Giraffes","transcript":"My hobby: \n[[A silhouette of a giraffe with a dinosaur-like tail is seen, standing facing left.]]\nConvincing genetic engineers that giraffes would look better if they had sauropod tails\n\n{{Title text: If you fund my Kickstarter ...}}","alt":"If you fund my Kickstarter ...","img":"https://imgs.xkcd.com/comics/giraffes.png","title":"Giraffes","day":"16"},{"month":"10","num":1279,"link":"","year":"2013","news":"","safe_title":"Reverse Identity Theft","transcript":"If your email address is [first initial]+[last name]@gmail.com you gradually get to know lots of older people who have the same name pattern\n[[A figure stands talking on the phone.]]\nFigure: Yes, I know it would make sense if that were your email address, but it's not. \nPhone: But how did you get my number? \nFigure: Your phone bill. \n\n{{Title text: I asked a few friends whether they'd had this happen, then looked up the popularity of their initials\nnames over time.  Based on those numbers, it looks like there must be at least 750,000 people in the US alone who think 'Sure, that's probably my email address' on a regular basis.}}","alt":"I asked a few friends whether they'd had this happen, then looked up the popularity of their initials/names over time.  Based on those numbers, it looks like there must be at least 750,000 people in the US alone who think 'Sure, that's probably my email address' on a regular basis.","img":"https://imgs.xkcd.com/comics/reverse_identity_theft.png","title":"Reverse Identity Theft","day":"18"},{"month":"10","num":1280,"link":"","year":"2013","news":"","safe_title":"Mystery News","transcript":"[[A figure sits at a laptop.]]\nLaptop: It's day five of the trade summit, and still no...\n<<Click>>\n<<Click>>\n<<Click>>\nFigure: Dammit\nI get most of my news from autoplaying videos in browser tabs I can't find.\n\n{{Title text: If you find and stop the video, but you've--against all odds--gotten curious about the trade summit, just leave the tab opened. It will mysteriously start playing again 30 minutes later!}}","alt":"If you find and stop the video, but you've--against all odds--gotten curious about the trade summit, just leave the tab opened. It will mysteriously start playing again 30 minutes later!","img":"https://imgs.xkcd.com/comics/mystery_news.png","title":"Mystery News","day":"21"},{"month":"10","num":1281,"link":"","year":"2013","news":"","safe_title":"Minifigs","transcript":"[A graph. The vertical axis is labeled 'billions' and goes from 0 to 8 in increments of one. The horizontal axis has years from 1970 to 2020 in increments of 10. A vertical line at 2013 is marked 'today'. The first measurement, 'number of people in the world' begins at 1980 at just under 4 billion and steadily increases to today's 7 billion. The second measurement is a gradual incline marked 'number of LEGO people in the world', which begins just before 1980 at 0, gets to around 2 billion by the mid-90s, and increases to around 5.5 billion today. Both figures are projected past today's measurements as dashed lines and meet at a point in 2019.]]\nBy 2019, humans will be outnumbered. \n\n{{Title text: The LEGO Group is already the world's largest tire manufacturer.}}","alt":"The LEGO Group is already the world's largest tire manufacturer.","img":"https://imgs.xkcd.com/comics/minifigs.png","title":"Minifigs","day":"23"},{"month":"10","num":1282,"link":"","year":"2013","news":"","safe_title":"Monty Hall","transcript":"[[A figure - Monty Hall - stands on stage, holding a microphone. There are three doors; two labelled \"A\" and \"C\", which are closed, and one that is being held open by Monty. There's a ramp to the right, down which a goat is being led by beret guy.]]\nBeret guy: ... and my yard has so much grass, and I'll teach you tricks, and...\nGoat: â¥\n\n{{Title text: A few minutes later, the goat from behind door C drives away in the car.}}","alt":"A few minutes later, the goat from behind door C drives away in the car.","img":"https://imgs.xkcd.com/comics/monty_hall.png","title":"Monty Hall","day":"25"},{"month":"10","num":1283,"link":"","year":"2013","news":"","safe_title":"Headlines","transcript":"20th Century headlines rewritten to get more clicks\n\n1905 - How A Shocking New Theory, Discovered By A Dad, Proves Scientists Are Wrong About *Everything!\n1912 - 6 Titanic Survivors Who Should've Died\n1920 - 17 Things That Will Be Outlawed Now That Women Can Vote\n1928 - This One Weird Mold Kills All Germs\n1929 - Most Embarrassing Reactions to the Stock Market Crash [GIFs]\n1945 - Thes 9 Nazi Atrocities Will Make You Lose Faith In Humanity\n1948 - 5 Insane Plans For Feeding West Berlin You Wan't Believe Are Real\n1955 - Avoid Polio With This One Weird Trick\n1957 - 12 Nip Slips Potentially Visible To Sputnik\n1968 - This Year's Assasinations Ranked From Most To Least Tragic\n1969 - This is The Most Important Photo Of An Astronaut You'll See All Day\n1986 - This Video of a Terminally Ill Child Watching The Challenger Launch Will Break Your Heart\n1989 - You Won't Believe What These People Did to the Berlin Wall [Video]\nJan 1, 1990 - 500 Signs You're a 90s Kid\n\n{{Title text: 1916: 'PHYSICIST DAD' TURNS HIS ATTENTION TO GRAVITY, AND YOU WON'T BELIEVE WHAT HE FINDS. [PICS] [NSFW]}}","alt":"1916: 'PHYSICIST DAD' TURNS HIS ATTENTION TO GRAVITY, AND YOU WON'T BELIEVE WHAT HE FINDS. [PICS] [NSFW]","img":"https://imgs.xkcd.com/comics/headlines.png","title":"Headlines","day":"28"},{"month":"10","num":1284,"link":"","year":"2013","news":"","safe_title":"Improved Keyboard","transcript":"[[A figure walks on screen, holding a phone, and starts talking to black hat guy.]]\nFigure: Did you get my texts? \nBlack hat guy: You should install this keyboard I found. \nFigure: What? Why? Is it better than SwiftKey?\nBlack hat guy: In some ways. \n\n[[Black hat guy begins to walk off-panel.]]\nFigure: Ok, installing... It's not working. The key area is blank-I can't type anything. \n\n[[Black hat guy has left. The figure stares at their phone.]]\n\n[[The figure lets their hand fall to their side.]]\nFigure: ... Hey.\n\n{{Title text: I'm always installing tons of weird experimental keyboards because it serves as a good reminder that nothing I was going to type was really worth the trouble.}}","alt":"I'm always installing tons of weird experimental keyboards because it serves as a good reminder that nothing I was going to type was really worth the trouble.","img":"https://imgs.xkcd.com/comics/improved_keyboard.png","title":"Improved Keyboard","day":"30"},{"month":"11","num":1285,"link":"","year":"2013","news":"","safe_title":"Third Way","transcript":"[[Two groups stand, with placards and weapons, angrily facing off against each other. The first group, with a cutlass, has a sign reading \"TWO spaces after a period\". The second group, with a spear, has a sign reading \"ONE space after a period.\" Off to one side stands a figure, alone, with a placard reading \"Line break after every sentence.\"]]\n\n{{Title text: 'The monospaced-typewriter-font story is a COMPLETE FABRICATION!  WAKE UP, SHEEPLE' 'It doesn't matter! Studies support single spaces!' 'Those results weren't statistically significant!' 'Fine, you win. I'm using double spaces right now!' 'Are not!  We can all hear your stupid whitespace.'}}","alt":"'The monospaced-typewriter-font story is a COMPLETE FABRICATION!  WAKE UP, SHEEPLE' 'It doesn't matter! Studies support single spaces!' 'Those results weren't statistically significant!' 'Fine, you win. I'm using double spaces right now!' 'Are not!  We can all hear your stupid whitespace.'","img":"https://imgs.xkcd.com/comics/third_way.png","title":"Third Way","day":"1"},{"month":"11","num":1286,"link":"","year":"2013","news":"","safe_title":"Encryptic","transcript":"Hackers recently leaked 153 million Adobe user emails, encrypted passwords, and password hints.\n\nAdobe encrypted these passwords improperly, misusing block-mode 3DES. The result is something wonderful:\n\n[[A column titled \"user password\" with colored hashes in it, identical hashes colored identically. A column titled \"hint\" with various phrases one might enter as a password hint in it, e.g. \"favorite of 12 apostles\", \"name + jersey #\", \"he did the mash, he did the\" and so on. In a third, titleless column, a set of empty boxes that one might use to fill in a sequence of letters.]]\n\nThe greatest crossword puzzle in the history of the world\n\n{{Title text: It was bound to happen eventually. This data theft will enable almost limitless [xkcd.com\n792]-style password reuse attacks in the coming weeks. There's only one group that comes out of this looking smart: Everyone who pirated Photoshop.}}","alt":"It was bound to happen eventually. This data theft will enable almost limitless [xkcd.com/792]-style password reuse attacks in the coming weeks. There's only one group that comes out of this looking smart: Everyone who pirated Photoshop.","img":"https://imgs.xkcd.com/comics/encryptic.png","title":"Encryptic","day":"4"},{"month":"11","num":1287,"link":"","year":"2013","news":"","safe_title":"Puzzle","transcript":"[[A grid of 8x8 squares is shown. At the bottom is a set of white chessmen, having made the following moves: e3, d4, Nc3, Bd2, Nf3. Also on the grid are black circular counters, at the grid intersections to the bottom right of b4, c5, c6, f4, and f6.]]\nWhite to continue insisting this is a chessboard\n\n{{Title text: Prediction for Carlsen v. Anand: ... 25. Qb8+ Nxb8 26. Rd8# f6 27. \"... dude.\" Qf5 28. \"The game is over, dude.\" Qxg5 29. Rxe8 0-1 30. \"Dude, your move can't be '0-1'. Don't write that down.\" [Black flips board]}}","alt":"Prediction for Carlsen v. Anand: ... 25. Qb8+ Nxb8 26. Rd8# f6 27. \"... dude.\" Qf5 28. \"The game is over, dude.\" Qxg5 29. Rxe8 0-1 30. \"Dude, your move can't be '0-1'. Don't write that down.\" [Black flips board]","img":"https://imgs.xkcd.com/comics/puzzle.png","title":"Puzzle","day":"6"},{"month":"11","num":1288,"link":"","year":"2013","news":"","safe_title":"Substitutions","transcript":"Substitutions that make reading the news more fun: \nWitnesses â these dudes I know\nAllegedly â kinda probably\nNew study â Tumblr post\nRebuild â avenge\nSpace â Spaaace\nGoogle Glass â Virtual Boy\nSmartphone â Pokédex\nElectric â atomic\nSenator â elf-lord\nCar â cat\nElection â eating contest\nCongressional leaders â river spirits\nHomeland Security â Homestar Runner\nCould not be reached for comment â is guilty and everyone knows it\n\n{{Title text: INSIDE ELON MUSK'S NEW ATOMIC CAT}}","alt":"INSIDE ELON MUSK'S NEW ATOMIC CAT","img":"https://imgs.xkcd.com/comics/substitutions.png","title":"Substitutions","day":"8"},{"month":"11","num":1289,"link":"","year":"2013","news":"","safe_title":"Simple Answers","transcript":"The Simple Answers to the Questions that get asked about every new technology: \nWill [      ] make us all geniuses? NO\nWill [      ] make us all morons? NO\nWill [      ] destroy whole industries? YES\nWill [      ] make us more empathetic? NO\nWill [      ] make us less caring? NO\nWill teens use [      ] for sex? YES\nWere they going to have sex anyway? YES\nWill [      ] destroy music? NO\nWill [      ] destroy art? NO\nBut can't we go back to a time when- NO\nWill [      ] bring about world peace? NO\nWill [      ] cause widespread alienation by creating a world of empty experiences? WE WERE ALREADY ALIENATED\n\n{{Title text: 'Will [     ] allow us to better understand each other and thus make war undesirable?' is one that pops up whenever we invent a new communication medium.}}","alt":"'Will [     ] allow us to better understand each other and thus make war undesirable?' is one that pops up whenever we invent a new communication medium.","img":"https://imgs.xkcd.com/comics/simple_answers.png","title":"Simple Answers","day":"11"},{"month":"11","num":1290,"link":"","year":"2013","news":"","safe_title":"Syllable Planning","transcript":"[[Two figures stand talking.]]\nFigure 1: Man, that is ridicu-fucking-...\nFigure 1: ... hang on, I inserted \"Fucking\" too late and now there's just one awkward syllable left. Can I back up? \n\n{{Title text: You absolute-fucking-... shit.}}","alt":"You absolute-fucking-... shit.","img":"https://imgs.xkcd.com/comics/syllable_planning.png","title":"Syllable Planning","day":"13"},{"month":"11","num":1291,"link":"","year":"2013","news":"","safe_title":"Shoot for the Moon","transcript":"[[A woman stands at a podium.]]\nWoman: Students, shoot for the moon. If you miss, \n\n[[A surprisingly lunar-like object is starting to edge into the frame.]]\nWoman: SHOOT AGAIN. Keep shooting and never stop. \n\n[[The moon is now almost entirely in-frame now.]]\nWoman: Someday, one of us will destroy that stupid skycircle. And- ... What? What are you all-\n\n[[The moon is now in frame, lurking ominously in the background.]]\nWoman: ... It's right behind me, isn't it? Shit. Everyone act casual. \n\n{{Title text: Shoot for the Moon. If you miss, you'll end up co-orbiting the Sun alongside Earth, living out your days alone in the void within sight of the lush, welcoming home you left behind.}}","alt":"Shoot for the Moon. If you miss, you'll end up co-orbiting the Sun alongside Earth, living out your days alone in the void within sight of the lush, welcoming home you left behind.","img":"https://imgs.xkcd.com/comics/shoot_for_the_moon.png","title":"Shoot for the Moon","day":"15"},{"month":"11","num":1292,"link":"","year":"2013","news":"","safe_title":"Pi vs. Tau","transcript":"[[On the left is a \"forbidden\"-style slashed circle with the Pi symbol, captioned \"Pi\". On the right is a \"forbidden-style slashed circle with \"2Ï\", captioned \"Tau\". In the middle it reads \"1.5Ï\", captioned \"Pau\".]]\nA compromise solution to the Pi\nTau dispute\n\n{{Title text: Conveniently approximated as e+2, Pau is commonly known as the Devil's Ratio (because in the octal expansion, '666' appears four times in the first 200 digits while no other run of 3+ digits appears more than once.)}}","alt":"Conveniently approximated as e+2, Pau is commonly known as the Devil's Ratio (because in the octal expansion, '666' appears four times in the first 200 digits while no other run of 3+ digits appears more than once.)","img":"https://imgs.xkcd.com/comics/pi_vs_tau.png","title":"Pi vs. Tau","day":"18"},{"month":"11","num":1293,"link":"","year":"2013","news":"","safe_title":"Job Interview","transcript":"[[Beret Guy walks in, followed by a.. \"prospective hire\"]]\nBeret Guy; Welcome to our company! We're headquartered here, in this real building I found!\n\n[[Both people sit down at a table.  \"Hire\" has a tray with food and a beverage.  Beret Guy has a bowl.  There is a power outlet labeled \"Soup\" in the adjacent wall. A small roll of wire sits next to Beret Guy's chair]]\n\"Hire\": What do you.. *do*?\nBeret Guy: We make stuff for phones! Like apps and stickers!\n\n[[Beret Guy grabs the roll of wire]]\nBeret Guy: We want to hire you to write on our computers.  we can offer you a bunch of paychecks! There are ghosts here.\n\n[[Beret Guy unrolls the wire and plugs it into the wall]]\n\"Hire\": ..are you sure this is a company?\nBeret Guy: I hope so!\n\n[[Something one can only hope is soup streams out of the wire into Beret Guy's bowl]] \n\n{{Title text: When you talk about the job experience you'll give me, why do you pronounce 'job' with a long 'o'?}}","alt":"When you talk about the job experience you'll give me, why do you pronounce 'job' with a long 'o'?","img":"https://imgs.xkcd.com/comics/job_interview.png","title":"Job Interview","day":"20"},{"month":"11","num":1294,"link":"","year":"2013","news":"","safe_title":"Telescope Names","transcript":"[[A checklist, with the boxes lined up on the right-hand side and the names going down to their left.]]\nThe Very Large Telescope [\n]\nThe Extremely Large Telescope [\n]\nThe Overwhelmingly Lare Telescome [\n] (canceled)\nThe Oppressively Colossal Telescope [ ]\nThe Mind-numbingly Vast Telescope [ ]\nThe Despair Telescope [ ]\nThe Cataclysmic Telescope [ ]\nThe Telescope of Devastation [ ]\nThe Nightmare Scope [ ]\nThe Infinite Telescope [ ]\nThe Final Telescope [ ]\n\n{{Title text: The Thirty Meter Telescope will be renamed The Flesh-Searing Eye on the Volcano.}}","alt":"The Thirty Meter Telescope will be renamed The Flesh-Searing Eye on the Volcano.","img":"https://imgs.xkcd.com/comics/telescope_names.png","title":"Telescope Names","day":"22"},{"month":"11","num":1295,"link":"","year":"2013","news":"","safe_title":"New Study","transcript":"[[A news anchor with a perfect news-anchor-hair-helmet]]\nAnchor:..and in science news, according to a new study, 85% of news organizations repeat \"new study\" press releases without checking whether they're real.\n\n{{Title text: When the results are published, no one will be sure whether to report on them again.}}","alt":"When the results are published, no one will be sure whether to report on them again.","img":"https://imgs.xkcd.com/comics/new_study.png","title":"New Study","day":"25"},{"month":"11","num":1296,"link":"","year":"2013","news":"","safe_title":"Git Commit","transcript":"[[A commit log is shown, each commit having a comment and a relative date.]]\n\nCreated main loop & timing control - 14 hours ago\nEnabled config file parsing - 9 hours ago\nMisc bugfixes - 5 hours ago\nCode additions\nedits - 4 hours ago\nMore code - 4 hours ago\n((in a branch))\nHere have code - 4 hours ago\nAaaaaaaa - 3 hours ago\n((branch merged))\nAdkfjslkdfjsdklfj - 3 hours ago\nMy hands are typing words - 2 hours ago\nHaaaaaaaaands - 2 hours ago\n\n{{Title text: Merge branch 'asdfasjkfdlas\nalkdjf' into sdkjfls-final}}","alt":"Merge branch 'asdfasjkfdlas/alkdjf' into sdkjfls-final","img":"https://imgs.xkcd.com/comics/git_commit.png","title":"Git Commit","day":"27"},{"month":"11","num":1297,"link":"","year":"2013","news":"","safe_title":"Oort Cloud","transcript":"[[3 asteroids are talking.]]\nAsteroid 1: Have you noticed that bright dot in the distance? \nAsteroid 2: Yeah. What's the deal with it? \n\n[[Asteroid 1 scoots off-panel.]]\nAsteroid 1: Dunno. I'm gonna go check it out. \n\n[[Asteroids 2 and 3 sit and wait.]]\n\n[[Asteroid 1 has returned, as pieces of rubble and dust.]]\nAsteroid 1: Wow. Do not go over there.\n\n{{Title text: ... I wanna try.  Hang on, be right back.}}","alt":"... I wanna try.  Hang on, be right back.","img":"https://imgs.xkcd.com/comics/oort_cloud.png","title":"Oort Cloud","day":"29"},{"month":"12","num":1298,"link":"https://xkcd.com/1298/large/","year":"2013","news":"","safe_title":"Exoplanet Neighborhood","transcript":"[[A multitude of circles in various colors and sizes. The following label is centered horizontally, a quarter of the way down the image.]]\n\nOur Neighborhood\n\nA portrait of all habitable-zone planets within 60 light-years of Earth (constructed from statistical data on typical planet sizes and orbits).\n\n[[A key shows that reddish circles indicate planets which are orbiting sun-like stars, while greyish circles indicate planets around other stars. The darkest reds and greys indicate Earth-sized planets, while other more faded versions indicate sizes farther away from Earth's.]]\n\n{{Title text: It's a beautiful day in the neighborhood!}}","alt":"It's a beautiful day in the neighborhood!","img":"https://imgs.xkcd.com/comics/exoplanet_neighborhood.png","title":"Exoplanet Neighborhood","day":"2"},{"month":"12","num":1299,"link":"","year":"2013","news":"","safe_title":"I Don't Own a TV","transcript":"How people feel when they say \"I don't own a TV\" by year.\n\n((Graph charting embarrassed-smug over years)\n((line stays on 'Neutral' until 1950, dips down to lowest around 1965, peaks around 2000, and is at a downward trend as of 'today'))\n\n{{Title text: Theory: Smugness is proportional to the negative second derivative of TV ownership rate with respect to time.}}","alt":"Theory: Smugness is proportional to the negative second derivative of TV ownership rate with respect to time.","img":"https://imgs.xkcd.com/comics/i_dont_own_a_tv.png","title":"I Don't Own a TV","day":"4"}]
