[{"month":"12","num":1300,"link":"","year":"2013","news":"","safe_title":"Galilean Moons","transcript":"[[A woman walks on-panel, up to a figure standing still. She has 4 small moons orbiting her.]]\nWoman: Check it out! \nFigure: What? \nWoman: I've got Galilean moons! \n\n[[Both figures stand still.]]\nMoon 1: Hi! \n\nMoon 2: Hi! \nMoon 1: What's your name? \n\nMoon 1: Hi! \nMoon 2: What's your-\nMoon 3: MOOOOOON!\n\nMoon 1: Hi! \nMoon 2: What's your name? \nMoon 4: Ugh\n\nMoon 1: Hi! \nMoon 4: So annoying\n\nMoon 1: Hi! \nMoon 2: What's y-\nMoon 3: MOOOOOON.\n\n[[Moon 4 is now halfway between the two figures.]]\nMoon 1: Hi! \nMoon 4: ...Almost... ...Almoooost...\n\n[[Moon 4 is now orbiting the figure.]]\nMoon 1: Hi! \nMoon 2: What's your name? \nMoon 4: Yessss!\n\n{{Title text: I'm SO glad I escaped. They almost had me caught in their weird ... thing.}}","alt":"I'm SO glad I escaped. They almost had me caught in their weird ... thing.","img":"https://imgs.xkcd.com/comics/galilean_moons.png","title":"Galilean Moons","day":"6"},{"month":"12","num":1301,"link":"","year":"2013","news":"","safe_title":"File Extensions","transcript":"Trustworthiness of information by file extension\n\n[[A series of ordered horizontal bars, most of which extend off to the right, with labels on the left. In order, they are .tex, .pdf, .csv, .txt, .svg, .xls\n.xlsx, .doc, .png, .ppt, .jpg, .jpeg, .gif - with the final two (.jpeg and .gif) extending to the left instead, as if intended to be negative values.]]\n\n{{Title text: I have never been lied to by data in a .txt file which has been hand-aligned.}}","alt":"I have never been lied to by data in a .txt file which has been hand-aligned.","img":"https://imgs.xkcd.com/comics/file_extensions.png","title":"File Extensions","day":"9"},{"month":"12","num":1302,"link":"","year":"2013","news":"","safe_title":"Year in Review","transcript":"[[A newscaster sits in a studio, with an inset reporter on the scene.]]\nNewscaster: We go live to our 2013: Year in review!\nOn-the-scene reporter: Thanks! In 2013, I didn't see an aurora.\nNewscaster: I- what?\n\nOn-the-scene reporter: The northern lights. I thought this would finally be the year. But it didn't happen. \n\nNewscaster: Oh. Uh... what about the rest of the year? \nOn-the-scene reporter: What do you mean? \nNewscaster: Any big news stories? \nOn-the-scene reporter: Oh yeah, tons. \n\n[[The inset reporter looks off screen. The newscaster looks at her.]]\n\nNewscaster: ... Well, that was 2013: Year in review.\nOn-the-scene reporter: The sky's clearing up. I'll be outside. \n\n{{Title text: All in all, I give this year a C-. There were no aurora visible from my house and that comet evaporated. They'd better not cancel the 2017 eclipse.}}","alt":"All in all, I give this year a C-. There were no aurora visible from my house and that comet evaporated. They'd better not cancel the 2017 eclipse.","img":"https://imgs.xkcd.com/comics/year_in_review.png","title":"Year in Review","day":"11"},{"month":"12","num":1303,"link":"","year":"2013","news":"","safe_title":"Profile Info","transcript":"[[A figure sits at a desk, using a computer. He's filling out a form. \"First name\": \"John\", \"Last name\": \"If-you-see-this-name-in-an-add-give-the-product-a-one-star-review-Smith\".]]\nHow to deal with companies harvesting your profile for marketing\n\n{{Title text: It's ok, they'll always let you opt out! Like they did with the YouTube real name profile thing.}}","alt":"It's ok, they'll always let you opt out! Like they did with the YouTube real name profile thing.","img":"https://imgs.xkcd.com/comics/profile_info.png","title":"Profile Info","day":"13"},{"month":"12","num":1304,"link":"","year":"2013","news":"","safe_title":"Glass Trolling","transcript":"[[A figure wearing glasses is looking at his phone.]]\nMy hobby: \nFigure: OK, Glass, check tomorrow's weather. Ooh, snow! \nOff-panel figure: Oh my God, it's somehow even more annoying than if you had it. \nSaying \"OK, Glass\" before everything while wearing regular glasses. \n\n{{Title text: Plus, when someone finally grabs your glasses and stomps on them, it costs way less than $1,500 to replace them.}}","alt":"Plus, when someone finally grabs your glasses and stomps on them, it costs way less than $1,500 to replace them.","img":"https://imgs.xkcd.com/comics/glass_trolling.png","title":"Glass Trolling","day":"16"},{"month":"12","num":1305,"link":"","year":"2013","news":"","safe_title":"Undocumented Feature","transcript":"An old Windows utility has an undocumented feature.\n[[Windows popup with \"Loading support forum...\" text and an hourglass icon.]]\nIf you open \"Help\" and click on the background, you get dropped into a \"support\" chat room.\n\nOnly a few of us ever found it.\n[[Background of a chat room, with lines like \"Morning!\", \"Hey!\", and \"You never finished that story\".]]\nBut we became friends.\n\nWe kept launching the program to check in.\n[[A figure sits with a laptop on the left side of the panel. Another figure looks at a monitor on the right side of the panel.]]\nEventually some of us were running VMs just to keep accessing it.\n\nAs the internet aged\n[[More background of a chat room, with lines like \"But none of us gets through li..\", \"You know?\", \"Yeah...\", \"You should talk to Kim about th...\", and \"I did\"]]\nSo did we\n\nWe don't know who runs the server. We don't know why it's still working so many years later.\n[[Three large question marks.]]\nMaybe we're some sysadmin's soap opera.\n\nIt will probably vanish someday\n[[5 figures floating randomly in a bubble.]]\nBut for now it's our meeting place\nOur hideaway\n\n[[Camera zooms out, with darker nodes and edges starting to come into view beyond the bubble.]]\nA life's worth of chat,\n\n[[Camera zooms out further. Many dark grey nodes and edges are visible, the bubble just a small space within them.]]\nBuried in the deep web.\n\nBut even if it lasts forever, we won't.\n[[A sunset.]]\nWhen we're gone, who will remember us?\n\nWho will remember this strange little world\n[[Two figures looking at each other inside a bubble.]]\nAnd the friendships we built here?\n\n[[Blank panel, except for centered text.]]\nNobody.\n\nThis place is irrelevant. Ephemeral.\n[[Panel with a bubble on it.]]\nOne day it will be forgotten\n\n[[Bubble begins to fade.]]\nAnd so will we\n\n[[Bubble continues to fade, only barely visible.]]\n\n[[Bubble disappears, leaving the panel blank.]]\n\n[[Blank panel, except for centered text.]]\nBut at least it doesn't have fucking video ads.\n\n{{Title text: And it doesn't pop up a box every time asking you to use your real name. In fact, there's no way to set your name at all. You just have to keep reminding people who you are.}}","alt":"And it doesn't pop up a box every time asking you to use your real name. In fact, there's no way to set your name at all. You just have to keep reminding people who you are.","img":"https://imgs.xkcd.com/comics/undocumented_feature.png","title":"Undocumented Feature","day":"18"},{"month":"12","num":1306,"link":"","year":"2013","news":"","safe_title":"Sigil Cycle","transcript":"[[A graph with a sine wave plotted on it. The y-axis is marked 'Odds that a word I type will start with some weird symbol' and the x-axis is marked 'Time ---->'. The first peak is labeled '$QBasic, the first trough is labeled 'C++'. The next peak is marked '$Bash, @$Perl, the next trough is marked 'Python'. The final peak says '+Google, @Twitter, #Hashtags'.]]\n\n{{Title text: The cycle seems to be 'we need these symbols to clarify what types of things we're referring to!' followed by 'wait, it turns out words already do that.'}}","alt":"The cycle seems to be 'we need these symbols to clarify what types of things we're referring to!' followed by 'wait, it turns out words already do that.'","img":"https://imgs.xkcd.com/comics/sigil_cycle.png","title":"Sigil Cycle","day":"20"},{"month":"12","num":1307,"link":"","year":"2013","news":"","safe_title":"Buzzfeed Christmas","transcript":"[[4 carollers stand in a line, singing songs.]]\nCarollers: 12 best drummers of all time\nCarollers: 11 pipers whose jaw-droppingly good piping will make you cry\nCarollers: You won't believe what these 10 lords leap over\nCarolers outside the Buzzfeed offices perform \"12 weird things I actually got for Christmas\"\n\n{{Title text: The 6 Weirdest Objects The Buzzfeed Writers Are Throwing Out Their Windows At Us}}","alt":"The 6 Weirdest Objects The Buzzfeed Writers Are Throwing Out Their Windows At Us","img":"https://imgs.xkcd.com/comics/buzzfeed_christmas.png","title":"Buzzfeed Christmas","day":"23"},{"month":"12","num":1308,"link":"","year":"2013","news":"","safe_title":"Christmas Lights","transcript":"[[Three figures sit around a large spectrum histogram, which has a general upward trend towards the infrared portion of the spectrum as well as a spike in that portion. To the right of the figures is a triangular shape approximating that of a Christmas tree made out of smaller spectrum histograms, each with spikes in places corresponding to the red or green sections of the visible spectrum. At the top is a final spectrum of whiter light.]]\n{{Title text: Merry Christmas from xkcd!}}","alt":"Merry Christmas from xkcd!","img":"https://imgs.xkcd.com/comics/christmas_lights.png","title":"Christmas Lights","day":"25"},{"month":"12","num":1309,"link":"","year":"2013","news":"","safe_title":"Infinite Scrolling","transcript":"[[A woman stands at a desk, reading a book, touching it very gingerly. Another figure is standing behind her.]]\nFigure: Why are you turning the pages like that? \nWoman: If I touch the wrong thing, I'll lose my place and have to start over.\nIf books worked like infinite-scrolling webpages\n\n{{Title text: Maybe we should give up on the whole idea of a 'back' button. 'Show me that thing I was looking at a moment ago' might just be too complicated an idea for the modern web.}}","alt":"Maybe we should give up on the whole idea of a 'back' button. 'Show me that thing I was looking at a moment ago' might just be too complicated an idea for the modern web.","img":"https://imgs.xkcd.com/comics/infinite_scrolling.png","title":"Infinite Scrolling","day":"27"},{"month":"12","num":1310,"link":"","year":"2013","news":"","safe_title":"Goldbach Conjectures","transcript":"[[In the center of the panel are the large words 'GOLDBACH CONJECTURES'. Around it are six boxes: two above it, and two on each side, one below the other. They read:\nWeak: Every odd number greather than 5 is the sum of three primes.\nStrong: Every even number greater than 2 is the sum of two primes.\nVery weak: Every number greater than 7 is the sum of two other numbers.\nVery strong: Every odd number is prime.\nExtremely weak: Numbers just \nkeep going\n.\nExtremely strong: There are no numbers above 7.\n\n{{Title text: The weak twin primes conjecture states that there are infinitely many pairs of primes. The strong twin primes conjecture states that every prime p has a twin prime (p+2), although (p+2) may not look prime at first. The tautological prime conjecture states that the tautological prime conjecture is true.}}","alt":"The weak twin primes conjecture states that there are infinitely many pairs of primes. The strong twin primes conjecture states that every prime p has a twin prime (p+2), although (p+2) may not look prime at first. The tautological prime conjecture states that the tautological prime conjecture is true.","img":"https://imgs.xkcd.com/comics/goldbach_conjectures.png","title":"Goldbach Conjectures","day":"30"},{"month":"1","num":1311,"link":"","year":"2014","news":"","safe_title":"2014","transcript":"((This is a series of quotes from various people of various timeframes.  The sections surrounded by two dashes (--) are bolded.  Each quote is followed by the author, the document of publication if applicable, and the year))\n\nIt is desirable -every thing printed should be preserved,- for we -cannot now tell how useful it may become- two centuries hence.\nChristopher Baldwin\n1834\n\nI predict that a century hence the -Canadian People- will be -the noblest specimens of humanity on the face of the Earth-\nRev. John Bredin\n1863\n\nIn the twenty-first century -mankind will subsist entirely upon jellies.- \nThe Book Lover\n1903\n\nThe twenty-first century baby is destined to be rocked and cradled by electricity, warmed and coddled by electricity, perhaps fathered and mothered by electricity.  -Probably the only thing he will be left to do unaided will be to make love-\nMrs. John Lane, The Fortnightly\n1905\n\nTo-day, in the city of New York, sixty-six different tongues are spoken. -A century hence, there will probably only be one-\nThe American Historical Magazine\n1907\n\nI often think -what interesting history we are making for the student of the twenty-first century-\nWilliam Carey Jones\n1908\n\nChina may be a -great shoe market- a decade or a century from now\nBoot and Shoe Recorder\n1914\n\nBy the twenty-first century I believe -we shall all be telepaths.-\nGumbriel, Character in Antic Hay\n1923\n\nThe physician of the twenty-first century...  May even criticize the language of the times, and may find that -some of our words have become as offensive to him as the term \"lunatic\" has become offensive to us.-\nDr. C. Macfie Cambpbell\n1924\n\nHistorians of the twenty-first century will look back with well-placed scorn on the -shallow-minded days- of the early twentieth century -when football games and petting parties were considered the most important elements of a college education.-\nMary Eileen Ahern, Library Bureau\n1926\n\n-In the year A.D. 2014- journalists will be writing on the centenary of the Great War-- -That is, if there has not been a Greater War-\nF.J.M, The Journalist\n1934\n\n{{Title text: Some future reader, who may see the term, without knowing the history of it, may imagine that it had reference to some antiquated bridge of the immortal Poet, thrown across the silver Avon, to facilitate his escape after some marauding excursion in a neighbouring park; and in some Gentleman's Magazine of the next century, it is not impossible, but that future antiquaries may occupy page after page in discussing so interesting a matter. We think it right, therefore, to put it on record in the Oriental Herald that the 'Shakesperian Rope Bridges' are of much less classic origin; that Mr Colin Shakespear, who, besides his dignity as Postmaster, now signs himself 'Superintendent General of Shakesperian Rope Bridges', is a person of much less genius than the Bard of Avon. --The Oriental Herald, 1825}}","alt":"Some future reader, who may see the term, without knowing the history of it, may imagine that it had reference to some antiquated bridge of the immortal Poet, thrown across the silver Avon, to facilitate his escape after some marauding excursion in a neighbouring park; and in some Gentleman's Magazine of the next century, it is not impossible, but that future antiquaries may occupy page after page in discussing so interesting a matter. We think it right, therefore, to put it on record in the Oriental Herald that the 'Shakesperian Rope Bridges' are of much less classic origin; that Mr Colin Shakespear, who, besides his dignity as Postmaster, now signs himself 'Superintendent General of Shakesperian Rope Bridges', is a person of much less genius than the Bard of Avon. --The Oriental Herald, 1825","img":"https://imgs.xkcd.com/comics/2014.png","title":"2014","day":"1"},{"month":"1","num":1312,"link":"","year":"2014","news":"","safe_title":"Haskell","transcript":"[[Two people are conversing.]]\nPerson #1: Code written in Haskell is guaranteed to have no side effects.\nPerson #2: ...because no one will ever run it?\n \n{{Title text: The problem with Haskell is that it's a language built on lazy evaluation and nobody's actually called for it.}}","alt":"The problem with Haskell is that it's a language built on lazy evaluation and nobody's actually called for it.","img":"https://imgs.xkcd.com/comics/haskell.png","title":"Haskell","day":"3"},{"month":"1","num":1313,"link":"","year":"2014","news":"","safe_title":"Regex Golf","transcript":"[[A woman sits at a laptop, leaning back over her chair to address a figure.]]\nRegex golf: \nWoman: You try to matchone one group but not the other. \nM | [TN]|B\n matches Star Wars subtitles but not Star Trek. \nFigure: Cool. \n\n[[We zoom to just show the woman, looking at her screen.]]\nMeta-regex golf: \nWoman: So I wrote a program that plays regex golf with arbitrary lists...\nFigure: Uh oh...\n\n[[We zoom back out. The figure is facepalming. The woman is typing.]]\nMeta-meta-regex golf: \nWoman: ...but I lost my code, so I'm grepping for files that look like regex golf solvers. \n\n[[We zoom back in.]]\n... And beyond:\nWoman: Really, this is all \n(meta-)*regex golf\n.\nFigure: Now you have infinite problems. \nWoman: No, I had those already. \n\n{{Title text: \nbu|[rn]t|[coy]e|[mtg]a|j|iso|n[hl]|[ae]d|lev|sh|[lnd]i|[po]o|ls\n matches the last names of elected US presidents but not their opponents.}}","alt":"/bu|[rn]t|[coy]e|[mtg]a|j|iso|n[hl]|[ae]d|lev|sh|[lnd]i|[po]o|ls/ matches the last names of elected US presidents but not their opponents.","img":"https://imgs.xkcd.com/comics/regex_golf.png","title":"Regex Golf","day":"6"},{"month":"1","num":1314,"link":"","year":"2014","news":"","safe_title":"Photos","transcript":"[[A man in a hat stands next to another figure on a roof. There's a sunset; in the distance, there are three people taking photos of the skyline as the sun sets.]]\nHat guy: Ugh, I hate how people take pictures instead of just enjoying the view. \nFigure: Why? \n\n[[Hat guy turns to the figure.]]\nHat guy: Documenting your live distracts you from living it. You're not really-\nFigure: Oh, come on. \n\n[[We zoom on their faces.]]\nFigure: Trying to take a picture of a thing makes me pay more attention to it. Some of my best adventures are built around trying to photograph something.\n\n[[We just see the figure's face.]]\nFigure: If \"other people having experiences incorrectly\" is annoying to you, think how unbearable it must be to have a condescending stranger tell you they hate the way you're experiencing your life at just the moment you've found something you want to remember. Why the fuck do you care how someone else enjoys a sunset? \n\n[[We zoom back out.]]\nHat guy: Well, they... Because I just, uh... ...\n\n[[The figure takes out a camera.]]\nFigure's camera: <<Click>>\n\n{{Title text: I hate when people take photos of their meal instead of eating it, because there's nothing I love more than the sound of other people chewing.}}","alt":"I hate when people take photos of their meal instead of eating it, because there's nothing I love more than the sound of other people chewing.","img":"https://imgs.xkcd.com/comics/photos.png","title":"Photos","day":"8"},{"month":"1","num":1315,"link":"","year":"2014","news":"","safe_title":"Questions for God","transcript":"[[A woman and a man are out for a walk.]]\nWoman: Horace Lamb said he would have two questions for God: Why quantum mechanics, and why turbulence? \nMan: I'd have just one: What did Miss Susie's steamboat DO?!\n\n{{Title text: What sins could possibly darken the heart of a STEAMBOAT? I asked The Shadow, but he says he only covers men.}}","alt":"What sins could possibly darken the heart of a STEAMBOAT? I asked The Shadow, but he says he only covers men.","img":"https://imgs.xkcd.com/comics/questions_for_god.png","title":"Questions for God","day":"10"},{"month":"1","num":1316,"link":"","year":"2014","news":"","safe_title":"Inexplicable","transcript":"[[A figure sits at a desk with a laptop. A woman is off-screen.]]\nFigure: Argh! \nWoman: What? \nFigure: Why do I always have these inexplicable, impossible-to-diagnose computer problems? \n\n[[The woman walks up to the desk.]]\nFigure: After six hours of this, I've concluded nothing works or makes sense. I give up on logic. \nWoman: <<sigh>>Gimme. I'll figure it out. \nFigure: You won't. \n\n[[The figure sits at his laptopless desk. Off-screen, we can hear the woman working on it. \n<<Type type>>\n<<Click>>\nWoman: ?\n<<Type type type>>\nWoman: ???\n\n[[The woman is back in front of the desk, clutching the laptop.]]\nFigure: How'd it go? \nWoman: Your computer is literally haunted. \nFigure: Told you. \n\n{{Title text: 'It has a ghost in it. Take it back.' 'No.'}}","alt":"'It has a ghost in it. Take it back.' 'No.'","img":"https://imgs.xkcd.com/comics/inexplicable.png","title":"Inexplicable","day":"13"},{"month":"1","num":1317,"link":"","year":"2014","news":"","safe_title":"Theft","transcript":"[[A figure sits in front of a laptop, apparently talking to it.]]\nFigure: I feel paralyzed by overwhelming existential dread. ...And yet for some reason I'm really excited about space? \nThe thief who stole my identity has a lot to deal with. \n\n{{Title text: Is he ALSO wondering at what point our thoughts diverged, if they even have yet? 'dude, I think he just took your credit card' AM I THE ORIGINAL? HOW DO I TELL?}}","alt":"Is he ALSO wondering at what point our thoughts diverged, if they even have yet? 'dude, I think he just took your credit card' AM I THE ORIGINAL? HOW DO I TELL?","img":"https://imgs.xkcd.com/comics/theft.png","title":"Theft","day":"15"},{"month":"1","num":1318,"link":"","year":"2014","news":"","safe_title":"Actually","transcript":"((The text of the comic is circular. Each statement is followed by the next, wrapping around back to the original speaker. Thus, the speaker chosen to be \"first\" below is chosen arbitrarily - in this case, the one that is facing upwards on the page.))\n[[6 figures stand on the surface of a circle, equidistant around it.]]\nFirst figure: Actually, measurements suggest it's flat.\nSecond figure: Actually, it's a sphere.\nThird figure: Actually, it's an oblate spheroid.\nFourth figure: Actually, it's a shape defined by the EGM96 coefficients.\nFifth figure: Actually, it's that plus local topography.\nSixth figure: Actually, it's embedded in a universe that's curved.\n((And thus the text has arrived back at the beginning of the first figure's statement.))\n\n{{Title text: Protip: You can win every exchange just by being one level more precise than whoever talked last. Eventually, you'll defeat all conversational opponents and stand alone.}}","alt":"Protip: You can win every exchange just by being one level more precise than whoever talked last. Eventually, you'll defeat all conversational opponents and stand alone.","img":"https://imgs.xkcd.com/comics/actually.png","title":"Actually","day":"17"},{"month":"1","num":1319,"link":"","year":"2014","news":"","safe_title":"Automation","transcript":"\"I spend a lot of time on this task. I should write a program automating it!\"\n\n[[Panel titled \"Theory:\" at the top contains a line plot, with \"work\" on the y-axis and \"time\" on the x-axis. Two curves indicate \"work on the original task\" eventually being permanently reduced by temporarily spending more work on coding, and then having the produced automation take over.]]\n\n[[Panel titled \"Reality:\" at the top contains a similar line plot, but the line for \"work on the original task\" does not decrease. The second curve, which starts out as \"writing code\", becomes \"debugging\", \"rethinking\", and then \"ongoing development\". The line for work on the original task becomes dotted, with the label \"no time for original task anymore.\"]]\n\n{{Title text: 'Automating' comes from the roots 'auto-' meaning 'self-', and 'mating', meaning 'screwing'.}}","alt":"'Automating' comes from the roots 'auto-' meaning 'self-', and 'mating', meaning 'screwing'.","img":"https://imgs.xkcd.com/comics/automation.png","title":"Automation","day":"20"},{"month":"1","num":1320,"link":"","year":"2014","news":"","safe_title":"Walmart","transcript":"When a network tries to be everyone's one-stop hub, the Walmart of social interaction...\n\n[[Two figures stand in a department store. One is holding some items in their right arm and waving at the other, who is pushing a shopping cart.]]\nFigure 1: Oh, uh, hi! Funny running into you here.\nFigure 2: Oh, hey! Yeah! How've you been?\n\n...it inevitably becomes the Walmart of social interaction.\n\n{{Title text: What I really want is to hang out where I hung out with my friends in college, but have all my older relatives there too.}}","alt":"What I really want is to hang out where I hung out with my friends in college, but have all my older relatives there too.","img":"https://imgs.xkcd.com/comics/walmart.png","title":"Walmart","day":"22"},{"month":"1","num":1321,"link":"","year":"2014","news":"","safe_title":"Cold","transcript":"[[Two figures in winter hats, one hat white and the other hat black, are walking.]]\nWhite Hat: It is brutal out. So much for global warming, huh?\n<<Black Hat sighs>>\nBlack Hat: This used to happen all the time.\nWhite Hat: What?\n\n[[A picture of an x-y plot, with years from 1970 to 2014 along the x-axis and dots rising up for each year, mostly concentrated from 1970 to 1999. The plot is labeled \"Days with lows < 0°F\".]]\nBlack Hat: You're from St. Louis, right? On average, it used to get below 0°F there a handful of days per year. But you haven't had a day like that since the nineties.\n\n[[The two figures continue walking.]]\nBlack Hat: Then, in 2014, when the first polar vortex hit, it dipped below zero for two days. And everyone freaked out because what used to be normal now feels too cold.\nWhite Hat: It is too cold!\n\n[[Panel labeled \"The future:\" contains a generic figure, looking at a frozen puddle on the ground.]]\nFigure: Look at this - ice! In St. Louis! So much for global warming.\n<<off-panel sigh>>\n\n{{Title text: 'You see the same pattern all over. Take Detroit--' 'Hold on. Why do you know all these statistics offhand?' 'Oh, um, no idea. I definitely spend my evenings hanging out with friends, and not curating a REALLY NEAT database of temperature statistics. Because, pshh, who would want to do that, right? Also, snowfall records.'}}","alt":"'You see the same pattern all over. Take Detroit--' 'Hold on. Why do you know all these statistics offhand?' 'Oh, um, no idea. I definitely spend my evenings hanging out with friends, and not curating a REALLY NEAT database of temperature statistics. Because, pshh, who would want to do that, right? Also, snowfall records.'","img":"https://imgs.xkcd.com/comics/cold.png","title":"Cold","day":"24"},{"month":"1","num":1322,"link":"","year":"2014","news":"","safe_title":"Winter","transcript":"[[Two figures, one in a winter hat and the other in a beret, are walking through snow and across a patch of ice.]]\nBeret Figure: The sky is cold and the floor water is too hard to drink.\n\n[[The figure with the beret looks upwards.]]\nBeret Figure: But I have my handcoats and the spacelight is warm.\n\n[[The two figures continue on through woods; there are musical notes coming from the trees.]]\nBeret Figure: Listen - the flappy planes are beeping in the stick towers.\n\n[[The figure with the winter hat pauses.]]\nHat Figure: Those are all the wrong words for those things.\n((Beret Figure replies from off panel.))\nBeret Figure: Maybe - but the things themselves are all right. So who cares?\n\n[[The figure with the winter hat continues walking, with sunlight and musical notes above.]]\n\n{{Title text: Stay warm, little flappers, and find lots of plant eggs!}}","alt":"Stay warm, little flappers, and find lots of plant eggs!","img":"https://imgs.xkcd.com/comics/winter.png","title":"Winter","day":"27"},{"month":"1","num":1323,"link":"","year":"2014","news":"","safe_title":"Protocol","transcript":"[[A standing figure is conversing with another figure who is sitting on computer desk chair. Behind the sitting figure is a desk with a flat-panel monitor.]]\nStanding figure: Alice sends a message to Bob saying to meet her somewhere.\nSitting figure: Uh huh.\nStanding figure: But Eve sees it, too, and goes to the place.\nSitting figure: With you so far.\nStanding figure: Bob is delayed, and Alice and Eve meet.\nSitting figure: Yeah?\n\nI've discovered a way to get computer scientists to listen to any boring story.\n\n{{Title text: Changing the names would be easier, but if you're not comfortable lying, try only making friends with people named Alice, Bob, Carol, etc.}}","alt":"Changing the names would be easier, but if you're not comfortable lying, try only making friends with people named Alice, Bob, Carol, etc.","img":"https://imgs.xkcd.com/comics/protocol.png","title":"Protocol","day":"29"},{"month":"1","num":1324,"link":"","year":"2014","news":"","safe_title":"Weather","transcript":"[[Shorthair and Cueball are talking.]]\nShorthair: So, how 'bout this weather?\nCueball: I know, right? The whole jet stream layer is nuts!\nShorthair: Um, sure...\nCueball: The 18z GFS forecasts 960MB by Tuesday, Think it'll verify?\nShorthair: What?\nCueball: ...right. Sorry. Uh, yeah. Weather sure has been crazy.\n\nWeather geeks have it tough.\n\n{{Title text: At least if you're really into, like, Turkish archaeology, store clerks aren't like 'hey, how 'bout those Derinkuyu underground cities!' when they're trying to be polite.}}","alt":"At least if you're really into, like, Turkish archaeology, store clerks aren't like 'hey, how 'bout those Derinkuyu underground cities!' when they're trying to be polite.","img":"https://imgs.xkcd.com/comics/weather.png","title":"Weather","day":"31"},{"month":"2","num":1325,"link":"","year":"2014","news":"","safe_title":"Rejection","transcript":"[[Two people are walking.]]\nPerson #1: Women \nsay\n they want nice guys, but what they \nreally\n want are--\nPerson #2: --guys who respond to rejection by belittling their judgment and self-awareness?  If so, don't worry -- you'll be \nfine\n.\n\n{{Title text: Perhaps you need a crash course in taking hints. Here's your first lesson: We're not actually walking somewhere together; I'm trying to leave this conversation and you're following me.}}","alt":"Perhaps you need a crash course in taking hints. Here's your first lesson: We're not actually walking somewhere together; I'm trying to leave this conversation and you're following me.","img":"https://imgs.xkcd.com/comics/rejection.png","title":"Rejection","day":"3"},{"month":"2","num":1326,"link":"","year":"2014","news":"","safe_title":"Sharks","transcript":"[[The character is sitting on a throne, talking to a minion who's not shown in the panel.]]\nMinion: The prisoner escaped and is swimming toward the mainland!\nLeader: \nRelease the sharks.\n\nMinion: Yes, sir.\n\nMinion: The sharks are swimming away.\nLeader: They're escaping, too? Send sharks after them!\n\nMinion: Now \nthose\n sharks are swimming away.\nLeader: \nMore sharks.\n\nMinion: ... sir, what's going on?\nLeader: Prisoners, of course! Can't let 'em escape!\n\nMinion: Sir, are you trying to turn Doom Island into a marine biology center?\nLeader: \nShark populations are in decline--\n\nLeader: *ahem*\nLeader: I mean, the world must fear us!\nMinion: Right...\n\n{{Title text: 'Now, minions, I'm off to inspect our shark cages.' 'Do you really need to inspect them this often?' 'PRISONERS MUST NEVER ESCAPE.'}}","alt":"'Now, minions, I'm off to inspect our shark cages.' 'Do you really need to inspect them this often?' 'PRISONERS MUST NEVER ESCAPE.'","img":"https://imgs.xkcd.com/comics/sharks.png","title":"Sharks","day":"5"},{"month":"2","num":1327,"link":"","year":"2014","news":"","safe_title":"Mobile Marketing","transcript":"[[Black Hat sits at a desk. A voice speaks from off panel, in front of Black Hat.]]\nOff Panel Voice: CNN hired you to improve viewership.\n\n[[Black Hat continues sitting at the desk.]]\nBlack Hat Guy: ...yes, and?\n\n[[Next panel, conversation continues.]]\nOff Panel Voice: You texted \"holy crap, turn on the news\" to a million random phone numbers?\nBlack Hat Guy: It sure did work.\nOff Panel Voice: Not what we meant!\n\n{{Title text: We're firing you, but the online headline-writing division wants to hire you.}}","alt":"We're firing you, but the online headline-writing division wants to hire you.","img":"https://imgs.xkcd.com/comics/mobile_marketing.png","title":"Mobile Marketing","day":"7"},{"month":"2","num":1328,"link":"","year":"2014","news":"","safe_title":"Update","transcript":"[[A figure sits at a desk. A message is being displayed on the figure's laptop screen. It reads \"Urgent: critical update available!\"]]\n\n[[The message continues. \"Details: Fixes an issue that was causing random laptop electrical fires.\"]]\n\n(This update will require restarting your computer.)\n\n[[The figure clicks on \"Remind me later.\"]]\n\n{{Title text: I have a bunch of things open right now.}}","alt":"I have a bunch of things open right now.","img":"https://imgs.xkcd.com/comics/update.png","title":"Update","day":"10"},{"month":"2","num":1329,"link":"","year":"2014","news":"","safe_title":"Standing","transcript":"[[One figure stands at the left side of the frame, watching a second figure chase a deer that has a laptop strapped to its back.]]\nSecond Figure: Humans aren't built to sit all day. This is much healthier.\n\nMy hobby: one-upping the standing desk people.\n\n{{Title text: At first I was making fun of them, but joke's on me--the \ndeer is surprisingly ergonomic, except for the kicks.}}","alt":"At first I was making fun of them, but joke's on me--the deer is surprisingly ergonomic, except for the kicks.","img":"https://imgs.xkcd.com/comics/standing.png","title":"Standing","day":"12"},{"month":"2","num":1330,"link":"","year":"2014","news":"","safe_title":"Kola Borehole","transcript":"[[A woman and black hat guy sit at desks, their backs to each other, each using a laptop.]]\nWoman: Ever hear of the Kola borehole? \nBlack hat guy: No - what's that? \nWoman: A Soviet project to drill deap into the earth's crust. \n\n[[The woman turns around; we see her head and shoulders.]]\nWoman: There's a hoax report claiming that their drill broke through into a superhot cavern, and when they lowered a microphone into the hole, they heard tormented screaming. People say that's why the miners sealed the well and abandoned the project.\n\n[[The woman turns back to her laptop.]]\nBlack hat guy: Why would anyone believe that story? \nWoman: I guess some people think Hell is literally an underground place. \n\n[[Black hat guy turns around and addresses the woman.]]\nBlack hat guy: No - I mean, why would the miners seal the opening? Why not just dig a canal connecting it to the ocean? Unless they like Hell.\n\n[[The woman turns back around.]]\nWoman: ... If there's ever a war between earth and Hell, I hope I'm on your side. \nBlack hat guy: You seem nice; you probably won't be. \n\n{{Title text: Tonight's top story: Lucifer, the Prince of Darkness, died in his home this morning at the age of [unintelligible rune]. Due to the large number of sharks inhabiting his former kingdom, no body could be recovered.}}","alt":"Tonight's top story: Lucifer, the Prince of Darkness, died in his home this morning at the age of [unintelligible rune]. Due to the large number of sharks inhabiting his former kingdom, no body could be recovered.","img":"https://imgs.xkcd.com/comics/kola_borehole.png","title":"Kola Borehole","day":"14"},{"month":"2","num":1331,"link":"","year":"2014","news":"","safe_title":"Frequency","transcript":"[[A grid of individual text items, five columns wide by ten rows tall. Each describes a particular event, and periodically individual items flash to full opacity before gradually fading again, indicating the average frequency of each occurring.]]\n\n((First row: heartbeat, one birth, one death, someone edits Wikipedia, someone buys a vibrator.))\n((Second row: China builds a car, Japan builds a car, Germany builds a car, the US builds a car, someone else builds a car.))\n((Third row: a European Union resident has their first kiss, a US fire department puts out a fire, someone hits a hole-in-one, my turn signal blinks, the turn signal of the car in front of me blinks.))\n((Fourth row: earthquake (magnitude 1), earthquake (magnitude 2), earthquake (magnitude 3), earthquake (magnitude 4), member of the UK parliament flushes a toilet.))\n((Fifth row: an airline flight takes off, someone buys To Kill a Mockingbird, someone's pet cat kills a mockingbird, someone in Phoenix buys new shoes, someone in Phoenix puts on a condom.))\n((Sixth row: someone locks their keys in their car, a Sagittarius named Amelia drinks a soda, a dog bites someone in the US, someone steals a bicycle, a bald eagle catches a fish.))\n((Seventh row: 50000 plastic bottles are produced, 50000 plastic bottles are recycled, a bright meteor is visible somewhere, old faithful erupts, a fishing boat catches a shark.))\n((Eighth row: someone in the US is diagnosed with cancer, someone in the US dies from cancer, someone adopts a dog from a shelter, someone adopts a cat from a shelter, someone gets married.))\n((Ninth row: someone registers a domain, someone in the US buys a house, someone in the US gets a tattoo, the star PSR J1748-2446AD rotates 1000 times, someone lies about their age to sign up for Facebook.))\n((Tenth row: someone breaks an iPhone screen, a little league player strikes out, someone has sex in North Dakota, Justin Bieber gains a follower on Twitter, someone in Denver orders a pizza.))\n\n{{Title text: This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.}}","alt":"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.","img":"https://imgs.xkcd.com/comics/frequency.png","title":"Frequency","extra_parts":{"headerextra":"","inset":"\n<table>\n<tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/heartbeat.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/birth.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/death.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/wikipedia.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/vibrator.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr><tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/car_china.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/car_japan.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/car_germany.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/car_us.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/car_elsewhere.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr><tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/kiss.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/fire_dept.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/holeinone.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/turnsignal1.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/turnsignal2.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr><tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/earthquake1.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/earthquake2.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/earthquake3.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/earthquake4.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/parliament_toilet.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr><tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/flight.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/book_mockingbird.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/cat_mockingbird.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/phoenixshoes.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/phoenix.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr><tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/keys.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/amelia.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/dogbite.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/bike.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/eagle.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr><tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/bottles.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/recycled.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/meteor.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/oldfaithful.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/shark.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr><tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/us_cancer.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/us_cancer_death.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/dog.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/cat.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/wedding.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr><tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/domain.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/house.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/tattoo.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/pulsar.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/facebook.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr><tr>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/iphone.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/littleleague.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/ndsex.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/bieber.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n<td><img src=\"//imgs.xkcd.com/comics/frequency/denverpizza.gif\" alt=\"Frequency\" title=\"This comic shows estimated average frequency. I wanted to include the pitch drop experiment, but it turns out the gif format has some issues with decade-long loops.\" /></td>\n</tr>\n</table>\n"},"day":"17"},{"month":"2","num":1332,"link":"","year":"2014","news":"","safe_title":"Slippery Slope","transcript":"[[A figure in a white hat stands talking to another.]]\nWhite hat guy: Yeah, but if I'm considerate toward one person about one thing, what's next? Being nice to other people about other things? Where does it end? \n\n{{Title text: Sure, taking a few seconds to be respectful toward someone about something they care about doesn't sound hard. But if you talk to hundreds of people every day and they all start expecting that same consideration, it could potentially add up to MINUTES wasted. And for WHAT?}}","alt":"Sure, taking a few seconds to be respectful toward someone about something they care about doesn't sound hard. But if you talk to hundreds of people every day and they all start expecting that same consideration, it could potentially add up to MINUTES wasted. And for WHAT?","img":"https://imgs.xkcd.com/comics/slippery_slope.png","title":"Slippery Slope","day":"19"},{"month":"2","num":1333,"link":"","year":"2014","news":"","safe_title":"First Date","transcript":"[[A man and a woman sit at an intimate dinner table. They have plates and glasses of wine in front of them.]]\nMan: So, did you grow up around here? \nWoman: I love you.\nMan: ... huh? \nWoman: Waiter! One of everything on the menu. \n\n[[The woman stands up. She's holding the plate.]]\nMan: Why are you up there? \nWoman: I'm stuck. This plate looks delicious. Aaaoogaoag.\n\n[[The woman has put the plate down and walked off-panel.]]\nWoman: Bye. OK. Coming back now. \n\n[[The woman is crouched on her chair, holding a spiral.]]\nMan: You're being controlled by Twitch, aren't you? \nWoman: Check out this cool spiral! \nMan: It's-\nWoman: SAVING.\n\n{{Title text: I sympathize with the TPP protagonist because I, too, have progressed through a surprising number of stages of life despite spending entire days stuck against simple obstacles.}}","alt":"I sympathize with the TPP protagonist because I, too, have progressed through a surprising number of stages of life despite spending entire days stuck against simple obstacles.","img":"https://imgs.xkcd.com/comics/first_date.png","title":"First Date","day":"21"},{"month":"2","num":1334,"link":"","year":"2014","news":"","safe_title":"Second","transcript":"[[A figure stands in a desert, looking at a rock in front of it.]]\nRock: Greetings, stranger. Whatever quest drives you, abandon it. You shall find no answers in these desolate wastes.\nFigure: I knew I wouldn't. I guess I... just had to see.\n\nI hate feeling desperate enough to visit the second page of Google results.\n\n{{Title text: Let me just scroll down and check behind that rock. Annnnd ... nope, page copyright year starts with '19'. Oh God, is this a WEBRING?}}","alt":"Let me just scroll down and check behind that rock. Annnnd ... nope, page copyright year starts with '19'. Oh God, is this a WEBRING?","img":"https://imgs.xkcd.com/comics/second.png","title":"Second","day":"24"},{"month":"2","num":1335,"link":"","year":"2014","news":"","safe_title":"Now","transcript":"[[A circle consisting of many rings with a projection of the surface of the earth in the center. The outermost ring is split into a yellow semi-circle labeled at the top with \"noon\" and a gray semi-circle labeled at the bottom with \"midnight,\" with \"6 AM\" on the left and \"6 PM\" on the right. A second ring immediately inside the outer ring has two sections labeled, one \"Rude to call\" and the other \"Business hours (9-5)\" - the rest of that ring is blank. Various other rings contain labels for various places on and portions of the Earth, for instance continents and city names.]]\n\n((Everything except the outer two rings in the image rotate such that the time markers on the outside correspond to the approximate times in the locations of the world aligned with them.))\n\n{{Title text: This image stays roughly in sync with the day (assuming the Earth continues spinning). Shortcut: xkcd.com\nnow}}","alt":"This image stays roughly in sync with the day (assuming the Earth continues spinning). Shortcut: xkcd.com/now","img":"https://imgs.xkcd.com/comics/now.png","title":"Now","extra_parts":{"pre":"","headerextra":"","inset":"","post":"\n<script type=\"text/javascript\">\nsetInterval(function(){document.getElementById('comic_now').src=\"//c.xkcd.com/redirect/comic/now\";}, 30000);\n</script>\n","imgAttr":"id=\"comic_now\""},"day":"26"},{"month":"2","num":1336,"link":"","year":"2014","news":"","safe_title":"Transformers","transcript":"[[Two \"Transformer\"-esque robots are visible.]]\nFirst Robot: Transform!\n\n[[Both robots run to the right.]]\n\n[[Each robot reaches a tree and begins to climb it.]]\n\n[[The camera focuses on the nearer of the two robots, which is placing itself into a chrysalis hanging from the tree branch.]]\n\n{{Title text: A helicopter bursts from a chrysalis and alights on a rock, rotors still damp.}}","alt":"A helicopter bursts from a chrysalis and alights on a rock, rotors still damp.","img":"https://imgs.xkcd.com/comics/transformers.png","title":"Transformers","day":"28"},{"month":"3","num":1337,"link":"","year":"2014","news":"","safe_title":"Hack","transcript":"[[A white-on-black drawing of the ISEE-3\nICE probe.]]\nThe ISEE-3\nICE probe was launched in 1978. Its mission ended in 1997 and it was sent a shutdown signal.\n\n[[Back to black-on-white text.]]\nIn 2008, we learned--to our surprise--that the probe didn't shut down. It's still running and it has plenty of fuel. ...and in 2014, its orbit brings it near Earth.\n\n[[Two figures talking.]]\nFigure 1: We could sent it on a new mission... except we no longer have the equipment to send commands to it.\nFigure 2: Can't we-\n\n[[Camera frame closes in slightly on the first figure.]]\nFigure 1: NASA won't rebuild it. \"Too expensive.\"\nFigure 2: Seriously?\nFigure 2: I know, right? So the internet found the specs and we went to work.\n\n[[Camera zooms out as the two figures walk through an area with two other figures seated at desks working on laptops; one of the seated figures is wearing a headset.]]\nFigure 1: We've convinced them to give us time on the Madrid DSN transmitter and hacked the maser to support the uplink. And today's the big day.\n\n[[Camera focuses on the figure with the headset.]]\nHeadset Operator 1: Transmitting... We have a signal! We have control!\n\n[[Camera flips back to the first figure.]]\nFigure 1: Okay, transmit the new comet rendezvous maneuver sequen-\nOff screen: What the hell?\n\n[[Camera zooms back out to show all four figures.]]\nHeadset Operator 1: My console went dead!\nOperator 2: Mine too!\nFigure 1: What's happening?\n\n[[Camera back to figure with headset, staring at screen.]]\nHeadset Operator 1: There's a new signal going out over the transmitter!\nFigure 1 (from offscreen): A bug?\nHeadset Operator 1: Someone else is in the system!\n\n[[Camera switches to the second operator.]]\nOperator 2: Kill the connection!\nHeadset Operator 1 (from offscreen): I can't find it!\nOperator 2: They're firing the probe's engines!\nHeadset Operator 1 (from offscreen): No!!\n\n[[Camera switches back to the headset operator.]]\nFigure 1 (from offscreen): Who's doing this?? Stop them!\nOperator 2 (from offscreen): I'm trying!\nHeadset Operator 1: Look! My screen!\n\n[[The camera zooms back to show all of them, and a message is being shown on the headset operator's screen, in red.]]\nM-E-S-S-W-I-T-H-T-H-E-B-E-S-T\nD-I-E-L-I-K-E-T-H-E-R-E-S-T\n\n[[Camera cuts to a pool with two figures in it.]]\n\n[[Camera zooms out to show that the pool is on the roof of a downtown building. We see the figures' speech coming from it.]]\nBurn: Crash?\nCrash: Yeah, Burn?\n\n[[Same skyline view.]]\nBurn: Make a wish.\n\n[[A meteor passes through the sky above the city skyline.]]\n\n{{Title text: HACK THE STARS}}","alt":"HACK THE STARS","img":"https://imgs.xkcd.com/comics/hack.png","title":"Hack","day":"3"},{"month":"3","num":1338,"link":"","year":"2014","news":"","safe_title":"Land Mammals","transcript":"Earth's LAND MAMMALS By Weight\n[[A graph in which one square equals 1,000,000 tons. Dark grey squares represent humans, light gray represent our pets and livestock, and green squares represent wild animals. The squares are arranged in a roughly round shape, with clusters for each type of animal. \nAnimals represented: Humans, cattle, pigs, goats (39 squares), sheep, horses (29 squares), elephants (1 square). There are other small, unlabeled clusters also. It is clear that humans and our pets & livestock outweigh wild animals by at least a factor of 10. ]]\n{{Title text: Bacteria still outweigh us thousands to one--and that's not even counting the several pounds of them in your body.}}","alt":"Bacteria still outweigh us thousands to one--and that's not even counting the several pounds of them in your body.","img":"https://imgs.xkcd.com/comics/land_mammals.png","title":"Land Mammals","day":"5"},{"month":"3","num":1339,"link":"","year":"2014","news":"","safe_title":"When You Assume","transcript":"[[Two characters are talking.  One has visible hair, the other does not.]]\nHair: You \nassumed?\n\nHair: You know what happens when you assume--\nNone: I don't.  Yet you're confidently asserting that I do.\nHair: ...Oh. Hm.\nNone: Check and mate.\n\n{{Title text: You know what happens when you assert--you make an ass out of the emergency response team.}}","alt":"You know what happens when you assert--you make an ass out of the emergency response team.","img":"https://imgs.xkcd.com/comics/when_you_assume.png","title":"When You Assume","day":"7"},{"month":"3","num":1340,"link":"","year":"2014","news":"","safe_title":"Unique Date","transcript":"[[One figure is excitedly speaking to two others.]]\nExcited Figure: Whoa, it's 2014-03-10! Under our system, that date will *never happen again!!*\n\nMy hobby: pointing this out every day.\n\n{{Title text: If our current civilization lasts another 8,000 years, it's probably fair to assume the Long Now Foundation got things right, and at some point we started listening to them and switched to five-digit years.}}","alt":"If our current civilization lasts another 8,000 years, it's probably fair to assume the Long Now Foundation got things right, and at some point we started listening to them and switched to five-digit years.","img":"https://imgs.xkcd.com/comics/unique_date.png","title":"Unique Date","day":"10"},{"month":"3","num":1341,"link":"","year":"2014","news":"","safe_title":"Types of Editors","transcript":"WYSIWYG\nWhat you see is what you get\n[[Two boxes, the first labeled \"What you see:\" contains an italic \"Hi\", the second labeled \"What you get:\" contains an italic \"Hi\".]]\n\nWYSINWYG\nWhat you see is not what you get\n[[Two boxes, the first labeled \"What you see:\" contains \"<em>Hi<\nem>\", the second labeled \"What you get:\" contains an italic \"Hi\".]]\n\nWYSITUTWYG\nWhat you see is totally unrelated to what you get\n[[Two boxes, the first labeled \"What you see:\" contains \"<em>Hi<\nem>\", the second labeled \"What you get:\" contains \"The HORSE is a noble animal.\"]]\n\nWYSIHYD\nWhat you see is how you die\n[[Two boxes, the first labeled \"What you see:\" contains \"EATEN BY WOLVES\" as white text on a black background, the second labeled \"What you get:\" without a border is says \"eaten by wolves\".]]\n\n\n{{Title text: m-x machineofdeath-mode}}","alt":"m-x machineofdeath-mode","img":"https://imgs.xkcd.com/comics/types_of_editors.png","title":"Types of Editors","day":"12"},{"month":"3","num":1342,"link":"","year":"2014","news":"","safe_title":"Ancient Stars","transcript":"((All of the panels of this comic are white-on-black.))\n\n[[Two figures stand facing each other, looking up at the sky.]]\nFigure One: Just think - the light from that start was emitted thousands of years ago. It could be long gone.\n\n[[Figure One looks at Figure Two, who is still looking up.]]\nFigure Two: That's Sirius. It's eight light-years away.\n\n[[Figure One looks up again.]]\nFigure One: Oh.\n\n[[The two figures look at one another.]]\nFigure One: Just think - the light from that star was emitted in the previous presidential administration.\nFigure Two: Hmm, doesn't pack quite the punch.\n\n{{Title text: 'The light from those millions of stars you see is probably many thousands of years old' is a rare example of laypeople substantially OVERestimating astronomical numbers.}}","alt":"'The light from those millions of stars you see is probably many thousands of years old' is a rare example of laypeople substantially OVERestimating astronomical numbers.","img":"https://imgs.xkcd.com/comics/ancient_stars.png","title":"Ancient Stars","day":"14"},{"month":"3","num":1343,"link":"","year":"2014","news":"","safe_title":"Manuals","transcript":"[[A horizontal line has four points labeled on it, with the second point from the left marked with a dashed vertical line dividing the horizontal line into two parts. An arrow labeled \"Solve problems\" points left from the vertical line. An arrow labeled \"Create problems\" points right from the vertical line. The points are labeled, from left to right, \"Tools that don't need a manual\", \"Tools that need a manual\", \"Tools that need a manual but don't have one\", and \"Tools whose manual starts with 'how to read this manual'\".]]\n\n{{Title text: The most ridiculous offender of all is the sudoers man page, which for 15 years has started with a 'quick guide' to EBNF, a system for defining the grammar of a language. 'Don't despair', it says, 'the definitions below are annotated.'}}","alt":"The most ridiculous offender of all is the sudoers man page, which for 15 years has started with a 'quick guide' to EBNF, a system for defining the grammar of a language. 'Don't despair', it says, 'the definitions below are annotated.'","img":"https://imgs.xkcd.com/comics/manuals.png","title":"Manuals","day":"17"},{"month":"3","num":1344,"link":"","year":"2014","news":"","safe_title":"Digits","transcript":"[[A first figure is walking past a second.]]\nFirst Figure: The talk is in room 8224.\nSecond Figure: Ooh, nice.\nFirst Figure: What?\nSecond Figure: ...sorry. Nothing.\n\nGreat, now I'll spend the rest of my life noticing numbers that would make good 2048 combos.\n\n{{Title text: It's taken me 20 years to get over skyline tetris.}}","alt":"It's taken me 20 years to get over skyline tetris.","img":"https://imgs.xkcd.com/comics/digits.png","title":"Digits","day":"19"},{"month":"3","num":1345,"link":"","year":"2014","news":"","safe_title":"Answers","transcript":"[[Two figures are walking and talking to each other.]]\nFigure One: Humans are defined by our curiosity, our hunger for answers.\nFigure Two: We all spend a third of our lives lying down with our eyes closed and *nobody knows why.*\nFigure One: ...touché.\n\n{{Title text: Stanford sleep researcher William Dement said that after 50 years of studying sleep, the only really solid explanation he knows for why we do it is 'because we get sleepy'.}}","alt":"Stanford sleep researcher William Dement said that after 50 years of studying sleep, the only really solid explanation he knows for why we do it is 'because we get sleepy'.","img":"https://imgs.xkcd.com/comics/answers.png","title":"Answers","day":"21"},{"month":"3","num":1346,"link":"","year":"2014","news":"","safe_title":"Career","transcript":"[[A figure stands facing a desk, behind which another figure is sitting in a desk chair.]]\nStanding Figure: It would start with five minutes of peeling lint from dryer traps, followed by an hour of pressing a lightsaber handle against things and switching it on. Then I'd retire to a life of luxury.\n\nWhen people ask me to describe my dream job, I'm never sure how realistic to be.\n\n{{Title text: They'd convince me to come out of retirement for one last job: biting into a giant lump of slightly soft wax a couple of times.}}","alt":"They'd convince me to come out of retirement for one last job: biting into a giant lump of slightly soft wax a couple of times.","img":"https://imgs.xkcd.com/comics/career.png","title":"Career","day":"24"},{"month":"3","num":1347,"link":"","year":"2014","news":"","safe_title":"t Distribution","transcript":"[[A physical bell-curve-shaped object labeled \"Student's t distribution\" is resting on a table. A figure is working with it and a piece of paper.]]\nFigure: hmm\n\n[[The figure looks at the piece of paper.]]\nFigure: ...nope.\n\n[[The figure picks up the object and begins to walk off the panel with it.]]\n\n[[The figure comes back onto the panel, now carrying an object shaped like a much more complex curve, with many symmetric spikes and dips, labeled \"Teacher's t distribution\".]]\n\n{{Title text: If data fails the Teacher's t test, you can just force it to take the test again until it passes.}}","alt":"If data fails the Teacher's t test, you can just force it to take the test again until it passes.","img":"https://imgs.xkcd.com/comics/t_distribution.png","title":"t Distribution","day":"26"},{"month":"3","num":1348,"link":"","year":"2014","news":"","safe_title":"Before the Internet","transcript":"[[An adult and a child are standing around, looking at cellphones.]]\nChild: Do you remember before the internet?\nAdult: Oh yeah, totally.\n\n[[The two look towards each other, no longer actively looking at their phones.]]\nChild: What was it like?\nAdult: Not having a phone or computer to distract you?\nChild: Yeah.\n\n[[Conversation continues.]]\nAdult: It was SO. BORING. All the time. I just *sat* there. It was the *worst*.\n\n[[Adult goes back to looking at phone.]]\nChild: But wasn't it, like, more fulfilling? Engaging?\nAdult: Wasn't worth it.\nChild: I still get bored.\nAdult: Not like we did.\n\n{{Title text: We watched DAYTIME TV. Do you realize how soul-crushing it was? I'd rather eat an iPad than go back to watching daytime TV.}}","alt":"We watched DAYTIME TV. Do you realize how soul-crushing it was? I'd rather eat an iPad than go back to watching daytime TV.","img":"https://imgs.xkcd.com/comics/before_the_internet.png","title":"Before the Internet","day":"28"},{"month":"3","num":1349,"link":"","year":"2014","news":"","safe_title":"Shouldn't Be Hard","transcript":"[[A person is sitting at a desk, typing on a laptop.]]\nPerson: What I'm trying to do is really simple. It shouldn't be hard.\n\n[[Someone off-screen speaks.]]\nOff-screen: All computers are just carefully organized sand. \nEverything\n is hard until someone makes it easy.\n\n[[The person leans back in their chair.]]\n\n[[The person lifts the laptop off the desk, examining it like a book.]]\nPerson: Maybe I should turn this one \nback\n into sand.\nOff-screen: I'll find a blowtorch.\n\n{{Title text: (six hours later) ARGH. How are these stupid microchips so durable?! All I want is to undo a massive industrial process with household tools!}}","alt":"(six hours later) ARGH. How are these stupid microchips so durable?! All I want is to undo a massive industrial process with household tools!","img":"https://imgs.xkcd.com/comics/shouldnt_be_hard.png","title":"Shouldn't Be Hard","day":"31"},{"month":"4","num":1350,"link":"","year":"2014","news":"","safe_title":"Lorenz","transcript":"((This April Fools' Day comic has a dynamic panel structure along the lines of a choose-your-own-adventure format - the viewer is presented with up to 4 options for each bit of dialogue, with each choice opening up a new subtree of potential options for the next bit of dialog, and new panel images are chosen semi-randomly based on a graph of potential panel transitions. Readers were also invited to submit dialog options for trees where there were not yet 4 fixed options, thus growing the potential story space. As such there is no fixed transcript for this comic.))\n\n{{Title text: Every choice, no matter how small, begins a new story.}}","alt":"Every choice, no matter how small, begins a new story.","img":"https://imgs.xkcd.com/comics/shouldnt_be_hard.png","title":"Lorenz","extra_parts":{"pre":"","headerextra":"\n<link rel=\"stylesheet\" href=\"/1350/bernardo.css\" type=\"text/css\">\n","inset":"\n<script src=\"/s/b66ed7.js\"></script>\n<script src=\"/1350/bernardo.min.js\"></script>\n<script type=\"text/javascript\">\nBernardo.comic({el: $('#comic')})\n</script>","post":"\n","imgAttr":""},"day":"1"},{"month":"4","num":1351,"link":"","year":"2014","news":"","safe_title":"Metamaterials","transcript":"[[A pair of violets, colored red.]]\nViolets are red\n\n[[A blue rose.]]\nAnd roses are blue\n\n[[Two people stand on a stage. Between them is a table, on which rests the two flowers under a translucent cover. One is at a podium with a microphone.]]\nPerson 1: When metamaterials\n\n[[The person at the microphone removes the cover to reveal the flowers are the opposite colors.]]\nPerson 1: Alter their hue.\n\n{{Title text: If I developed a hue-shifting metamaterial, I would photobomb people's Instagram pics with a sheet of material that precisely undid the filter they were using.}}","alt":"If I developed a hue-shifting metamaterial, I would photobomb people's Instagram pics with a sheet of material that precisely undid the filter they were using.","img":"https://imgs.xkcd.com/comics/metamaterials.png","title":"Metamaterials","day":"4"},{"month":"4","num":1352,"link":"","year":"2014","news":"","safe_title":"Cosmologist on a Tire Swing","transcript":"[[A child and an adult are walking across a grassy park with puddles strewn across it and trees nearby.]]\nChild: What was before the Big Bang?\nAdult: I think time began with the Big Bang. So it doesn't make sense to ask what came before it.\nFrom offscreen: Look out!\n\n[[A cosmologist on a tire swing comes swinging by the pair.]]\nCosmologist: Wheeeee hi I'm a cosmologist on a tire swing!\n\n[[The cosmologist swings back the other way.]]\nCosmologist: We don't know whether time--\n\n[[Another swing the other direction...]]\nCosmologist: --started at the Big Bang.\n\n[[Another swing.]]\nCosmologist: It might have!\n\n[[Another swing.]]\nCosmologist: Or maybe not! We don't know!\nAdult: Oh. Ok!\n\n[[Another swing.]]\nChild: ...your tire swing looks fun!\nCosmologist: I can't stop!\n\n[[Continues swinging.]]\nChild: Won't the swing stop on its own?\nCosmologist: I thought it would but it seems to be accelerating.\nChild: Cosmology sounds pretty confusing.\nCosmologist: Wheeeee!\n\n{{Title text: No matter how fast I swing, I can never travel outside this loop! Maybe space outside it doesn't exist! But I bet it does. This tire came from somewhere.}}","alt":"No matter how fast I swing, I can never travel outside this loop! Maybe space outside it doesn't exist! But I bet it does. This tire came from somewhere.","img":"https://imgs.xkcd.com/comics/cosmologist_on_a_tire_swing.png","title":"Cosmologist on a Tire Swing","day":"7"},{"month":"4","num":1353,"link":"","year":"2014","news":"","safe_title":"Heartbleed","transcript":"[[Two people are walking along, one is looking at her phone.]]\nPerson 1: Heartbleed must be the worst web security lapse ever.\nPerson 2: Worst so far. Give us time.\n\n[[Still walking, first person is now holding her phone at her side.]]\nPerson 1: I mean, this bg isn't just broken encryption. It lets website visitors make a server dispense random memory contents.\n\n[[They stop walking and face each other.]]\nPerson 1: It's not just keys. It's traffic data. Emails. Passwords. Erotic fanfiction.\nPerson 2: Is \neverything\n compromised?\n\n[[They begin walking again.]]\nPerson 1: Well, the attack is limited to data stored in computer memory.\nPerson 2: So paper is safe. And clay tablets.\nPerson 1: Our imaginations, too.\nPerson 2: See, we'll be fine.\n\n{{Title text: I looked at some of the data dumps from vulnerable sites, and it was ... bad. I saw emails, passwords, password hints. SSL keys and session cookies. Important servers brimming with visitor IPs. Attack ships on fire off the shoulder of Orion, c-beams glittering in the dark near the Tannhäuser Gate. I should probably patch OpenSSL.}}","alt":"I looked at some of the data dumps from vulnerable sites, and it was ... bad. I saw emails, passwords, password hints. SSL keys and session cookies. Important servers brimming with visitor IPs. Attack ships on fire off the shoulder of Orion, c-beams glittering in the dark near the Tannhäuser Gate. I should probably patch OpenSSL.","img":"https://imgs.xkcd.com/comics/heartbleed.png","title":"Heartbleed","day":"9"},{"month":"4","num":1354,"link":"","year":"2014","news":"","safe_title":"Heartbleed Explanation","transcript":"How the Heartbleed Bug Works:\n\n[[Meg stands by a server. There's a thought bubble arising from the server showing the data the server is currently processing, including a portion that states \"User Meg wants these six letters: POTATO.\"]]\nMeg: Server, are you still there? If so, reply \"POTATO\" (6 letters).\n\n[[The 6 letters \"POTATO\" are highlighted yellow in the server's thought bubble, and the server emits \"POTATO\".]]\n\n[[The phrase \"User Meg wants these 4 letters: BIRD.\" is in the server's thought bubble with other data around it, with \"BIRD\" highlighted. The server is emitting \"BIRD\".]]\nMeg: Hmm...\n\n[[The phrase \"User meg wants these 500 letters: HAT.\" is in the server's thought bubble, along with other data around it.]]\nMeg: Server, are you still there? IF so, reply \"HAT\" (500 letters).\n\n[[\"HAT\" and many more characters after it in the thought bubble are highlighted, and the server emits a long string of text starting with \"HAT\" but then including much more other unrelated data. Meg is busily writing it down in a notebook.]]\n\n{{Title text: Are you still there, server? It's me, Margaret.}}","alt":"Are you still there, server? It's me, Margaret.","img":"https://imgs.xkcd.com/comics/heartbleed_explanation.png","title":"Heartbleed Explanation","day":"11"},{"month":"4","num":1355,"link":"","year":"2014","news":"","safe_title":"Airplane Message","transcript":"[[A little propeller plane toting a banner from behind that reads, 'Adriamycin, one of our most poten chemotherapy drugs, come from the dirt from an Italian castle.']]\nMY HOBBY: Breaking into airplane hangars and replacing the ads on their giant banners with cool facts.\n\n{{Title text: PHARAOH IRY-HOR, FROM THE 3100s BC, IS THE FIRST HUMAN WHOSE NAME WE KNOW.}}","alt":"PHARAOH IRY-HOR, FROM THE 3100s BC, IS THE FIRST HUMAN WHOSE NAME WE KNOW.","img":"https://imgs.xkcd.com/comics/airplane_message.png","title":"Airplane Message","day":"14"},{"month":"4","num":1356,"link":"","year":"2014","news":"","safe_title":"Orbital Mechanics","transcript":"[A line graph labeled 'How Well I Understand Orbital Mechanics:'. The x-axis is labeled 'time -->'. The line starts slightly above 0 at the y-axis and increases very little until a point at which it peaks slightly, labeled 'took high school physics'. It decreases slightly for a while and then increases significantly over a short period of time, the peak of which is labeled 'got physics degree'. It dips shallowly for a while, then starts to increase slightly for a time, labeled 'actual job at NASA'. The line starts to slope downward again, and then shoots up very, very high. The beginning of this increase is labeled 'started playing Kerbal Space Program'.]]\n\n{{Title text: To be fair, my job at NASA was working on robots and didn't actually involve any orbital mechanics. The small positive slope over that period is because it turns out that if you hang around at NASA, you get in a lot of conversations about space.}}","alt":"To be fair, my job at NASA was working on robots and didn't actually involve any orbital mechanics. The small positive slope over that period is because it turns out that if you hang around at NASA, you get in a lot of conversations about space.","img":"https://imgs.xkcd.com/comics/orbital_mechanics.png","title":"Orbital Mechanics","day":"16"},{"month":"4","num":1357,"link":"","year":"2014","news":"","safe_title":"Free Speech","transcript":"[[A person speaking to the reader.]]\nPerson: Public Service Announcehment: The *right to free speech* means the government can't arrest you for what you say.\n\n[[Close-up on person's face.]]\nPerson: It doesn't mean that anyone \nelse\n has to listen to your bullshit, - or host you while you share it.\n\n[[Back to full figure.]]\nPerson: The 1st Amendment doesn't shield you from criticism or consequences.\n\n[[Close-up.]]\nPerson: If you're yelled at, boycotted, have your show canceled, or get banned from an internet community, your free speech rights aren't being violated.\n\n[[Person, holding palm upward.]]\nPerson: It's just that the people listening think you're an asshole,\n\n[[A door that is ajar.]]\nPerson: And they're showing you the door.\n\n{{Title text: I can't remember where I heard this, but someone once said that defending a position by citing free speech is sort of the ultimate concession; you're saying that the most compelling thing you can say for your position is that it's not literally illegal to express.}}","alt":"I can't remember where I heard this, but someone once said that defending a position by citing free speech is sort of the ultimate concession; you're saying that the most compelling thing you can say for your position is that it's not literally illegal to express.","img":"https://imgs.xkcd.com/comics/free_speech.png","title":"Free Speech","day":"18"},{"month":"4","num":1358,"link":"","year":"2014","news":"","safe_title":"NRO","transcript":"[[Two people are in a field. One is kneeling on the grass, looking at a laptop on the ground. Another is facing the other direction, holding a book open to the sky.]]\nComputer: [Target located]\nPerson #1: Got him. - Left edge, two inches down.\nThe National Reconnaissance Office has an unusual approach to \nWhere's Waldo\n.\n\n{{Title text: 'DISPATCHING DRONE TO TARGET COORDINATES.' 'Wait, crap, wrong button. Oh jeez.'}}","alt":"'DISPATCHING DRONE TO TARGET COORDINATES.' 'Wait, crap, wrong button. Oh jeez.'","img":"https://imgs.xkcd.com/comics/nro.png","title":"NRO","day":"21"},{"month":"4","num":1359,"link":"","year":"2014","news":"","safe_title":"Phone Alarm","transcript":"[[A flow chart. First box says, 'Alarm goes off' which leads with a straight arrow to the next box, reading 'BEEP BEEP BEEP BEEP'. One curved arrow leads from this box back to itself. Another leads in the opposite direction to a box that says, '\"???\"'. From that an arrow leads down to 'Answer phone in dream', which leads to 'talk', which leads to 'hang up', which leads back to 'BEEP BEEP BEEP BEEP'.]]\nMy problem with phone alarms\n\n{{Title text: Who's calling me?? WHY IS THE WORST PERSON IN THE WORLD CALLING ME!?}}","alt":"Who's calling me?? WHY IS THE WORST PERSON IN THE WORLD CALLING ME!?","img":"https://imgs.xkcd.com/comics/phone_alarm.png","title":"Phone Alarm","day":"23"},{"month":"4","num":1360,"link":"","year":"2014","news":"","safe_title":"Old Files","transcript":"[[A cutaway view of a \"ground\" which is actually made up of layers labeled with various groups of files as one might see on a random person's computer fills the frame, such as \"Documents, 47 GB\" and \"High School Zip Disk, 94 MB\". A small crevice leads down through the middle, to a cave-like area where a figure stands looking through the smallest grouping of files. A second figure with long hair stands at ground level, looking down into the crevice.]]\nLong-haired Figure: You okay down there?\nSubterranean Figure: Oh my god. I wrote *poetry*.\n\n{{Title text: Wow, ANIMORPHS-NOVEL.RTF? Just gonna, uh, go through and delete that from all my archives real quick.}}","alt":"Wow, ANIMORPHS-NOVEL.RTF? Just gonna, uh, go through and delete that from all my archives real quick.","img":"https://imgs.xkcd.com/comics/old_files.png","title":"Old Files","day":"25"},{"month":"4","num":1361,"link":"","year":"2014","news":"","safe_title":"Google Announcement","transcript":"[Person stands behind a podium labeled Google.]\nPerson: The rumors are true. Google will be shutting down Plus--\nPerson: along with Hangouts, Photos, Voice, Docs, Drive, Maps, Gmail, Chrome, Android, and Search--\nPerson: to focus on our core project:\nPerson: the 8.8.8.8 DNS server.\n\n{{Title text: The less popular 8.8.4.4 is slated for discontinuation.}}","alt":"The less popular 8.8.4.4 is slated for discontinuation.","img":"https://imgs.xkcd.com/comics/google_announcement.png","title":"Google Announcement","day":"28"},{"month":"4","num":1362,"link":"","year":"2014","news":"","safe_title":"Morse Code","transcript":"[[Two people are sitting on a stony hill. One is sitting on the ground, the other is lying back and looking at the sky.]]\n\n[[The first person turns to the other and says...]\nPerson 1: When the French navy retired Morse code in 1997, they broadcast a final message: - \n\"Calling all. This is our last cry before our eternal silence.\"\n\n\n[[They sit in silence for a moment.]]\n\n[[The first person puts their hand to their chin.]]\nPerson 1: I wonder if I can find my Livejournal login.\nPerson 2: Hey I \nlike\n Livejournal.\nPerson 1: It's a nice place to go for some peace and quiet, I suppose.\n\n{{Title text: Oh, because Facebook has worked out SO WELL for everyone.}}","alt":"Oh, because Facebook has worked out SO WELL for everyone.","img":"https://imgs.xkcd.com/comics/morse_code.png","title":"Morse Code","day":"30"},{"month":"5","num":1363,"link":"","year":"2014","news":"","safe_title":"xkcd Phone","transcript":"[[Ad for a phone, with several factoids positioned around a picture of the device]]\n\n((factoids listed here starting clockwise from the top))\n\n-Runs custom blend of Android and iOS\n-Simulates alternative speed of light (default: 100 miles per hour) and adjusts clock as phone accelerates\n-Wireless\n-Accelerometer detects when phone is in freefall and makes it scream\n-When exposed to light, phone says \"hi!\"\n-FlightAware partnership: makes airplane noise when flights pass overhead\n-Realistic case\n-Clear screen\n-Side-facing camera\n\nIntroducing the XKCD Phone -- Your mobile world just went digital® \n\n{{Title text: Presented in partnership with Qualcomm, Craigslist, Whirlpool, Hostess, LifeStyles, and the US Chamber of Commerce. Manufactured on equipment which also processes peanuts. Price includes 2-year Knicks contract. Phone may extinguish nearby birthday candles. If phone ships with Siri, return immediately; do not speak to her and ignore any instructions she gives. Do not remove lead casing. Phone may attract\ntrap insects; this is normal. Volume adjustable (requires root). If you experience sudden tingling, nausea, or vomiting, perform a factory reset immediately. Do not submerge in water; phone will drown. Exterior may be frictionless. Prolonged use can cause mood swings, short-term memory loss, and seizures. Avert eyes while replacing battery. Under certain circumstances, wireless transmitter may control God.}}","alt":"Presented in partnership with Qualcomm, Craigslist, Whirlpool, Hostess, LifeStyles, and the US Chamber of Commerce. Manufactured on equipment which also processes peanuts. Price includes 2-year Knicks contract. Phone may extinguish nearby birthday candles. If phone ships with Siri, return immediately; do not speak to her and ignore any instructions she gives. Do not remove lead casing. Phone may attract/trap insects; this is normal. Volume adjustable (requires root). If you experience sudden tingling, nausea, or vomiting, perform a factory reset immediately. Do not submerge in water; phone will drown. Exterior may be frictionless. Prolonged use can cause mood swings, short-term memory loss, and seizures. Avert eyes while replacing battery. Under certain circumstances, wireless transmitter may control God.","img":"https://imgs.xkcd.com/comics/xkcd_phone.png","title":"xkcd Phone","day":"2"},{"month":"5","num":1364,"link":"","year":"2014","news":"","safe_title":"Like I'm Five","transcript":"[[Two characters are talking.]]\nLeft: What've you been up to?\nRight: Doing tons of math for my thesis.\nLeft: Can you explain it like I'm five?\nRight: \"Oh my God, where are your parents?\"\n\n{{Title text: 'Am I taking care of you? I have a thesis to write!' 'My parents are at their house; you visited last--' 'No, no, explain like you're five.'}}","alt":"'Am I taking care of you? I have a thesis to write!' 'My parents are at their house; you visited last--' 'No, no, explain like you're five.'","img":"https://imgs.xkcd.com/comics/like_im_five.png","title":"Like I'm Five","day":"5"},{"month":"5","num":1365,"link":"","year":"2014","news":"","safe_title":"Inflation","transcript":"[[Scientists are standing and sitting at a computer.]]\nSitting: Imprinted on the sky\nSitting: Are the gravity waves that were sloshing across the universe.\n[[The sitting character holds hands a short distance apart.]]\nSitting: When it was \nthis big\n.\n\nSitting: So really, we're using the entire universe\nSitting: As a giant microscope\nSitting: Pointed at itself when it was small.\n\n[[Sitting turns to the computer.]]\nStanding: That's neat.\nSitting: Yeah. But...\nStanding: But what?\nSitting: Well, look.\n\nStanding: Oh. Hmm.\nSitting: Yeah.\nStanding: What...\nSitting: I don't know.\n\n[[ The final panel is a picture of the early universe, through a Mollweide projection.  The lines typical of a basketball can be seen, as well as the word 'Spalding' ]]\n\n{{Title text: Wait till they notice the faint reflection of Michael Jordan and Bugs Bunny in the E-mode.}}","alt":"Wait till they notice the faint reflection of Michael Jordan and Bugs Bunny in the E-mode.","img":"https://imgs.xkcd.com/comics/inflation.png","title":"Inflation","day":"7"},{"month":"5","num":1366,"link":"","year":"2014","news":"","safe_title":"Train","transcript":"[[The world is shown, with a train on top.  There's an arrow indicating the direction the world is rotating.]]\nPassenger: ... Almost ...\nA machine that grabs the Earth by metal rails and rotates it until the part you want is near you.\n\n{{Title text: Trains rotate the Earth around various axes while elevators shift its position in space.}}","alt":"Trains rotate the Earth around various axes while elevators shift its position in space.","img":"https://imgs.xkcd.com/comics/train.png","title":"Train","day":"9"},{"month":"5","num":1367,"link":"","year":"2014","news":"","safe_title":"Installing","transcript":"[[One character is talking to another.]]\nCharacter: Installing things has gotten so fast and painless.\nCharacter: Why not skip it entirely, and make a phone that has every app \"installed\" already and just downloads and runs them on the fly?\nI felt pretty clever until I realized I'd invented webpages.\n\n{{Title text: But still, my scheme for creating and saving user config files and data locally to preserve them across reinstalls might be useful for--wait, that's cookies.}}","alt":"But still, my scheme for creating and saving user config files and data locally to preserve them across reinstalls might be useful for--wait, that's cookies.","img":"https://imgs.xkcd.com/comics/installing.png","title":"Installing","day":"12"},{"month":"5","num":1368,"link":"","year":"2014","news":"","safe_title":"One Of The","transcript":"[[A TV presenter is at a desk in front of a picture of an arch.]]\nPresenter: ... And he went on to design the Gateway Arch, one of the most recognizable arches in St. Louis.\n Pet Peeve: Reporters unnecessarily hedging with \"One of the\"\n\n{{Title text: 'The world's greatest [whatever]' is subjective, but 'One of the world's greatest [whatever]s' is clearly objective. Anyway, that's why I got you this 'one of the world's greatest moms' mug!}}","alt":"'The world's greatest [whatever]' is subjective, but 'One of the world's greatest [whatever]s' is clearly objective. Anyway, that's why I got you this 'one of the world's greatest moms' mug!","img":"https://imgs.xkcd.com/comics/one_of_the.png","title":"One Of The","day":"14"},{"month":"5","num":1369,"link":"","year":"2014","news":"","safe_title":"TMI","transcript":"[[Someone is sitting at a desk with a laptop.]]\nSomeone: Ugh, TMI.\n\n[[From off panel, a voice speaks.]]\nVoice: Oh? What?\n\nSomeone: Just...\nSomeone: Everything.\nVoice: \nTrue.\n\n\n{{Title text: 'TMI' he whispered, gazing into the sea.}}","alt":"'TMI' he whispered, gazing into the sea.","img":"https://imgs.xkcd.com/comics/tmi.png","title":"TMI","day":"16"},{"month":"5","num":1370,"link":"","year":"2014","news":"","safe_title":"President","transcript":"[[A large person is talking to a small person, who is presumably young.]]\nLarge: I can't imagine anyone who grew up on the Internet being able to run for President.\n\nSmall: Why?\nSmall: Because it'd mark the handover of a world that no longer needs you to a generation you don't understand?\n\nSmall: ... or because there would be embarrassing pictures of us as teenagers?\n\nLarge: Um.\nLarge: The pictures one?\nSmall: Pictures of teens!  How will we even survive?\n\n{{Title text: Anyone who thinks we're all going to spend the 2032 elections poring over rambling blog posts by teenagers has never tried to read a rambling blog post by a teenager.}}","alt":"Anyone who thinks we're all going to spend the 2032 elections poring over rambling blog posts by teenagers has never tried to read a rambling blog post by a teenager.","img":"https://imgs.xkcd.com/comics/president.png","title":"President","day":"19"},{"month":"5","num":1371,"link":"","year":"2014","news":"","safe_title":"Brightness","transcript":"[[The panel is white ink on a black background.  A character is staring at the ground.]]\nCharacter: Based on this decrease in the star's brightness, I believe it is orbited by at least one planet.\nExoplanet astronomers at night\n\n{{Title text: Recently, some exoplanet astronomers have managed to use careful analysis of reflected light to discover Earth during the day.}}","alt":"Recently, some exoplanet astronomers have managed to use careful analysis of reflected light to discover Earth during the day.","img":"https://imgs.xkcd.com/comics/brightness.png","title":"Brightness","day":"21"},{"month":"5","num":1372,"link":"","year":"2014","news":"","safe_title":"Smartwatches","transcript":"A use for smartwatches:\n\n[[Two smartwatches are shown on the left side of the panel, with an arrow pointing to them saying \"working\"; an iPhone is shown on the right side, with another arrow saying \"dead\".]]\n\n[[A hacksaw cuts the iPhone in half across the shorter axis of the screen.]]\n\n[[The electronics and screens from the two smartwatches are removed from the bands and placed onto the iPhone halves.]]\n\n[[A hinge is installed between the two iPhone halves.]]\n\n[[The hinge is shown closing, folding the iPhone halves together, with the text \"World's first flip iPhone\".]]\n\n{{Title text: This is even better than my previous smartphone casemod: an old Western Electric Model 2500 desk phone handset complete with a frayed, torn-off cord dangling from it.}}","alt":"This is even better than my previous smartphone casemod: an old Western Electric Model 2500 desk phone handset complete with a frayed, torn-off cord dangling from it.","img":"https://imgs.xkcd.com/comics/smartwatches.png","title":"Smartwatches","day":"23"},{"month":"5","num":1373,"link":"","year":"2014","news":"","safe_title":"Screenshot","transcript":"When someone posts a screenshot of their phone,\n\n[[Image depicts a phone screenshot as part of a post on a website. In the screenshot, the battery indicator is at 6%. The battery indicator portion of the screenshot is circled in bright red circles, and bright red exclamation marks have been added.]]\n\nI can't pay attention to the content if their battery is low.\n\n{{Title text: I'M PLUGGING IN MY PHONE BUT THE BATTERY ON THE SCREEN ISN'T CHARGING}}","alt":"I'M PLUGGING IN MY PHONE BUT THE BATTERY ON THE SCREEN ISN'T CHARGING","img":"https://imgs.xkcd.com/comics/screenshot.png","title":"Screenshot","day":"26"},{"month":"5","num":1374,"link":"","year":"2014","news":"","safe_title":"Urn","transcript":"[[A lecturer is standing in front of a student at a desk.]]\nLecturer: Imagine that you're drawing at random from an urn containing fifteen balls--six red and nine black.\nStudent: Ok.  I reach in and... \n...My grandfather's ashes?!? Oh god!\n\nLecturer: I... what?\nStudent: \nWhy would you do this to me?!?\n\n\n{{Title text: Can this PLEASE be drawing with replacement?}}","alt":"Can this PLEASE be drawing with replacement?","img":"https://imgs.xkcd.com/comics/urn.png","title":"Urn","day":"28"},{"month":"5","num":1375,"link":"","year":"2014","news":"","safe_title":"Astronaut Vandalism","transcript":"[[A signpost has had a third arrow added at the top, pointing up.  The signs read:]]\nSpace 62\nJackson 115\nMemphis 98\n\n{{Title text: That night, retired USAF pilots covertly replaced the '62' with '50'.}}","alt":"That night, retired USAF pilots covertly replaced the '62' with '50'.","img":"https://imgs.xkcd.com/comics/astronaut_vandalism.png","title":"Astronaut Vandalism","day":"30"},{"month":"6","num":1376,"link":"","year":"2014","news":"","safe_title":"Jump","transcript":"[[A character is posed in a series of positions across a landscape.  The implication is that the character is progressing forward in time towards the right side of the panel.]]\nI love these dreams\n[[The character leaps into the air, the word 'jump' above them.]]\nEach jump is a little longer\n[[They leap down a small incline, traveling a fair distance.]]\nEach push off the ground a little softer\n[[The character leaps a third time.]]\nUntil I\n[[The character does not touch the ground again.]]\n\nG L I D E\n\n\n[[The character continues to hover over the landscape, above scrub grass, a wind barrier, sand dunes, and a beach.  Birds can be seen in the distance as the character drifts out to sea.]]\n\n[[The character passes a small fish jumping.]]\nCharacter: ...I \nhope\n this is a dream.\n\n{{Title text: I hope I'm at least following the curve of the Earth around to land ...}}","alt":"Or that I'm at least following the curve of the Earth around to land ...","img":"https://imgs.xkcd.com/comics/jump.png","title":"Jump","day":"2"},{"month":"6","num":1377,"link":"","year":"2014","news":"","safe_title":"Fish","transcript":"[[Two characters are talking.]]\nLeft: The Fermi Paradox keeps getitng worse. If planets are common, where \nis\n everybody?\n\nRight: Imagine you're a SCUBA diver looking at the ocean floor.\nRight: You know there's a fish there, but you can't see it.  Why?\n\n[[The panel zooms out, ground dark beneath the characters.]]\nLeft: Maybe the fish looks like sand.\nRight: Yeah ...\n\n[[The panel zooms out further, the entire Earth visible against the blackness of space.]]\nRight: ... And what would that tell you about the ecosystem?\n\n[[The Earth is silent.]]\n\n[[The Earth exits, stage left.]]\n\n[[This panel is completely black.]]\n\n[[A shark enters from stage right.]]\n\n{{Title text: [Astronomer peers into telescope] [Jaws theme begins playing]}}","alt":"[Astronomer peers into telescope] [Jaws theme begins playing]","img":"https://imgs.xkcd.com/comics/fish.png","title":"Fish","day":"4"},{"month":"6","num":1378,"link":"","year":"2014","news":"","safe_title":"Turbine","transcript":"[[A character is standing near a wind turbine.]]\nCharacter: I'll hold up a big kite, and you blow air at me until I lift off!\nCharacter: What do you think of that idea?\nTurbine: I'm not a huge fan.\n\n{{Title text: Ok, plan B: Fly a kite into the blades, with a rock in a sling dangling below it, and create the world's largest trebuchet.}}","alt":"Ok, plan B: Fly a kite into the blades, with a rock in a sling dangling below it, and create the world's largest trebuchet.","img":"https://imgs.xkcd.com/comics/turbine.png","title":"Turbine","day":"6"},{"month":"6","num":1379,"link":"","year":"2014","news":"","safe_title":"4.5 Degrees","transcript":"Without prompt, aggressive limits on CO2 emissions, the Earth will likely warm by an average of 4°-5°C by the century's end.\nHow big a change is that?\n[[The panel shows a temperature scale.]]\nIn the coldest part of the last ice age, Earth's average temperature was 4.5°C below the 20th century norm.\nLet's call a 4.5°C difference one \"Ice Age unit.\"\n\n((These are along the time line, spaced out for clarity.))\n-2 IAU\n<-- snowball Earth (-4 IAU)\n\n-1 IAU\n20,000 years ago\n((There's an inset panel, showing a picture of a glacier.))\nMy neighborhood:\nHalf a mile of ice\n\n0\nAverage during modern times\n((Another inset panel.))\n[[A character is in the foreground of a green field with a skyline in the distance.]]\nMy neighborhood:\nCharacter: Hi!\n\n0.20\nWhere we are today\n\n+1 IAU\nWhere we'll be in 86 years\n((Another inset panel.))\nMy neighborhood:\n?\n\n+2 IAU\nCretaceous hothouse\n+200m sea level rise\nNo glaciers\nPalm trees at the poles\n\n{{Title text: The good news is that according to the latest IPCC report, if we enact aggressive emissions limits now, we could hold the warming to 2°C. That's only HALF an ice age unit, which is probably no big deal.}}","alt":"The good news is that according to the latest IPCC report, if we enact aggressive emissions limits now, we could hold the warming to 2°C. That's only HALF an ice age unit, which is probably no big deal.","img":"https://imgs.xkcd.com/comics/4_5_degrees.png","title":"4.5 Degrees","day":"9"},{"month":"6","num":1380,"link":"","year":"2014","news":"","safe_title":"Manual for Civilization","transcript":"Brian Eno: Hi. I'm music's Brian Eno, co-founder of the Long Now Foundation.\n\n[[Brian Eno is on a stage.]]\nBrian Eno: As part of our mission to promote long-term thinking, we've asked experts to help us assemble a collection of books from which civilization can be rebuilt if it ever collapses.\n\n[[Brian Eno holds up a list.]]\nBrian Eno: Today, we're sharing the results--the first ever \nManual for Civilization\n.\n\n[[Brian Eno begins to read, until he is interrupted by a voice from off-panel.]]\nBrian Eno: *Ahem* \nAnimorphs #1: The Invasion\n\nBrian Eno: \nAnimorphs #2: The Visitor\n\nBrian Eno: \nAnimorphs #3: The Encounter\n\nVoice: ... Are they \nall\n Animorphs books?\nBrian Eno: No! There's also \nMegamorphs\n and \nThe Andalite Chronicles.\n\n\n{{Title text: We will have an entire wing of the library devoted to copies of book #26, because ohmygod it's the one where Jake and Cassie finally KISS!!!}}","alt":"We will have an entire wing of the library devoted to copies of book #26, because ohmygod it's the one where Jake and Cassie finally KISS!!!","img":"https://imgs.xkcd.com/comics/manual_for_civilization.png","title":"Manual for Civilization","day":"11"},{"month":"6","num":1381,"link":"","year":"2014","news":"","safe_title":"Margin","transcript":"[[The panel shows a mostly-illegible page of a book.  In the margin is a note.  Unusually for xkcd, this note is written in lower-case.]]\nI have discovered a truly marvelous proof that information is infinitely compressible, but this margin is too small to...\n...oh\nnever mind :(\n\n{{Title text: PROTIP: You can get around the Shannon-Hartley limit by setting your font size to 0.}}","alt":"PROTIP: You can get around the Shannon-Hartley limit by setting your font size to 0.","img":"https://imgs.xkcd.com/comics/margin.png","title":"Margin","day":"13"},{"month":"6","num":1382,"link":"","year":"2014","news":"","safe_title":"Rocket Packs","transcript":"Rocket packs are easy.\n[[Someone is lying on the ground wearing a rocket pack, with heat waves coming from their lower legs and feet.]]\nSomeone: Ow.\nThe hard part is inventing the calf shields.\n\n{{Title text: Every year: 'It's <year>--I want my jetpack [and also my free medical care covering all my jetpack-related injuries]!'}}","alt":"Every year: 'It's <year>--I want my jetpack [and also my free medical care covering all my jetpack-related injuries]!'","img":"https://imgs.xkcd.com/comics/rocket_packs.png","title":"Rocket Packs","day":"16"},{"month":"6","num":1383,"link":"","year":"2014","news":"","safe_title":"Magic Words","transcript":"[[Two characters are in bed.]]\nLinguist: Can you repeat \"Story water paper doorway\" at the start, then switch to \"Disarm Adele's giraffe grenade\" as we get going, and finally \"Strawberry scorpion poetry\" as I finish?\nLinguist with a foot fetish\n\n{{Title text: 'And then whisper 'anapest' in my ear as you hold me?'}}","alt":"'And then whisper 'anapest' in my ear as you hold me?'","img":"https://imgs.xkcd.com/comics/magic_words.png","title":"Magic Words","day":"18"},{"month":"6","num":1384,"link":"","year":"2014","news":"","safe_title":"Krypton","transcript":"[[Stick Man looks into a telescope. Dark Hair stands beside them and looks in the opposite direction.]]\nSM: The distant planet Krypton is becoming unstable!\nOut of Panel: WAAAAAA\nDH: That crying baby is really annoying.\n\n[[They look at each other.]]\n\n[[A small rocket launches.]]\n\n[[The rocket is headed toward Krypton. Kal-El's star-shaped ship is seen heading in the opposite direction.]]\n\n[[Krypton explodes.]]\n\n{{Title text: Their Sun and gravity will make you, uh, something, I guess. Out of earshot from Earth, mostly.}}","alt":"Their Sun and gravity will make you, uh, something, I guess. Out of earshot from Earth, mostly.","img":"https://imgs.xkcd.com/comics/krypton.png","title":"Krypton","day":"20"},{"month":"6","num":1385,"link":"","year":"2014","news":"","safe_title":"Throwing Rocks","transcript":"[[Dark Hair person and White Beret person stand at the edge of a body of water. White Beret person throws a stone into the water.]]\nWB: Every day I make a little leaf boat, then I throw rocks until it sinks or floats away.\n\n[[The stone lands in the water.]]\n<<plonk>>\nIt's pointless, but at least it's relaxing.\n\n[[Dark Hair picks up a stone and examines it.]]\nDH: Every day, I read the comments on a news article.\n\n[[They both throw stones into the water.]]\n\n{{Title text: ::PLOOOOSH:: Looks like you won't be making it to Vinland today, Leaf Erikson.}}","alt":"::PLOOOOSH:: Looks like you won't be making it to Vinland today, Leaf Erikson.","img":"https://imgs.xkcd.com/comics/throwing_rocks.png","title":"Throwing Rocks","day":"23"},{"month":"6","num":1386,"link":"","year":"2014","news":"","safe_title":"People are Stupid","transcript":"[[White Hat Man talks to Stick Figure Guy.]]\nWH: Well, you know, people are stupid.\nSF: *sigh*\n\n[[The continue to face each other and converse.]]\nSF: No, people aren't stupid. On average, people are of average intelligence. When you say \"people are stupid,\" you mean stupid compared to \nyour\n expectations.\n\n[[A close-up on Stick Figure.]]\nSF: What you're really saying is \"other people aren't as smart as \nme\n. - And maybe you're right! In which case\n\nI'd like to bestow upon you the First Annual AWARD for EXCELLENCE in BEING VERY SMART.\n[[Stick Figure presents White Hat with a trophy as confetti rains down.]]\nMay you continue to grace our internet with your wisdom.\n\n{{Title text: To everyone who responds to everything by saying they've 'lost their faith in humanity': Thanks--I'll let humanity know. I'm sure they'll be crushed.}}","alt":"To everyone who responds to everything by saying they've 'lost their faith in humanity': Thanks--I'll let humanity know. I'm sure they'll be crushed.","img":"https://imgs.xkcd.com/comics/people_are_stupid.png","title":"People are Stupid","day":"25"},{"month":"6","num":1387,"link":"","year":"2014","news":"","safe_title":"Clumsy Foreshadowing","transcript":"TODAYS NEWS\n[[Little thumbnails accompany each headline.]]\nNorth Korea Threatens U.S. Over Upcoming Movie\nShark Populations Booming Off East Coast\nSpaceX to Attempt New Rocket Launch Today\n\n[[A down arrow leads from the above headlines to this panel. A person walks away toward the edge of the panel, coat over arm. A TV in the background shows a talking head reading the news.]]\nPerson: Bye! See you tonight!\nOut of Panel: Have a good day!\nTV: \nResearchers are reporting record numbers of sharks...\n\nTo make news stories seem way more ominous, imagine you're hearing them from a background TV in a movie as the main character leaves.\n\n{{Title text: '... hosts were unexpectedly fired from ABC's 'The View' today. ABC will likely announce new ...'}}","alt":"'... hosts were unexpectedly fired from ABC's 'The View' today. ABC will likely announce new ...'","img":"https://imgs.xkcd.com/comics/clumsy_foreshadowing.png","title":"Clumsy Foreshadowing","day":"27"},{"month":"6","num":1388,"link":"","year":"2014","news":"","safe_title":"Subduction License","transcript":"[[White Beret approaches Stick Man, who is at his computer desk.]]\nWB: Sweet! I finally got my subduction license!\nSM: Your what?\n\n[[White Beret leans forward on one foot and balls up his fists with effort.]]\nSM: ...what are you doing?\n\n[[White Beret leans further forward, getting closer to the desk. His feet are now buried and tiny mountains are forming on the floor and under the desk. Stick man tries to keep his computer from toppling over.]]\nSM: STOP IT! STOP IT!\n\n[[White Beret is buried up to his waist now, and the little mountains are a full-on miniature mountain range, knocking over the desk and Stick Man with it.]]\nSM: AUGH!\n\n{{Title text: 'Dude, why can't you just be a normal roommate?' 'Because I'm coming TOWARD you!'}}","alt":"'Dude, why can't you just be a normal roommate?' 'Because I'm coming TOWARD you!'","img":"https://imgs.xkcd.com/comics/subduction_license.png","title":"Subduction License","day":"30"},{"month":"7","num":1389,"link":"https://xkcd.com/1389/large/","year":"2014","news":"","safe_title":"Surface Area","transcript":"{{Title text: This isn't an informational illustration; this is a thing I think we should do. First, we'll need a gigantic spool of thread. Next, we'll need some kind of ... hmm, time to head to Seattle.}}\n\nSpace\nWithout the space\nThe solar system's solid surfaces stitched together\n(excluding dust and small rocks)\n\n((Map showing each solid planet and planetoid surface area to scale))\nIO\nCallisto\nEuropa\nGanymede\nVesta\nCeres\nAsteroids (1km+)\nTethys\nDione\nIapetus\nEnceladus\nAll human skin\nRhea\nTitan\nAsteroids (100m+)\nOberon\nMiranda\nAriel\nTitania\nUmbriel\nMercury\nThe moon\nVarious small moons, comets, etc\nMars\nMakemake\nHaumea\nEris\nCharon\nPluto\nVenus","alt":"This isn't an informational illustration; this is a thing I think we should do. First, we'll need a gigantic spool of thread. Next, we'll need some kind of ... hmm, time to head to Seattle.","img":"https://imgs.xkcd.com/comics/surface_area.png","title":"Surface Area","day":"2"},{"month":"7","num":1390,"link":"","year":"2014","news":"","safe_title":"Research Ethics","transcript":"[[A person with dark hair speaks to two people, one with a light-colored ponytail and the other without any hair.]]\nDark hair: Facebook shoudn't choose what stuff they show us to conduct unethical psychological research. - They should \nonly\n make those decisions based on, uh... - however they were doing it before. - Which was probably ethical, right?\n\n{{Title text: I mean, it's not like we could just demand to see the code that's governing our lives. What right do we have to poke around in Facebook's private affairs like that?}}","alt":"I mean, it's not like we could just demand to see the code that's governing our lives. What right do we have to poke around in Facebook's private affairs like that?","img":"https://imgs.xkcd.com/comics/research_ethics.png","title":"Research Ethics","day":"4"},{"month":"7","num":1391,"link":"","year":"2014","news":"","safe_title":"Darkness","transcript":"[[A news anchor with a ponytail sits at a news desk while a correspondent is inset in a black box on the screen next to her.]]\nAnchor: ...getting reports that the darkness has spread as far west as Texas. Let's go live to our reporter in Houston.\nCorrespondent: It's been thirty minutes since the sun vanished...\n\"Genie, for my last wish, make everyone in the media forget about the day-night cycle.\"\n\n{{Title text: This was actually wish #406. Wish #2 was for him to lose the ability to remember that each new wish wasn't my first.}}","alt":"This was actually wish #406. Wish #2 was for him to lose the ability to remember that each new wish wasn't my first.","img":"https://imgs.xkcd.com/comics/darkness.png","title":"Darkness","day":"7"},{"month":"7","num":1392,"link":"https://xkcd.com/1392/large/","year":"2014","news":"","safe_title":"Dominant Players","transcript":"{{Title text: When Vera Menchik entered a 1929 tournament, a male competitor mocked her by suggesting that a special 'Vera Menchik Club' would be created for any player who lost to her. When the tournament began, he promptly became the first member of said club, and over the years it accumulated a large and illustrious roster.}}\n\nDominant Players over time\n\n[[Graph of Basketball (NBA\nABA) Player Efficiency Rating from 1950 to 2014]]\n\n[[Chess Elo Rating from 1950 to 2014]]\nModern Elo rating system dates back to about 1970.\nComputer analysis (like Kenneth Regan's) lets us rate historical players,but this has only been done rigorously for a few tournaments.  Dashed lines are rough estimates only.\n\n[[Chess Elo rating for women from 1950 to 2014]]\nFor a long time, sexism, a lack of role models, and institutional hostility largely kept women from pursuing serious chess careers.\nWith the expansion of women's tournaments and prizes starting in the 1970s, this has begun to change.","alt":"When Vera Menchik entered a 1929 tournament, a male competitor mocked her by suggesting that a special 'Vera Menchik Club' would be created for any player who lost to her. When the tournament began, he promptly became the first member of said club, and over the years it accumulated a large and illustrious roster.","img":"https://imgs.xkcd.com/comics/dominant_players.png","title":"Dominant Players","day":"9"},{"month":"7","num":1393,"link":"","year":"2014","news":"","safe_title":"Timeghost","transcript":"[[A ghost flies over to a couple of people.]]\nGhost: ...ooOOOOOOOOooo... Tiiiime is passiiiing! \nPerson 1: Ugh. Timeghost.\nPerson 2: Huh?\nPerson 1: Here come the factoids.\n\n[[The ghost flies around in little circles as it speaks. Person 1 turns away.]]\nTG: \nForrest Gump\n came out closer to the Vietnam War than to the present daaay.\nP1: Go away!\nTG: The average new grandparents are younger than Keanu Reeeeves!\nP2: That can't be right...\n\n[[The ghost is out of panel. Person 1 is plugging their ears.]]\nTG: Today's new parents were ten when Eminem got big - DaAaaAaad MuuUuUuSic - They remember Simpsons Season 5 or 6 at the earliest.\nP1: Argh!\nP2: How long has it been doing this?\n\n[[The ghost floats above them. They look up.]]\nTG: The staaaaart of my haunting is now further away than your deaaaths!\nP1: Will you sto--WHAT!?\n\n{{Title text: 'Hello, Ghostbusters?' 'ooOOoooo people born years after that movie came out are having a second chiiiild right now ooOoooOoo'}}","alt":"'Hello, Ghostbusters?' 'ooOOoooo people born years after that movie came out are having a second chiiiild right now ooOoooOoo'","img":"https://imgs.xkcd.com/comics/timeghost.png","title":"Timeghost","day":"11"},{"month":"7","num":1394,"link":"","year":"2014","news":"","safe_title":"Superm*n","transcript":"[[A tall man with black hair and a red cape comes to the aid of a stick man trying to reach something on a high shelf.]]\nSuperm*n: I'll get it! I'm 5 inches taller and 7% stronger than the average man!\nThe new Supermoon-inspired \nSuperman\n reboot.\n\n{{Title text: See also: Spider-Man reboot in which he can produce several inches of web, doesn't need as much chalk powder on his hands when he goes rock climbing, and occasionally feels vaguely uneasy about situations.}}","alt":"See also: Spider-Man reboot in which he can produce several inches of web, doesn't need as much chalk powder on his hands when he goes rock climbing, and occasionally feels vaguely uneasy about situations.","img":"https://imgs.xkcd.com/comics/superm_n.png","title":"Superm*n","day":"14"},{"month":"7","num":1395,"link":"","year":"2014","news":"","safe_title":"Power Cord","transcript":"[[A stick figure is sitting on a chair typing on a laptop whose cord is lying on the floor, unplugged. White Beret man approaches.]]\n<<type type>>\n\n[[White Beret picks up the cord and examines it. The person in the chair continues typing.]]\n<<type type>>\n\n[[White Beret puts the cord into his mouth and blows, causing the laptop to inflate, which surprises the person typing.]]\n<<PBBBBT>>\n<<FOOMP>>\n\n[[White Beret man walks away as the formerly typing person climbs up the chair to reach his now floating-away laptop.]]\n\n{{Title text: In this situation, gzip \ndev\ninside to deflate, then pipe the compressed air to \ndev\ninput to clean your keyboard. Avert your eyes when you do.}}","alt":"In this situation, gzip /dev/inside to deflate, then pipe the compressed air to /dev/input to clean your keyboard. Avert your eyes when you do.","img":"https://imgs.xkcd.com/comics/power_cord.png","title":"Power Cord","day":"16"},{"month":"7","num":1396,"link":"","year":"2014","news":"","safe_title":"Actors","transcript":"Who are today's 10 HOTTEST ACTORS?\n[[A hairless person with a clipboard stands behind a shaggy-haired person holding a device which is emitting some sort of beam toward something out of panel.]]\nShaggy-hair: 81.5, but I think it got part of his shirt. -- HEY JUSTIN - HOLD STILL!\nWe grab an infrared thermometer and find out!\n\n{{Title text: Once again topping the list of tonight's hottest rising stars in Hollywood is Î¾ Persei!}}","alt":"Once again topping the list of tonight's hottest rising stars in Hollywood is ξ Persei!","img":"https://imgs.xkcd.com/comics/actors.png","title":"Actors","day":"18"},{"month":"7","num":1397,"link":"","year":"2014","news":"","safe_title":"Luke","transcript":"[[Darth Vader is speaking to Luke Skywalker while holding what appears to be an unactivated light saber.]]\nDarth Vader: \nI See You Have Constructed A New Light Saber.\n\nLuke: ...yes. That is definitely what I did.\nVader finds Luke's fleshlight.\n\n{{Title text: Don't turn it on.}}","alt":"Don't turn it on.","img":"https://imgs.xkcd.com/comics/luke.png","title":"Luke","day":"21"},{"month":"7","num":1398,"link":"","year":"2014","news":"","safe_title":"Snake Facts","transcript":"Snake Facts:\nSnake venom evolved from saliva, which means that it all started with a snake whose mouth was \nsliiightly\n more gross than usual.\n\n[[A snake slithers into frame.]]\nSnake: Hi guys! \nOut-of-panel: Eww, it's Frank.\n\nThe world's longest snake is found in Brazil, Peru, and Chile. It is believed to be over 60 years old.\n[[A range map showing South America with a silhouette of a giant snake marking the range.]]\n\n[[A snake skeleton.]]\nIf you lad all the bones in a snake end-to-end, you would have a snake.\n\n{{Title text: Biologically speaking, what we call a 'snake' is actually a human digestive tract which has escaped from its host.}}","alt":"Biologically speaking, what we call a 'snake' is actually a human digestive tract which has escaped from its host.","img":"https://imgs.xkcd.com/comics/snake_facts.png","title":"Snake Facts","day":"23"},{"month":"7","num":1399,"link":"","year":"2014","news":"","safe_title":"Chaos","transcript":"[[A stick figure is looking at a whiteboard covered in diagrams.]]\nSF: For two decades, I've studied phase space, nonlinear equations, and strange attractors.\n\n[[The figure stand in silence, looking at the board.]]\n\n[[They continue to look at the board.]]\nSF: And there is \nnothing\n in here about dinosaurs escaping.\n\n{{Title text: Although the oral exam for the doctorate was just 'can you do that weird laugh?'}}","alt":"Although the oral exam for the doctorate was just 'can you do that weird laugh?'","img":"https://imgs.xkcd.com/comics/chaos.png","title":"Chaos","day":"25"}]
