[{"month":"3","num":1500,"link":"","year":"2015","news":"","safe_title":"Upside-Down Map","transcript":"((A mercator projection of the world map is shown. All the continents have been rotated one hundred eighty degrees.))\n\n((Cuba  is next to alaska, and alaska is touching the tip of south america, which is all near the equator. Mexico is now friends with greenland.\n\n((Iceland, the UK, and asia are all close together. Japan and Taiwan haven't moved with the asian continent, and are technically European.))\n\n((Siberia is now equatorial. Africa is pretty temperate, except for the north bits which are somewhat antarctic.))\n\nCaption: This upside-down map will change your perspective on the world!\n\n{{Title text: Due to their proximity across the channel, there's long been tension between North Korea and the United Kingdom of Great Britain and Southern Ireland.}}","alt":"Due to their proximity across the channel, there's long been tension between North Korea and the United Kingdom of Great Britain and Southern Ireland.","img":"https://imgs.xkcd.com/comics/upside_down_map.png","title":"Upside-Down Map","day":"18"},{"month":"3","num":1501,"link":"","year":"2015","news":"","safe_title":"Mysteries","transcript":"[[Title of this comic is MYSTERIES, it's a graph with two axis. The horizontal axis ranges from NOT THAT WEIRD to WEIRD AS HELL. The vertical axis ranges from I HAVE NO EXPLANATION to EXPLANATION SEEMS PRETTY CLEAR.]]\n\n[[Not that weird and i have no explanation]]\nwho carly simon is singing about in you're so vain\nlindbergh baby\nuvb-seventy-six\ntoynbee tiles\njimmy hoffa\n\n[[Not that weird and explanation seems pretty clear]]\nvoynich manuscript\njfk\nwhy i keep putting ice cream back in the fridge instead of the freezer\noak island money pit\n\n[[I have no explanation and weird as hell]]\nthe wow signal\ndb cooper\nmh 370\nlead masks case\nsalish sea feet\nmary celeste\n\n[[weird as hell and explanation seems pretty clear]]\nzodiac letters\namelia earhart\nlost colony\nkentucky meat shower\nbigfoot\nloch ness monster\ndyatlov pass incident\n\n{{Title text: At the bottom left: The mystery of why, when I know I needed to be asleep an hour ago, I decide it's a good time to read through every Wikipedia article in the categories 'Out-of-place artifacts', 'Earth mysteries', 'Anomalous weather', and 'List of people who disappeared mysteriously'.}}","alt":"At the bottom left: The mystery of why, when I know I needed to be asleep an hour ago, I decide it's a good time to read through every Wikipedia article in the categories 'Out-of-place artifacts', 'Earth mysteries', 'Anomalous weather', and 'List of people who disappeared mysteriously'.","img":"https://imgs.xkcd.com/comics/mysteries.png","title":"Mysteries","day":"20"},{"month":"3","num":1502,"link":"","year":"2015","news":"","safe_title":"Wasted Time","transcript":"((Two characters are talking. One is wielding a small electronic device. The other is wearing a hat.))\n\nHacker: This new keyboard is like thirty percent faster! I'm never going back.\nHaberdasher: Good, put those years of horror behind you.\nHacker: Come on. Sure, sometimes my focus on efficiency doesn't make sense. But we type a LOT. That 30% improvement pretty quickly adds up to a HUGE amount of wasted time rescued.\nHaberdasher: I just watched you open google news and then close it without reading it FIVE TIMES IN A ROW.\nHacker: The fact that I spend most of my time so stupidly only makes it MORE important not to waste any here.\n\n{{Title text: Since it sounds like your time spent typing can't possibly be less productive than your time spent not typing, have you tried typing SLOWER?}}","alt":"Since it sounds like your time spent typing can't possibly be less productive than your time spent not typing, have you tried typing SLOWER?","img":"https://imgs.xkcd.com/comics/wasted_time.png","title":"Wasted Time","day":"23"},{"month":"3","num":1503,"link":"","year":"2015","news":"","safe_title":"Squirrel Plan","transcript":"((A squirrel ASTRONAUT is suspended in some kind of harness beneath a child's helium balloon. Two other squirrels serve as its GROUND TEAM.))\n\nGround team: Once you've chewed a hole in the sun, shoot the balloon to fall back to earth, then pull the parachute ripcord to land.\nAstronaut: Are you SURE it's full of acorns?\nGround team: Look how bright and magnificent is is! What ELSE could be in there?\n\n{{Title text: [Halfway to the Sun ...] Heyyyy ... what if this BALLOON is full of acorns?!}}","alt":"[Halfway to the Sun ...] Heyyyy ... what if this BALLOON is full of acorns?!","img":"https://imgs.xkcd.com/comics/squirrel_plan.png","title":"Squirrel Plan","day":"25"},{"month":"3","num":1504,"link":"","year":"2015","news":"","safe_title":"Opportunity","transcript":"((The year is 2010. Two scientists hunker over a large console.))\nFirst scientist: After six years, Spirit is down, but Opportunity is still going strong.\nSecond scientist: Tough little rover.\n\n((The year is 2015. Two scientists dialogue over radio while a tiny wheeled robot drives cheerfully across the martian surface.))\nFirst scientist: Eleven years, wow.\nSecond scientist: Wasn't the original mission 90 days?\nFirst scientist: This is starting to get weird.\n\n((The year is 2023. Two nerds hunker over a sleek computer.))\nFirst nerd: The battery is totally disconnected. How can it still be moving??\nSecond nerd: Given what it did to the mars 2020 rover, we may never know.\n\n((The year is 2450. A planetary administrator stands with their child on a martian plateau, with a good view of a small city, some flying cars, and even some pyramids!))\nAdministrative god-king: Everything the light touches is our kingdom.\nFuture despoiler of worlds: What's that dark area?\nAdministrative god-king: That is Opportunity's half of the planet. We must never go there.\n\n\n{{Title text: We all remember those famous first words spoken by an astronaut on the surface of Mars: \"That's one small step fo- HOLY SHIT LOOK OUT IT'S GOT SOME KIND OF DRILL! Get back to the ... [unintelligible] ... [signal lost]\"}}","alt":"We all remember those famous first words spoken by an astronaut on the surface of Mars: \"That's one small step fo- HOLY SHIT LOOK OUT IT'S GOT SOME KIND OF DRILL! Get back to the ... [unintelligible] ... [signal lost]\"","img":"https://imgs.xkcd.com/comics/opportunity.png","title":"Opportunity","day":"27"},{"month":"3","num":1505,"link":"","year":"2015","news":"","safe_title":"Ontological Argument","transcript":"((Two characters walk along, deep in thought. The world around them is devoid of form))\nCharacter: But wouldn't a god who could find a flaw in the ontological argument be even greater?\n\n{{Title text: A God who holds the world record for eating the most skateboards is greater than a God who does not hold that record.}}","alt":"A God who holds the world record for eating the most skateboards is greater than a God who does not hold that record.","img":"https://imgs.xkcd.com/comics/ontological_argument.png","title":"Ontological Argument","day":"30"},{"month":"4","num":1506,"link":"//xkcd.com/1506/","year":"2015","news":"","safe_title":"xkcloud","transcript":"{{Title text: }}\n[[Randall monologues behind his official XKCD desk.]]\nRandall: We've made a huge mistake.\n\nRandall: I figured starting a cloud services company would be EASY. After all, I've got TONS of computers!\n[[Randall gestures to a mound of various and sundry mini computers, from a lowly Commodore to a large Alienware.]]\n\n[[Close zoom on Randall's featureless oval face.]]\nRandall: Facebook, twitter, tumblr - they all struggle to protect privacy and user data.\nRandall: And we offered a solution.\nRandall: I forget what it was, though.\n\n[[Wide zoom to Randall waving his arms in a conciliatory manner.]]\nRandall: Anyway, long story short, we screwed up IMMEDIATELY and lost TONS of their data.\nRandall: Also a bunch of stuff is literally on fire?\n\n[[Randall is back behind the desk.]]\nRandall: We can fix this. But we need your help.\n\nLarge red banner: Help us recover user data before facebook & co notice we lost it.","alt":"","img":"https://imgs.xkcd.com/comics/xkcloud.png","title":"xkcloud","extra_parts":{"pre":"","headerextra":"","post":"\n<script type=\"text/javascript\" src=\"/1506/main.js\"></script>\n","imgAttr":""},"day":"1"},{"month":"4","num":1507,"link":"","year":"2015","news":"","safe_title":"Metaball","transcript":"[[A character kicks a soccer ball at an upward angle]]\n\n[[A soccer ball falls down towards a basketball hoop. A character reaches upwards to block it, while another character ineffectually waggles their arm.]]\nOff-panel: OUT!\n\n[[Another panel]]\nOff-panel: What do MEAN, out?!\nReferee: The ball clipped the corner of the baseball zone. Infield fly rule.\nOff-panel: Aw, maaan...\n\n{{Title text: Shoot, it landed in the golf course. Gonna be hard to get it down the--oh, never mind, it rolled onto the ice hazard. Face-off!}}","alt":"Shoot, it landed in the golf course. Gonna be hard to get it down the--oh, never mind, it rolled onto the ice hazard. Face-off!","img":"https://imgs.xkcd.com/comics/metaball.png","title":"Metaball","day":"3"},{"month":"4","num":1508,"link":"","year":"2015","news":"","safe_title":"Operating Systems","transcript":"[[A timeline comic.]]\nTitle: Operating systems running in my house.\n\nIn 1985, begins running MS DOS.\nIn 1993, begins running Windows.\nIn 1994, begins running Mac OS.\nIn 1998, stops running MS DOS.\nIn 2000, starts running Linux\nIn 2001, stops running Mac OS.\nIn 2007, stops running Windows.\nIn 2009, starts running OSX and Android.\nIn 2013, starts running iOS.\n\n\"Now\" is marked as 2015.\n\nIn 2016, stops running Android.\nIn 2018, stops running Linux, starts running SOMETHING.JS\nIn 2019, iOS and OSX merge into one.\nIn 2023, starts running Tinder OS.\nIn 2024, stops running OSX and starts running NEST.\nIn 2028, stops running SOMETHING.JS and starts running Elon Musk Project.\nIn 2029, stops running Tinder OS and starts running DOS, but ironically.\nIn 2032, stops running NEST.\nIn 2034, starts running Blood DRone.\nIn 2036, stops running DOS, but ironically.\nIn 2041, stops running Blood Drone and Elon Musk Project as HUMAN CIVILIZATION ENDS IN FIRE.\n\nIn 2059, starts running GNU\nHURD.\n\n{{Title text: One of the survivors, poking around in the ruins with the point of a spear, uncovers a singed photo of Richard Stallman. They stare in silence. \"This,\" one of them finally says, \"This is a man who BELIEVED in something.\"}}","alt":"One of the survivors, poking around in the ruins with the point of a spear, uncovers a singed photo of Richard Stallman. They stare in silence. \"This,\" one of them finally says, \"This is a man who BELIEVED in something.\"","img":"https://imgs.xkcd.com/comics/operating_systems.png","title":"Operating Systems","day":"6"},{"month":"4","num":1509,"link":"https://xkcd.com/1509/large/","year":"2015","news":"","safe_title":"Scenery Cheat Sheet","transcript":"[[Title: scenery cheat sheet. Subtile: A cheat sheet for figuring out where in the us you are by recognizing the background from movies (for use by geoguessr players and crash-landed astronauts)]]\n[[A map of the US with labels. Some fans have completely dissected the joke for you http:\n\nwww.explainxkcd.com\nwiki\nindex.php\n1509 ]]\nhttp:\n\nwww.explainxkcd.com\nwiki\nindex.php\n1509\n\n{{Title text: At the boundary between each zone, stories blend together. Somewhere in the New Mexico desert, the Roadrunner is pursued by a tireless Anton Chigurh.}}","alt":"At the boundary between each zone, stories blend together. Somewhere in the New Mexico desert, the Roadrunner is pursued by a tireless Anton Chigurh.","img":"https://imgs.xkcd.com/comics/scenery_cheat_sheet.png","title":"Scenery Cheat Sheet","day":"8"},{"month":"4","num":1510,"link":"","year":"2015","news":"","safe_title":"Napoleon","transcript":"[[Two musketeers present a handcuffed Napoleon to a magistrate.]]\nSoldiers: This is Napoleon. He tried to take over the world.\nMagistrate: Exile him to Elba!\n\n[[Three musketeers present a somewhat dirty, handcuffed and shackled Napoleon to a magistrate.]]\nSoldiers: It's us again. Napoleon escaped from Elba and tried to conquer the world. Again.\nMagistrate: Send him someplace truly remote, like Saint Helena.\nSoldiers: Yes, sir.\n\nSeveral years later...\n[[Six musketeers present a dripping wet, handcuffed and shackled Napoleon, with an octopus on his head, to a magistrate.]]\nSoldiers: Well, he swam back.\nMagistrate stands and gestures to the skies imperiously.\nMagistrate: We must mount an expedition to the south pole, where we will encase Napoleon in the antarctic ice!\n\nA century later...\n[[THE PRESIDENT stands behind a podium. Behind him stands a very dirty, handcuffed, shackled, splinted napoleon with icicles dripping off his hat.]]\nPresident: We choose to go to the moon, not because it is easy...\n\n{{Title text: \"Mr. President, what if the unthinkable happens? What if the launch goes wrong, and Napoleon is not stranded on the Moon?\" \"Have Safire write up a speech.\"}}","alt":"\"Mr. President, what if the unthinkable happens? What if the launch goes wrong, and Napoleon is not stranded on the Moon?\" \"Have Safire write up a speech.\"","img":"https://imgs.xkcd.com/comics/napoleon.png","title":"Napoleon","day":"10"},{"month":"4","num":1511,"link":"","year":"2015","news":"","safe_title":"Spice Girl","transcript":"[[A windowless room littered with debris: a door on the left is barred shut and also being held shut by a terrified figure. In the center of a room is a large armored box. On the side of the box away from the door, a figure is crouched down, calmly loading a weapon.]]\n[[A CRUEL INTERLOPER, external to the scene and room, pounds on the door and shouts at the two figures in our sight.]]\nTerrified figure: WHICH SPICE GIRL ARE YOU?! The merciful one, or the one who started this war?\n\nCaption: When I see those quiz titles, I like to imagine they're being shouted through a door in a postapocalyptic dystopia.\n\n{{Title text: Haha, you'll see!}}","alt":"Haha, you'll see!","img":"https://imgs.xkcd.com/comics/spice_girl.png","title":"Spice Girl","day":"13"},{"month":"4","num":1512,"link":"","year":"2015","news":"","safe_title":"Horoscopes","transcript":"Horoscopes with an actual basis in fact.\n\nAries: You may have been conceived after a 4th of July Fireworks show\nTaurus: You may have been concieved on a hot August day\nGemini: You may have been concieved as the leaves began to chance\nCancer: You may have been concieved by people trying on costumes\nLeo: You may have been concieved during thanksgiving\nVirgo: You may have been concieved while a christmas song played\nLibra: You may have been concieved after a new year's eve party\nScorpio: You may have been concieved by people stuck inside after a long winter\nSagittarius: You may have been concieved during march madness\nCapricorn: You may have been concieved during a sexy easter egg hunt\nAquarius: You may have been concieved on mother's day\nPisces:: You may have been concieved at someone's wedding\n\n{{Title text: If you live in the Northern hemisphere, anyway. In the southern hemisphere, due to the coriolis effect, babies are born nine months BEFORE they're conceived.}}","alt":"If you live in the Northern hemisphere, anyway. In the southern hemisphere, due to the coriolis effect, babies are born nine months BEFORE they're conceived.","img":"https://imgs.xkcd.com/comics/horoscopes.png","title":"Horoscopes","day":"15"},{"month":"4","num":1513,"link":"","year":"2015","news":"","safe_title":"Code Quality","transcript":"[[An AMATEUR CODER excitedly gestures a PRO CODER towards a laptop computer on a desk.]]\nAmateur: Keep in mind that I'm self-taught, so my code may be a little messy.\nPro: Lemme see, I'm sure it's fine.\n\n[[PRO CODER sits at the desk, clacking at the laptop.]]\nPro: Wow. This is like being in a house built by a child using nothing but a hatchet and a picture of a house.\n\n[[PRO CODER leans forward, slightly engrossed.]]\nPro: It's like a salad recipe written by a corporate lawyer using a phone autocorrect that only knew excel formulas.\n\n[[PRO CODER leans back, slightly horrified.]]\nPro: It's like someone took a transcript of a couple arguing at ikea and made random edits until it compiled without errors.\nAmateur: OKAY I will read a style guide.\n\n{{Title text: I honestly didn't think you could even USE emoji in variable names. Or that there were so many different crying ones.}}","alt":"I honestly didn't think you could even USE emoji in variable names. Or that there were so many different crying ones.","img":"https://imgs.xkcd.com/comics/code_quality.png","title":"Code Quality","day":"17"},{"month":"4","num":1514,"link":"","year":"2015","news":"","safe_title":"PermaCal","transcript":"[[Two figures converse]]\nFirst: What day is it?\nSecond: Sunday the nineteenth.\nFirst: But you said it was the nineteenth yesterday.\nSecond. It changed AGAIN? Crap, better add another leap day.\n\nCaption: My new simplified calendar system assumes the date never changes, then corrects any drift via leap days.\n\n{{Title text: The flood of PermaCalNTP leap-second notifications was bad enough, but when people started asking for millisecond resolution, the resulting DDOS brought down the internet.}}","alt":"The flood of PermaCalNTP leap-second notifications was bad enough, but when people started asking for millisecond resolution, the resulting DDOS brought down the internet.","img":"https://imgs.xkcd.com/comics/permacal.png","title":"PermaCal","day":"20"},{"month":"4","num":1515,"link":"","year":"2015","news":"","safe_title":"Basketball Earth","transcript":"[[This comic consists of four rows of four panels each.]]\n[[First row.]]\n[[A presenter gestures at a hovering model of our planet.]]\nPresenter: IF the earth were the size of a basketball,\n\n[[Presenter gestures at hovering model of earth's moon.]]\nPresenter: The moon would be--\n[[Blackhat enters]]\nBlackhat: Hey, cool!\n\n[[Blackhat begins touching the earth]]\nPresenter: Um.\n\n[[A massive tsunami hundreds of feet tall dwarfs a coastal city. Screams are heard.]]\nThe earth's inhabitants: AAAAAAAAAAAAAAAAAAAAAAA\n\n[[Second row.]]\n[[Presenter gestures at a hovering model of our planet.]]\nPresenter: Let's try that again. If the earth were the size of a basketball,\n\n[[Presenter gestures at hovering model of earth's moon.]]\nPresenter: The moon would be--\n[[Lady enters, carrying squirt bottle]]\n\n[[Lady squirts earth model with water.]]\n\n[[The earth is completely covered in water, and very wet. The lady leaves.]]\n\n[[Third row]]\n[[Presenter gestures at a hovering model of our planet.]]\nPresenter: If the earth were the size of a basketball,\n\n[[Presenter gestures at hovering model of earth's moon.]]\nPresenter: The moon would...\n[[A cat enters]]\n\n[[The cat leaps towards the earth]]\n\n[[The cat rolls away with the earth, purring]]\n\n[[Fourth row]]\n[[Presenter gestures at a hovering model of our planet.]]\nPresenter: If the earth were the size of a basketball,\n\n[[Presenter gestures at hovering model of earth's moon.]]\nPresenter: The moon would, uh...\n[[A basketball player enters]]\n\n[[The player grabs the earth model]]\n\n[[The player leaps towards a basketball hoop, clearly intending to dunk the earth.]]\n\n{{Title text: How many points do you get for dunking every basketball in existence at once?}}","alt":"How many points do you get for dunking every basketball in existence at once?","img":"https://imgs.xkcd.com/comics/basketball_earth.png","title":"Basketball Earth","day":"22"},{"month":"4","num":1516,"link":"","year":"2015","news":"","safe_title":"Win by Induction","transcript":"[[This will not make sense if you do not know what Pokemon is.]]\n[[A seemingly infite row of Pikachu stands, each next to an open pokéball. The pokemon on the end of the row, nearest to the trainers, has a closed pokéball.]]\nPikachu: Pikachu, I choose YOU!\n\n[[There are two trainers. One has an open pokéball. The other is staring at their watch.]]\n\n{{Title text: This would be bad enough, but every 30th or 40th pokéball has TWO of them inside.}}","alt":"This would be bad enough, but every 30th or 40th pokéball has TWO of them inside.","img":"https://imgs.xkcd.com/comics/win_by_induction.png","title":"Win by Induction","day":"24"},{"month":"4","num":1517,"link":"","year":"2015","news":"","safe_title":"Spectroscopy","transcript":"[[A large white planet fills the void of space, orbited by a tiny moon.]]\nMusical overture: I watch the sunlight\n\n[[The planet is eclipsed by its moon]]\nMusical overture: dance across your face\n\n[[A graph is here. There is a spike. It is labeled OXYGEN.]]\nMusical overture: I can see you breathe\n\nThree panel caption: Faith hill on exoplanet spectroscopy\n\n{{Title text: Although right now I'm more excited about ESPRESSO's radial velocity measurements, so I'm listening to This Kiss, her song about measuring \"centrifugal motion\" on \"a rooftop under the sky\".}}","alt":"Although right now I'm more excited about ESPRESSO's radial velocity measurements, so I'm listening to This Kiss, her song about measuring \"centrifugal motion\" on \"a rooftop under the sky\".","img":"https://imgs.xkcd.com/comics/spectroscopy.png","title":"Spectroscopy","day":"27"},{"month":"4","num":1518,"link":"","year":"2015","news":"","safe_title":"Typical Morning Routine","transcript":"[[Darkness.]]\n<<BLEEP BLEEP>>\nPerson 1: Urgh.\nPerson 2: Your alarm is going off.\nPerson 1: Huh?\nPerson 2: Make it stop.\nPerson 1: Urrgh.\n\n[[Still darkness.]]\n<<BLEEPEEP BLEEP BLEEP B>>\nPerson 2: Hit snooze.\nPerson 1: I'm \ntrying.\n I closed the alarm app and I can't... I'll just pop out the battery. \nwhoops!\n\n<<CLANG>>\n\n[[The light is on. Person one looks over the edge of the bed to see the vent on the floor is open.]]\n<<EEP BLEEP BLEEP BLE>>\nPerson 2: Make it stop!\nPerson 1: It... fell down the vent.\n\n[[Person 1 types on their laptop.]]\n<<EP BLEEP BLEEP BLEEP BLE>>\nPerson 2: Can you brick it remotely?\nPerson 1: Trying... I think I fumbled it into airplane mode?\nPerson 2: The battery could last for weeks.\nPerson 1: You know, maybe we should just move.\n\n{{Title text: Hang on, I've heard this problem. We need to pour water into the duct until the phone floats up and ... wait, phones sink in water. Mercury. We need a vat of mercury to pour down the vent. That will definitely make this situation better and not worse.}}","alt":"Hang on, I've heard this problem. We need to pour water into the duct until the phone floats up and ... wait, phones sink in water. Mercury. We need a vat of mercury to pour down the vent. That will definitely make this situation better and not worse.","img":"https://imgs.xkcd.com/comics/typical_morning_routine.png","title":"Typical Morning Routine","day":"29"},{"month":"5","num":1519,"link":"","year":"2015","news":"","safe_title":"Venus","transcript":"[[A teacher holding a pointer stands in front of a backdrop of a lush, coastal field filled with flower and greenhouses.]]\nTeacher: Venus was once temperate. It had seas and rivers, and Venusians cultivated vast fields of beautiful flowers.\n\n[[The backdrop is now a shot of an earth-like Venus seen from space, with greenhouses flying rapidly away from it.]]\nTeacher: Until their greenhouses fled the planet due to the runaway greenhouse effect.\n\n[[A little girl is seen sitting at a desk, listening to the teacher speak.]]\nTeacher: The Venusians pursued their greenhouses to Earth, settling in the Netherlands and kickstarting the Dutch floral industry. Any questions?\n\n[[A close-up on the teacher's profile, the student is out of panel.]]\nStudent: Because you're retiring in a month, do you just not care what you say anymore? \nTeacher: \nWHAT?!\n I \nRIDE THE SKIES\n atop a screaming bird of truth! Also, yes, I do not. \n\n{{Title text: The sudden introduction of Venusian flowers led to an explosive growth of unusual Earth pollinators, which became known as the \"butterfly effect.\"}}","alt":"The sudden introduction of Venusian flowers led to an explosive growth of unusual Earth pollinators, which became known as the \"butterfly effect.\"","img":"https://imgs.xkcd.com/comics/venus.png","title":"Venus","day":"1"},{"month":"5","num":1520,"link":"","year":"2015","news":"","safe_title":"Degree-Off","transcript":"[[A gameshow setting. Three figures stand behind podiums labeled PHYS, BIO, and CHEM, in front of an announcer.]]\nAnnouncer: Welcome to the DEGREE OFF, where we determine which field is the best! Physics, wanna go first?\nPhysics: Sure! I'd like to tell the story of Richard Feynman's manhattan project lockpicking pranks..\n\nPhysics: ..and as he said \"All science is either physics or stamp collecting.\" Thank you.\nAnnouncer: Great! Bio, you wanna go next?\nBiology: Okay.\n\n[[A graph appears displaying numbers falling from eight hundred per one hundred thousand, to less than a hundred per one hundred thousand, over the last century.]]\nBiology:This is a graph of the death rate from infectious disease in this country.\n\n[[BIO raises fist emphatically]]\nBiology: The heroes of my field have SLAIN one of the four horsemen of the apocalypse.\n\n[[BIO points finger at PHYS]]\nBiology: While the heroes of YOUR field gathered in the desert to create a new one.\n\nPhysics: ...jeez, what the hell? I thought this was supposed to be fun and lighthearted!\nBiology: YOU MUST HAVE BEEN THINKING OF STAMP COLLECTING.\n\n{{Title text: I'M SORRY, FROM YOUR YEARS OF CONDESCENDING TOWARD THE 'SQUISHY SCIENCES', I ASSUMED YOU'D BE A LITTLE HARDER.}}","alt":"I'M SORRY, FROM YOUR YEARS OF CONDESCENDING TOWARD THE 'SQUISHY SCIENCES', I ASSUMED YOU'D BE A LITTLE HARDER.","img":"https://imgs.xkcd.com/comics/degree_off.png","title":"Degree-Off","day":"4"},{"month":"5","num":1521,"link":"","year":"2015","news":"","safe_title":"Sword in the Stone","transcript":"[[A figure approaches a sword sticking out of a rock. They grab it, tussle a bit, then successfully wrest it from its crevice. Angelic trumpets sound.]]\nAethereal voice from above: THE THRONE OF ENGLAND IS YOURS\n\n[[Figure pulls out smartphone]]\nSmartphone: Wikipedia. England.\n\n[[Figure stares at smartphone a bit, pokes sword back into stone.]]\n\n{{Title text: That seems like an awful lot of hassle when all I wanted was a cool sword.}}","alt":"That seems like an awful lot of hassle when all I wanted was a cool sword.","img":"https://imgs.xkcd.com/comics/sword_in_the_stone.png","title":"Sword in the Stone","day":"6"},{"month":"5","num":1522,"link":"","year":"2015","news":"","safe_title":"Astronomy","transcript":"[[A figure is staring through a large telescope pointed towards the heavens. A canvas of thousands of stars fills the sky.]]\n\n[[A figure in a beret walks up with a ladder and a magnifying glass. The astronomer continues to gaze into the optic, unfailingly alert.]]\n\n[[The figure sets up and steadies the ladder as the astronomer continues to observe through the scope.]]\n\n[[Beret figure climbs the ladder, looks at the stars through the magnifying glass. The astronomer remains completely unmoved.]]\n\n{{Title text: Astrobiology is held back by the fact that we're all too nervous to try to balance on the ladder while holding an expensive microscope.}}","alt":"Astrobiology is held back by the fact that we're all too nervous to try to balance on the ladder while holding an expensive microscope.","img":"https://imgs.xkcd.com/comics/astronomy.png","title":"Astronomy","day":"8"},{"month":"5","num":1523,"link":"","year":"2015","news":"","safe_title":"Microdrones","transcript":"[[Two figures. One is standing, one is sitting at a desk with a laptop computer.]]\nStanding: So how do we regulate all these micro drones? I mean, amazon delivery bots sound cool...\n\n[[Standing figure is suddenly surrounded by tiny robots.]]\nStanding: But I worry that overnight we'll realize we're surrounded by these things, no one will know who's controlling them, and then BAM, sci-fi dystopia.\n\n[[Standing figure is back next to sitting figure. Sitting figure turns their full attention to standing figure.]]\nSitting: If you wanna slow it down, why not just remove all regulations, but then make drone theft legal?\n\n[[Standing figure, ponders while sitting figure returns to the laptop.]]\nStanding: ...I LIKE that.\nSitting: You write to congress. I'll stock up on butterfly nets.\n\n{{Title text: Oh, weird, Amazon is out of butterfly nets.}}","alt":"Oh, weird, Amazon is out of butterfly nets.","img":"https://imgs.xkcd.com/comics/microdrones.png","title":"Microdrones","day":"11"},{"month":"5","num":1524,"link":"","year":"2015","news":"","safe_title":"Dimensions","transcript":"[[Two figures sit beneath a tree in a meadow]]\nFigure: Of the four dimensions I could have spent my life being pushed inexorably forward through, I guess \"Time\" isn't the worst.\n\n{{Title text: I would say time is definitely one of my top three favorite dimensions.}}","alt":"I would say time is definitely one of my top three favorite dimensions.","img":"https://imgs.xkcd.com/comics/dimensions.png","title":"Dimensions","day":"13"},{"month":"5","num":1525,"link":"https://xkcd.com/1525/","year":"2015","news":"","safe_title":"Emojic 8 Ball","transcript":"EMOJIC 8 BALL\n[[A text box where you can enter a question, with a default question of 'How will I die?, and an 'ASK' button underneath. Below is a drawing of a 'magic 8 ball' toy, and in the center a white triangle comes up with 1-3 random emojis.]]\n\n{{(No alt-text.)}}\n","alt":"","img":"https://imgs.xkcd.com/comics/emojic_8_ball.png","title":"Emojic 8 Ball","extra_parts":{"headerextra":"\n<link rel=\"stylesheet\" type=\"text/css\" href=\"/1525/emojic8.css\" title=\"Default\"/>\n","inset":"                                                                                                   \n    <img src=\"/1525/bg.png\">\n    <form id=\"emoji-ball\" class=\"dark\">\n      <input type=\"text\" placeholder=\"How will I die?\" id=\"ball-question\"/>\n      <input type=\"submit\" id=\"ball-ask\" value=\"Ask\"/>\n      <div class=\"ball\">\n        <div class=\"ball-cover\"></div>\n        <div class=\"shading\"></div>\n        <div id=\"ball-answer\"><div class=\"text\"></div></div>\n      </div>\n    </form>\n    <div id=\"emoji-link\"></div>\n    <script type=\"text/javascript\" src=\"/1525/emojic8.js\"></script>\n"},"day":"15"},{"month":"5","num":1526,"link":"","year":"2015","news":"","safe_title":"Placebo Blocker","transcript":"[[Two figures, one is monologuing]]\nFigure: Some reasearchers(hall et al, doi: 10.1015\nmolmed 2015 02 009) are starting to figure out the mechanism behind the placebo effect. \nWe've used their work to create a new drug: a placebo effect blocker.\nNow we just need to run a trial! We'll get two groups, give them both placebos, then give one the real placebo blocker, and the other a... wait...\n\n[[A panel where nothing is said]]\n\nAudience: My head hurts.\nFigure: Mine too. Here, want a sugar pill?\n\n{{Title text: They work even better if you take them with our experimental placebo booster, which I keep in the same bottle.}}","alt":"They work even better if you take them with our experimental placebo booster, which I keep in the same bottle.","img":"https://imgs.xkcd.com/comics/placebo_blocker.png","title":"Placebo Blocker","day":"18"},{"month":"5","num":1527,"link":"","year":"2015","news":"","safe_title":"Humans","transcript":"[[Two hovering robots have an amiable chat]]\nUNIT ONE: You know, new research suggests ancient human kings and queens were covered in colorful fabric.\n\nUNIT TWO: Ugh, I like MOVIE humans more. Screaming pink warriors with metal crowns poking through the skin on their heads!\nNow they're, what, big pillows?\nScience ruins everything.\n\n{{Title text: At this point, if we're going to keep insisting on portraying dinosaurs as featherless because it's \"cooler\", it's time to apply that same logic to art involving bald eagles.}}","alt":"At this point, if we're going to keep insisting on portraying dinosaurs as featherless because it's \"cooler\", it's time to apply that same logic to art involving bald eagles.","img":"https://imgs.xkcd.com/comics/humans.png","title":"Humans","day":"20"},{"month":"5","num":1528,"link":"","year":"2015","news":"","safe_title":"Vodka","transcript":"[[Two figures sit at a table. One is IMBIBING from a large BOTTLE. The other is cradling what could be a cup of coffee, or a squarish bomb, or even a boxy of custom size condoms.\n\nIMBIBER: Maybe this is the vodka talking, but:\nHI! I'M MADE FROM POTATOES!\n\n{{Title text: Or whatever's handy! I'm pretty much pure alcohol and water, so it doesn't really matter!}}","alt":"Or whatever's handy! I'm pretty much pure alcohol and water, so it doesn't really matter!","img":"https://imgs.xkcd.com/comics/vodka.png","title":"Vodka","day":"22"},{"month":"5","num":1529,"link":"","year":"2015","news":"","safe_title":"Bracket","transcript":"[[What follows is a bunch of names, all in an ULTIMATE SINGLE ELIMINATION BRACKET, like one might see for SPORTS like BATTLEBOTS or MARCH MADNESS.]]\n\n[[on the left side]]\nLouis armstrong\nneil armstrong\nlance armstrong\nstretch armstrong\n\njeff gordon\njeff bridges\njeff daniels\njack daniels\n\norson welles\nh.g. wells\ngeorge orwell\nwells fargo\n\nkurt russell\nrussell brand\nrussell crowe\nrussell simmons\nrichard simmons\ngene simmons\ngene hackman\nhugh jackman\nalan rickman\nalan parsons\nalan partridge\n\njenny mccarthy\njoseph mccarthy\neugene mccarthy\neugene v.debs\ngene wilder\nolivia wilde\noscar wilde\noscar de la renta\noscar de la hoya\n\njack nicklaus\njack nicholson\nphil mickelson\nnicholas nickleby\n\nryan adams\nbryan adams\n\nchubby checker\nfats domino\n\ncolin firth\ncolin farrell\nwill ferrell\nthe farrelly brothers\n\njoseph gordon-levitt\njennifer love hewitt\n\ndanny glover\ndonald glover\ndonnie wahlberg\nmark wahlberg\nmark ruffalo\nmark shuttleworth\n\n[[on the right side]]\nphilip pullman\nbill pullman\nbill paxton\nbill murray\ndan aykroyd\n\nginger rogers\nmister\nfred astaire\nrogers\nmister spock\ndoctor spock\ndoctor octopus\ndoctor manhattan\ndoctor strangelove\ndoctor strnage\ndr. no\nthe doctor\ncory doctorow\n\njerry lee lewis\njerry lewis\njenny lewis\nxeni jardin\n\nchris evans\nchris hemsworth\nchris pine\nchris pratt\n\nshallots\nscallops\nscallions\n\nsioxsie sioux\nsuzanne vega\n\ntom arnold\narnold palmer\namanda palmer\n\nwes craven\nwes anderson\npaul thomas anderson\npoul anderson\n\nsir walter scott\nsir walter raleigh\nsir francis drake\nfrank drake\ndrake\n\nvan halen\nvan morrison\nvan wilder\nrobert van winkle\nrip van winkle\nrip torn\nnatalie imbruglia\n\nthe body shop\nbath and body works\nbed bath and beyond\nbeyond thunderdome\nbeyoncé\n\n{{Title text: I'm staring at the \"doctor\" section, and I can't help but feel like I've forgotten someone.}}","alt":"I'm staring at the \"doctor\" section, and I can't help but feel like I've forgotten someone.","img":"https://imgs.xkcd.com/comics/bracket.png","title":"Bracket","day":"25"},{"month":"5","num":1530,"link":"","year":"2015","news":"","safe_title":"Keyboard Mash","transcript":"[[A person walks toward their computer desk as the screen indicates \"new chat message.\"]]\n\n[[The screen shows a text conversation (where lines are contained in speech bubble boxes) between White Hat Guy and the first person.]]\n\nWHG: Can't sleep. Stupid dogs keep barking.\n          FJAFJKLDWSKF7JKFDJ\n\nFP: Ugh, I'm sorry. Maybe you could...\n      ...OK, wait. I have to ask. \n      How did you hit a \"7\" in the middle there?\n\nWHG: Huh?\n          I was just randomly keyboard mashing.\n\nFP: Sorry, right.\n\nWHG: Anyway,\n\nFP: ...I know this is silly, but like... all your hands were clearly on the home row.\n     I don't get how one finger could have stretched up to the \"7.\"\n\nWHG: Why do you always fixate on these bizarre details?\n\nFG: I don't know.\n      Sorry.\n\nWHG: It's weird, is all.\n         \n[[A giant spider dangles from the ceiling, typing at a laptop on a desk, while White Hat Guy is suspended upside down, wrapped in spider thread. The chair lies on the floor on its side. The conversation continues on the computer.]]\nSpider:I am a normal human typing with my human hands.\nFP: Yeah, of course. \n      I know.\n((MMM!! MMPH!!!))\n \n{{Title text: WHY DON'T YOU COME HANG OUT INSIDE MY HOUSE. WE CAN COOK BREAD AND CHAT ABOUT OUR INTERNAL SKELETONS.}}","alt":"WHY DON'T YOU COME HANG OUT INSIDE MY HOUSE. WE CAN COOK BREAD AND CHAT ABOUT OUR INTERNAL SKELETONS.","img":"https://imgs.xkcd.com/comics/keyboard_mash.png","title":"Keyboard Mash","day":"27"},{"month":"5","num":1531,"link":"","year":"2015","news":"","safe_title":"The BDLPSWDKS Effect","transcript":"[[A person with a ponytail stands in front of a projector screen with an image of a speeding firetruck hurtling toward a person on it. They hold a pointer, and indicate towards the image.]]\nPonytail: The Bernoulli-Dopper-Leidenfrost-Peltzman-Sapir-Whorf-Dunning-Kruger-Stroop Effect states that if a speeding fire truck lifts off and hurtles toward you on a layer of superheated gas, you'll dive out of the way faster if the driver screams \"RED!\" in a \nnon\n-tonal language that \nhas\n a word for \"firefighter\" than if they scream \"GREEN!\" in a \ntonal\n language with \nno\n word for \"firefighter\" which you \nthink\n you're fluent in but \naren't.\n\n{{Title text: This well-known effect has of course been replicated in countless experiments.}}","alt":"This well-known effect has of course been replicated in countless experiments.","img":"https://imgs.xkcd.com/comics/the_bdlpswdks_effect.png","title":"The BDLPSWDKS Effect","day":"29"},{"month":"6","num":1532,"link":"","year":"2015","news":"","safe_title":"New Horizons","transcript":"[[Two people stand at a mission control terminal.]]\nOne: We made it! After all these years, \nNew Horizons\n is finally revealing the surface of Pluto!\nTwo: Take \nthat\n, \nDawn\n team.\n\n[[On the black screen, a small grayish circle appears.]]\n\n[[It grows slightly larger, and a differentiation of colors can be seen, white and gray.]]\n\n[[Larger still, now landmasses and water are visible.]]\n\n[[It is now large enough to see that we are looking at the Earth, with Africa, Europe, and some of Asia visible.]]\n\n[[One person is still looking at the screen while the other is walking away.]]\nOne: Ok, who did the calculations for the Jupiter slingshot maneuver?\nTwo: \nDammit, Steve...\n\n\n{{Title text: Last-minute course change: Let's see if we can hit Steve's house.}}","alt":"Last-minute course change: Let's see if we can hit Steve's house.","img":"https://imgs.xkcd.com/comics/new_horizons.png","title":"New Horizons","day":"1"},{"month":"6","num":1533,"link":"","year":"2015","news":"","safe_title":"Antique Factory","transcript":"[[White Beret Guy is walking off, carrying a briefcase.]]\nWBG: Gotta go - I'm late for work.\nOff-screen: Oh, where are you working now?\nWBG: Antique factory!\n\n[[White Beret Guy arrives at his office, where he pulls out his chair from his desk.]]\n\n[[He sits at his table and waits.]]\n\n[[And waits.]]\n{{Title text: WARNING: This item was aged by the same inexorable passage of time that also processes nuts.}}","alt":"WARNING: This item was aged by the same inexorable passage of time that also processes nuts.","img":"https://imgs.xkcd.com/comics/antique_factory.png","title":"Antique Factory","day":"3"},{"month":"6","num":1534,"link":"","year":"2015","news":"","safe_title":"Beer","transcript":"[[Two people stand at an open refrigerator.]]\n1: What do you drink? Stouts? Lagers?\n2: Uh, anything's fine.\n\n[[Person 1 is drinking from a bottle while Person 2 holds his in his hand.]]\n2: ...do you ever think maybe we should just admit that all beer tastes kind of bad and everyone's just pretending?\n\n[[Person 2 drinks from his bottle and Person 1 holds his.]]\n1: Man, you are no fun at all.\n2: Ok, got it. Not a word.\n1: Dude, if you don't like it, don't drink it.\n2: No, no, gotta do my part! - Mmmmm!!!\n\n{{Title text: Mmmm, this is such a positive experience! I feel no social pressure to enjoy it at all!}}","alt":"Mmmm, this is such a positive experience! I feel no social pressure to enjoy it at all!","img":"https://imgs.xkcd.com/comics/beer.png","title":"Beer","day":"5"},{"month":"6","num":1535,"link":"","year":"2015","news":"","safe_title":"Words for Pets","transcript":"[[This comic uses a series of venn diagrams to show \"Words I use to refer to a pet over the years that I live with\"]]\n\nFirst year: Primarily the pet's name, and sometimes words related to the pet.\n\nSecond year: Primarily words related to the pet, and sometimes the pets name or coherent words of any kind.\n\nThird year: Words related to the pet, or coherent words of any kind, and sometimes not even that.\n\nFourth year onward: Terms which do not belong in any of the aforementioned categories.\n\n{{Title text: Seventh year: Perfectly coherent words, but in the pet's language, not mine.}}","alt":"Seventh year: Perfectly coherent words, but in the pet's language, not mine.","img":"https://imgs.xkcd.com/comics/words_for_pets.png","title":"Words for Pets","day":"8"},{"month":"6","num":1536,"link":"","year":"2015","news":"","safe_title":"The Martian","transcript":"[[White Hat Guy comes up behind Stickman while he is sitting at a desk looking at a laptop.]]\nSM: Ooh, trailer for \nThe Martian\n! \nWHG: What's that?\nSM: Movie of a book I liked.\nWHG: Should I read it?\n\n[[Stickman turns around in his chair to face White Hat Guy.]]\nSM: Depends. You know the scene in Apollo 13 where the guy says \"we have to figure out how to connect \nthis\n thing to \nthis\n thing using \nthis\n table full of parts or the astronauts will all die?\"\nWHG: Yeah?\n\n[[Stickman turns back to the laptop.]]\nSM: \nThe Martian\n is for people who wish the whole movie had just been more of that scene.\nWHG: How on earth did \nthat\n become a big-budget thing with Matt Damon?\nSM: No idea, but I'm \nso\n excited.\n\n{{Title text: I have never seen a work of fiction so perfectly capture the out-of-nowhere shock of discovering that you've just bricked something important because you didn't pay enough attention to a loose wire.}}","alt":"I have never seen a work of fiction so perfectly capture the out-of-nowhere shock of discovering that you've just bricked something important because you didn't pay enough attention to a loose wire.","img":"https://imgs.xkcd.com/comics/the_martian.png","title":"The Martian","day":"10"},{"month":"6","num":1537,"link":"","year":"2015","news":"","safe_title":"Types","transcript":"My new language is great, but it has a few quirks regarding type:\n[[Gray and white type on a black background.]]\n [1]> 2 + \"2\"\n  =>  \"4\"\n [2]> \"2\" + [ ]\n  =>  \"[2]}\n [3]   (2\n0)\n  =>  NaN\n [4]> (2\n0)+2\n  =>  NaP\n [5]> \"\"+\"\"\n  =>  '\"+\"'\n [6]> [1,2,3] + 2\n  =>  FALSE\n [7]> [1,2,3] +4\n  =>  TRUE\n [8] 2\n(2-(3\n2 + 1\n2))\n  =>  NaN.00000000000000013\n [9]> RANGE(\" \")\n  =>  (' \" ',  \"!\", \"  \", '\"')\n[10]> +2\n  =>  12\n[11]> 2+2\n   => DONE\n[14]> RANGE (1,5)\n   =>  (1,4,3,4,5)\n[13]> FLOOR(10.5)\n   =>  |\n   =>  |\n   =>  |\n   =>  |___10.5___ \n\n{{Title text: colors.rgb(\"blue\") yields \"#0000FF\". colors.rgb(\"yellowish blue\") yields NaN. colors.sort() yields \"rainbow\"}}","alt":"colors.rgb(\"blue\") yields \"#0000FF\". colors.rgb(\"yellowish blue\") yields NaN. colors.sort() yields \"rainbow\"","img":"https://imgs.xkcd.com/comics/types.png","title":"Types","day":"12"},{"month":"6","num":1538,"link":"","year":"2015","news":"","safe_title":"Lyrics","transcript":"[[A man sits in an easy-chair, while music with indecipherable lyrics plays from a radio behind him.]]\nSometimes I wonder what it would be like to be able to understand song lyrics without looking them up.\n\n{{Title text: To me, trying to understand song lyrics feels like when I see text in a dream but itð° hà¸­áµ£d tâ áµ£eâd aà¸d ð¾ canÙt fà¾cuà¼§à¼¦à¿à¼}}","alt":"To me, trying to understand song lyrics feels like when I see text in a dream but it𝔰 hอᵣd t₀ ᵣeₐd aกd 𝒾 canٖt fཱྀcu༧༦࿐༄","img":"https://imgs.xkcd.com/comics/lyrics.png","title":"Lyrics","day":"15"},{"month":"6","num":1539,"link":"","year":"2015","news":"","safe_title":"Planning","transcript":"[[Two people walk along, one with light hair and a ponytail, another with shortish dark hair.]]\nPonytail: Why are people so comfortable handing Google and Facebook all this control over our lives?\nDark hair: I dunno. - Our species built thousands of nuclear weapons, scattered them around the planet, and then moved on to other things. - Maybe it's best to accept that some of this big-picture planning is just happening on autopilot.\n\n{{Title text: [10 years later] Man, why are people so comfortable handing Google and Facebook control over our nuclear weapons?}}","alt":"[10 years later] Man, why are people so comfortable handing Google and Facebook control over our nuclear weapons?","img":"https://imgs.xkcd.com/comics/planning.png","title":"Planning","day":"17"},{"month":"6","num":1540,"link":"","year":"2015","news":"","safe_title":"Hemingway","transcript":"Hemingway's Rough Drafts\n[[A list.]]\nFor Sale: This Gullible Baby's Shoes\nBaby Shoes For Sale By Owner\n((crossed out))Actually, there's no evidence Hemingway wrote\nFree Shoes, Provided You Overpower Baby\nFor Sale: Weird Baby's Toe Shoes\nFor Sale: Baby Shoes ((check mark))Prime Eligible\n((crossed out))Though popularly attributed to Hemingway, the\nThis Weird Trick Covers Baby Feet!\nFor Sale: Baby Shoes, Just Hatched\nSale: Seven-League Boots (expedited shipping)\nComplete This Survey for Free Shoes!\n\nShoes\n, by Ernest Hemingway [citation needed]\n<blink><marquee>Baby Shoes!<\nmarquee><\nblink>\nFor Sale: Baby-sized Saddle, Bobcat\nHemingway Busted for Craigslist Shoe Scam\n\n{{Title text: Instead of bobcat, package contained chair.}}","alt":"Instead of bobcat, package contained chair.","img":"https://imgs.xkcd.com/comics/hemingway.png","title":"Hemingway","day":"19"},{"month":"6","num":1541,"link":"","year":"2015","news":"","safe_title":"Voice","transcript":"[[Two people, one with dark hair and one with light hair, walking along.]]\nDark hair: Are you doing anything later?\nLight hair: I was th- \nI can only control my voice once every six years. Please, you have to\n -inking of going out, but no real plans.\nDH: ...what was that?\nLH: Haha, what?\n\n{{Title text: Anyway, we should totally go watch a video story or put some food in our normal mouths!}}","alt":"Anyway, we should totally go watch a video story or put some food in our normal mouths!","img":"https://imgs.xkcd.com/comics/voice.png","title":"Voice","day":"22"},{"month":"6","num":1542,"link":"","year":"2015","news":"","safe_title":"Scheduling Conflict","transcript":"[[A newspaper with the headline: National Scheduling Conflict Championships Canceled. Below the headline is a picture of an empty podium beneath a banner that reads \"NSCC 2015.\"]]\n\n{{Title text: Neither a spokesperson for the organization nor the current world champion could be reached for comment.}}","alt":"Neither a spokesperson for the organization nor the current world champion could be reached for comment.","img":"https://imgs.xkcd.com/comics/scheduling_conflict.png","title":"Scheduling Conflict","day":"24"},{"month":"6","num":1543,"link":"","year":"2015","news":"","safe_title":"Team Effort","transcript":"[[A person stands on a stage, holding an award. Another person with a ponytail stands behind a podium next to them.]]\nWinner: I'd like to thank my director, my friends and family, and - of course - the writhing mass of gut bacteria inside me. -- I mean, there's like one or two pints of them in here; their cells outnumber mine! -- Anyway, this was a real team effort.\n\n{{Title text: Given the role they play in every process in my body, really, they deserve this award more than me. Just gotta figure out how to give it to them. Maybe I can cut it into pieces to make it easier to swallow ...}}","alt":"Given the role they play in every process in my body, really, they deserve this award more than me. Just gotta figure out how to give it to them. Maybe I can cut it into pieces to make it easier to swallow ...","img":"https://imgs.xkcd.com/comics/team_effort.png","title":"Team Effort","day":"26"},{"month":"6","num":1544,"link":"","year":"2015","news":"","safe_title":"Margaret","transcript":"[[A single woman, MARGARET, speaks alone, in the darkness.]]\n\nMargaret: Are you there, god? It's me, Margaret.\nMargaret: I know you're listening.\n\n[[Margaret appears larger.]]\nMargaret: Are you scared, god?\nMargaret: Are you?\n\n[[Only her head face is seen now. The lack of expression on her ovoid countenance is truly horrifying.]]\nMargaret: You should be.\n\n[[Silhouetted against the darkness, Margaret stands alone.]]\nMargaret: MARGARET IS COMING FOR YOU.\n\n{{Title text: Otherwise known as Margaret the Destroyer, I will bring pain to the the Great One. Then again, maybe I won't.}}","alt":"Otherwise known as Margaret the Destroyer, I will bring pain to the the Great One. Then again, maybe I won't.","img":"https://imgs.xkcd.com/comics/margaret.png","title":"Margaret","day":"29"},{"month":"7","num":1545,"link":"","year":"2015","news":"","safe_title":"Strengths and Weaknesses","transcript":"[[Two characters sit at a table, opposite one another. One is an INTERVIEWER, the other an APPLICANT]]\nInterviewer: What would you say is your biggest weakness?\n\nApplicant: Probably that I'm a giant tangle of parts that don't always work right, so I can die easily.\n\nInterviewer: Biggest strength?\nApplicant: There will come a day when I'm either an ancesotr to ALL living humans, or to NONE of them.\n\nInterviewer: Where do you see yourself in five years?\nApplicant: Probably not the ancestor of all living humans yet. But you never know!\n\n{{Title text: Do you need me to do a quicksort on the whiteboard or produce a generation of offspring or something? It might take me a bit, but I can do it.}}","alt":"Do you need me to do a quicksort on the whiteboard or produce a generation of offspring or something? It might take me a bit, but I can do it.","img":"https://imgs.xkcd.com/comics/strengths_and_weaknesses.png","title":"Strengths and Weaknesses","day":"1"},{"month":"7","num":1546,"link":"","year":"2015","news":"","safe_title":"Tamagotchi Hive","transcript":"TITLE: My hobby.\n[[GRAPHIC: A tree diagram of many tiny ovals.]]\nRunning a massive distributed computing project that simulates trillions and trillions of Tamagotchis and keeps them all constantly fed and happy.\n\n{{Title text: The Singularity happened, but not to us.}}","alt":"The Singularity happened, but not to us.","img":"https://imgs.xkcd.com/comics/tamagotchi_hive.png","title":"Tamagotchi Hive","day":"3"},{"month":"7","num":1547,"link":"","year":"2015","news":"","safe_title":"Solar System Questions","transcript":"Title: Questions I have about the solar system. Some answered.\n\nWhy is the moon so blotchy?\nAnswer: Lava.\nWhy are all the blotches on the near side?\nDid mars have seas?\nAnswer: Yes, briefly?\nWas their life on mars?\nWhat's titan like?\nAnswer: Cold, yellow, lakes and rivers (methane)\nWhat was earth like during the hadean?\nIs the oort cloud a real thing?\nWhy is the suns corona so hot?\nAnswer: Something about magnets?\nWhat are comets like?\nAnswer: Precipitous\nWhere's Philae, exactly?\nWhat's pluto like?\nAnswer: SOON!\nWhat's Charon like?\nAnswer: Soon!\nWhy don't we have in-between-sized planets?\nWhat's Ceres like?\nAnswer: Working on it!\nWhy is Europa so weird looking and pretty?\nAnswer: Ice over a water ocean\nWhy is IO so weird looking? \nAnswer: Sulfur volcanos.. in the wrong places??\nWhy are so many Kyiper belt objects red?\nWhat are those spots on Ceres?\nWhat's in the sease under Europa's ice?\nWhich of the other moons have seas?\nAnswer: Several\nWhat are the big white things in Titans lakes?\nWhat do Jupiter's clouds look like up close?\nWhat's all that red stuff in the great red spot?\nWhat's pushing the pioneer probes? \nAnswer: Heat from the RTG\nWhat pushes spacecraft slightly during flybys?\nWhere are all the sun's neutrinos?\nAnswer: Oscillating\nWhy is there so much air on Titan?\nWhy does the Kuiper belt stop?\nWhy is Iapetus weird colored?\nWhy does Iapetus have a belt?\nWhat's the deal with Miranda?\nDid Uranus and Neptune change places?\nDid the late heavy bombardment happen?\nDid life start before it?\nIs Europa covered in ice spikes?\nWhy haven't we built a big inflatable extreme sports complex on the moon?\n\n{{Title text: My country's World Cup win was exciting and all, but c'mon, what if the players wore nylon wings and COULD LITERALLY FLY?}}","alt":"My country's World Cup win was exciting and all, but c'mon, what if the players wore nylon wings and COULD LITERALLY FLY?","img":"https://imgs.xkcd.com/comics/solar_system_questions.png","title":"Solar System Questions","day":"6"},{"month":"7","num":1548,"link":"","year":"2015","news":"","safe_title":"90s Kid","transcript":"[[Two children on a playground]]\nchild: Ugh, don't you hate how parents are all \"eat your carrots\" and \"lol, remember Rugrats and Doug? Share if you're a 90's kid!\"\n\nCaption: The median age at first birth in the US is 25, which means the typical new mother is now a 90's kid.\n\n{{Title text: We remember Rugrats, and think of them every time our kids look at us through their baby gates.}}","alt":"We remember Rugrats, and think of them every time our kids look at us through their baby gates.","img":"https://imgs.xkcd.com/comics/90s_kid.png","title":"90s Kid","day":"8"},{"month":"7","num":1549,"link":"","year":"2015","news":"","safe_title":"xkcd Phone 3","transcript":"[[A drawing of a phone is shown here. Numerous features are pointed out. It is called THE XKCD PHONE 3, We Made Another One®]]\n\nListing of features:\nBoneless\nEar screen\nHeartbeat accelerator\nMobilePay money clip\nSiri, or whoever it was we put in here\nInstead of being on surface only, screen goes all the way through\nTheknot.com partnership: phone licensed to perform wedding ceremonies and does so at random.\nFingerprint randomizer.\nUSB E (hotswappable)\nWaterproof, but can drown.\nForetold by prophecy\nRuns natively\nWristband\nWireless discharging\nMagnetic stripe\nTwo AA batteries (not included)\n\n{{Title text: If you're not completely satisfied with the phone after 30 days, we will return you to your home at no cost.}}","alt":"If you're not completely satisfied with the phone after 30 days, we will return you to your home at no cost.","img":"https://imgs.xkcd.com/comics/xkcd_phone_3.png","title":"xkcd Phone 3","day":"10"},{"month":"7","num":1550,"link":"","year":"2015","news":"","safe_title":"Episode VII","transcript":"[[Movie title: STAR WARS, THE FORCE AWAKENS]]\n\n[[A desolate adobe structure. A sign out front reads TOSCHE STATION]]\n\n[[Hooded jedi & R2D2 walk into the TOSCHE STATION]]\n\nJEDI: I'm here for those power converters.\n\n[[Closing title: Directed by J J Abrams]]\n\n{{Title text: The Lord of the Rings sequel, set years after the Ring hubbub has died down, is just Samwise discreetly creeping back to Bag End to finish dropping the eaves.}}","alt":"The Lord of the Rings sequel, set years after the Ring hubbub has died down, is just Samwise discreetly creeping back to Bag End to finish dropping the eaves.","img":"https://imgs.xkcd.com/comics/episode_vii.png","title":"Episode VII","day":"13"},{"month":"7","num":1551,"link":"https://www.nasa.gov/feature/new-horizons-spacecraft-displays-pluto-s-big-heart-0","year":"2015","news":"","safe_title":"Pluto","transcript":"Title:PLUTO\nSubtitle: Some of the features already identified in today's NEW HORIZONS image\n[[What follows is random text labels pointing to random areas of Pluto. I will list them.]]\nCandy shell\nFrontal bone\ngrease stains\nbugs\njpeg plumes\nfull text of the wikipedia article on paridolia\nsnake pit\ntadpole\nmoon bud\nreset button\nthe good part\npluto dinosaur extinction crater\nkuiper beltloops\nmegaman\narea missed during ironing\nhyena country\nborder of pride lands\nheart\ncoronary heart disease\nmount mons\nprobably benign\ndock connector\nvanilla frosting\nchocolate frosting\ndebate hole: where we're putting all the people still arguing about pluto's planet status\nplug (inflating\ndeflating)\ncharging socket\ncracks (beginning to hatch)\nserenity\nbullet holes\nnew netherlands\nghost\ndinosaur\ndisputed territory\n\nImage credit: NASA MOTHERFUCKERS\n((Editor's note: Sorry, I added the \"Motherfuckers\". Not in original comic))\n\n{{Title text: After decades of increasingly confused arguing, Pluto is reclassified as a \"dwarf Pluto.\"}}","alt":"After decades of increasingly confused arguing, Pluto is reclassified as a \"dwarf Pluto.\"","img":"https://imgs.xkcd.com/comics/pluto.png","title":"Pluto","day":"14"},{"month":"7","num":1552,"link":"","year":"2015","news":"","safe_title":"Rulebook","transcript":"[[Two people are standing on the left, with a dog in a vest with a '9' on its side. Two other people are facing them on the right, one is holding a clipboard.]]\nClipboard: There's nothing in the rulebook that says we can't kill and eat your dog.\n\n{{Title text: It's definitely an intentional foul, but we've decided it's worth it.}}","alt":"It's definitely an intentional foul, but we've decided it's worth it.","img":"https://imgs.xkcd.com/comics/rulebook.png","title":"Rulebook","day":"17"},{"month":"7","num":1553,"link":"","year":"2015","news":"","safe_title":"Public Key","transcript":"[[Character sits alone at a desk.. drifting in an infinite white void..]]\nCharacter, thinking: I've been posting my public key for fifteen years now, but no one has ever asked me for it or used it for anything as far as I can tell.\n\n[[A frame of silence.]]\n\n[[Another frame of silence.]]\n\nCharacter, thinking more: Maybe I should try posting my PRIVATE key instead.\n\n{{Title text: I guess I should be signing stuff, but I've never been sure what to sign. Maybe if I post my private key, I can crowdsource my decisions about what to sign.}}","alt":"I guess I should be signing stuff, but I've never been sure what to sign. Maybe if I post my private key, I can crowdsource my decisions about what to sign.","img":"https://imgs.xkcd.com/comics/public_key.png","title":"Public Key","day":"20"},{"month":"7","num":1554,"link":"","year":"2015","news":"","safe_title":"Spice Girls","transcript":"[[Two characters in dialogue]]\n\nQuestioner: your turn. Can you name all the spice girls?\nAnswerer: Hmm. Hearing spice, vision spice, smell spice, touch spice, taste spice?\nQuestioner: That's senses.\n\nAnswerer: Denial spice, anger spice, bargaining spice, depression spice, acceptance spice.\nQuestioner: Stages of grief.\n\nAnswerer: War spice, famine spice, plague spice, death spice?\nQuestioner: You're not even trying.\n\nAnswerer: No, wait, I can get this for real. uhh...\nAnswerer: Pog spice, story spice, sarah spice, gender spice, baleen spice?\nQuestioner: ...close enough.\n\n{{Title text: The Earth's five major mass extinctions were the Posh Extinction, the Sporty Extinction, the Scary Extinction, the Ginger Extinction, and the Baby Extinction.}}","alt":"The Earth's five major mass extinctions were the Posh Extinction, the Sporty Extinction, the Scary Extinction, the Ginger Extinction, and the Baby Extinction.","img":"https://imgs.xkcd.com/comics/spice_girls.png","title":"Spice Girls","day":"22"},{"month":"7","num":1555,"link":"","year":"2015","news":"","safe_title":"Exoplanet Names 2","transcript":"[[Title: Exoplanet names 2]]\nNASA has announced the discovery of a (super)earth sized planet in the habitable zone of a sun-like star.\n\nI suggest we name this planet \"pluto\", both to celebrate the great work by the new horizons team, and to make the stupid \"is pluto a planet\" debate a little more confusing.\n\nWhile we wait to hear from the IAU, here's a revised and updated list of planet name suggestions, see xkcd.com\n1253\n\n[[Full explanation & dissection & transcription available http:\n\nwww.explainxkcd.com\nwiki\nindex.php\n1555 ]]\n\n{{Title text: I'm going to drive this Netherlands joke so far into the ground they'll have to build levees around it to keep the sea out.}}","alt":"I'm going to drive this Netherlands joke so far into the ground they'll have to build levees around it to keep the sea out.","img":"https://imgs.xkcd.com/comics/exoplanet_names_2.png","title":"Exoplanet Names 2","day":"24"},{"month":"7","num":1556,"link":"","year":"2015","news":"","safe_title":"The Sky","transcript":"[[Two figures stand in front of a glorious skyscape]]\nFigure: I like the sky\nSecond figure: Yeah\n\n[[The CLOUDS are ALIGHT in a GLORIOUS SPECTACLE which eludes description]]\n\nSecond figure: It's one of my favorite halves.\n\n{{Title text: The other half has some cool shipwrecks, rocks, and snakes, but if you move those out of the way, it also has more sky.}}","alt":"The other half has some cool shipwrecks, rocks, and snakes, but if you move those out of the way, it also has more sky.","img":"https://imgs.xkcd.com/comics/the_sky.png","title":"The Sky","day":"27"},{"month":"7","num":1557,"link":"","year":"2015","news":"","safe_title":"Ozymandias","transcript":"[[Two figures talking]]\nFigure: I met a traveler from an antique land who said: \"I met a traveler from an antique land, who said: \"I met a traveler from an antique land, who said: \"I met...\n\n{{Title text: And on the pedestal these words appear: \"And on the pedestal these words appear: \"And on the pedestal these words appear: \"And ...}}","alt":"And on the pedestal these words appear: \"And on the pedestal these words appear: \"And on the pedestal these words appear: \"And ...","img":"https://imgs.xkcd.com/comics/ozymandias.png","title":"Ozymandias","day":"29"},{"month":"7","num":1558,"link":"","year":"2015","news":"","safe_title":"Vet","transcript":"[[A concerned pet owner at the front of a row of customers in a veterinarian's  office. A tired veterinary assistant performs arbitrage. A pet carrier cage, the sort used to contain a small dog or cat, is on a desk for the vet tech to examine.]]\nPet owner: There's something wrong with my dog.\nPet owner: He keeps crawling around eating dirt.\n\n[[The vet tech carefully removes the dog from its carrier and gently examines it.]]\nVet tech: This is a roomba.\nPet owner: Well, he's a mix.\nPet owner: Probaby some roomba in there.\n\n[[The vet tech places the roomba on the desk, probably maintaining a weary forced congeniality though we can't see their face.]]\nVet tech: A roomba is not a pet.\nPet owner: You're right. It's wrong to keep a beautiful creature like this in a house.\n\n[[The pet owner, outside, beneath a tall tree. It looks like an ash, or maybe a beech. There aren't any leaves drawn in the frame so I can't be sure.]]\nPet owner: Go! Be free!\n[[The roomba cheerfully speeds towards the tree]]\nRoomba: WHIRRR\n\n{{Title text: It's probably for the best. Since Roombas are native to North America, it's illegal for Americans to keep them in their houses under the Migratory Bird Treaty Act.}}","alt":"It's probably for the best. Since Roombas are native to North America, it's illegal for Americans to keep them in their houses under the Migratory Bird Treaty Act.","img":"https://imgs.xkcd.com/comics/vet.png","title":"Vet","day":"31"},{"month":"8","num":1559,"link":"","year":"2015","news":"","safe_title":"Driving","transcript":"[[black hat guy walks up to a figure carrying a large, heavy rock]]\nBlack hat guy: Would you guess this weighs as much as a small adult?\nFigure: What? Uh, probably.\n\n[[black hat guy walks off panel with the panel]]\nblack hat guy: great!\n\n[[offscreen]]\n<<thump>>\nCar: Please fasten your seat belt.\n<<click>>\nblack hate guy: Take me to Anchorage, Alaska.\ncar: navigating.\n<<slam>>\n<<vrrrrrrrrr>>\n\n[[Black hat guy returns to frame]]\nblack hat guy: I love self driving cars.\nfigure: ...whose car was that?\nblack hat guy: dunno, but they shouldn't have left it running.\n\n{{Title text: Sadly, it probably won't even have enough gas to make it to the first border crossing.}}","alt":"Sadly, it probably won't even have enough gas to make it to the first border crossing.","img":"https://imgs.xkcd.com/comics/driving.png","title":"Driving","day":"3"},{"month":"8","num":1560,"link":"","year":"2015","news":"","safe_title":"Bubblegum","transcript":"[[BERET GUY stands in a doorway into a dark room, silhouetted against the light]]\nBeret: I came here to chew bubblegum and make friends!\n\n[[Now in a well lit space, BERET GUY stands silently, facing two figures.]]\n\n[[BERET GUY stretches out a hand towards the figures, who completely fail to react.]]\nBeret: Want some gum?\n\n{{Title text: I came here to chew bubblegum and say no more than eighteen words ... and I'm all out of}}","alt":"I came here to chew bubblegum and say no more than eighteen words ... and I'm all out of","img":"https://imgs.xkcd.com/comics/bubblegum.png","title":"Bubblegum","day":"5"},{"month":"8","num":1561,"link":"","year":"2015","news":"","safe_title":"Water Phase Diagram","transcript":"[[A phase diagram of water, with temperature on the horizontal axis increasing to the left, and pressure on the vertical axis increasing downwards.  It shows the commonly known phases of water (ice, liquid, vapor) as well as the more exotic high-pressure phases Ice II, Ice III and Ice V.  As pressure increases, the diagram shows Vanilla Ice (Ice VI) transitioning to David Bowie & Queen.]]\n\n{{Title text: Vanilla Ice was produced in small quantities for years, but it wasn't until the 90s that experimenters collaborated to produce a sample that could survive at room temperature for several months. }}","alt":"Vanilla Ice was produced in small quantities for years, but it wasn't until the 90s that experimenters collaborated to produce a sample that could survive at room temperature for several months. ","img":"https://imgs.xkcd.com/comics/water_phase_diagram.png","title":"Water Phase Diagram","day":"7"},{"month":"8","num":1562,"link":"","year":"2015","news":"","safe_title":"I in Team","transcript":"[[Two figures chatting]]\nScraggly figure: Remember, there's no \"I\" in \"team.\"\nShorn figure: No, but there's a \"U\" in \"People who apparently don't understand the relationship between orthography and meaning.\"\n\n{{Title text: There's no \"I\" in \"VOWELS\".}}","alt":"There's no \"I\" in \"VOWELS\".","img":"https://imgs.xkcd.com/comics/i_in_team.png","title":"I in Team","day":"10"},{"month":"8","num":1563,"link":"","year":"2015","news":"","safe_title":"Synonym Movies","transcript":"[[The spines of DVD cases on a shelf, the titles from left to right read: ]]\nSPACE FIGHTS: SUDDEN OPTIMSIM\nSPACE FIGHTS: THE GOVERNMENT WINS THIS ONE\nSPACE FIGHTS: THE SWORD WIZARD IS BACK\n\nTHE JEWELRY GOD: THE JEWELRY TEAM\nTHE JEWELRY GOD: DOUBLE HOUSES\nTHE JEWELRY GOD: WE HAVE A CZAR AGAIN\n\nSPACE TRIP: THE MOVIE\nSPACE TRIP: THAT GUY IS ANGRY\nSPAC TRIP: WHERE IS THE VULCAN?\nSPACE TRIP: LET'S GO BACK\n\n{{Title text: Fans eagerly await 2015's 'Space Fights: Power Gets Up', although most think 1999's 'Space Fights: The Scary Ghost' didn't live up to the hype.}}","alt":"Fans eagerly await 2015's 'Space Fights: Power Gets Up', although most think 1999's 'Space Fights: The Scary Ghost' didn't live up to the hype.","img":"https://imgs.xkcd.com/comics/synonym_movies.png","title":"Synonym Movies","day":"12"},{"month":"8","num":1564,"link":"","year":"2015","news":"","safe_title":"Every Seven Seconds","transcript":"[[A single figure plods along alone, deep in thought.]]\nThought: There's no way that's true.\nThought: It would interfere with basic cognition.\nThought: Such a ridiculous view of masculinity.\nThought: How would you even STUDY that?\n\nCaption: Every seven seconds, sociologists think about that made-up statistic about how often men think about sex.\n\n{{Title text: Every few months, I think about sex every seven seconds and how weird and implausible it would be.}}","alt":"Every few months, I think about sex every seven seconds and how weird and implausible it would be.","img":"https://imgs.xkcd.com/comics/every_seven_seconds.png","title":"Every Seven Seconds","day":"14"},{"month":"8","num":1565,"link":"","year":"2015","news":"","safe_title":"Back Seat","transcript":"Title: PROTIP\n[[A car is surrounded by two waiting, non-plussed friends while the driver clears the car out.]]\nDriver: Hang on, I just have to clear a few things out of the back.\n[[The driver opens the door. There are smell lines coming out.]]\n\nCaption: When you hear \"I just have to clear a few things out of the back\", You are about to see, at minimum, a decaying racoon.\n\n{{Title text: Hang on, let me scare the live raccoon over to the same side of the dead one.}}","alt":"Hang on, let me scare the live raccoon over to the same side as the dead one.","img":"https://imgs.xkcd.com/comics/back_seat.png","title":"Back Seat","day":"17"},{"month":"8","num":1566,"link":"","year":"2015","news":"","safe_title":"Board Game","transcript":"[[Four board gamers sit around a table, looking at one another across a pile of books and papers.]]\nRandall: Now, this pile is \"Allowable deduction\" cards. You match them with cards in your hand to preserve their full point value. Over here are \"dependent\" tokens..\n\nCaption: Every year i trick a local board game club into doing my taxes.\n\n{{Title text: Yes, it took a lot of work to make the cards and pieces, but it's worth it--the players are way more thorough than the tax prep people ever were.}}","alt":"Yes, it took a lot of work to make the cards and pieces, but it's worth it--the players are way more thorough than the tax prep people ever were.","img":"https://imgs.xkcd.com/comics/board_game.png","title":"Board Game","day":"19"},{"month":"8","num":1567,"link":"","year":"2015","news":"","safe_title":"Kitchen Tips","transcript":"[[A enthused CHEF speaks to us from behind a counter loaded with spices & kitchen things.]]\nChef: If you're anything like me, you may have trouble telling when meat is fully cooked.\nChef: Instead of guessing, try a meat thermometer.\n\n[[Chef stands between a full trash can on one side, and sink on the other. Chef holds a dirty plate, like the exact opposite of a glistening beacon of cleanliness.]]\nChef: If you're anything like me, you probably throw away your plates and glasses when they get dirty. But if you clean them, they can often be used again!\n\n[[Chef is busy with a frying pan over a stove.]]\nChef: Making scrambled eggs? Put a pan under them!\nChef: It's easier, and it keeps your burners cleaner.\n\n[[Chef sprays a garden hose into the freezer side of a combination refrigerator\nfreezer. Water is flowing out.]]\nChef: If you're anything like me, you make ice by spraying a hose into your freezer and then slamming it shut.\nChef: But there's a better way....\n\n{{Title text: Household tip: Tired of buying so much toilet paper? Try unspooling the paper from the roll before using it. A single roll can last for multiple days that way, and it's much easier on your plumbing.}}","alt":"Household tip: Tired of buying so much toilet paper? Try unspooling the paper from the roll before using it. A single roll can last for multiple days that way, and it's much easier on your plumbing.","img":"https://imgs.xkcd.com/comics/kitchen_tips.png","title":"Kitchen Tips","day":"21"},{"month":"8","num":1568,"link":"","year":"2015","news":"","safe_title":"Synonym Movies 2","transcript":"[[Movies stacked up on a shelf. Their titles on the spine are as followed]]\nWandboy and the magic rock\nWandboy and the hidden room\nWandboy and the fugitive\nWandboy and the burning cup\nWandboy and the firebird club\nWandboy and the book owner\nWandboy and the magic stuff (1\n2)\nWandboy and the magic stuff (2\n2)\n\nPuncher\nPuncher II\nPuncher III\nPuncher IV\nPuncher V\nPuncher Lastname\n\nTropical boaters: spooky boat\nTropical boaters: Angry worhface\nTropical boaters: boats everywhere\nTropical boaters: vitamin water\n\nProfessor whip and the box of god\nProfessor whip and the scary church\nProfessor whip and the looks for a cup\nProfessor whip is in another movie\n\n{{Title text: There's also the TV show based on the hit Hot and Cold Music books: Fun With Chairs, Royal Rumble, Knife Blizzard, Breakfast for Birds, and Samba Serpents.}}","alt":"There's also the TV show based on the hit Hot and Cold Music books: Fun With Chairs, Royal Rumble, Knife Blizzard, Breakfast for Birds, and Samba Serpents.","img":"https://imgs.xkcd.com/comics/synonym_movies_2.png","title":"Synonym Movies 2","day":"24"},{"month":"8","num":1569,"link":"","year":"2015","news":"","safe_title":"Magic Tree","transcript":"[[Beret guy excitedly points to a pillar about a meter across. There's a sign on the side. Beret guy is pointing it out to his friend, Fancy Haircut]]\nBeret: Check it out! I threw my magic beans on the ground here yesterday, and this big tree appeared!\n\n[[Now in silhouette we see the pillar is several hundred feet tall, covered in antennae, and the figures are as ants in its shadow.]]\nhaircut: that's a cell tower.\nberet: no way-- it has branches! See? I'm gonna climb it!\n\n[[Beret guy begins to shimmy up the side of the pole. Somehow. With impressively powerful thighs I guess.]]\nhaircut: No, they just put those there to make it look-- ...never mind.\n\n[[Later...]]\nhaircut: Why do I have no signal?\nberet, with an axe: there were scary giants with yellow helmets in that tree! luckily, I cut it down before they ate me.\n\n{{Title text: Since people rarely try to cut down cell phone towers, after millions of years, as cell phone towers have gotten more treelike, trees have started growing fake cell phone tower attachments and shiny gray bark to protect themselves. This is a standard textbook example of convergent evolution.}}","alt":"Since people rarely try to cut down cell phone towers, after millions of years, as cell phone towers have gotten more treelike, trees have started growing fake cell phone tower attachments and shiny gray bark to protect themselves. This is a standard textbook example of convergent evolution.","img":"https://imgs.xkcd.com/comics/magic_tree.png","title":"Magic Tree","day":"26"},{"month":"8","num":1570,"link":"","year":"2015","news":"","safe_title":"Engineer Syllogism","transcript":"[[Empty panel with text]]\nAn engineer syllogism\n\n[[Engineer sits at desk thoughtfully, thinking.]]\nEngineer: One, I am good at understanding numbers.\n\n[[Engineer puts hands to face, pondering]]\nEngineer: Two, the stock market is made of numbers.\n\n[[Engineer suddenly aghast]]\nEngineer: Three, therefore, I-- WOW where did all my money just go?\n\n{{Title text: The less common, even worse outcome: \"3: [everyone in the financial system] WOW, where did all my money just go?\"}}","alt":"The less common, even worse outcome: \"3: [everyone in the financial system] WOW, where did all my money just go?\"","img":"https://imgs.xkcd.com/comics/engineer_syllogism.png","title":"Engineer Syllogism","day":"28"},{"month":"8","num":1571,"link":"","year":"2015","news":"","safe_title":"Car Model Names","transcript":"Certain letters and numbers are used disproporitionately often in car models compared to regular text.\nSee: Rev-4 CR-X x4 G6 MAXX\n\n[[There is a bar chart here. With frequency scores for letters and umbers in car model names.]]\n\nBases on these scores, here are a few suggestions for car companies (with average letter scores)\n\nSECTION: Names to avoid \nHonda 2Chainz (-0.13) \nMitsubishi Fhqwhgads (-0.62) \nKia 49AndGothy (-2.96) \nChevrolet Niceguy (-3.09) \nOldsmobile GoodWood (-4.44) \nInfinity Toothy69 (-4.51) \nBMW Outhouse (-4.85) \nVolkswagen Woodpony 7OH7 (-5.70) \nChrysler Uh Iono (-5.65) \nNissan Doody (-5.84) \n\nSECTION: Potential hits\nHonda 3Chainz (0.57)\nSubaru Andre3000 (1.30)\nSuzuki Sexism (1.82)\nLincoln Marxism (2.17)\nHyundai Climax (2.48)\nPorsche Zizek9000 (3.06)\nLexus 3x3Cutrix (3.22)\nAcura PizzaJazz (3.56)\nFord SixAxle 4x4 (3.95)\nToyota Cervixxx (4.85) \n\n{{A full explanation of THE CUNNING REFERENCES in this are at http:\n\nwww.explainxkcd.com\nwiki\nindex.php\n1571 }}\n\n{{Title text: CLIMAX is good, but SEXCLIMAX is even better.}}","alt":"CLIMAX is good, but SEXCLIMAX is even better.","img":"https://imgs.xkcd.com/comics/car_model_names.png","title":"Car Model Names","day":"31"},{"month":"9","num":1572,"link":"https://goo.gl/forms/pj0OhX6wfO","year":"2015","news":"","safe_title":"xkcd Survey","transcript":"Introducing the XKCD SURVEY! A search for weird correlations.\n\nNOTE: This survey is anonymous, but all responses will be posted publicly so people can play with the data.\n\nClick here to take the survey.\n\nhttp:\n\ngoo.gl\nforms\nlzZr7P9Qlm\n\nOr click here, or here. The whole comic is a link because I still haven't gotten the hang of HTML imagemaps.\n\n{{Title text: The xkcd Survey: Big Data for a Big Planet}}","alt":"The xkcd Survey: Big Data for a Big Planet","img":"https://imgs.xkcd.com/comics/xkcd_survey.png","title":"xkcd Survey","day":"1"},{"month":"9","num":1573,"link":"","year":"2015","news":"","safe_title":"Cyberintelligence","transcript":"[[Two scientists look at graphs, intensely!]]\nScientist: Our overall fiscal year 2015 cyberintelligence budget was eight point one billion-\nScientst2: Yet it wasn't enough to pick up on the fact that no one else has used the prefix \"cyber-\" for like a decade?\nScientist: Shut up.\n\n{{Title text: We had gathered that raw information, but had yet to put it all together.}}","alt":"We had gathered that raw information, but had yet to put it all together.","img":"https://imgs.xkcd.com/comics/cyberintelligence.png","title":"Cyberintelligence","day":"4"},{"month":"9","num":1574,"link":"","year":"2015","news":"","safe_title":"Trouble for Science","transcript":"[[A series of whitepaper headlines]]\nMany Commercial Antibody-Based Immunoassays Are Unreliable\nProblems With the p-value as an indicator of significance\nOverfeeding of laboratory rodents compromises animal models\nReplication study fails to reproduce many published results\ncontrolled trials show bunsen burners make things colder\n\n{{Title text: Careful mathematical analysis demonstrates small-scale irregularities in Gaussian distribution}}","alt":"Careful mathematical analysis demonstrates small-scale irregularities in Gaussian distribution","img":"https://imgs.xkcd.com/comics/trouble_for_science.png","title":"Trouble for Science","day":"7"},{"month":"9","num":1575,"link":"","year":"2015","news":"","safe_title":"Footprints","transcript":"[[An untitled graph. Horizontal axis: Time. Vertical axis: Sets of footprints. Data points are listed below, in the format NUMBER: EVENT LABEL]]\n2: Start\n1: Jesus carried me\n1: I carried jesus\n1: Jesus disappeared for an evening each time a new Twilight movie came out\n3: Who was that guy?\n5: Ducklings imprinted on jesus and followed him around\n4: Got lost and followed our own footprints\n1: Rode around with jesus in captured at-st\n1: Hit quicksand patch. Jesus didn't make it :(\n0: Went home\n\n{{Title text: \"There's one set of foot-p's cause I was totes carrying you, bro!\" said Jesus seconds before I punched him.}}","alt":"\"There's one set of foot-p's cause I was totes carrying you, bro!\" said Jesus seconds before I punched him.","img":"https://imgs.xkcd.com/comics/footprints.png","title":"Footprints","day":"9"},{"month":"9","num":1576,"link":"","year":"2015","news":"","safe_title":"I Could Care Less","transcript":"[[Two Friends walking and talking.]]\nMonologuer: ...anyway, I could care less.\n\nListener: I think you mean you COULDN'T care less. Saying you COULD care less implies you care at least some amount.\n\nMonologuer: I dunno.\n\n[[Monologuer begins to monologue over many panels]]\nWe're these unbelievably complicated brains drifting through a void, trying in vain to connect with one another by blindly flinging words out into the darkness.\n\nEvery choice of phrasing and spelling and tone and timing carries countless signals and contexts and subtexts and more,\n\nand every listener interprets those signals in their own way.\n\nLanguage isn't a formal system. Language is a glorious chaos.\n\nYou can never know for sure what ANY words will mean to ANYONE.\n\nAll you can do is try to get better at guessing how your words affect people, so you can have a chance of finding the ones that will make them feel something like what you want them to feel.\n\nEverything else is pointless.\n\nI assume you're giving me tips on how you interpret words because you want me to feel less alone.\n\nIf so, then thank you.\n\nThat means a lot.\n\nBut if you'r ejust running my sentences past some mental checklist so you can show off how well you know it,\n\nthen I could care less.\n\n{{Title text: I literally could care less.}}","alt":"I literally could care less.","img":"https://imgs.xkcd.com/comics/i_could_care_less.png","title":"I Could Care Less","day":"11"},{"month":"9","num":1577,"link":"","year":"2015","news":"","safe_title":"Advent","transcript":"[[Stick guy is standing in front of a wall-sized grid, 12 rows high, 20 columns wide. Each larger box has a smaller grid inside.]]\nUnsettling Gift: Life Expectancy Advent Calendar.\n{{Title text: The few dozen doors that have little Christmas trees on them are a nice touch.}}","alt":"The few dozen doors that have little Christmas trees on them are a nice touch.","img":"https://imgs.xkcd.com/comics/advent.png","title":"Advent","day":"14"},{"month":"9","num":1578,"link":"","year":"2015","news":"","safe_title":"Squirrelphone","transcript":"[[A person is walking along and they see a squirrel standing on a tree stump.]]\nSquirrel: RIIIIING -- RIIIIIING\n\n[[The person picks up the squirrel and puts it to his ear like a phone.]]\nPerson: Hello?\n\n[[The squirrel bites down on the person's ear.]\n<<CHOMP>>\nPerson: OW!\n\n[[The squirrel leaps away, and the person is left holding his face in bewilderment.]]\nPerson: ???\n\n{{Title text: After a while, the squirrel starts making that beeping noise and doesn't stop until it hops back up onto the stump.}}","alt":"After a while, the squirrel starts making that beeping noise and doesn't stop until it hops back up onto the stump.","img":"https://imgs.xkcd.com/comics/squirrelphone.png","title":"Squirrelphone","day":"16"},{"month":"9","num":1579,"link":"","year":"2015","news":"","safe_title":"Tech Loops","transcript":"[[Flowchart of things which support things. Arrows indicate what supports what.]]\n\nLibrary supports\nlibrary, supports\ncustom settings, supports\nlibrary, supports\ntool, supports\nupdater, supports\nvm, supports\nchat client, supports\nrepository, supports nothing at all!\n\nlibrary, supports\nhardware workaround, supports\nawful hack from 2009, supports\nirc for some reason, supports\nawful hack from 2009, supports\nthe library we started with\n\nDLL needed by something, supports\ntwo mysterious items???\n\n\"Things I actually want to use my computer for\" neither supports nor is supported by anything else on the chart.\n\nCAPTION: Every now and then I realize I'm maintaining a huge chain of technology solely to support itself.\n\n{{Title text: And when I think about it, a lot of \"things I want to do\" are just learning about and discussing new tools for tinkering with the chain.}}","alt":"And when I think about it, a lot of \"things I want to do\" are just learning about and discussing new tools for tinkering with the chain.","img":"https://imgs.xkcd.com/comics/tech_loops.png","title":"Tech Loops","day":"18"},{"month":"9","num":1580,"link":"","year":"2015","news":"","safe_title":"Travel Ghost","transcript":"transcribe\n[[A person monologues to another]]\n\nLots of apps let you plan your tirps using real-time bus, train, and traffic data. They try to predict which route will be faster, but aren't always right.\n\nInstead of just planning, my new app lets you send \"ghost\" versions of you along different routes, simulating their travel using the real-time data.\n\nThat way, you can see which route turned out to be faster in practice. You can also race your past selves.\n\n[[Soon: Person dashing out of a taxi, twenty feet behind a ghost.]]\nUgh, lost to the bike ghost AGAIN.\n\n[[Person carrying briefcase is on wrong side of door. On the other side, wife is standing with ghost also carrying briefcase. ]]\nPerson: Hey, my key won't work.\nWife: I'm sorry, but we've decided to replace you. This floaty guy is much more punctual.\nPerson: But...\n\n[[Two children hold hands with ghost]]\nChildren: Our NEW dad never misses our games!\n[[Person, stretching out hands in desperate agony]]\nPerson: NOOOOOOOOOOO!\n\n{{Title text: And a different ghost has replaced me in the bedroom.}}","alt":"And a different ghost has replaced me in the bedroom.","img":"https://imgs.xkcd.com/comics/travel_ghosts.png","title":"Travel Ghost","day":"21"},{"month":"9","num":1581,"link":"","year":"2015","news":"","safe_title":"Birthday","transcript":"XKCd turns 10 years old this month. In light of last nights court ruling in Rupamarya v. Warner\nChappell Music Inc, I would just like to say:\n\nHappy birthday to you\nHappy birthday to you\nHappy birthday, dear XKCD\nHappy birthday to you\n\n[[There is a cake here.]]\n\n{{Title text: I guess I need to apologize to my parents, friends, and the staff at Chuck E. Cheese's for all the times I called the cops on them.}}","alt":"I guess I need to apologize to my parents, friends, and the staff at Chuck E. Cheese's for all the times I called the cops on them.","img":"https://imgs.xkcd.com/comics/birthday.png","title":"Birthday","day":"23"},{"month":"9","num":1582,"link":"","year":"2015","news":"","safe_title":"Picture a Grassy Field","transcript":"[[A person monologues to their friend.]]\nPicture a grassy field.\nIn the center sits a small, pale, big-eyed creature with the power to escape from any visualized scene and move freely through the brain that imagined it.\nIt glances around nervously and--\n--whoops, where'd it go?\nSorry about that! Keep an eye out for it in your daydreams.\n\n{{Title text: Wait, I can fix this. Picture another field. In the middle sits the only creature the first creature is afraid of. Now just-- wait, where did THAT one go?}}","alt":"Wait, I can fix this. Picture another field. In the middle sits the only creature the first creature is afraid of. Now just-- wait, where did THAT one go?","img":"https://imgs.xkcd.com/comics/picture_a_grassy_field.png","title":"Picture a Grassy Field","day":"25"},{"month":"9","num":1583,"link":"","year":"2015","news":"","safe_title":"NASA Press Conference","transcript":"[[Someone stands at a podium with the NASA logo on it, speaking.]]\nSpokesperson: That concludes the press conference. Any questions? - Yes, you, from... it just says \"The News\"?\n\n[[With a crowd of nondescript people behind him, White Beret speaks into a microphone.]]\nWB: Hi! I have a microphone so I'm real loud now. - How does this Mars data compare to data from other fields? Like medicine? Or sports?\n\n[[The spokesperson responds from out of panel, we still see White Beret with the microphone.]]\nSpokesperson: That question makes no sense.\nWB: If there's water on Mars, is it ruined? - Or will it be okay when it dries out?\nSpokesperson: Any \nother\n questions?\n\n[[A far side-view of spokesperson at the podium facing a crowd of various people, including White Beret.]]\nWB: What were those guys hassling Luke in the Mos Eisley cantina trying to accomplish? I felt like I was supposed to understand that.\nSpokesperson: Anyone \nelse\n?\nOther person: That's now my question, too.\nAnother person: Were they just picking a fight?\nOther person: If so, why did...\n\n{{Title text: Why are we spending billions to ruin Mars with swarms of robots when Elon Musk has promised to ruin Mars for a FRACTION of the cost?}}","alt":"Why are we spending billions to ruin Mars with swarms of robots when Elon Musk has promised to ruin Mars for a FRACTION of the cost?","img":"https://imgs.xkcd.com/comics/nasa_press_conference.png","title":"NASA Press Conference","day":"28"},{"month":"9","num":1584,"link":"","year":"2015","news":"","safe_title":"Moments of Inspiration","transcript":"Isaac Newton\n[[A man sitting under a tree is hit in the head by a falling apple.]]\n<<BONK>>\nNewton: Ow!\n\n[[Newton rubs his sore head.]]\nNewton: Aha!\n\nLise Meitner\n[[Someone throws a ball towards a woman, and it goes over her head.]]\nBall-thrower: Hey Lise, think fast!\n<<CRASH>>\n\n[[The ball has hit one of her porcelain model atoms, splitting it in half. Lise surveys the damage.]]\nLise: Oh no! My collection of porcelain atoms! -- \n...Hmm.\n\n\nCharles Darwin\n[[Charles Darwin and his wife are watching their four children drinking soda. Two drink through straws while two have beaks and are having trouble drinking.]]\nMrs. Darwin: I gave our kids soda, but the ones with beaks always have trouble drinking it.\nMr. Darwn: I've noticed that...\n\nAlbert Einstein\n[[A train passes by in the background while Albert Einstein and another person look on from the foreground.]]\nEinstein: I wish your twin brother would stop shining lights at us from that train. I can barely see my clock! - \n...Wait!\n\n\n{{Title text: Charles, I just talked to John and Mildred, who run that company selling seeds and nuts, and their kids with MOUTHS are starving!}}","alt":"Charles, I just talked to John and Mildred, who run that company selling seeds and nuts, and their kids with MOUTHS are starving!","img":"https://imgs.xkcd.com/comics/moments_of_inspiration.png","title":"Moments of Inspiration","day":"30"},{"month":"10","num":1585,"link":"","year":"2015","news":"","safe_title":"Similarities","transcript":"Person 1: So it's a work of fiction about a well-known brand, written on the internet by an enthusiast, republished as a bestselling book, and then made into a movie?\nPerson 2: yup.\n\n[[Person 1 ponders this for a moment]]\n\nPerson 1: Yeah, \"The Martian\" and \"Fifty Shades of Grey\" are basically the same book.\nPerson 2: \"Fifty Shades of Red\"?\nPerson 1: Man, tell me you wouldn't read that.\n\n{{Title text: I just came from The Martian, and I just have to say: Forget BB-8; I want a pet Sojourner! It's always been the cutest of our Mars rovers.}}","alt":"I just came from The Martian, and I just have to say: Forget BB-8; I want a pet Sojourner! It's always been the cutest of our Mars rovers.","img":"https://imgs.xkcd.com/comics/similarities.png","title":"Similarities","day":"2"},{"month":"10","num":1586,"link":"","year":"2015","news":"","safe_title":"Keyboard Problems","transcript":"[[Person 1 sits on the floor facing a laptop with another laptop behind them. The second laptop has an external keyboard attached. Person 2 stands looking at Person 1.]]\n\nPerson 1: Keys on my keyboard keep failing, even when I boot from an external recovery disk.\nPerson 2: Sounds like it's hardware, then.\n\n[[Person 1 turns slightly to reach the second laptop.]]\n\nPerson 1: Yeah... except the problem followed me from my last computer.\nPerson 2: You have the most bizarre tech issues.\n\n[[Person 1 has unplugged the keyboard from the second laptop and plugged it into the first laptop.]]\n\nPerson 1: It must be spreading via keyboards. This one won't work with any computer now.\nPerson 2: When the robot apocalypse happens, I'm hiding out in your house. Any Skynet drones that come near will develop inexplicable firmware problems and crash.\n\n{{Title text: In the future, a group of resistance fighters send me back in time with instructions to find the Skynet prototype and try to upgrade it.}}","alt":"In the future, a group of resistance fighters send me back in time with instructions to find the Skynet prototype and try to upgrade it.","img":"https://imgs.xkcd.com/comics/keyboard_problems.png","title":"Keyboard Problems","day":"5"},{"month":"10","num":1587,"link":"","year":"2015","news":"","safe_title":"Food Rule","transcript":"Title: My food rule\nWill eat: Red meat, pork, poultry, fish, fruit, vegetables, grains.\nWon't eat: shrimp, oysters, squid.\n\nCaption: I won't eat something if I have to google to figure out whether or not it has a face.\n\n{{Title text: I won't eat invertebrates, because I can fight a skeleton, but I have no idea what kind of spooky warrior a squid leaves behind.}}","alt":"I won't eat invertebrates, because I can fight a skeleton, but I have no idea what kind of spooky warrior a squid leaves behind.","img":"https://imgs.xkcd.com/comics/food_rule.png","title":"Food Rule","day":"7"},{"month":"10","num":1588,"link":"","year":"2015","news":"","safe_title":"Hardware Reductionism","transcript":"[[Two people talk to each other while holding their smartphones.]]\n1: Your photos from the triathlon got so many more likes than mine. \n2: Yeah - my phone is quad-core. Research shows that iPhones like yours have just two cores, so they have a hard time capturing scenes with three different events in them.\n\nIf we talked about phone hardware the way we talk about brain hardware.\n\n{{Title text: My MRI research shows a clear correlation between the size of the parietal lobe--the part of the brain that handles spatial reasoning--and enjoyment of 3D DoritosÂ®.}}","alt":"My MRI research shows a clear correlation between the size of the parietal lobe--the part of the brain that handles spatial reasoning--and enjoyment of 3D Doritos®.","img":"https://imgs.xkcd.com/comics/hardware_reductionism.png","title":"Hardware Reductionism","day":"9"},{"month":"10","num":1589,"link":"","year":"2015","news":"","safe_title":"Frankenstein","transcript":"Like many people, I'm tired of nitpicking about Frankenstein's Monster's name.\nLuckily, \nFrankenstein\n is public domain.\nTherefore, I present\nXKCD'S\n\nFRANKENSTEIN\n\n[Lightning bolt]\n(The monster's name)\n[[No illustration, just centered text leading to a title with a small lightning bolt at the bottom.]]\n\n[[A man with a flat-top haircut lies under a blanket on a gurney, with wires leading from his neck. A person throws a large switch on the wall.]]\nMonster: \nGRAAAR!\n\nDoctor: Frankenstein is alive! I am a modern Prometheus!\nMonster: RAAAAR!\nDoctor: To be clear, your name is \nFrankenstein\n. Canonically.\nMonster: \nGRAAAAAR!\n The moon landings were faked!\nDoctor: Wait, what?\n\n~Fin.~\nThere. Feel free to call the monster \"Frankenstein.\"\nIf anyone tries to correct you, just explain that this comic is your canonical version.\nThank you.\n[[Again, no illustration, just text.]]\n\n{{Title text: \"Wait, so in this version is Frankenstein also the doctor's name?\" \"No, he's just 'The Doctor'.\"}}","alt":"\"Wait, so in this version is Frankenstein also the doctor's name?\" \"No, he's just 'The Doctor'.\"","img":"https://imgs.xkcd.com/comics/frankenstein.png","title":"Frankenstein","day":"12"},{"month":"10","num":1590,"link":"","year":"2015","news":"","safe_title":"The Source","transcript":"<<a hum so faint it is completely unindicated in the comic wafts through the air>>\n[[Person with a quizzical look on their face in a room alone]]\n\n[[Person looks around the room]]\n\n[[Person walks down the hall]]\n\n[[Person walks through some doorways]]\n\n[[Person walks down some stairs]]\n\n[[Person finds a large machine labeled \"High-pitched hum generator\" at the other end of a room]]\n\n[[Person unplugs machine]]\n\n[[Person walks away]]\n\n{{Title text: Why did we even have that thing?}}","alt":"Why did we even have that thing?","img":"https://imgs.xkcd.com/comics/the_source.png","title":"The Source","day":"14"},{"month":"10","num":1591,"link":"","year":"2015","news":"","safe_title":"Bell's Theorem","transcript":"t=0 nanoseconds\nPerson 1: This is called Bell's Theorem.  It was first-\n\n((distance marker cross-panel indicating 5 meters between Person 1 and Person 2))\n\nt=1 nanosecond\nPerson 2: Wow, faster-than-light communication is possible!\n\nBell's Second Theorem:  Misunderstandings of Bell's Theorem happen so fast that they violate locality.\n\n{{Title text: The no-communication theorem states that no communication about the no-communication theorem can clear up the misunderstanding quickly enough to allow faster-than-light signaling.}}","alt":"The no-communication theorem states that no communication about the no-communication theorem can clear up the misunderstanding quickly enough to allow faster-than-light signaling.","img":"https://imgs.xkcd.com/comics/bells_theorem.png","title":"Bell's Theorem","day":"16"},{"month":"10","num":1592,"link":"","year":"2015","news":"","safe_title":"Overthinking","transcript":"[[A person and White Hat Guy walk along]]\nPerson 1: I found a study* that said water is good for you, but you should just drink it when you feel thirsty, and not go overboard.\nWhite Hat Guy: Uh huh?\n{{Footnote*: DOI:10.1097\n\nJSM.0000000000000221}}\n\nPerson 1: Another study* found that prolonged sitting isn't necessarily bad for you, as long as you're also getting exercise.\nWhite Hat Guy: Okay...\n{{Footnote*: DOI 10.1093\nije\ndyv101}}\n\nPerson 1:Now a study* claims that humans in pre-industrial societies stay up late, and sleep 6 or 7 horus a night, just like most people today.\nWhite Hat Guy: Huh. So what you're saying is..\n{{Footnote*: DOI: 10.1016\nj.cub.2015.09.046}}\n\nPerson 1: Maybe we're overthinking it.\nWhite Hat Guy: But what caused our modern epidemic of overthinking?! Plumbing? Or is it email?\nPerson 1: Modern? I bet the wheel was invented by someone overthinking \"pushing\".\n\n{{Title text: On the other hand, it took us embarrassingly long to clue in to the lung cancer\ncigarette thing, so I guess the real lesson is \"figuring out which ideas are true is hard.\"}}","alt":"On the other hand, it took us embarrassingly long to clue in to the lung cancer/cigarette thing, so I guess the real lesson is \"figuring out which ideas are true is hard.\"","img":"https://imgs.xkcd.com/comics/overthinking.png","title":"Overthinking","day":"19"},{"month":"10","num":1593,"link":"","year":"2015","news":"","safe_title":"Play-By-Play","transcript":"[[Beret Guy is most definitely sitting at a desk, in what may or may not be an announcer's box.  Beret Guy has what may or may not be an active headset with microphone on under his hat.]]\nBeret Guy: For those just joining us, hi! We're on part 5 of a hitting game.\n\nBeret Guy: The next guy has a big bat, so he'll probably hit the ball real far.   huh?\n{{\n-\nWait- he missed! \n-\nOh good, they're letting him try again.\n\nBeret Guy: The people sitting on the chair shelves are yelling at this guy, but he's ignoring them. Wow. \n-\nRude.\n\nBeret Guy: This thrower is good! He keeps making people leave by throwing balls at them. \n-\nIt's just him though. None of his teammates are joining in.\n\nBeret Guy: That guy just ran to the second pillow when no one was looking! \n-\nEveryone's real mad but I guess they checked the rules and there's nothing that says he can't do that.  \n-\nYikes. Hopefully they can fix that once this game is over.\n\n{{Title text: The thrower started hitting the bats too much, so the king of the game told him to leave and brought out another thrower from thrower jail.}}","alt":"The thrower started hitting the bats too much, so the king of the game told him to leave and brought out another thrower from thrower jail.","img":"https://imgs.xkcd.com/comics/play_by_play.png","title":"Play-By-Play","day":"21"},{"month":"10","num":1594,"link":"","year":"2015","news":"","safe_title":"Human Subjects","transcript":"[[Two people are sitting at a desk reviewing things.]]\nPerson 1: We're concerned that some of your results may be tainted by the fact that your human subjects are *awful*.\nPerson 2: What do you mean?\n\nPerson 1: Several participants in your drug trial were arrested for arson.\nPerson 2: Side effects can be unpredictable.\nPerson 1: They were in the control group.\n\nPerson 1: In your prisoner's dilemma study, 80% of the participants chose to betray their partners *before* the experimenter had a chance to tell them about the reward.\nPerson 2: Definitely troubling.\n\nPerson 1: In one experiment, your subjects repeatedly gave electric shocks to a stranger in another room.\nPerson 2: That's a famous psychological-\nPerson 1: This was a study of moisturizing creams!\nPerson 2: Yes, we're not sure how they snuck in all that equipment.\n\n\n{{Title text: After meeting with a few of the subjects, the IRB actually recommended that you stop stressing out so much about safety guidelines.}}","alt":"After meeting with a few of the subjects, the IRB actually recommended that you stop stressing out so much about safety guidelines.","img":"https://imgs.xkcd.com/comics/human_subjects.png","title":"Human Subjects","day":"23"},{"month":"10","num":1595,"link":"","year":"2015","news":"","safe_title":"30 Days Hath September","transcript":"[[Another person stuck in a Sisyphean thought bubble.]]\nPerson 1: ((thinking)) Thirty days hath September, April, June and November.  All the rest have 31- except February, which has 28, and leap year which makes it 29.  \n- \nWait, which month was I listening for? Oh right, October.\n-\nDid I say \"October\" in there? Now i can't remember.\n-\n30 days hath September...\n\n{{Title text: There's a cool mental calculation hack I recently learned for this: If you open the calendar app on your phone or computer, the highest-numbered box along the bottom is equal to the number of days in the month!}}","alt":"There's a cool mental calculation hack I recently learned for this: If you open the calendar app on your phone or computer, the highest-numbered box along the bottom is equal to the number of days in the month!","img":"https://imgs.xkcd.com/comics/30_days_hath_september.png","title":"30 Days Hath September","day":"26"},{"month":"10","num":1596,"link":"","year":"2015","news":"","safe_title":"Launch Status Check","transcript":"[[A multiengine rocket sits on a launch pad.  Flight controllers monitor the launch.]]\nAnnouncer: T-minus 2 minutes\nController 1: Tank and booster are go for launch.\nController 2: Safety console?\nController 1: Check. Safety-\nController 2: Wait.\n\n[[Controller 2 notices an object flying past the rocket]]\nController 1: What is it?\nController 2: On the live feed- a cool bird just flew past the tower!\n\nController 1: Whoa, hat kind?\nController 2: Like a hawk, maybe!\nController 1: Could it be a vulture?\nController 2: I doubt it. The wings were flat, not in a \"V\".\nController 1: It could be an eagle!\nController 2: Ooh!\n\nController 1: This is launch control. We have a possible sighting of a cool bird. Halt the countdown.\nController 2: Someone get binoculars up here!\nController 1: I want to see!\n\n{{Title text: Visual checks suggest the cool bird has exited the launch zone. Tip the rocket sideways and resume the countdown--we're gonna go find it!}}","alt":"Visual checks suggest the cool bird has exited the launch zone. Tip the rocket sideways and resume the countdown--we're gonna go find it!","img":"https://imgs.xkcd.com/comics/launch_status_check.png","title":"Launch Status Check","day":"28"},{"month":"10","num":1597,"link":"","year":"2015","news":"","safe_title":"Git","transcript":"[[3 people stand in front of a laptop on a desk.  Person 3 just stands there and learns]]\nPerson 1: This is git. It tracks collaborative work on projects through a beautiful distributed graph theory tree model.\nPerson 2: Cool. How do we use it?\nPerson 1: No idea. Just memorize these shell commands and type them to sync up.\nIf you get errors, save your work elsewhere, delete the project, and download a fresh copy.\n\n{{Title text: If that doesn't fix it, git.txt contains the phone number of a friend of mine who understands git. Just wait through a few minutes of 'It's really pretty simple, just think of branches as...' and eventually you'll learn the commands that will fix everything.}}","alt":"If that doesn't fix it, git.txt contains the phone number of a friend of mine who understands git. Just wait through a few minutes of 'It's really pretty simple, just think of branches as...' and eventually you'll learn the commands that will fix everything.","img":"https://imgs.xkcd.com/comics/git.png","title":"Git","day":"30"},{"month":"11","num":1598,"link":"","year":"2015","news":"","safe_title":"Salvage","transcript":"[[A reporter is filmed by a cameraperson while reporting on a major operation visible in the background. Helicopters and boats are active in the background.  Labels at the bottom say \"Historic Salvage\" and \"Live\"]]\n\n[[Several smaller boats at the surface have submerged lines carrying up the front half of a massive ship.  The ship is labeled \"RMS Titanic\"]]\n\n[[A hover of helicopters are hauling the now ascended front half of the Titanic.  A second hover of helicopters follows close behind with the back half. ]]\n\n[[Both hovers of helicopters drop their respective pieces into an enormous vat of rice. ]]\n\n{{Title text: My hobby: Taking advantage of the rice myth by posting articles on \"how to save your wet phone\" which are actually just elaborate recipes for rice pilaf.}}","alt":"My hobby: Taking advantage of the rice myth by posting articles on \"how to save your wet phone\" which are actually just elaborate recipes for rice pilaf.","img":"https://imgs.xkcd.com/comics/salvage.png","title":"Salvage","day":"2"},{"month":"11","num":1599,"link":"","year":"2015","news":"","safe_title":"Water Delivery","transcript":"Now that Amazon is advertising one-hour delivery of bottled water,\n\n[[A diagram showing the most obvious progression of events.  First just one bottle is sent from the warehouse to a person.  Then two.  Then five.  Then 20.\nFinally, a direct pipe sends the water along.]]\n\nI vote we start calling municipal plumbing \"on-demand hyperloop-style water delivery\" and see if we can sell anyone on the idea.\n\n{{Title text: When I was a kid, I asked my parents why our houses didn't have toothpaste pipes in addition to water ones. I'm strangely pleased to see Amazon thinking the same way.}}","alt":"When I was a kid, I asked my parents why our houses didn't have toothpaste pipes in addition to water ones. I'm strangely pleased to see Amazon thinking the same way.","img":"https://imgs.xkcd.com/comics/water_delivery.png","title":"Water Delivery","day":"4"}]
