[{"month":"12","num":201,"link":"","year":"2006","news":"","safe_title":"Christmas GPS","transcript":"Boy: Check it out-- I got a GPS receiver for Christmas!  What should we do with it?\nGirl: Let's take our latitude & longitdue, put our birthdays after the decimal points, then go to that spot and make out.\n[[Boy is in love]]\nNarrator: Merry Christmas from XKCD\n[[car driving off in to the distance]]\n{{Alt Text: If it's over water, and you can't get a boat or revise the rules to preserve the makeout, there is no helping you.}}","alt":"If it's over water, and you can't get a boat or revise the rules to preserve the makeout, there is no helping you.","img":"https://imgs.xkcd.com/comics/christmas_gps.png","title":"Christmas GPS","day":"25"},{"month":"12","num":202,"link":"","year":"2006","news":"","safe_title":"YouTube","transcript":"The Internet has always had loud dumb people, but I've never seen anything quite as bad as the people who comment on YouTube videos.\n[[A YouTube comments page for a moon landing video]]\nComments & Responses\nrocckir (48 minutes ago)\nthis is so obviously faked its unbilevable, why r people so gullible??? morons\nbigmike133 (35 minutes ago)\nive seen the space shuttle ass hole it definetly landed on the moon do some research...\ngunpistolman (22 minutes ago)\nif it was real why is their gravity? americans r fucken sheep\ncrackmonkey74 (17 minutes ago)\nu dont think we went to the moon why not tell louis armstrong to his face\nsimpleplan2009 (3 minutes ago)\nit was a soundstage on mars\n{{Title text: I pray GunPistolMan never learns the word 'sheeple'.}}","alt":"I pray GunPistolMan never learns the word 'sheeple'.","img":"https://imgs.xkcd.com/comics/youtube.png","title":"YouTube","day":"27"},{"month":"12","num":203,"link":"","year":"2006","news":"","safe_title":"Hallucinations","transcript":"Heading: Sometimes is seems bizarre to me that we take dreaming in stride.\n[[Two people standing]]\nPerson 1: Are you coming to dinner?\nPerson 2: Yeah, but first I'm gonna go comatose for a few hours, hallucinate vividly, and then maybe suffer amnesia about the whole experience.\nPerson 1: Okay, cool.","alt":"And the possibility of lucid dreaming just makes it that much more fascinating.","img":"https://imgs.xkcd.com/comics/hallucinations.png","title":"Hallucinations","day":"29"},{"month":"1","num":204,"link":"","year":"2007","news":"","safe_title":"America","transcript":"[[Timeline]]\n1776 ; declaration of independence\n1979 ; jimmy carter attacked by giant swimming rabbit\n2007 ; present day\ncentered, bottom, title ; america must never forget","alt":"The younger folk in the audience think this is a joke.","img":"https://imgs.xkcd.com/comics/america.png","title":"America","day":"1"},{"month":"1","num":205,"link":"","year":"2007","news":"","safe_title":"Candy Button Paper","transcript":"When it came to eating strips of candy buttons, there were two main strategies.  Some kids carefully removed each bead, checking closely for paper residue before eating.\nOthers tore the candy off haphazardly, swallowing large scraps of paper as they ate.\nThen there were the lonely few of us who moved back and forth on the strip, eating rows of beads here and there, pretending we were Turing machines.\n{Title text: Nonrewritable tape?}","alt":"Nonrewritable tape?","img":"https://imgs.xkcd.com/comics/candy_button_paper.png","title":"Candy Button Paper","day":"3"},{"month":"1","num":206,"link":"","year":"2007","news":"","safe_title":"Reno Rhymes","transcript":"[[Two men stand facing one another. Man on the left is wearing a hat]]\nMan: You know, I once shot a man in Reno, just to watch him die.\nMan 2: Really?  Well, I once shot a man in Reno, but I couldn't tell you why.\nMan: I once shot a man in Reno, then I went home to cry.\nMan 2: I once shot a man in Reno, then I watered his cacti.\nMan: I once shot a man in Reno 'cause they cancelled Firefly.\nMan 2: I once shot a man in Reno, him and all his succubi.\nMan: I once shot a man in Reno and a bunch more in My Lai.\nMan 2: I think we're done.\n{{title text: Did you shoot a man in Reno?  Now, I don't mean to pry.}}","alt":"Did you shoot a man in Reno?  Now, I don't mean to pry.","img":"https://imgs.xkcd.com/comics/reno_rhymes.png","title":"Reno Rhymes","day":"5"},{"month":"1","num":207,"link":"","year":"2007","news":"","safe_title":"What xkcd Means","transcript":"{{Title: What does XKCD mean?}}\n[[One car of two sitting at a red light makes a right turn, then shifts over to the left and makes a left turn to go back the way it came. It then makes another right and continues on the road past the traffic light. This is shown with a red arrow.]]\n{{Panel title: It means saving a few seconds at a long red light via elaborate and questionably legal maneuvers.}}\n[[Someone on a cell phone is shown in a circle in the panel. A second person in the panel itself is looking at a dog, from which the ringing sound of his phone is coming]]\n<<Ring>>\n{{Panel title: It means having someone call your cell phone to figure out where it is.}}\n[[The mathematical function \"A(g64, g64)=,\" with the 64s subscripted, appears in the panel. Next to the equal sign stands a mathematician, clutching his head.]]\n{{Panel title: It means calling the Ackermann function with Graham's number as the arguments just to horrify mathematicians.}}\nMathematician: Aughhh\n[[An approximately 8 by 8 square of floor tiles is shown; the first, fourth and seventh across in the first, fourth and seventh rows are black and the rest are white. A guy and girl are shown next to it, walking on what is presumed to be the same pattern of floor tiles.]]\n{{Panel title: It means instinctively constructing rules for which floor tiles it's okay to step on and then walking funny ever after.}}\n{{Line indicating the uppermost right black tile: Black tiles okay}}\n{{Line indicating tile directly below it: White tiles directly between black tiles okay}}\n{{Line indicating a white tile in the last column over: Not okay}}\n{{Alt text: It means shuffling quickly past nuns on the street with ketchup in your palms, pretending you're hiding stigmata.}}","alt":"It means shuffling quickly past nuns on the street with ketchup in your palms, pretending you're hiding stigmata.","img":"https://imgs.xkcd.com/comics/what_xkcd_means.png","title":"What xkcd Means","day":"8"},{"month":"1","num":208,"link":"","year":"2007","news":"","safe_title":"Regular Expressions","transcript":"Narrator: Whenever I learn a new skill I concoct elaborate fantasy scenarios where it lets me save the day.\nWoman: Oh no! The killer must have followed her on vacation!\n[[Woman points to computer]]\nWoman: But to find them we'd need to search through 200MB of emails looking for something formatted like an address!\nMan: It's hopeless!\nOffpanel voice: Everybody stand back.\nOffpanel voice: I know regular expressions.\n[[A man swings in on a rope, toward the computer]]\n<<tap tap>>\n<<PERL!>>\n[[The man swings away, and the other characters cheer]]\n{{rollover text: Wait, forgot to escape a space. Wheeeeee[taptaptap]eeeeee.}}","alt":"Wait, forgot to escape a space.  Wheeeeee[taptaptap]eeeeee.","img":"https://imgs.xkcd.com/comics/regular_expressions.png","title":"Regular Expressions","day":"10"},{"month":"1","num":209,"link":"","year":"2007","news":"","safe_title":"Kayak","transcript":"[[Person with beret in a kayak is talking to person on pier.]]\nPerson with beret: Come explore the future with me!\nPerson on pier: Huh? What's that you're in?\nPerson with beret: A two seat kayak!\nPerson on pier: I see, but why do you have it?\nPerson with beret: We'll find out! The future is a big place!\nPerson on pier: So the kayak travels through time?\nPerson with beret: Sure! Just like everything else! It also goes over water. Come on!\n{{title text: Man, there's future *everywhere*.}}","alt":"Man, there's future *everywhere*.","img":"https://imgs.xkcd.com/comics/kayak.png","title":"Kayak","day":"12"},{"month":"1","num":210,"link":"","year":"2007","news":"","safe_title":"90's Flowchart","transcript":"Start\n |\nThe 90's?\n \n          \\\nNo       Yes\n |           |\nStop      Stop\n           \n       \\\nHammertime  Collaborate\n                       |\n                    Listen\n{{alt: Freestyle rapping is basically applied Markov chains.}}","alt":"Freestyle rapping is basically applied Markov chains.","img":"https://imgs.xkcd.com/comics/90s_flowchart.png","title":"90's Flowchart","day":"15"},{"month":"1","num":211,"link":"","year":"2007","news":"","safe_title":"Hamster Ball Heist","transcript":"Person 1: You know that giant hamster ball you've always wanted? I just found out that Wayne Coyne from the Flaming Lips crowd-surfs in one.\nPerson 2: Let's go.\n\nSome Weeks Later ...\n[[Wayne Coyne is, in fact, crowd-surfing in a giant hamster ball.]]\nPerson: Ready?\nFriends: Ready.\n\nPerson: Now!\n<<shove>>\n[[People on both sides shove the crowd out of the way, causing Coyne in his ball to fall to the ground.]]\nWayne Coyne: Hey!\n\nPerson: Okay, push!\n[[Person and friends start pushing the ball away, as the crowd looks on.]]\n\n[[Some roll him up the ramp into the back of a semi, while others hold the crowd back and one stands by to drive.]]\nWayne Coyne: Help!\n\n[[The truck drives off, leaving the audience in a cloud of dust.]]\n\n{{Title text: First person to bring me Wayne Coyne in a hamster ball gets a free t-shirt!  He gets one too.}}","alt":"First person to bring me Wayne Coyne in a hamster ball gets a free t-shirt!  He gets one too.","img":"https://imgs.xkcd.com/comics/hamster_ball_heist.png","title":"Hamster Ball Heist","day":"17"},{"month":"1","num":212,"link":"","year":"2007","news":"","safe_title":"Brain","transcript":"My brain:\n[[Picture of Brain. Line points at a highlighted point]] Section that is devoted, no matter where I go in life, to planning the ultimate tree house*.\n*Man it would be like Swiss Family Robinson, but with multiple trees connected by... hey come up to my room and see the blue prints.\n{{title text: The rest is fear of raptors}}","alt":"The rest is fear of raptors.","img":"https://imgs.xkcd.com/comics/brain.png","title":"Brain","day":"19"},{"month":"1","num":213,"link":"","year":"2007","news":"","safe_title":"Ghostbusters Marathon","transcript":"[[Two people are in a room.  One is standing up.  There is litter around them.]]\nStanding man: Okay, that's all the Ghostbusters marathon I can handle. Later!\nMan #2: You can't leave! We just started the animated series!\n\nStanding man: I've had my fill. I'm going home.\nMan #2: I can't let you do that.\n\n[[The man walks along a cord, and past a box.  The other man clicks a switch.]]\n<<Click>>\n\n[[The standing man is bathed in some kind of aura emitted by the box.]]\n\n{{Title text: If you walk out that door you'll be crossing the Rubicon with me, and that's one stream I'm not ready to cross.}}","alt":"If you walk out that door you'll be crossing the Rubicon with me, and that's one stream I'm not ready to cross.","img":"https://imgs.xkcd.com/comics/ghostbusters_marathon.png","title":"Ghostbusters Marathon","day":"22"},{"month":"1","num":214,"link":"","year":"2007","news":"","safe_title":"The Problem with Wikipedia","transcript":"The Problem With Wikipedia:\nTakoma Narrows Bridge\n[[Lines Lead to]] Suspension Bridge [[and]] Structural Collapse\nThree Hours of Fascinated Clicking Later\nWilliam Howard Taft\n24-Hour Analog Dial\nLesbianism in Erotica\nBatman [[leads to]] Fatal Hilarity\nTaylor Hanson\nCotton [[leads to]] T-Shirt [[leads to]] Wet T-Shirt Contest\n{{alt:'Taft in a wet t-shirt contest' is the key image here}}","alt":"'Taft in a wet t-shirt contest' is the key image here.","img":"https://imgs.xkcd.com/comics/the_problem_with_wikipedia.png","title":"The Problem with Wikipedia","day":"24"},{"month":"1","num":215,"link":"","year":"2007","news":"","safe_title":"Letting Go","transcript":"[[A picture of a man and a woman in a heart is being held by someone, it has been ripped down the middle, separating the two people]]\n[[Man sits at computer, looking at the picture]]\n[[It is night, man still sits at computer with the picture in front of him and his head drooped]]\n[[It is day again, man types on computer]]\nText from computer: root@homebox:~# userdel megan\n{{alt text: At least I never gave her the root password.}}","alt":"At least I never gave her the root password.","img":"https://imgs.xkcd.com/comics/letting_go.png","title":"Letting Go","day":"26"},{"month":"1","num":216,"link":"","year":"2007","news":"","safe_title":"Romantic Drama Equation","transcript":"TV Romantic Drama Equation\n(Derived during a series of 'Queer as Folk' episodes)\n[[A table shows equations for possible romantic pairings in a TV show. The equation under \"gay\" is n(n-1)\n2+x(x-n); the equation under \"straight\" is x(n-x).]]\nx: Number of male (or female) cast members.\nn: total number of cast members.\n[[A graph plots pairings (for large casts) against cast makeup. Each of the above equations forms a curve.\n\"Gay cast\" starts high for an all male cast, dips down at 50\n50 cast makeup, and then rises again for all female.\n\"Straight cast\" starts at zero for an all male cast, peaks at 50\n50 cast makeup, and then drops to zero again for an all female cast.\nThe two curves intersect at two points close to the middle.]]\n\n{{Title text: Real-life prospective-pairing curves over things like age can get depressing.}}","alt":"Real-life prospective-pairing curves over things like age can get depressing.","img":"https://imgs.xkcd.com/comics/romantic_drama_equation.png","title":"Romantic Drama Equation","day":"29"},{"month":"1","num":217,"link":"","year":"2007","news":"","safe_title":"e to the pi Minus pi","transcript":"Person: Hey, check it out: e^pi-pi is 19.999099979. That's weird.\nHat Guy: Yeah. That's how I got kicked out of the ACM in college.\nPerson: . . . what?\nHat Guy: During a competition, I told the programmers on our team that e^pi-pi was a standard test of floating-point handlers--it would come out to 20 unless they had rounding errors.\nPerson: That's awful.\nHat Guy: Yeah, they dug through half their algorithms looking for the bug before they figured it out.\n{{alt text: Also, I hear the 4th root of (9^2 + 19^2\n22) is pi.","alt":"Also, I hear the 4th root of (9^2 + 19^2/22) is pi.","img":"https://imgs.xkcd.com/comics/e_to_the_pi_minus_pi.png","title":"e to the pi Minus pi","day":"31"},{"month":"2","num":218,"link":"","year":"2007","news":"","safe_title":"Nintendo Surgeon","transcript":"{{Headline: Scary Thought #137: The NES came out over two decades ago. Those kids are all grown-ups now.}}\n[[Two surgeons are in an operating room, leaning over a patient]]\nFirst Surgeon: He's going into cardiac arrest. Stand by for defibrillation.\nSecond Surgeon: Wait. First let's try taking out the heart, blowing into the ventricles, and putting it back in.\n{{title text: Scary thought #138: Raptors coming down the waterslide behind me.}}","alt":"Scary thought #138: Raptors coming down the waterslide behind me.","img":"https://imgs.xkcd.com/comics/nintendo_surgeon.png","title":"Nintendo Surgeon","day":"2"},{"month":"2","num":219,"link":"","year":"2007","news":"","safe_title":"Blanket Fort","transcript":"[[Two girls are talking with each other.  There is a fort made of cushions and blankets on the left]]\nFirst Girl: Like my fort? It uses every blanket and cushion in the apartment.\nSecond Girl: Okay, no offense, but this is like that ball pit you made -- Cute, but don't you worry you're clinging to childhood games because you're afraid of change?\nFirst Girl: No. I'm happy to grow up. But I won't pretend fun things aren't still fun out of fear of looking silly.\nSecond Girl: But you're 24 and building blanket forts. How have you changed? What's adult about that?\nFirst Girl: Well, there's my boyfriend curled up in the back.\nSecond Girl: ...Ah.\nBoyfriend [[from inside the fort]]:Excuse my shyness.  I'm not exactly dressed.\n{{alt text: Also, we have a fort out in the woods where we stashed that hooker's body.}}","alt":"Also, we have a fort out in the woods where we stashed that hooker's body.","img":"https://imgs.xkcd.com/comics/blanket_fort.png","title":"Blanket Fort","day":"5"},{"month":"2","num":220,"link":"","year":"2007","news":"","safe_title":"Philosophy","transcript":"[[Girl sits on chair, thinking]]\n[[Two panels pass, the girl does not move]]\nGirl: If the question of what it all means doesn't mean anything, why do I keep coming back to it?\n[[Two boys are talking to each other]]\nFirst boy: She's getting existential again.\nSecond boy: It's okay, I have a super soaker.\n[[Second boy pulls a large super soaker from a drawer]]\n{{title text: It's like the squirt bottle we use with the cat.}}","alt":"It's like the squirt bottle we use with the cat.","img":"https://imgs.xkcd.com/comics/philosophy.png","title":"Philosophy","day":"7"},{"month":"2","num":221,"link":"","year":"2007","news":"","safe_title":"Random Number","transcript":"int getRandomNumber()\n{\n  return 4; \n chosen by fair dice roll.\n               \n guarenteed to be random.\n}\n{{title text: RFC 1149.5 specifies 4 as the standard IEEE-vetted random number.}}","alt":"RFC 1149.5 specifies 4 as the standard IEEE-vetted random number.","img":"https://imgs.xkcd.com/comics/random_number.png","title":"Random Number","day":"9"},{"month":"2","num":222,"link":"","year":"2007","news":"","safe_title":"Small Talk","transcript":"Sometimes I forget how to do small talk.\n[[Two people are talking to each other]]\nFirst person: Hey!\nSecond person: Hey, man!\nFirst person: What's up? How've you been?\nSecond person: Well...\n[[Nothing happens]]\n[[Nothing happens]]\n[[Nothing happens]]\nFirst person: Uh, you okay?\nSecond person: Yeah! It's just an interesting question. I'm trying to decide what best sums up my -\nFirst person: <<SNAP>> Hey, conversation.\nSecond person: Oh, right. I'm fine. You?\n{{title text: But surely I owe you an accurate answer!}}","alt":"But surely I owe you an accurate answer!","img":"https://imgs.xkcd.com/comics/small_talk.png","title":"Small Talk","day":"12"},{"month":"2","num":223,"link":"","year":"2007","news":"","safe_title":"Valentine's Day","transcript":"{{Valentine's Day}}\n[[There is a large, shaded, red heart.]]\n{{Because love isn't quite complicated enough as it is.}}\n{{alt: One of these days me and Joey Comeau will get around to subverting hetero-normative paradigm and fixing all this.}}","alt":"One of these days me and Joey Comeau will get around to subverting the hetero-normative paradigm and fixing all this.","img":"https://imgs.xkcd.com/comics/valentines_day.jpg","title":"Valentine's Day","day":"14"},{"month":"2","num":224,"link":"","year":"2007","news":"","safe_title":"Lisp","transcript":"[[Floating in space]]\nSpeaker: Last night I drifted off while reading a Lisp book.\nStick Figure Man: Huh?\nSpeaker: Suddenly, I was bathed in a suffusion of blue.\n[[Floating in space before a vast concept tree]]\nSpeaker: At once, just like they said, I felt a great enlightenment.  I saw the naked structure of Lisp code unfold before me.\nStick Figure Man: My God\nStick Figure Man: It's full of 'car's\nSpeaker: The patterns and metapatterns danced.  Syntax faded, and I swam in the purity of quantified conception.  Of ideas manifest.\nTruly, this was the language from which the gods wrought the Universe.\n[[Floating in space with God appearing through a line of clouds]]\nGod: No, it's not.\nStick Figure Man: It's not?\nGod: I mean, ostensibly, yes.  Honestly, we hacked most of it together with Perl.\n{{Alt Text: We lost the documentation on quantum mechanics.  You'll have to decode the regexes yourself.}}","alt":"We lost the documentation on quantum mechanics.  You'll have to decode the regexes yourself.","img":"https://imgs.xkcd.com/comics/lisp.jpg","title":"Lisp","day":"16"},{"month":"2","num":225,"link":"","year":"2007","news":"","safe_title":"Open Source","transcript":"[[A man with much facial hair is sleeping on a bed.]]\n[[Suddenly, two ninjas jump through the skylight.]]\nNinja 1: Richard Stallman! Your viral open source licenses have grown too powerful.\nNinja 1: The GPL must be stopped.\nNinja 1: At the source.\nNinja 1: You.\n[[Richard Stallman wakes up immediately, and pulls his katana out of its sheath from under his bed]]\nRichard Stallman: Hah! Microsoft lackeys! So it has come to this!\nRichard Stallman: A night of blood I've long awaited. But be this my death or yours, free software will carry on! For a GNU dawn! For freedom! ... hey, where are you going?\n[[The ninja step out the window]]\nNinja 1: Man, you're right, that never gets old.\nNinja 2: Let's do Eric S. Raymond next.\nNinja 1: Or Linus Torvalds. I hear he sleeps with nunchucks.\n[[Comic alt text: Later we'll dress up like Big Oil thugs and jump Ralph Nader.]]","alt":"Later we'll dress up like Big Oil thugs and jump Ralph Nader.","img":"https://imgs.xkcd.com/comics/open_source.png","title":"Open Source","day":"19"},{"month":"2","num":226,"link":"","year":"2007","news":"","safe_title":"Swingset","transcript":"[[Woman talking to boy on swing-set]]\nWoman: You know, at the peak of a big swing, you become weightless.\n[[Thought bubble from boy on swing-set]]\n[[Boy swings higher and higher.  At the peak of a big swing he shoves off the swing.  The boy remains hovering in the air.]]\nBoy: Hey guys. Come check this out.\n{{title text: Someone bring me a pocket fan so I can drift around the yard.}}","alt":"Someone bring me a pocket fan so I can drift around the yard.","img":"https://imgs.xkcd.com/comics/swingset.png","title":"Swingset","day":"21"},{"month":"2","num":227,"link":"","year":"2007","news":"","safe_title":"Color Codes","transcript":"[[Man holding cell phone talks to a man at a desk littered with objects]]\nMan with phone: Hey, what's your cell number?\nMan at desk: (Violet Brown Gray) - Uh, I mean, (718)-387-6962.\nMan with phone: Okay, you are putting down those resistors and going outside for a while.\nMan at desk: That's probably a good idea.\n{{title text: (It's the TMBG Dial-a-Song line, to save you some time.)}}","alt":"(It's the TMBG Dial-a-Song line, to save you some time.)","img":"https://imgs.xkcd.com/comics/color_codes.png","title":"Color Codes","day":"23"},{"month":"2","num":228,"link":"","year":"2007","news":"","safe_title":"Resonance","transcript":"[[A person is sitting at a desk, which is vibrating.]]\n<<clatter clatter>>\n[[He leans back and turns to face someone sitting at another desk behind him.]]\nPerson 1: Excuse me--you're jiggling your leg up and down. It's traveling through the floor and making my desk resonate.\nPerson 2: Oh, I didn't even realize! I'll stop.\n[[The first person passes a sheet of paper to the second person.]]\nPerson 1: Actually, can you just shift the frequency up by 15%? I think you can get resonance with Steve's desk instead.\nPerson 2: Uh huh . . .\nPerson 1: Here are the calculations. Let's coordinate and try to spill his drink.\n{{alt text: It's really hard to control the frequency, actually.}}","alt":"It's really hard to control the frequency, actually.","img":"https://imgs.xkcd.com/comics/resonance.png","title":"Resonance","day":"26"},{"month":"2","num":229,"link":"","year":"2007","news":"","safe_title":"Graffiti","transcript":"[[A guy sits on a toilet in a bathroom. The stall sidewalll next to him is covered in graffiti--\"you suck,\" \"Mike sucks cock,\" \"Cunt,\" \"dane was here\" stuck through and \"dane is a fag\" written under it. One block of graffiti is salient:]]\n\"This graffitii is\nfleeting human contact\nboth of us lost,\nbut for a moment\nwe're lost together.\nI wonder who you are.\"\nSubtitle: I think I look for meaning in the wrong places sometimes.\n{{title-text: FOR AN INTRIGUING TIME CALL}}","alt":"FOR AN INTRIGUING TIME CALL","img":"https://imgs.xkcd.com/comics/graffiti.png","title":"Graffiti","day":"28"},{"month":"3","num":230,"link":"","year":"2007","news":"","safe_title":"Hamiltonian","transcript":"[[Classroom]]\nLecturer: And therefore, based on the existence of a Hamiltonian path, we can prove that the routing algorithm gives the optimal result in all cases.\nMan: Oh my God.\n[[Close-up of Man]]\n(Out of frame): What? What is it?\nMan: A sudden rush of perspective. What am I doing here? Life is so much bigger than this!\n\n[[Man Running out of Room]]\nMan: I have to go.\n[[Man enters darkened room, where woman waits by window.]]\n[[Man and woman embrace...]]\n\n[[...and get into bed.]]\n[[A heart appears over the supine bodies]]\nWoman: Ohh...\n[[Hands <<grip>>]]\nMan (out of frame): Wait a moment.\nWoman (out of frame): What is it?\n[[Silence]]\nMan (out of frame): His proof only holds if there's a Hamiltonian _cycle_ as well as a path!\nWoman (out of frame): ...excuse me?\nMan (out of frame): Paper, I need some paper.\nMan (out of frame): Hey, do you mind if I jot down some notes on your chest?\n{{title text: The  problem with perspective is that it's bidirectional}}","alt":"The problem with perspective is that it's bidirectional.","img":"https://imgs.xkcd.com/comics/hamiltonian.png","title":"Hamiltonian","day":"2"},{"month":"3","num":231,"link":"","year":"2007","news":"","safe_title":"Cat Proximity","transcript":"[[a graph is drawn, x-axis: \"human proximity to cat\" from far to near]]\n[[a curve labeled intelligence veering downwards]]\n[[a curve labeled inanity of statements veering upwards]]\n[[a man standing far from a kitten]]\n[[a man standing closer to a kitten]]\n[[a man standing next to a kitten]]\nMan: You're a kitty!\n{{alt-text: Yes you are! And you're sitting there! Hi, kitty!}}","alt":"Yes you are!  And you're sitting there!  Hi, kitty!","img":"https://imgs.xkcd.com/comics/cat_proximity.png","title":"Cat Proximity","day":"5"},{"month":"3","num":232,"link":"","year":"2007","news":"","safe_title":"Chess Enlightenment","transcript":"Narrator: Why is chess so hard? Maybe the answers lie within me. Maybe I just need to let go, relax, and let my instincts and subconscious speak.\n<<Meditate>>\nNarrator's Subconscious: Knight to G-4\n\nNarrator: That's not even a legal move.\nNarrator's Subconscious: Okay, hold on. How do the pawns capture, again?\nNarrator: Man, Obi-Wan was full of crap.\n{{title text: You know that 'sweep the pieces off the board and see it in your mind' thing?  Doesn't work.}}","alt":"You know that 'sweep the pieces off the board and see it in your mind' thing?  Doesn't work.","img":"https://imgs.xkcd.com/comics/chess_enlightenment.png","title":"Chess Enlightenment","day":"7"},{"month":"3","num":233,"link":"","year":"2007","news":"","safe_title":"A New CAPTCHA Approach","transcript":"To complete your web registration, please prove that you're human:\nWhen Littlefoot's mother died in the original `Land Before Time', did you feel sad?\n[[radio button]] Yes\n[[radio button]] No\n(Bots: no lying)","alt":"They'd use that Futurama episode with Fry's dog, but even spambots cry at that.","img":"https://imgs.xkcd.com/comics/a_new_captcha_approach.png","title":"A New CAPTCHA Approach","day":"9"},{"month":"3","num":234,"link":"","year":"2007","news":"","safe_title":"Escape Artist","transcript":"[[One man sits before a computer on a desk while another stands behind him.]]\nStanding Man: I was fascinated by locks as a kid. I loved how they turned information and patterns into physical strength.\nSitting Man: Why does my script keep dying?\n[[Closeup of the man on the man sitting at the computer]]\nStanding Man: And a lock invites you to try and open it. It's the hacker instinct. Only your ignorance stands in the way.\nSitting Man: Wait it's passing bad strings.\n[[Returns to the two shot of both men]]\nStanding Man: I admired Harry Houdini, how he could open any lock and free himself from any restraint. \nSitting Man: Ah - Bash is parsing the spaces.\nStanding Man: Sure some of it was fakery and showmanship. But I still wonder how he so consistently escaped handcuffs.\nSitting Man: Backslashes\nStanding Man: Huh?\nSitting Man: Never mind. \n{{Alt: Easier to escape: n-layered nested quotes or an iron maiden?}}","alt":"Easier to escape: n-layered nested quotes or an iron maiden?","img":"https://imgs.xkcd.com/comics/escape_artist.png","title":"Escape Artist","day":"12"},{"month":"3","num":235,"link":"","year":"2007","news":"","safe_title":"Kite","transcript":"[[A man readies a kite]]\n[[The man starts to fly the kite]]\n[[The man continues to fly the kite]]\n[[The man ties the kite string to a tree]]\n[[The man grabs the string]]\n[[The man starts to climb the string]]\n[[A scene showing the man holding onto the string at a high altitude, against a colour backdrop of the ground, clouds, water and the sky]]\n[[Black and white again.  A woman comes into view holding onto a small blimp]]\nMan's thought bubble: Hey, there's someone else up here.  I wonder what her story is.\n[[Woman floats to the other side of the panel]]\nMan's thought bubble: Maybe I should say hi.\n[[The man is alone holding onto the string]]\n{{title text: It's easy to regret your awkward conversations but hard to regret the ones you didn't have}}","alt":"It's easy to regret your awkward conversations but hard to regret the ones you didn't have.","img":"https://imgs.xkcd.com/comics/kite.jpg","title":"Kite","day":"14"},{"month":"3","num":236,"link":"","year":"2007","news":"","safe_title":"Collecting Double-Takes","transcript":"[[A man is standing in the middle of the produce aisle in a supermarket, holding a tube of K-Y Jelly in one hand, the other on his chin.  The signs read \"Bananas\" \"Apples\" \"Oranges\" and \"Zucchini\" from left to right.]] \nMY HOBBY:  Standing in the supermarket's produce section holding a tube of K-Y Jelly, looking contemplative.\n{{Title Text: Fun Game: find a combination of two items that most freaks out the cashier. Winner: pregnancy test and single coat hanger.}}","alt":"Fun game: find a combination of two items that most freaks out the cashier.  Winner: pregnancy test and single coat hanger.","img":"https://imgs.xkcd.com/comics/collecting_double_takes.png","title":"Collecting Double-Takes","day":"16"},{"month":"3","num":237,"link":"","year":"2007","news":"","safe_title":"Keyboards are Disgusting","transcript":"{{title text: Keyboards are Disgusting}}\n[[A Man sits at his computer, chatting with some other person.]]\nChat: Wanna see an optical illusion? Hold your keyboard up in front of you and look at the home row.\n[[The man holds the keyboard in front of him.]]\nChat: Now cross your eyes a little so the 'g' and 'h' overlap.\nChat: Keeping focus, lift the keyboard over your head.\n[[The man lifts the keyboard over his head still looking at the keyboard]]\n[[Tiny parts of dust and skin particles fall in the man's face]]\nMan: Eww!\nChat: Haha","alt":"Alternate method: convince them to pretend it's an Etch-a-Sketch and try to erase it.","img":"https://imgs.xkcd.com/comics/keyboards_are_disgusting.png","title":"Keyboards are Disgusting","day":"19"},{"month":"3","num":238,"link":"","year":"2007","news":"","safe_title":"Pet Peeve #114","transcript":"[[Figure reading a book in a chair]]\n{{Pet peeve #114:}}\nVoice on the phone: Really?  What are you doing reading?  It's Saturday night!\n{{Alt text: I'm reading a goddamn book, thank you very much.}}","alt":"I'm reading a goddamn book, thank you very much.","img":"https://imgs.xkcd.com/comics/pet_peeve_114.png","title":"Pet Peeve #114","day":"21"},{"month":"3","num":239,"link":"","year":"2007","news":"","safe_title":"Blagofaire","transcript":"Man in Red Cape and Goggles: Hey, it worked!\nMan: What? Who are you?\nMan in Red Cape and Goggles: I'm from the distant future.\nMan: Wow.  Hi!\nMan in Red Cape and Goggles: Are you a blogger?  I play one of you at our festivals!\nMan: Huh?\nMan in Red Cape and Goggles: Like the ren faires of your time - I do reenactments.\nMan in Red Cape and Goggles: We relive the days when the internet was new and free.  The days of risky sharing, slashdot, the myspace music renaissance.  The generation's finest minds meeting on comment threads, battling roving bands of trolls, and holding the great dialogues of the age!\nMan: Is that how you -\nMan in Red Cape and Goggles: We're fuzzy on some details.  Did bloggers really wear red capes and goggles and blog from high-altitude balloons?\nMan: No!\nMan: Well, Cory Doctorow does.  But nobody else.\n{{Title Text: Things were better before the Structuring and the Levels.}}","alt":"Things were better before the Structuring and the Levels.","img":"https://imgs.xkcd.com/comics/blagofaire.png","title":"Blagofaire","day":"23"},{"month":"3","num":240,"link":"","year":"2007","news":"","safe_title":"Dream Girl","transcript":"Man 1: I had a dream that I met a girl in a dying world.\nIt was all coming apart. Hairline cracks in reality widened to yawning chasms. Everything was going dark and light all at once, and there was a sound like breaking waves rising into a piercing scream at the edge of hearing. I knew we didn't have long together.\nShe grabbed me and spoke a stream of numbers into my ear. Then it all went away.\n[[A girl grabs him as the edges of the panel crack and tear]]\nI woke up. The memory of the apocalypse faded to mere fancy, but the numbers burned bright in my mind. I wrote them down right away.\n[[A note reads: 42.39561  -71.13051  2007 09 23  14 38 00]]\nThey were coordinates. A place and a time, neither one too far away.\nMan 1: What else could I do? When the day came, I went to the spot and waited.\nMan 2: ...and?\nMan 1: It turns out wanting something doesn't make it real.\n{{Alt-text: No matter how elaborately you fool yourself.}}","alt":"No matter how elaborately you fool yourself.","img":"https://imgs.xkcd.com/comics/dream_girl.png","title":"Dream Girl","day":"26"},{"month":"3","num":241,"link":"","year":"2007","news":"","safe_title":"Battle Room","transcript":"[[A scene is depicted from the Battle Room of the novel Ender's Game by Orson Scott Card.  The men are floating in a room with random cubes.]]\nDink: Sorry, Ender - seems like there were some system crashes.  The battle's gotta be cut short.\nEnder: The lasers still work.\nDink: Yeah, but the enemy's gate is down.\n{{Title Text: Bean actually sabotaged it just to give Dink the excuse to make that joke.}}","alt":"Bean actually sabotaged it just to give Dink the excuse to make that joke.","img":"https://imgs.xkcd.com/comics/battle_room.png","title":"Battle Room","day":"28"},{"month":"3","num":242,"link":"","year":"2007","news":"","safe_title":"The Difference","transcript":"[[A man pulls a lever.]]\n<<Pull>>\n[[Lightning hits the man.]]\n<<ZAP>>\n[[The man still stands, obviously battered]]\n[[Arrow labeled \"Normal Person\"]]\nThinks: I guess I shouldn't do that.\n[[Arrow labeled \"Scientist\"]]\nThinks: I wonder if that happens every time.\n[[He reaches for the lever again.]]\n{{ alt: How could you choose avoiding a little pain over understanding a magic lightning machine? }}","alt":"How could you choose avoiding a little pain over understanding a magic lightning machine?","img":"https://imgs.xkcd.com/comics/the_difference.png","title":"The Difference","day":"30"},{"month":"4","num":243,"link":"","year":"2007","news":"","safe_title":"Appropriate Term","transcript":"[[A diagram of a TrackPoint pointer on a keyboard, under which is a continuity line labeled \"Tone of Conversation-Formal to Informal.\" There are four boxes under this line]]\nNarrator: How to refer to the pointer thing on laptop keyboards\nVery formal: TrackPoint(tm)-style pointer\nFormal: Nub\nInformal: Nipple mouse\nVery informal: Clit mouse\n{{title text: I know a lot of people hate these, but I prefer them to touchpads}}","alt":"I know a lot of people hate these, but I prefer them to touchpads.","img":"https://imgs.xkcd.com/comics/appropriate_term.png","title":"Appropriate Term","day":"2"},{"month":"4","num":244,"link":"","year":"2007","news":"","safe_title":"Tabletop Roleplaying","transcript":"[[Four people sit around a table]]\nDM: Your party enters the tavern.\nPlayer: I gather everyone around a table. I have the elves start whittling dice and get out some parchment for character sheets.\nDM: Hey, no recursing.\n{{title-text: I may have also tossed one of a pair of teleportation rings into the ocean, with interesting results.}}","alt":"I may have also tossed one of a pair of teleportation rings into the ocean, with interesting results.","img":"https://imgs.xkcd.com/comics/tabletop_roleplaying.png","title":"Tabletop Roleplaying","day":"4"},{"month":"4","num":245,"link":"","year":"2007","news":"","safe_title":"Floor Tiles","transcript":"[[Two characters walk on a floor tiled in black and white.]]\nFirst: Why are you walking funny?\n[[Second panel consists of second character's thought cloud in which the second character points to an easel mounted diagram of the floor tile pattern]]\nSecond, thinking: Well, my instinct is to step only on black tiles, but they're too far apart. So I'm letting myself walk on the tiles directly in line with the black ones, but that means that when we walk diagonally, I have to step in a pattern where...\n[[Returns to situation in first panel]]\nSecond: I'm not walking funny.\n{{title-text: The worst part is when sidewalk cracks are out-of-sync with your natural stride.}}","alt":"The worst part is when sidewalk cracks are out-of-sync with your natural stride.","img":"https://imgs.xkcd.com/comics/floor_tiles.png","title":"Floor Tiles","day":"6"},{"month":"4","num":246,"link":"","year":"2007","news":"","safe_title":"Labyrinth Puzzle","transcript":"[[Three guards with spears stand in front of three doors.  A man wearing a hat and another man stand in front of the guards]]\nMan with hat: And over here we have the labyrinth guards.  One always lies, one always tells the truth, and one stabs people who ask tricky questions.\n{{title text: And the whole setup is just a trap to capture escaping logicians. None of the doors actually lead out.}}","alt":"And the whole setup is just a trap to capture escaping logicians.  None of the doors actually lead out.","img":"https://imgs.xkcd.com/comics/labyrinth_puzzle.png","title":"Labyrinth Puzzle","day":"9"},{"month":"4","num":247,"link":"","year":"2007","news":"","safe_title":"Factoring the Time","transcript":"[[One man is sitting at a computer.  Another man is sitting at a separate desk.  There is a clock which reads 2:53]]\nMan at desk: 253 is 11x23\nMan at computer: What?\nMan at desk: I'm factoring the time.\nMan at desk: I have nothing to do, so I'm trying to calculate the prime factors of the time each minute before it changes.\nMan at desk: It was easy when I started at 1:00, but with each hour the number gets bigger\nMan at desk: I wonder how long I can keep up.\n[[Man at desk reaches back and touches the clock]] <<beep>> [[Clock now reads 14:53]]\nMan at desk: Hey!\nMan at computer: Think fast.\n{{alt text: I occasionally do this with mile markers on the highway.}}","alt":"I occasionally do this with mile markers on the highway.","img":"https://imgs.xkcd.com/comics/factoring_the_time.png","title":"Factoring the Time","day":"11"},{"month":"4","num":248,"link":"","year":"2007","news":"","safe_title":"Hypotheticals","transcript":"Beret Guy: What if I had some ice cream? Wouldn't that be awesome?\nPerson: No, stop--\nBeret Guy (thinking):\n        Person: Great, you've trapped us in a a hypothetical situation!\n        Beret Guy (holding ice cream): Mm, ice cream.\n        Person: Maybe if I had a knife I could cut our way free . . .\n        Person (thinking):\n                Beret Guy: Mmm, ice cream!\n                Person (reaching back into previous thought bubble): Here, take this one.\n{{alt: What if someone broke out of a hypothetical situation in your room right now?}}","alt":"What if someone broke out of a hypothetical situation in your room right now?","img":"https://imgs.xkcd.com/comics/hypotheticals.png","title":"Hypotheticals","day":"13"},{"month":"4","num":249,"link":"","year":"2007","news":"","safe_title":"Chess Photo","transcript":"[[Friend 2 sits at a desk with glue, chess pieces, and a chessboard while Friend 1 looks over his shoulder.]]\nFriend 1: What are you doing?\nFriend 2: Gluing down chess pieces.\nFriend 1: Why?\nFriend 2: Because there's a picture I've always wanted... I'll need your coat to sneak this onto the ride.\n[[A photograph of a roller coaster ride with Friend 2 sitting in the first car, chin in the hand, thinking over the chessboard. The photograph has \"Mega Coaster 3000 souvenir photo\" written on the margin.]]\n{{alt text: We once tried playing blindfold chess on the Aerosmith ride at Disney World.}}","alt":"We once tried playing blindfold chess on the Aerosmith ride at Disney World.","img":"https://imgs.xkcd.com/comics/chess_photo.png","title":"Chess Photo","day":"16"},{"month":"4","num":250,"link":"","year":"2007","news":"","safe_title":"Snopes","transcript":"Another urban legend? You should check out Snopes before sending me this stuff.\nOops; yeah.\nMan, Snopes is really great--independent fact-checkers trawling our collective discourse, filtering out misinformation.\nYeah, but they have their dark side. The couple that runs snopes.com also runs a network of spam servers that start many of those forwarded stories in the first place, ensuring they'll always have business.\nThat's absurd. Plus, it's definitely not true--it was debunked by...\nYes?\n... Oh my God.\nalt text: The MythBusters are even more sinister.","alt":"The MythBusters are even more sinister.","img":"https://imgs.xkcd.com/comics/snopes.png","title":"Snopes","day":"18"},{"month":"4","num":251,"link":"","year":"2007","news":"","safe_title":"CD Tray Fight","transcript":"[[A stick figure is standing, holding a CD tray which is half-in his computer. There are other CDs on the floor.]]\nStick Figure: Hey. Hey! Stop retracting my CD!\n[[Label: I feel uncomfortable when my computer physically struggles with me. Sure, I can overpower it _now_, but it feels like a few short steps from here to the robot wars.]]\n{{alt text: This is silly, of course. The enemy will be born in the network.}}","alt":"This is silly, of course.  The enemy will be born in the network.","img":"https://imgs.xkcd.com/comics/cd_tray_fight.png","title":"CD Tray Fight","day":"20"},{"month":"4","num":252,"link":"","year":"2007","news":"","safe_title":"Escalators","transcript":"Graph with y axis titled \"Urge to try running up the down escalator\", with \"weak\" by the bottom and \"strong\" by the top. x axis has every two years labeled and every year signified by a smaller mark, which stops at 24. A red line with \"What I was supposed to feel\" with points at every line rises, peaks at 7 years old, then falls \"tangent graph\" shaped until the end. Along this line are shown various stick-figures at 12, 14, 20 and 24. A second red line runs \"What I've actually felt\" which stays consistently high.\n{{alt text: The one time I tried, I got hit by a slinky going down at double speed.}}","alt":"The one time I tried, I got hit by a slinky going down at double speed.","img":"https://imgs.xkcd.com/comics/escalators.png","title":"Escalators","day":"23"},{"month":"4","num":253,"link":"","year":"2007","news":"","safe_title":"Highway Engineer Pranks","transcript":"Highway Engineer Pranks:\n[[Each panel depicts a highway intersection.]]\nThe Inescapable Cloverleaf:\n[[Roads lead onto the rings for each leaf, but then are trapped in the circles.  Minor roads also allow travel between the rings.]]\n\nThe Zero-Choice Interchange:\n[[On and off-ramps exist, but they lead back to the same lane they disconnected from.]]\n\nThe Rotary Supercollider:\n[[The roads lead into a traffic circle, and then a loop reverses the direction of flow so all the roads run into each other.]]\n\n{{Title text: Prank #11: Boston}}","alt":"Prank #11: Boston","img":"https://imgs.xkcd.com/comics/highway_engineer_pranks.png","title":"Highway Engineer Pranks","day":"25"},{"month":"4","num":254,"link":"","year":"2007","news":"","safe_title":"Comic Fragment","transcript":"Editor's Note: Mr. Monroe has been missing for several days.  We have received no submissions from him for some time, but we found this single panel on his desk in a folder labeled 'MY BEST IDEA EVER' .  It is clearly part of a work in progress, but we have decided to post it in lieu of a complete comic.\n[[Single panel illustration in color with one small panel embedded within, showing a zoomed-in version of Janeane Garafolo on a motorcycle.  The background is a gray landscape beneath a falling space station, a large volcano with smoke rising the only discernible feature of the landscape below.]]\nAs the damaged space station fell deeper into the atmosphere and started to break up around her, Janeane Garafolo tightened her grip on the motorcycle.\nThe volcano was looming ahead, and her tranquilizer pistol only had six darts left - barely enough to bring down even ONE tyrannosaur. \n{{Title Text: No one wants an explanation more than us.  Except Ms. Garafolo.}}","alt":"No one wants an explanation more than us.  Except Ms. Garofalo.","img":"https://imgs.xkcd.com/comics/comic_fragment.jpg","title":"Comic Fragment","day":"27"},{"month":"4","num":255,"link":"","year":"2007","news":"","safe_title":"Subjectivity","transcript":"[tall slide, seen from the ground]\nWhen I was a kid, my school playground had a really tall slide that always made me nervous\n[tall slide, seen from the side]\nWe moved away, but the slide stuck in my memory, becoming a skyscraping monster\n[car and a sign pointing to school zone]\nYears later, I was passing through my old town and remembered the playground\nI drove to the school to see the slide that my inner six-year-old thought was so towering\n[huge slide, (small) person beside it]\nAND IT WAS HUGE\nI KNEW IT\n{{title text: Or maybe the slide is like Aslan, and gets taller as I do (except without the feeling of discomfort when I reach my teens and suddenly get the Christ stuff)}}","alt":"Or maybe the slide is like Aslan, and gets taller as I do (except without the feeling of discomfort when I reach my teens and suddenly get the Christ stuff.)","img":"https://imgs.xkcd.com/comics/subjectivity.png","title":"Subjectivity","day":"30"},{"month":"5","num":256,"link":"https://imgs.xkcd.com/comics/online_communities.png","year":"2007","news":"","safe_title":"Online Communities","transcript":"[[Hand-drawn fantasy style map with land and sea areas representing populations of online communities. Each area or item is labeled.]]\nMap Title Text: Map of Online Communities and related points of interest. Geographic area represents estimated size of membership\nMap Disclaimer Text: Not a complete survey. Sizes based on best figures I could find but involved some guesswork. Do not use for navigation.\nLand Area Labels: The Icy North (Yahoo, Windows Live), AOL, Reunion dot com, Classmates dot com, E-harmony, Faceparty, QWGHLM, Yahoo Games, Mountains of Web 1.0, The Lonely Island, MySpace, Attractive MySpace Pages, The Series of Tubes, Myspace Bands, WOW, Lineage, Second Life, Third Life, UO, EQ, FPXI, 2channel, 4chan, LJ, Xanga, Orkut, Cyworld, Blurty, OK Cupid, Facebook, Piczo, The Compass-Rose-Shaped Island, Broadcaster, Flickr, Last.fm, DeviantArt, Isle of Slash, Numa, Digg, Fark, Reddit, Your Base, Soviet Russia, \n. (slashdot), Spaaarta (YTMND), StumbleUpon, Del.icio.us, The Blogipelago, Sulawesi, Technocrati, BoingBoing, Huntingdon Post, Gays of Web 2.0, The Wikipedia project, MIT, Engadget, Gizmodo, Usenet, XY Singles, MAKE Blog, IRC Isles, Sourceforge.\nSea Area Labels: NOOB Sea, Gulf of YouTube, Bay of Angst, Sea of Culture, Ocean of Subculture, P2P Shoals, Straits of Web 2.0, Here Be Anthropomorphic Dragons, Bay of Trolls, Viral Straits, Sea of Memes, The Wet Sea\nItem Labels: Shipwreck of the SS Howard Dean, Cory Doctrow's Balloon, Stallman's airship, Google's volcano fortress\n{{Alt-text: I'm waiting for the day when, if you tell someone 'I'm from the internet', instead of laughing they just ask 'oh, what part?'}}","alt":"I'm waiting for the day when, if you tell someone 'I'm from the internet', instead of laughing they just ask 'oh, what part?'","img":"https://imgs.xkcd.com/comics/online_communities_small.png","title":"Online Communities","day":"2"},{"month":"5","num":257,"link":"","year":"2007","news":"","safe_title":"Code Talkers","transcript":"[[A man is looking at a computer monitor and speaking into a microphone]]\nMan 1: A'la'ih, do'neh'lini,\ndo'neh'lini, a'la'ih,\ndo'neh'lini, a'la'ih,\ndo'neh'lini, do'neh'lini,\na'la'ih, a'la'ih,\ndo'neh'lini, a'la'ih,\ndo'neh'lini,do'neh'lini,\ndo'neh'lini ...\n[[Two men are talking nearby:]]\nMan 2: For added security, after we encrypt the data stream, we send it through our Navajo code talker.\nMan 3: ...Is he just using Navajo words for \"Zero\" and \"One\"?\nMan 2: Woah, hey, keep your voice down!\n{{alt:As far as I can tell, Navajo doesn't have a common word for 'zero'.  do-neh-lini means 'neutral'.}}","alt":"As far as I can tell, Navajo doesn't have a common word for 'zero'.  do-neh-lini means 'neutral'.","img":"https://imgs.xkcd.com/comics/code_talkers.png","title":"Code Talkers","day":"4"},{"month":"5","num":258,"link":"","year":"2007","news":"","safe_title":"Conspiracy Theories","transcript":"[[Figure A:]]\nThe official story of 9-11 is full of holes.  Take the --\n[[Figure B:]]\nPlease, stop, because seeing this happen to you breaks my heart.\n[[Figure B:]]\nConspiracy theories represent a known glitch in human reasoning.  The theories are of course occasionally true, but their truth is completely uncorrelated with the believer's certainty.  For some reason, sometimes when people think they've uncovered a lie, they raise confirmation bias to an art form.  They cut context away from facts and arguments and assemble them into reassuring litanies.  And over and over I've argued helplessly with smart people consumed by theories they were sure were irrefutable, theories that in the end proved complete fictions.\nYoung-Earth Creationists, the Moon Landing people, the Perpetual Motion subculture -- can't you see you're falling into the same pattern?\n[[Figure A:]]\nYou don't seriously believe we landed on the moon.  Do you?\n[[Figure B flees]]\n[[Figure B, praying:]]\nDear God.\n[[Booming from the sky:]]\nYES MY CHILD?\n[[Figure B:]]\nI would like to file a bug report.","alt":"There are a lot of graduate-educated young-earth creationists.","img":"https://imgs.xkcd.com/comics/conspiracy_theories.png","title":"Conspiracy Theories","day":"7"},{"month":"5","num":259,"link":"","year":"2007","news":"","safe_title":"Clichd Exchanges","transcript":"Narrator: MY HOBBY: DERAILING CLICHD EXCHANGES BY USING THE WRONG REPLIES\nMan 1: O RLY?\nMan 2: O RLY? I 'ARDLY KNOW 'ER!\n{{It's like they say, you gotta fight fire with clichs.}}","alt":"It's like they say, you gotta fight fire with clich&eacute;s.","img":"https://imgs.xkcd.com/comics/cliched_exchanges.png","title":"Clich&eacute;d Exchanges","day":"9"},{"month":"5","num":260,"link":"","year":"2007","news":"","safe_title":"The Glass Necklace","transcript":"[[A man is drawing a diagram of a cylinder with electrical terminals on either end]]\n[[The man is shown at a workbench making the device in a workshop]]\n[[He kneels down on a beach and scoops up sand]]\n[[He pours the sand into the cylinder]]\n[[He ties a spool of string to one end of the cylinder, and ties a deflated weather balloon to the other end]]\n[[The weather balloon is inflated, and raised up into the clouds as thunder rumbles]]\n[[The end of the string is tied to a stake in the ground, and lightning is flashing in the background]]\n[[Lightning hits the balloon, travels through the cylinder, and fuses it's contents]]\n{{Later}}\n[[The man follows the string to find the cylinder]]\n[[He detaches it, opens it, removes a solidified piece, and admires the piece]]\n[[He takes the stone to a jeweler]]\n[[The jeweler examines, grinds, and sets the now-shining stone in a necklace]]\n[[The man approves of the final result]]\n[[He gives it to a woman]]\n{{alt: Well, for some value of 'actually work'.}}","alt":"Well, for some value of 'actually work'.","img":"https://imgs.xkcd.com/comics/the_glass_necklace.png","title":"The Glass Necklace","day":"11"},{"month":"5","num":261,"link":"","year":"2007","news":"","safe_title":"Regarding Mussolini","transcript":"[[Three people are standing around a map.  One of them is pushing something with a stick.]]\n[[A messenger arrives.]]\nMessenger: General, Italian forces have entered Egypt.\nGeneral: As I expected. This is a foolish move by Mussolini, but like Hitler he will no doubt force his commanders to --\nMessenger: Hey. Godwin's Law.\nGeneral: Dammit.\nGeneral: You know, this may become a problem.\n\n{{Title text: Constantly stopping these briefings halfway through is becoming a pain.}}","alt":"Constantly stopping these briefings halfway through is becoming a pain.","img":"https://imgs.xkcd.com/comics/regarding_mussolini.png","title":"Regarding Mussolini","day":"14"},{"month":"5","num":262,"link":"","year":"2007","news":"","safe_title":"IN UR REALITY","transcript":"[[Two men stand facing one another. Man on the left is wearing a hat and holding a cat and a piece of paper. Man 2 has raised his arms. There are three cats with captions stuck to them]] \nMan: Oh hi; I'm here from the internet\nMan 2: What are you doing!?\nMan: Gluing captions to your cats.\n<<rrrr>>\n{{Title-text: Hey, at least I ran out of staples.}}","alt":"Hey, at least I ran out of staples.","img":"https://imgs.xkcd.com/comics/in_ur_reality.png","title":"IN UR REALITY","day":"16"},{"month":"5","num":263,"link":"","year":"2007","news":"","safe_title":"Certainty","transcript":"[[A door seen from a hallway, with \"Teachers' Lounge\" on the glass. Inside, two teachers are talking.]]\nTeacher 1: My students drew me into another political argument.\nTeacher 2: Eh; it happens.\nTeacher 1: Lately, political debates bother me. They just show how good smart people are at rationalizing.\n[[The two teachers continue talking. A third one is seen reading a book on a sofa.]]\nTeacher 1: The world is so complicated - the more I learn, the less clear anything gets. There are too many ideas and arguments to pick and choose from. How can I trust myself to know the truth about anything?\nAnd if everything I know is so shaky, what on Earth am I doing teaching?\nTeacher 2: I guess you just do your best. No one can impart perfect universal truths to their students.\nTeacher 3: <<ahem>>\nTeacher 2: ...Except math teachers.\nTeacher 3: Thank you.\n{{alt text: a(b+c)=(ab)+(ac). Politicize that, bitches.}}","alt":"a(b+c)=(ab)+(ac).  Politicize that, bitches.","img":"https://imgs.xkcd.com/comics/certainty.png","title":"Certainty","day":"18"},{"month":"5","num":264,"link":"","year":"2007","news":"","safe_title":"Choices: Part 1","transcript":"[[Girl sits at desk, using computer. Refreshes page]]\n<<*Refresh*>>\n<<Click>>\n[[Sits back and looks at monitor]]\n[[Refreshes page on computer]]\n<<*Refresh*>>\n<<Click>>\n[[Sits back and looks at monitor]]\n[[Girl leans forward and clicks mouse]]\n<<Click>>\n[[A hole opens up in the panel. It appears to be the torn paper of the comic itself. A blue, sky-like background is revealed. Girl jumps in surprise, nearly tipping over the chair]]\n[[Girl stands up as the chair falls over completely.]]\n[[Wide view. The girl looks back at the door furtively]]\n[[She begins to climb into the hole]]\n[[By now the girl is entirely inside the hole. She is closing it behind her]]\n[[Only her head and arms are visible]]\n[[The hole is closed, revealing a formation of ripped paper.]]\n{{Large frame}}\n[[She appears to be in space. Stars dot the sky and a ray of light traverses the frame horizontally. Megan is in a bubble, floating disconnectedly. Both her and bubble have become white, tinged against the backdrop]]\n{{title text: Wait, damn, I think I spotted a new email on the last refresh.}}","alt":"Wait, damn, I think I spotted a new email on the last refresh.","img":"https://imgs.xkcd.com/comics/choices_part_1.jpg","title":"Choices: Part 1","day":"21"},{"month":"5","num":265,"link":"","year":"2007","news":"","safe_title":"Choices: Part 2","transcript":"[[A boy is doing some excercises in a book. The clock on the wall says 12:50 or 13:50.]]\n[[Book:\nChapter 15: Special Relativity\nProblem 1:\nTwo spacecraft transmit messages to each other while passing at constant velocities of...\n]]\nBoy: <<sigh>>\n[[Label: Meanwhile:]]\n[[A girl in a bubble and a spacecraft are moving towards each other. Each one has a velocity vector drawn before themselves, each showing a velocity of 0.2c.]]\n[[They pass each other.]]\nSpacecraft: We observe your speed to be 38.5%c, and your time is passing at 92.3% the rate of ours. Does this mirror your observations?\nGirl: Please help me. I think I'm lost.\n[[They continue with the same velocity vectors. The girl is looking back at the spacecraft.]]\n{{alt text: Maybe someday I'll get to write the Wikipedia article about this place! Wait, damn, original research.}}","alt":"Maybe someday I'll get to write the Wikipedia article about this place!  Wait, damn, original research.","img":"https://imgs.xkcd.com/comics/choices_part_2.jpg","title":"Choices: Part 2","day":"21"},{"month":"5","num":266,"link":"","year":"2007","news":"","safe_title":"Choices: Part 3","transcript":"[[A girl floats in a bubble against a space backdrop]]\nGirl: I should feel scared.\nBut I don't.\nMaybe this is a dream\nbut it doesn't feel like one.\nDisembodied voice: Okay, found you.\nGirl: Who are you?\nVoice: Er, hang on.  This next part might be a little weird.\n[[No dialogue]]\n[[Many copies of the girl whirl around her bubble; a lightning bolt appears in the background]]\n[[All the copies have disappeared except for one]]\nCopy: Sorry -- Hi, me.\nGirl: ...Hi.\n{{Alt-text: Wait, this is space -- how are you talking to me?  And, as an afterthought, what's up with the hole in reality?}}","alt":"Wait, this is space -- how are you talking to me?  And, as an afterthought, what's up with the hole in reality?","img":"https://imgs.xkcd.com/comics/choices_part_3.jpg","title":"Choices: Part 3","day":"23"},{"month":"5","num":267,"link":"","year":"2007","news":"","safe_title":"Choices: Part 4","transcript":"[[Girl in bubble, floating in outer space next to her clone]]\nClone: I shouldn't do this, but I pulled you out for a moment to give you a hint.\nGirl: A hint?\nClone: Take wrong turns.  Talk to strangers.  Open unmarked doors.  And if you see a group of people in a field, go find out what they're doing.  Do things without always knowing how they'll turn out.\nGirl: Why tell me this?\nClone: You're curious and smart and bored, and all you see is the choice between working hard and slacking off.  There are so many adventures that you miss because you're waiting to think of a plan.  To find them, look for tiny interesting choices.  And remember that you are always making up the future as you go.\nGirl: So, wait, what *is* this place?  Am I going to wake up thinking this was a dream?\nClone: This is... think of this as after the game, outside the theatre.  To go in, I had to suspend disbelief, forget the outside.\nGirl: So you... Huh.  Why give me hints I'm going to forget?\nClone: You'll forget this trip but I think the hints should stay with you.\nGirl: ...if this is a game, are you--are *we*--cheating?\nClone: Yup.\nGirl: Is that a good idea?\nClone: Well it's an interesting one.  We'll see how it goes.\nGirl: Well, I guess I'll see you aroun--Wait a minute; have you brought me here before?\nClone: I... maybe.  once.\nGirl: For another hint?\nClone: Er.  Actually we just made out.\nGirl: We wh--\nClone: Bye!\n{{Alt-text: Making out with yourself: now an official xkcd theme?  Troubling.}}","alt":"Making out with yourself: now an official xkcd theme?  Troubling.","img":"https://imgs.xkcd.com/comics/choices_part_4.jpg","title":"Choices: Part 4","day":"24"},{"month":"5","num":268,"link":"","year":"2007","news":"","safe_title":"Choices: Part 5","transcript":"[[A girl is walking towards the right of the panel.]]\n[[A boy wearing a backpack is walking towards the left of the panel.]]\n[[They walk past each other.]]\n[[The girl has a sudden thought.]]\n[[The girl turns back and says.]]\nGirl: Hi.\nBoy: Uh, hi.\nGirl: Sorry if this is weird, but\nGirl: Do you like flying kites?\n{{alt text: I wonder what percentage of not-obviously-busy people on the street would say yes to kite-flying with a stranger. This looks like a job for Science!}}","alt":"I wonder what percentage of not-obviously-busy people on the street would say yes to kite-flying with a stranger.  This looks like a job for Science!","img":"https://imgs.xkcd.com/comics/choices_part_5.png","title":"Choices: Part 5","day":"25"},{"month":"5","num":269,"link":"","year":"2007","news":"","safe_title":"TCMP","transcript":"[[Two guys and a girl are standing in a room, the first guy holds a keyboard.]]\nFirst guy: Hey, help me test the Transconsciousness Messaging Protocol.\nSecond guy: What's that?\nFirst guy: I've been training myself to keep my fingers moving slightly as I fall asleep, so I can type from inside dreams.\n[[First guy sitting on his bed]]\nFirst guy: I'm going to sleep now. My computer will relay my messages to you as I explore the dream world.\n[[In the dream: (first guy standing in what looks like a forest.)]]\nFirst guy: So strange to think none of this is real. And yet I have this lifeline to the internet back home.\nFirst guy: A chance to speak from one reality to another. I feel like Bell & Watson. I get to write the inaugural TCMP message. Let's see... [[types on the keyboard]]\n[[outside: (girl sitting at a computer, second guy standing behind her)]]\nGirl: \"F1rst pst!!\"?\nSecond guy: Great. He's jumped straight to transreality trolling.\n{{title text: A big obstacle in experimenting with the mind's dream-simulation-engine is holding onto the details as you wake up.  With TCMP you can bring back any information you want.}}","alt":"A big obstacle in experimenting with the mind's dream-simulation-engine is holding onto the details as you wake up.  With TCMP you can bring back any information you want.","img":"https://imgs.xkcd.com/comics/tcmp.png","title":"TCMP","day":"28"},{"month":"5","num":270,"link":"","year":"2007","news":"","safe_title":"Merlin","transcript":"[[Man and woman standing by a train]]\nWoman: I'm bad at goodbyes. At some level I never think they're for real.\nMan: They make me think of T. H. White's Merlin.\nWoman: Oh?\nMan: He lived backwards, remembering the future and not the past. To him, final goodbyes meant nothing, while first hellos were tearful and bittersweet.\nWoman: Huh - so over the years he'd forget all his friends.\nMust've been lonely.\nMan: Yeah. He ended up just sitting around at home watching DVDs all day. The best was the time he rented 'Memento'...\n[[Merlin is sitting in front of a couch, watching TV]]\nMerlin: Well, that was straightforward.\n{{alt text: I mean, the black-and-white stuff was running backward, but it hardly mattered to the story.}}","alt":"I mean, the black-and-white stuff was running backward, but it hardly mattered to the story.","img":"https://imgs.xkcd.com/comics/merlin.png","title":"Merlin","day":"30"},{"month":"6","num":271,"link":"","year":"2007","news":"","safe_title":"Powers of One","transcript":"{{Powers of One}}\n{{A mind-expanding look at our world.}}\n[[A sequence, presumably continuing endlessly in both directions, of identical images of a couple lying on a chequered blanket, with a picnic basket, on grass. Each image has a rule at the bottom giving measurements in meters, with the scale in terms of 1 to a particular power. The powers visible are the -1th (part), 0th-2nd, and 3rd (part).]]\n{{alt: It's kinda zen when you think about it, if you don't think too hard.}}","alt":"It's kinda Zen when you think about it, if you don't think too hard.","img":"https://imgs.xkcd.com/comics/powers_of_one.png","title":"Powers of One","day":"1"},{"month":"6","num":272,"link":"","year":"2007","news":"","safe_title":"Linux User at Best Buy","transcript":"Salesman: Interested in updating your antivirus software?\nCustomer: Oh, I wouldn't need any of that.\n{{In a spiky speech bubble}}\nI RUN LINUX.\n<<Flip>>\n{{Customer does a backflip onto a motorcycle}}\n{{Customer performs a wheelie on the motorcycle}}\n{{Customer does a hard, donut turn on the motorcycle, kicking up dirt into the salesman's face}}\n{{Customer speeds off on the motorcycle, leaving the salesman in a cloud of black exhaust}}","alt":"We actually stand around the antivirus displays with the Mac users just waiting for someone to ask.","img":"https://imgs.xkcd.com/comics/linux_user_at_best_buy.png","title":"Linux User at Best Buy","day":"4"},{"month":"6","num":273,"link":"https://imgs.xkcd.com/comics/electromagnetic_spectrum.png","year":"2007","news":"","safe_title":"Electromagnetic Spectrum","transcript":"((Everything is one big panel.))\n\nThe Electromagnetic Spectrum\n\nThese waves travel through the electromagnetic field. They were formerly carried by the aether, which was decommissioned in 1897 due to budget cuts.\n\nOther waves:\n- Slinky waves [[Two people hold the ends of a tangled slinky.]]\n- Sound waves [[There is a snippet of a frequency band. Between 20 Hz and 20 KHz is labeled \"Audible Sound.\" Towards the top is a line labeled \"That high-pitched noise in empty rooms.\"]]\n- The wave [[A row of people does a wave.]]\n\n[[Three parallel scales are across the bottom. The first is lambda (m), ranging from 100Mm to 100fm; second is f (Hz), which starts at 1 Hz and reaches 100 THz about 2\n3 of the way along, after which the labels read \"other entertaining greek prefixes like peta- exa- and zappa-\"; last is Q (Gal^2\nColoumb), whose labels are 17, 117, pi, 17, 42, theta, e^pi-pi, -2, 540^50, and 11^2. Above the scales and lined up accurately with the first two are the following:]]\n\n- Power & Telephone (100Mm to 1km)\n- Radio & TV (1km to somewhere between 1m and 10cm); above that are many boxes showing subranges (AM, VHF, UHF, 14\n7 NPR pledge drives, a very thin band for the space rays controlling Steve Ballmer, 99.3 \"The Fox,\" 101.5 \"The Badger,\" 106.3 \"The Frightened Squirrel,\" cell phone cancer rays, CIA, ham radio, kosher radio, shouting car dealership commercials)\n- Microwaves (a bit more than 10cm to a bit more than 1mm); it also has subranges (aliens, just below SETI, wifi, FHF, brain waves, sulawesi, gravity)\n- Toasters (about 1mm to about 100 micrometers)\n- IR (about 100 micrometers to somewhere between 1 micrometer and 1 nm); above that is a bell graph labeled \"Superman's heat vision,\" with a motorcycle driving up the left side labeled \"Jack Black's Heat Vision.\"\n- Visible light (and, under it, visible dark); above that is a bell graph labeled \"sunlight.\" There's a breakout chart above it showing the visible spectrum from 700nm (red) to 450nm (violet). There's an arrow pointing to where octarine would be, somewhere off to the side. Above that are bars showing the absorption spectra for hyrogen, helium, Depends(R) (yellow only) and Tampax(R) (red only).\n- UV (about 100nm to about 10nm)\n- Miller Light (a thin bar around 10nm)\n- An unlabeled section with a thin line above it showing the frequency of the main death star laser\n- A blocked-off portion labeled \"Censored Under Patriot Act.\"\n- X-rays (from about 1nm to about 10pm); a line above shows the frequency of mail-order x-ray glasses. Somewhere vaguely above the 10pm mark is a potato.\n- Gamma\ncosmic rays (10pm and smaller); above that is a bar marked Sinister Google Projects which also trails off into higher frequencies, and blogorays, which are slightly lower.\n\n{{Title text: Sometimes I try to picture what everything would look like if the whole spectrum were compressed into the visible spectrum.  Also sometimes I try to picture your sister naked.}}","alt":"Sometimes I try to picture what everything would look like if the whole spectrum were compressed into the visible spectrum.  Also sometimes I try to picture your sister naked.","img":"https://imgs.xkcd.com/comics/electromagnetic_spectrum_small.png","title":"Electromagnetic Spectrum","day":"6"},{"month":"6","num":274,"link":"","year":"2007","news":"","safe_title":"With Apologies to The Who","transcript":"[[Stick figure is sitting at a desk with a computer, typing]]\nMonitor: People try to shut us d-d-down \n just 'cause our music gets around\n[[Stick figure is standing on his chair and typing with his keyboard across his hip.]]\nMonitor: Old folks act like total noobs \n get off our net; _you_ block the tubes\n[[Stick figure is really wailing on the keyboard.]]\nMonitor: Why don't you all just d-d-disconnect \n and don't try an' grok our d-d-dialect\n[[Stick figure smashes the keyboard into the monitor.]]\nMonitor: I'm not tryin' to cause a big s-s-sensation \n I'm just bloggin' bout my generation\n{{alt: Trivia: Roger Daltry originally wrote \"Don't try an' Digg what we all say' but erased the second 'g' when he moved to reddit.}}","alt":"Trivia: Roger Daltry originally wrote 'Don't try an' Digg what we all say' but erased the second 'g' when he moved to reddit.","img":"https://imgs.xkcd.com/comics/with_apologies_to_the_who.png","title":"With Apologies to The Who","day":"8"},{"month":"6","num":275,"link":"","year":"2007","news":"","safe_title":"Thoughts","transcript":"When meeting a girlfriend's family, I have to suppress the weirdest thoughts.\n[[A boy talking with his girlfriend's parents]]\nBoy: Hi!\nMother: Hi! It's so nice to finally meet you!\nBoy: I have licked your daughter's nipples.\n{{alt text: And now I might never get to again.}}","alt":"And now I might never get to again.","img":"https://imgs.xkcd.com/comics/thoughts.png","title":"Thoughts","day":"11"},{"month":"6","num":276,"link":"","year":"2007","news":"","safe_title":"Fixed Width","transcript":"[[A man, Rob, is sitting at a computer. The text is an IRC-style transcript of a conversation, in a fixed-width font. He is text-messaging a girl he slept with named Emily; their messages read as follows:]]\n<rob> hi\n<emily> hey you\n<rob> last night was nice\n<emily> the best i've had\n<rob> yeah it was AMAZING\n<emily> ok, i have to ask\n<emily> is this for real?\n<emily> or is it just sex\n<rob> definitely just sex\n<emily> holy shit\n<emily> are you serious?\n<emily> you don't know how much that made\n        my stomach hurt\n<emily> i want to cry\n<rob> i'm sorry\n<rob> i wanted to type 'i love you'\n<rob> but our line lengths were syncing up\n<emily> ...\n<rob> and it would have broken the pattern\n* emily has disconnected\n{{alt text: I wish I knew how to quit this so I wouldn't have to quit you.}}","alt":"I wish I knew how to quit this so I wouldn't have to quit you.","img":"https://imgs.xkcd.com/comics/fixed_width.png","title":"Fixed Width","day":"13"},{"month":"6","num":277,"link":"","year":"2007","news":"","safe_title":"Long Light","transcript":"[[A man in a car, sitting at a red light.]]\nMan: This light always takes forever.  I'd like to smack the idiot who designed this intersection.\n[[An engineer steps up onto the hood of the man's car.]]\nEngineer: Hi.\nMan: Who the hell are you?\nEngineer: I designed this intersection.\nEngineer [[arms spread outward]] : You're right - I should have just made the light shorter! Never mind the hours of simulation and testing I did.  Never mind that this intersection interacts with it's neighbors in a complicated way and it took me a week to work out timing sequences that avoided total jams.\nEngineer: Clearly, I'm a crappy engineer and you have a better solution.  Go on, show me your proposed timings.\nMan: Get the hell off my hood before I start driving and fling you into traffic.\nEngineer: You can't.  Light's red.\nMan: Well, when will it change?\nEngineer: Tuesday.\n{{Title Text: You can look at practically any part of anything manmade around you and think 'some engineer was frustrated while designing this.'  It's a little human connection.}}","alt":"You can look at practically any part of anything manmade around you and think 'some engineer was frustrated while designing this.'  It's a little human connection.","img":"https://imgs.xkcd.com/comics/long_light.png","title":"Long Light","day":"15"},{"month":"6","num":278,"link":"","year":"2007","news":"","safe_title":"Black Hat Support","transcript":"[[A man - wearing a black hat - is sitting at his computer, wearing a phone headset]]\nPhone: Thank you for calling the Black Hat Support Line, your first source for Linux support. How may I assist?\nMan: Hi. I'm running an Apache server, and the load keeps climbing out of control.\nPhone: Okay. First, click on the Start Menu.\nMan: I'm sorry, this is the Linux helpline, right?\nPhone: Of course, Sir.\nMan: If you'll just open the \"My Documents\" folder-\nPhone: Just a damn minute, I think you're putting me on.\nMan: Please bear with me, Sir.\nMan: Now, load up your AOL and go to the Keyword \"Linux\"-\nPhone: *click*\n{{Alt: So as not to leave you hanging -- it was a problem with select() calls.}}","alt":"So as not to leave you hanging -- it was a problem with select() calls.","img":"https://imgs.xkcd.com/comics/black_hat_support.png","title":"Black Hat Support","day":"18"},{"month":"6","num":279,"link":"","year":"2007","news":"","safe_title":"Pickup Lines","transcript":"[picture of a man at a bar]\nMan: If I could rearrange the alphabet, I'd put your sister and I together.\nMan: Is your father a thief? because that's totally my jetta you parked outside.\nMan:You must be tired, 'cause you've been running through my mind all night\nMan: screaming.\n{{title text: That shirt looks good on you, but it would look even better stuffed onto the neck of a vodka bottle and flung burning through our office building's window.  Let's fucking do it and never look back.}}","alt":"That shirt looks good on you, but it would look even better stuffed into the neck of a vodka bottle and flung burning through our office building's window.  Let's fucking do it and never look back.","img":"https://imgs.xkcd.com/comics/pickup_lines.png","title":"Pickup Lines","day":"20"},{"month":"6","num":280,"link":"","year":"2007","news":"","safe_title":"Librarians","transcript":"{{Advantages to dating librarians}}\nLibrarian: We're stopping in Baltimore to visit my family, and that's final.\nBoyfriend: Oh yeah?\n[[Reaching inside paper bag.]]\nBoyfriend: Hey, look, it's a new hardback book!\n[[Holds book in hands]]\nLibrarian Girlfriend: You wouldn't.\n[[The book is twisted and crinkled.]]\n<<crinkle>>\n<<creak>>\n[[Librarian Girlfriend twitches.]]\n<<crack>>\n[[The book's spine is broken]]\nLibrarian Girlfriend: OKAY! You win!\n\n{{alt: Don't expect any leniencies on late fees, though.}}","alt":"Don't expect any leniency on late fees, though.","img":"https://imgs.xkcd.com/comics/librarians.png","title":"Librarians","day":"22"},{"month":"6","num":281,"link":"","year":"2007","news":"","safe_title":"Online Package Tracking","transcript":"{{Online Package Tracking}}\n{{_Pros_: Convenient, Useful}}\n{{_Cons_: Makes You Crazy}}\n[[A person is sitting at a computer.]]\n<<refresh>>\nPerson: Aww, still in Memphis.\n<<refresh>>\nPerson: Aww, still in Memphis.\n<<refresh>>\nPerson: Aww, still in Memphis.","alt":"I don't even *want* this package!  Why did I join the stinging insect of the month club, anyway?","img":"https://imgs.xkcd.com/comics/online_package_tracking.png","title":"Online Package Tracking","day":"25"},{"month":"6","num":282,"link":"","year":"2007","news":"","safe_title":"Organic Fuel","transcript":"[[Man sitting at computer second man standing nearby]]\nMan at Computer: Wow  Engines can burn vegetable oil.\nStanding man: Well, sure. You can burn most any organic matter. Corn, leaves, spices...\nMan at Computer: Spices? Really?\nStanding man: Sure  Mussolini made the trains run on thyme.\nMan at Computer: ...\nMan at Computer: We are no longer friends.\n{{alt text: I have nothing to apologize for.}}","alt":"I have nothing to apologize for.","img":"https://imgs.xkcd.com/comics/organic_fuel.png","title":"Organic Fuel","day":"27"},{"month":"6","num":283,"link":"","year":"2007","news":"","safe_title":"Projection","transcript":"[[Man and woman seated on couch watching a TV.]]\nWoman: Argh, movie pet peeve. Someone sitting at a computer in the dark with the screen projected on their face. Monitors don't work like that!\n[[Man and woman face each other on couch.]]\nMan: Right - that only happens if you're in the way of a proected image. Like when we're sitting together in a parked car in the rain and the mottled light through the raindrops on the windshield makes shifting shadows on your skin...\n[[Woman stands, man uses laptop on table behind couch.]]\nWoman: ...I wasn't really into the movie anyway.\nMan: The nearest rainstorm's about 60 miles away.\nWoman: We'll drive fast.\nMan: I'll grab some snacks.\n{{title text: Out in a field, not another car for miles, silence but for the rain drumming on the sunroof, warm thick folds of the blanket hiding wordless fingertip games...}}","alt":"Out in a field, not another car for miles, silence but for the rain drumming on the sunroof, warm thick folds of the blanket hiding wordless fingertip games ...","img":"https://imgs.xkcd.com/comics/projection.png","title":"Projection","day":"29"},{"month":"7","num":284,"link":"","year":"2007","news":"","safe_title":"Tape Measure","transcript":"[[A man finds a tape measure]]\nMan: Hey, a tape measure!\n[[He extends the tape measure]]\n<<extend>> <<extend>>\n[[The tape measure falls]]\n<<clatter>>\n[[He tries again]]\n<<extend>>\nMan: Eight feet!  I wonder if that's a world record?\n[[He imagines ... In an olympic stadium]]\nAudience:  Go!  Go!  Gooooo!","alt":"This sequence was later reproduced in the International Tape-Extending Federation archives, retitled 'The Founding of the Sport'.","img":"https://imgs.xkcd.com/comics/tape_measure.png","title":"Tape Measure","day":"2"},{"month":"7","num":285,"link":"","year":"2007","news":"","safe_title":"Wikipedian Protester","transcript":"[[There is a politician speaking at a podium, which sports an American flag.]]\n[[In front of the speaker there is a crowd of people listening.  In the middle of the crowd a man is standing up holding a sign reading \"[CITATION NEEDED]\" in blue underlined text, as in Wikipedia articles.]]\n{{title text: SEMI-PROTECT THE CONSTITUTION}}","alt":"SEMI-PROTECT THE CONSTITUTION","img":"https://imgs.xkcd.com/comics/wikipedian_protester.png","title":"Wikipedian Protester","day":"4"},{"month":"7","num":286,"link":"","year":"2007","news":"","safe_title":"All Your Base","transcript":"[[A section of a Linux terminal window is shown]]\nText from window: ~ \n$ ls \nayb    boot    etc         lib ...\nbin     dev     home    mnt ...\n~\n $ ls \nayb\nallyourbase_original.swf   al...\nallyourbase_remix.swf        ...\nallyourbase_remix2.swf    b ...\nayb_acapella.mp3           ze...\nayb_images\n                  ze...\nayb_orchestral.mp3\n....\n[[Girl is at computer]]\nGirl: What's with the All Your Base stuff? Didn't that die like five years ago?\n[[From off-panel]] : Yes.\n[[Man enters panel]]\nMan: It was my first internet meme, and my favorite.  Others tired of it, but I never did.\nMan: So I wait.\nMan: Someday, decades from now, people will have forgotten. It will be fresh again.\nMan: Retro.\nMan: and when that day comes [[Man raises his fists]]\nMan: I WILL BE READY!\nGirl: You need a hobby or something.\nMan: What you say!!\nMan: Wait, too soon.\n{{title text: The AYB retro-return-date (Zero Wing Zero Hour) should be around AD 2021.}}","alt":"The AYB retro-return-date (Zero Wing Zero Hour) should be around AD 2021.","img":"https://imgs.xkcd.com/comics/all_your_base.png","title":"All Your Base","day":"6"},{"month":"7","num":287,"link":"","year":"2007","news":"","safe_title":"NP-Complete","transcript":"My Hobby:\nEmbedding NP-Complete problems in restaurant orders\n[[A menu is shown]]\nChotchkies Retaurant\nAppetizers\nMixed Fruit 2.15\nFrench Fries 2.75\nSide Salad 3.35\nHot Wings 3.55\nMozzarella Sticks 4.20\nSampler Plate 5.80\n[[Three people sit at a table. One man at the table is ordering from a waiter]]\nMan at table: We'd like exactly $15.05 worth of appetizers, please.\nWaiter: ... Exactly? Uhh ...\nMan at table: Here, these papers on the knapsack problem might help you out.\nWaiter: Listen, I have six other tables to get to - \nMan at table: - As fast as possible, of course. Want something on traveling salesman?\n{{title text: General solutions get you a 50% tip.}}","alt":"General solutions get you a 50% tip.","img":"https://imgs.xkcd.com/comics/np_complete.png","title":"NP-Complete","day":"9"},{"month":"7","num":288,"link":"","year":"2007","news":"","safe_title":"Elevator","transcript":"[[Elevator panel, with a Certificate of Inspection and five floor buttons, numbered 14. The fifth button is unlabeled.]]\n[Person thinks]\n[Person writes something on a small piece of paper]\n[Person tapes it onto the panel]\n[[Elevator panel, with the same Certificate and buttons, and with the piece of paper labeling the fifth button Zeppelin.]]\n[Person presses the new Zeppelin button]\n[Elevator moves]\nElevator: *Ding*\n[Person is looking out the door of a Zeppelin. The Zeppelin is flying over a green landscape with many lakes.]\n{{Title text: Quick, try it with 'LOVE'.}}","alt":"Quick, try it with 'LOVE'.","img":"https://imgs.xkcd.com/comics/elevator.jpg","title":"Elevator","day":"11"},{"month":"7","num":289,"link":"","year":"2007","news":"","safe_title":"Alone","transcript":"[[Girl crawling on bed toward boy\nnarrator.]]\nNarrator: It's not something you can turn off.\n[[Boy pulling girl, bedspread, and pillow off of bed onto floor.]]\nNarrator: A part of me is always detached. \n Abstracting, looking at numbers and patterns.\n[[Girl on top of boy, both under bedspread, on floor. Girl looks to be 'touching' boy.]]\nNarrator: When we should be closest, part of me is still alone. \n Counting the touches of her fingertips. \n Touch. \n Touch. \n Touch touch. \n Touch touch touch. \n Touch touch touch touch touch.\n[[Same scene as third panel.]]\nNarrator: Wait. \n Is that... \n That's the Fibonacci Sequence! \n Whatever I did to deserve you, it couldn't have been enough.\n{{title text - Worries assuaged, the numbers become less important than your touches.}}","alt":"Worries assuaged, the numbers become less important than your touches.","img":"https://imgs.xkcd.com/comics/alone.png","title":"Alone","day":"13"},{"month":"7","num":290,"link":"","year":"2007","news":"","safe_title":"Fucking Blue Shells","transcript":"My Profanity Usage By Cause:\n[[Pie chart is shown]]\n[[Injury is about 5% of pie chart]]\n[[Irony is about 5% of pie chart]]\n[[Misc is about 5% of pie chart]]\n[[Segfaults is about 10% of pie chart]]\n[[MarioKart is about 75% of pice chart]]\n{{title text: You can evade blue shells in Double Dash, but it is deep magic.}}","alt":"You can evade blue shells in Double Dash, but it is deep magic.","img":"https://imgs.xkcd.com/comics/fucking_blue_shells.png","title":"Fucking Blue Shells","day":"16"},{"month":"7","num":291,"link":"","year":"2007","news":"","safe_title":"Dignified","transcript":"[[Figure with beret swinging upside-down from tree branch to figure walking by:]]\nYou were once shoved headfirst through someone's vagina.  Why are you acting so dignified?\n{{alt: 'I don't know, why is your beret staying on your head?' 'Staples.'}}","alt":"'I don't know, why is your beret staying on your head?' 'Staples.'","img":"https://imgs.xkcd.com/comics/dignified.png","title":"Dignified","day":"18"},{"month":"7","num":292,"link":"","year":"2007","news":"","safe_title":"goto","transcript":"[[Man sits at computer, thinking]]\nMan: I could restructure the program's flow - or use one little 'GOTO' instead.\nMan: Eh, screw good practice. How bad can it be?\nText on computer: goto main_sub3;\n<<Compile>>\n[[Panel passes in which man simply looks at the computer]]\n[[A raptor jumps into the panel and attacks the man at the computer]]\n{{title text: Neal Stephenson thinks it's cute to name his labels 'dengo'}}","alt":"Neal Stephenson thinks it's cute to name his labels 'dengo'","img":"https://imgs.xkcd.com/comics/goto.png","title":"goto","day":"20"},{"month":"7","num":293,"link":"","year":"2007","news":"","safe_title":"RTFM","transcript":"[[ A man with a knife sticking out of his heavily bleeding face stands in front of a toaster, which has an arm extending from the top of it. He is holding a telephone to his ear. ]]\nMan: Hello, 911?  I just tried to toast some bread, and the toaster grew an arm and stabbed me in the face!\n911: Did you read the toaster's man page first?\nMan: Well, no, but all I wanted was--\n911: <<click>>\n{{ alt: Life is too short for man pages, and occasionally much too short without them. }}","alt":"Life is too short for man pages, but occasionally much too short without them.","img":"https://imgs.xkcd.com/comics/rtfm.png","title":"RTFM","day":"23"},{"month":"7","num":294,"link":"","year":"2007","news":"","safe_title":"Bookstore","transcript":"[[Man is standing in a bookstore, looking at a book]]\nMan: This book looks interesting. Maybe I'll buy it.\n[[The man reads the book; a clock appears above showing the passage of time]]\nMan: Oops, I read the whole thing.\nMan: I'll just quietly put it back and go.\n[[Man walks through a security scanner to exit the bookstore]]\n<<BEEP BEEP BEEP>>\nVoice from off-frame: Hey! Your brain set off the sensor!\nMan: I, uhh...\nVoice from off-frame: You have a book in there, don't you!\nMan: Crap.\n{{title text: You can search it if you want, but you may want to skip the memories of your mom.}}","alt":"You can search it if you want, but you may want to skip the memories of your mom.","img":"https://imgs.xkcd.com/comics/bookstore.png","title":"Bookstore","day":"25"},{"month":"7","num":295,"link":"","year":"2007","news":"","safe_title":"DNE","transcript":"[[Man is in an empty classroom writing on the whiteboard.  In the top right corner in large print is written \"Fuck This Place!.\"  It is circled, and underneath he is writing \"DNE\"]]\n{{title text: I've seen advertisers put their URLs on chalkboards, encircled with a DNE.  They went unerased for months.  If you see this, feel free to replace the URL with xkcd.com.}}","alt":"I've seen advertisers put their URLs on chalkboards, encircled with a DNE.  They went unerased for months.  If you see this, feel free to replace the URL with xkcd.com.","img":"https://imgs.xkcd.com/comics/dne.png","title":"DNE","day":"27"},{"month":"7","num":296,"link":"","year":"2007","news":"","safe_title":"Tony Hawk","transcript":"My Hobby:\nDoing skateboard tricks in Tony Hawk while also doing them in real life.\n[[Man riding a skateboard in a halfpipe with a handheld video game]]\n<<beep click beep>>\n[[Man does a skateboard trick]]\n<<Frontside 360!>>\nVideogame: Frontside 360!\n{{Bad idea #271: Dropping into the half-pipe on a Segway.}}","alt":"Bad idea #271: Dropping into the half-pipe on a Segway.","img":"https://imgs.xkcd.com/comics/tony_hawk.png","title":"Tony Hawk","day":"30"},{"month":"8","num":297,"link":"","year":"2007","news":"","safe_title":"Lisp Cycles","transcript":"[[Guy sitting at computer. Girl listening]]\nGuy: Lisp is over half a century old and it still has this perfect, timeless air about it.\nGuy: I wonder if the cycles will continue forever.\nGuy: A few coders from each new generation rediscovering the Lisp arts.\n[[Man in Jedi robes carrying an armload of parentheses, speaking to Guy]]\nJedi: These are your father's parentheses. Elegant weapons. For a more... civilized age.\n{{title text: I've just received word that the Emperor has dissolved the MIT computer science program permamently. }}","alt":"I've just received word that the Emperor has dissolved the MIT computer science program permanently.","img":"https://imgs.xkcd.com/comics/lisp_cycles.png","title":"Lisp Cycles","day":"1"},{"month":"8","num":298,"link":"","year":"2007","news":"","safe_title":"Tesla Coil","transcript":"[[Two figures, one wearing a hat stand near a tesla coil mounted on a table.]]\nNo hat: I finally finished my Tesla Coil!\n[[The room is dark; characters appear as faint blue outlines on black background. No hat turnss on the Tesla Coil <<click>> and it sparks white static electricity. <<gzzzzzz>>]]\nHat Man: Cool, but-\nHat Man: Check *this* out\n[[Lightning shoots out of Hat Man's hands <<gzzzzzz>>]]\n[[The lights are back on]]\nNo Hat: How did you do that?\nHat Man: The world doesn't actually make any sense. Science doesn't work. No one told you because you're so cute when you get into something.\nHat Man: [[Floting up the frame]] Still, neat toy.\nNo Hat: [[Pointing to Hat Man]] Now you're hovering!\nHat Man: I guess you're still not getting this.\n{{Title Text: For scientists, this can be the hardest thing about dreams.}}","alt":"For scientists, this can be the hardest thing about dreams.","img":"https://imgs.xkcd.com/comics/tesla_coil.png","title":"Tesla Coil","day":"3"},{"month":"8","num":299,"link":"","year":"2007","news":"","safe_title":"Aeris Dies","transcript":"[[Two men are talking.  The second man is sitting on the ground, hugging his knees to his chest]]\nFirst Man: Maggie's gone. You can't bring her back.\nSecond Man: But I have to, she's a part of my life.\nFirst Man: <<sigh>>\nFirst Man: Okay, let me put this in your terms.\nFirst Man: Remember when Aeris died in FFVII? It was sad, but you had to keep playing.\nSecond Man: Actually, I downloaded a mod to add her back to my party. It changed other character's appearances and dialogue to hers so you didn't have to lose her.\nSecond Man: Lots of gamers did it.\n[[The first man put his hand on his chin]]\nFirst Man: That is troubling on several levels.\nSecond Man: I wonder if Maggie's old dress would fit you.\n{{alt text: It's bad enough that all the families in your Sims are just you and Maggie recreated over and over.}}","alt":"It's bad enough that all the families in your Sims are just you and Maggie recreated over and over.","img":"https://imgs.xkcd.com/comics/aeris_dies.png","title":"Aeris Dies","day":"6"},{"month":"8","num":300,"link":"","year":"2007","news":"","safe_title":"Facebook","transcript":"{{Title: Mildly sleazy uses of Facebook, part 14:}}\n{{subheading: Looking up someone's profile before introducing yourself so you know which of your favorite bands to mention}}\nBoy: Favorite bands? Hmm...\nBoy: Maybe Regina Spektor or the Polyphonic Spree.\nGirl: Whoa, those are two of my favorites, too!\nGirl: Clearly, we should have sex.\nBoy: Okay!  My favorite position is the retrograde wheelbarrow.\nGirl: [[arms in the air]] Ohmygod, mine too!\n{{alt-text: 'Here, I'll put my number in your cell pho -- wait, why is it already here?'}}","alt":"'Here, I'll put my number in your cell pho -- wait, why is it already here?'","img":"https://imgs.xkcd.com/comics/facebook.png","title":"Facebook","day":"8"}]
