[{"month":"8","num":301,"link":"","year":"2007","news":"","safe_title":"Limerick","transcript":"[[Stick figure sitting at computer, typing]]\nStickman:I used to find slashdot delightful,\nbut my feelings of late are more spiteful;\nmy comments sarcastic\nthe iconoclastic\nkeep modding to plus five (Insightful).","alt":"Fun game: try to post a YouTube comment so stupid that people realize you must be joking.  (Hint: this is impossible)","img":"https://imgs.xkcd.com/comics/limerick.png","title":"Limerick","day":"10"},{"month":"8","num":302,"link":"","year":"2007","news":"","safe_title":"Names","transcript":"{{Title: Names}}\nMan (thinking): I hate it when I don't know someone's name, but it's been long enough that it's too awkward to ask.\n[[The scene is revealed to be at the alter getting married by a minister to a woman in a bridal dress.]]\nMinister: Do you Rachel, take this man...\nMan (thinking): Aha! Rachel!\n{{alt-text: I'm always so happy that I successfully navigated the introduction that I completely forget to pay attention to the name the other person told me.}}","alt":"I'm always so happy that I successfully navigated the introduction that I completely forget to pay attention to the name the other person told me.","img":"https://imgs.xkcd.com/comics/names.png","title":"Names","day":"13"},{"month":"8","num":303,"link":"","year":"2007","news":"","safe_title":"Compiling","transcript":"{{ Title: The #1 Programmer Excuse for Legitimately Slacking Off: “My code's compiling.” }}\n[[Two programmers are sword-fighting on office chairs in a hallway. An unseen manager calls them back to work through an open office door.]]\nManager: Hey! Get back to work!\nProgrammer 1: Compiling!\nManager: Oh. Carry on.\n{{ Alt: ‘Are you stealing those LCDs?’ ‘Yeah, but I'm doing it while my code compiles.’ }}","alt":"'Are you stealing those LCDs?' 'Yeah, but I'm doing it while my code compiles.'","img":"https://imgs.xkcd.com/comics/compiling.png","title":"Compiling","day":"15"},{"month":"8","num":304,"link":"","year":"2007","news":"","safe_title":"Nighttime Stories","transcript":"[[ Man sitting in an armchair in a darkened room, behind him a bookshelf and an open window. A girl is seen outside reading a book by an eerie glow]]\nFor a few weeks now, sometime past midnight, a girl has wandered past my apartment reading by flashlight.\n[[Outside, the girl, walking down the street passing under a street lamp]]\nI wonder why she's up so late.\nMaybe she's restless\nLike me.\nI wonder what story she's wrapped up in.\nI wonder if she let's anyone into that island of light.\n[[ Man sitting in dark room ]]\n[[ Dark room minus man ]]\n[[ Man standing on his doorstep at the top of a small flight of stairs, near the bottom of which the girl has stopped, no longer reading. ]]\nMan: Hi!  What are you reading?\nGirl: Orson Scott Card's 'Xenocide.'  It's my favorite in the series!\n[[ The same, only man looks more dejected ]]\nMan: Wait, you like it more than Speaker for the Dead OR Ender's Game?\nGirl: Yeah!\n[[ The same, only man has withdrawn ]]\n[[ Man back sitting in the chair within dark apartment ]]\nAnd to think I loved her.\n{{ alt: Cue angry letters from all seven fans of Xenocide. }}","alt":"Cue angry letters from all seven fans of Xenocide.","img":"https://imgs.xkcd.com/comics/nighttime_stories.jpg","title":"Nighttime Stories","day":"17"},{"month":"8","num":305,"link":"","year":"2007","news":"","safe_title":"Rule 34","transcript":"[[A guy sits in front of his desktop computer. A girl lies belly-down on the floor in front of her laptop.]]\nMale: Huh—Thomas the Tank Engine slash fiction.\nFemale: It's rule 34 of the internet. If you can imagine it, there is porn of it. \nMale: Nah. The web is freaky, but it can't begin to have everything.\nMale: There's no porn set atop storm-chasing vans. No homoerotic spelling bees. No women playing electric guitar in the shower.\nFemale: Actually, that last one would look pretty hot. As long as they were unplugged or waterproofed...\nFemale: Rivulets of water run down her chest, the smooth body of the guitar firm against her hips.\nFemale: She twangs the E-string and it shakes off tiny droplets in all directions.\n[[She rises into a crouch]]\nFemale: You're sure it doesn't exist?\nMale: Not yet.\nFemale: I'm registering WetRiffs.com. Let's get on this.\n{{title text: Okay, Lance.  For entry into the college bowl, spell 'Throbbing'}}","alt":"Okay, Lance.  For entry into the college bowl, spell 'Throbbing'","img":"https://imgs.xkcd.com/comics/rule_34.png","title":"Rule 34","day":"20"},{"month":"8","num":306,"link":"","year":"2007","news":"","safe_title":"Orphaned Projects","transcript":"[[Voices are coming from behind a door with a sign that reads \"Debian Linux HQ\"]]\nFirst voice: Problem: One of the volunteer developers has a date this weekend. Dates lead to romance, romance leads to orphaned projects.\nSecond voice: What's the plan?\nFirst voice: We're hiring him a relationship coach. He's like Will Smith in \"Hitch,\" but he only gives bad advice.\n[[Man in black hat is talking to another man, who is standing in from of a mirror]]\nMan in black hat: Okay, remember: The key to conversation is constructive criticism.\nMan in black hat: You need to show you're smart enough to solve her problems.\nMan in front of mirror: Makes sense.\n{{title text: His date works for Red Hat, who hired a coach for her, too.  She advised her to 'rent lots of movies like Hitch.  Guys love those.'}}","alt":"His date works for Red Hat, who hired a coach for her, too.  He advised her to 'rent lots of movies like Hitch.  Guys love those.'","img":"https://imgs.xkcd.com/comics/orphaned_projects.png","title":"Orphaned Projects","day":"22"},{"month":"8","num":307,"link":"","year":"2007","news":"","safe_title":"Excessive Quotation","transcript":"[[Outside, under a crescent moon.]]\nWoman: It's strange to stare at the moon and think about people walking on it.\nMan: That's no moon, it's a—<<gack>>\n[[She holds him up in the air by his neck à la Darth Vader using the force.]]\nWoman: I find your lack of original conversation disturbing.\n{{Title text: Unfortunately for her, real Star Wars fans are attracted to a gal with a good force choke.}}","alt":"Unfortunately for her, real Star Wars fans are attracted to a gal with a good force choke.","img":"https://imgs.xkcd.com/comics/excessive_quotation.png","title":"Excessive Quotation","day":"24"},{"month":"8","num":308,"link":"","year":"2007","news":"","safe_title":"Interesting Life","transcript":"[[On the left hand side of the panel is a cutaway of several floors of an office, in gray.  On the right side a blue sky with clouds, and green hills.  Hanging from a cable is a GIRL, clearly having rappelled down the side of the building]]\nGIRL: You know how some people consider \"May you have an interesting life\" to be a curse?\nGUY IN OFFICE: Yeah...\nGIRL: Fuck those people.  Wanna have an adventure?\n{{Alt-text: Quick, fashion a climbing harness out of a cat-6 cable and follow me down}}","alt":"Quick, fashion a climbing harness out of cat-6 cable and follow me down.","img":"https://imgs.xkcd.com/comics/interesting_life.png","title":"Interesting Life","day":"27"},{"month":"8","num":309,"link":"","year":"2007","news":"","safe_title":"Shopping Teams","transcript":"[[Each team is looking at a counter with two cubes on it.]]\nBad: Two non-nerds\nFirst man: Let's get that one.\nSecond man: okay.\nGood: non-nerd + nerd\nWoman: Let's get that one.\nMan: Wait, I think that one might be a better deal.\nWoman: Okay, that one. \nVery Bad: Two Nerds\nMan: How about that one?\nSecond man: i think the other one might be the better deal...\nFirst man: Hmm, I'm not sure...'\nTwo Hours Later\n[[Nerds are sitting in front of laptops with papers strewn about in front of display counter]]\nMan: I think our main problem is our unclear definition of value\nWoman: That is not your main problem!\n{{Title Text: I am never going out to buy an air-conditioner with my sysadmin again.}}","alt":"I am never going out to buy an air conditioner with my sysadmin again.","img":"https://imgs.xkcd.com/comics/shopping_teams.png","title":"Shopping Teams","day":"29"},{"month":"8","num":310,"link":"","year":"2007","news":"","safe_title":"Commitment","transcript":"[[Guy proposing to girl on his knee]]\nNarrator: I understand now. There's no choir of angels when you meet the right person. It's about growing out of your fears to realize what you have is what you want.\nGuy: I do.\nGirl: I do.\n[[A cloud with trumpeting angels appears]]\nGirl 2: Hi.\nNarrator: Well, shit.\n{{Could be worse. The last guy in that situation fell for one of the transient trumpeting angels.}}","alt":"Could be worse.  The last guy in that situation fell for one of the transient trumpeting angels.","img":"https://imgs.xkcd.com/comics/commitment.png","title":"Commitment","day":"31"},{"month":"9","num":311,"link":"","year":"2007","news":"","safe_title":"Action Movies","transcript":"[[A man and a woman are talking together as they walk away from a cinema]]\nMan: Another summer gone without a mindless big-budget action movie.\nWoman: Huh? Die Hard was nothing BUT action!\nMan: No, it was too talky.\nWoman: What? Too talky?\nMan: I tallied it minute-by-minute. It's at least 60% people walking and talking. ALL those movies are.\nMan: Just once, I want a real action movie. 30 seconds of exposition followed by a perfect 90-minute action scene. One with a huge budget, a good choreographer, and a great director.\nWoman: And they should center it around some character we already know, someone we never get tired of watching.\nMan: I think we've got something here...\n[[A movie poster is shown]]\nMovie Poster: Coming this summer\nMovie Poster: River Tam\nMovie Poster: Beats up EVERYONE\n[[The movie shows a line of houses, there are people beat up and lying in doorways, out of windows, and on the sidewalk. River Tam is doing a flying kick into someone's face]]\n{{title text: By my count, only 48 of the 158 minutes in Live Free or Die Hard have action.  That's pathetic, guys.  Crank is better, but needs a bigger budget and more Summer Glau.}}","alt":"By my count, only 48 of the 158 minutes in Live Free or Die Hard have action.  That's pathetic, guys.  Crank is better, but needs a bigger budget and more Summer Glau.","img":"https://imgs.xkcd.com/comics/action_movies.png","title":"Action Movies","day":"3"},{"month":"9","num":312,"link":"","year":"2007","news":"","safe_title":"With Apologies to Robert Frost","transcript":"A God's Lament\nSome said the world should be in Perl;\nSome said in Lisp.\nNow, having given both a whirl,\nI held with those who favored Perl.\nBut I fear we passed to men\nA disappointing founding myth,\nAnd should we write it all again,\nI'd end it with\nA close-paren.","alt":"Some say the world will end in fire; some say in segfaults.","img":"https://imgs.xkcd.com/comics/with_apologies_to_robert_frost.png","title":"With Apologies to Robert Frost","day":"5"},{"month":"9","num":313,"link":"","year":"2007","news":"","safe_title":"Insomnia","transcript":"[[It is black, except a few blue and green lights, and red numbers from a clock. The clock shows 4:31]]\nLying awake at night\nI realize how many little lights there are in my room.\nThe alarm clock is the brightest.\nCan't sleep\nI'm alone with those glowing red numbers\n[[The clock now shows 4:32]]\nTime slows\nDoes time even exist here?\nThoughts churning in on themselves\n[[The clock nows shows 4:33]]\nThe madness can't be far away\nAh yes\n[[The clock now shows 13:72]]\nThere it is.\n{{title text: Crap, I have levitation class at 25:131.  Better set the alarm to 'cinnamon'.}}","alt":"Crap, I have levitation class at 25:131.  Better set the alarm to 'cinnamon'.","img":"https://imgs.xkcd.com/comics/insomnia.png","title":"Insomnia","day":"7"},{"month":"9","num":314,"link":"","year":"2007","news":"","safe_title":"Dating Pools","transcript":"[[Woman is sitting on the ground with her elbows on her knees and her hands on her chin.  She is talking to a man.]]\nWoman: This sucks. The median first marriage age is 26. The pools of singles is shrinking. I'm running our of time.\nMan: Actually, not quite.\nMan: Yes, older singles are rarer. But as you get older, the dateable age range gets wider. An 18-year-old's range is 16-22, whereas a 30-year-old's might be more like 22-46.\n[[Man points to a chart]]\nText on chart: Standard creepiness rule: Don't date under (Age\n2 + 7)\nMan: I did some analysis of this with the Census Bureau numbers just last weekend. Your dating pool actually GROWS until middle age. So don't fret so much!\n[[Man is pointing to new set of charts. The first chart is labeled Singles, and is a decreasing graph.  The second graph is labeled Dating Pool, and is a bell curve.]]\nWoman: Did you analysis say anything about the dating prospects of people who spend weekends at home making graphs?\nMan: Come on. Somewhere at the edge of the bell curve is the girl for me.\n{{title text: The full analysis is of course much more complicated, but I can't stay to talk about it because I have a date.}}","alt":"The full analysis is of course much more complicated, but I can't stay to talk about it because I have a date.","img":"https://imgs.xkcd.com/comics/dating_pools.png","title":"Dating Pools","day":"10"},{"month":"9","num":315,"link":"","year":"2007","news":"","safe_title":"Braille","transcript":"I learned to read braille a while back, and I've noticed that the messages on signs don't always match the regular text.\n[[There is a sign which reads: Third Floor Office with braille print underneath.  A man is reading the braille]]\nMan's thoughts: S-i-g-h-t-e-d-P-e-o-p-l-e-S-u-c-k ... Hey!\n{{alt text: The only big difference I've seen is in colors.  Where the regular text reads 'press red button', the braille reads 'press two-inch button'.}}","alt":"The only big difference I've seen is in colors.  Where the regular text reads 'press red button', the braille reads 'press two-inch button'.","img":"https://imgs.xkcd.com/comics/braille.png","title":"Braille","day":"12"},{"month":"9","num":316,"link":"","year":"2007","news":"","safe_title":"Loud Sex","transcript":"[[Man in bed, covering his head with pillow.]]\nNarrator: My neighbor has loud sex.\n<<OHHHHH>>\n<<GASP>>\n<<AAAAAAA>>\nNarrator: Good for her and all, but it keeps me up at night.\n[[Man and neighbor coming out of their apartments.]]\nNeighbor: Sorry, could you hear us last night? Oh, you know how it gets sometimes.\nNarrator: (small) Not really...\n[[Girl with \"LOUD\" and an arrow pointing to her.]]\nNarrator: But tonight I finally get my revenge. Because now I have a loud girlfriend too.\n[[Diagram of an elliptical reflector dish.]]\nNarrator: And an elliptical reflector dish.\n[[Man and his girlfriend having sex, with dish behind them, with sex sound effects coming off the dish, through walls, to his neighbor sitting up in bed while holding her head in pain.]]\n{{title text - Spherical or parabolic reflectors would of course lead to aberrant behavior.}}","alt":"Spherical or parabolic reflectors would of course lead to aberrant behavior.","img":"https://imgs.xkcd.com/comics/loud_sex.png","title":"Loud Sex","day":"14"},{"month":"9","num":317,"link":"","year":"2007","news":"","safe_title":"That Lovin' Feelin'","transcript":"[[Man is in the middle of the frame, talking]]\nMan: You never close your eyes anymore when I kiss your lips and there's no tenderness like before in your fingertips.\n[[Man thoughtfully places his hand on his chin]]\nMan: Maybe I should try your sister instead.\n{{title text: Maybe there's no tenderness in her fingertips either, but at least SHE puts out.}}","alt":"Maybe there's no tenderness in her fingertips either, but at least SHE puts out.","img":"https://imgs.xkcd.com/comics/that_lovin_feelin.png","title":"That Lovin' Feelin'","day":"17"},{"month":"9","num":318,"link":"","year":"2007","news":"","safe_title":"Nostalgia","transcript":"Narrator: This generation is going to have some weird nostalgia.\n[[Two people, each wearing headsets with antennae, sunglasses and jetpacks, are hovering]]\nMale Figure: Darling, let's put on our best fake accounts, connect to the core ForumSpace, and trick people into looking at a picture of a man's distended anus!\nFemale Figure: Oh, it'll be just like old times!\n{{alt text: If you don't get this one, don't google it.}}","alt":"If you don't get this one, don't google it.","img":"https://imgs.xkcd.com/comics/nostalgia.png","title":"Nostalgia","day":"19"},{"month":"9","num":319,"link":"","year":"2007","news":"","safe_title":"Engineering Hubris","transcript":"[[ Landscape in the background, canyon with a winding road ]]\nMaybe engineering is the pursuit of an unattainable perfection.\nMaybe it's impossible to create something bug-free.\nMaybe I'm a fool\nMaybe the tyranny of Murphy is the penalty for hubris.\nBut I just can't shake the feeling\n[[ man standing on a box labeled \"ACME\" ]]\nWith all those supplies\n_I_ could have caught that roadrunner.\n{{Alt: Chuck Jones is a vengeful god. }}","alt":"Chuck Jones is a vengeful god.","img":"https://imgs.xkcd.com/comics/engineering_hubris.png","title":"Engineering Hubris","day":"21"},{"month":"9","num":320,"link":"","year":"2007","news":"","safe_title":"28-Hour Day","transcript":"[[There is a diagram which shows the hours in a week. It has sections labeled \"bed\" and below has sections labeled \"night.\" They do not line up.]]\n[[Two men are talking together.]]\nFirst man: You have trouble sleeping right?\nSecond man: Only when your mom is over.\n[[First man is now pointing to a chart.]]\nFirst man: Since your work is flexible-\nSecond Man: -Like your mom-\nFirst Man: -you should try the 28-hour day - 20 awake, 8 asleep (or 19\n9 if you prefer).\nSecond Man: I prefer your mom.\nFirst Man: It synchs up with the week - you spend weekdays awake normally, then on weekends you can go out all night.\nSecond Man: Just like your mom.\nFirst Man: It means four extra hours daily. You can stay up until you're exhausted every day and then spend a full 9 hours asleep each night!\nSecond Man: But how much time can I spend doing your mom?\nFirst Man: You? I'm guessing three or four minutes, tops.\nSecond Man: ...Well played.\n{{title text: Small print: this schedule will eventually drive one stark raving mad.}}","alt":"Small print: this schedule will eventually drive one stark raving mad.","img":"https://imgs.xkcd.com/comics/28_hour_day.png","title":"28-Hour Day","day":"24"},{"month":"9","num":321,"link":"","year":"2007","news":"","safe_title":"Thighs","transcript":"[[Guy singing, Girl at computer]]\nGuy: It's the thigh of the tiger\nGuy: When the moon hits your thigh like a big pizza pie, that's amore.\nGuy: She's my brown-thighed girl.\nGirl: Don't you have a job or something?\nGirl: Also, Eww.\n{{Alt text: My thighs have seen the glory of the coming of the Lord?}}","alt":"My thighs have seen the glory of the coming of the Lord?","img":"https://imgs.xkcd.com/comics/thighs.png","title":"Thighs","day":"26"},{"month":"9","num":322,"link":"","year":"2007","news":"","safe_title":"Pix Plz","transcript":"[[A man stands in the entrance to a room.  The door has been broken down.  A surprised nerd has turned away from his computer to face the remains of the door.]]\nMan: Hi.  I'm here about the girl who visited your IRC channel last night looking for Java help.\nNerd: What did you do to my door?\nMan: When someone with a feminine username joins your community and you say \"OMG a woman on the Internet\" and \"jokingly\" ask for naked pics, you are being an asshole.  You are not being ironic.  You are not cracking everybody up.  You are the number one reason women are so rare on the Internet.\nMan: At least, the parts of it _you_ frequent.\n[[Woman enters the room, holding some sort of device.]]\nMan: As someone who likes nerdy girls, I do not appreciate this.  I'm here to ban you from the Internet.  The gal behind me with the EMP cannon is Joanna -- she'll be assigned to you for the next year.  Try to go online and she'll melt your PC.\nNerd: Dude, she's hot.  Is she single?\nMan: Joanna, fire.\n{{Alt image tag: \"But one of the regulars in the channel is a girl!\"}}","alt":"But one of the regulars in the channel is a girl!","img":"https://imgs.xkcd.com/comics/pix_plz.png","title":"Pix Plz","day":"28"},{"month":"10","num":323,"link":"","year":"2007","news":"","safe_title":"Ballmer Peak","transcript":"[[A graph with \"programming skill\" on the X-axis and \"blood alcohol concentration\" on the Y one]]\n[[A man is making a presentation with the graph]]\nPresenter: Called the Ballmer Peak, it was discovered by Microsoft in the 80's. The cause is unknown but somehow a B.A.C between 0.129% and 0.138% confers superhuman programming ability.\nPresenter: However, it's a delicate effect requiring careful calibration--you can't just give a team of coders a year's supply of whiskey and tell them to get cracking.\nMan in public: ...Has that ever happened.\nPresenter: Remember Windows ME?\nMan: I knew it!\n{{title text: Apple uses automated schnapps IVs.}}","alt":"Apple uses automated schnapps IVs.","img":"https://imgs.xkcd.com/comics/ballmer_peak.png","title":"Ballmer Peak","day":"1"},{"month":"10","num":324,"link":"","year":"2007","news":"","safe_title":"Tapping","transcript":"[[A man is sitting at a desk, tapping various parts of it]]\nMan: Hey, I can get different pitches by tapping on different parts of the desk.\n[[The man starts tapping faster, with both hands]]\nMan: Sweet, I can do the Jurassic park theme!\n[[The man taps very rapidly]]\n[[Later, elsewhere]]\nFriend: So, what did you do all afternoon?\nMan: Hung out.\n{{alt text: Sometimes the best fun looks like boredom.}}","alt":"Sometimes the best fun looks like boredom.","img":"https://imgs.xkcd.com/comics/tapping.png","title":"Tapping","day":"3"},{"month":"10","num":325,"link":"","year":"2007","news":"","safe_title":"A-Minus-Minus","transcript":"[[the hat guy is packing a bobcat into a box; a woman stands beside him.]]\nwoman: What are you doing?\nthe Hat Guy: Making the world a weirder place.\nbobcat: <<mrrowlll>>\n[[The hat guy has finished taping the package for shipping.]]\nman: Starting with my eBay feedback page.\n[[Bandaged person at a computer with assorted debris around the floor]]\nscreen: comments:\n<<bandaged person typing>> Instead of office chair package contained bobcat.\n<<bandaged person typing>> Would not buy again.\n{{title: You can do this one in every 30 times and still have 97% positive feedback.}}","alt":"You can do this one in every 30 times and still have 97% positive feedback.","img":"https://imgs.xkcd.com/comics/a-minus-minus.png","title":"A-Minus-Minus","day":"5"},{"month":"10","num":326,"link":"","year":"2007","news":"","safe_title":"Effect an Effect","transcript":"Narrator: MY HOBBY:\nUsing the more obscure meanings of \"affect\" and \"effect\" to try to trip up amateur grammar nazis.\nMan [[types]]: I think that our foreign policy effects the situation.\nComputer [[types]]: You mean \"affects\".\n[[from Man]] <<tee hee hee>>\n{{title text: Time to paint another grammarian silhouette on the side of the desktop.}}","alt":"Time to paint another grammarian silhouette on the side of the desktop.","img":"https://imgs.xkcd.com/comics/effect_an_effect.png","title":"Effect an Effect","day":"8"},{"month":"10","num":327,"link":"","year":"2007","news":"","safe_title":"Exploits of a Mom","transcript":"[[A woman is talking on the phone, holding a cup]]\nPhone: Hi, this is your son's school. We're having some computer trouble.\nMom: Oh dear—did he break something?\nPhone: In a way—\nPhone: Did you really name your son \"Robert'); DROP TABLE Students;--\" ?\nMom: Oh, yes. Little Bobby Tables, we call him.\nPhone: Well, we've lost this year's student records. I hope you're happy.\nMom: And I hope you've learned to sanitize your database inputs.\n{{title-text: Her daughter is named Help I'm trapped in a driver's license factory.}}","alt":"Her daughter is named Help I'm trapped in a driver's license factory.","img":"https://imgs.xkcd.com/comics/exploits_of_a_mom.png","title":"Exploits of a Mom","day":"10"},{"month":"10","num":328,"link":"","year":"2007","news":"","safe_title":"Eggs","transcript":"[[A woman sits at a bar, a man approaches.]]\nMan: So, how do you like your eggs in the morning?\nWoman: Ooh, sunny side up.\nMan: Oh. Huh.\nWoman: Is that a problem?\nMan: Well, it's just that I was trying to set you up for the \"unfertilised\" line.\nWoman: Ah. Bad timing; I'm actually looking for casual sex. ...interested?\nMan: I'd love to, but I've got like 20 more jokes to set up tonight. Hey, have you seen a priest and a rabbi?\n{{Title Text: Oh, yeah, we get tons of them at these casual sex bars.}}","alt":"Oh, yeah, we get tons of them at these casual sex bars.","img":"https://imgs.xkcd.com/comics/eggs.png","title":"Eggs","day":"12"},{"month":"10","num":329,"link":"","year":"2007","news":"","safe_title":"Turing Test","transcript":"[[A man sits at a computer connected through a wall to another computer.]]\nTURING TEST EXTRA CREDIT: CONVINCE THE EXAMINER THAT HE'S A COMPUTER.\nMan: You know, you make some really good points. I'm ... not even sure who I am anymore.\n{{Title Text: Hit Turing right in the test-ees.}}","alt":"Hit Turing right in the test-ees.","img":"https://imgs.xkcd.com/comics/turing_test.png","title":"Turing Test","day":"15"},{"month":"10","num":330,"link":"","year":"2007","news":"","safe_title":"Indecision","transcript":"First Guy: So, what do you want to do?\nSecond Guy: Still no ideas.\nFirst guy: Wait, I think there's a rule about this.\n[[First Guy goes to bookshelf and removes a book called \"Rules\"]]\n[[The book of Rules is opened to the following:\nRULE social.b.99.1\nIf friends spend more than 60 minutes unable to decide what to do, they must default to sexual experimentation.]]\n[[First Guy is standing, holding the book. Second Guy is in the process of standing up.]]\nFirst Guy: Huh.\nSecond Guy: I did not know that rule.\nFirst Guy: Me neither.\nSecond Guy: I'll go get the Crisco.\n{{alt-text: Hey, I don't make the rules. It's in the book.}}","alt":"Hey, I don't make the rules.  It's in the book.","img":"https://imgs.xkcd.com/comics/indecision.png","title":"Indecision","day":"17"},{"month":"10","num":331,"link":"","year":"2007","news":"","safe_title":"Photoshops","transcript":"[[A woman holds a sword while a man looks on]]\nText: My hobby: Insisting that real-life objects are photoshopped.\nWoman: This sabre is a 19th-century family heirloom.\nMan: It looks photoshopped.\nWoman: Huh?\nMan: Yeah, the reflections are all wrong. Definitely photoshopped.\n{{Alt-text: When I look into your eyes, I see JPEG artifacts.  I can tell by the pixels that we're wrong for each other.}}","alt":"When I look into your eyes, I see JPEG artifacts.  I can tell by the pixels that we're wrong for each other.","img":"https://imgs.xkcd.com/comics/photoshops.png","title":"Photoshops","day":"19"},{"month":"10","num":332,"link":"","year":"2007","news":"","safe_title":"Gyroscopes","transcript":"[[Person at desk with Gyroscope]]\nNarrator: Despite years of studying physics, I still find gyroscopes a little freaky.\n[[Person starts gyroscope with a zzzzip]]\n[[Gyroscope spins with a zzzzzz]]\n[[Gyroscope lifts into the air]]\nGyroscope: Greetings, Human.\n{{title text: We didn't actually land on the moon -- it just looked like we did because of precession.  Also, gyroscopes caused 9\n11.}}","alt":"We didn't actually land on the moon -- it just looked like we did because of precession.  Also, gyroscopes caused 9/11.","img":"https://imgs.xkcd.com/comics/gyroscopes.png","title":"Gyroscopes","day":"22"},{"month":"10","num":333,"link":"","year":"2007","news":"","safe_title":"Getting Out of Hand","transcript":"[[A couple is in bed in the dark, and the guy reaches out from under the covers to do a Wikipedia search about Foreplay.]]\n{{title text: Wikipedia's role as brain-extension, while a little troubling, is also really cool.}}","alt":"Wikipedia's role as brain-extension, while a little troubling, is also really cool.","img":"https://imgs.xkcd.com/comics/getting_out_of_hand.png","title":"Getting Out of Hand","day":"24"},{"month":"10","num":334,"link":"","year":"2007","news":"","safe_title":"Wasteland","transcript":"[[A guy is walking through a wasteland talking to himself]]\nI am alone in this wasteland, a thousand miles  from you.\nBut I haven't forgotten the feel of your skin, your mischievous smile.\nYou'd think a thousand miles would be enough.\nI guess I'll keep walking.\n{{title text: You make forgetting look so easy.}}","alt":"You make forgetting look so easy.","img":"https://imgs.xkcd.com/comics/wasteland.png","title":"Wasteland","day":"26"},{"month":"10","num":335,"link":"","year":"2007","news":"","safe_title":"Mattress","transcript":"[[A couple is cuddling.]]\nCuddling face-to-face is nice, but we can never figure out where to put our lower arms.\nOur solution: the Cuddle Mattress!\nYour lower arms fit in the convenient gap.\n[[There is a diagram of a mattress with a notch cut through it at shoulder level. The gap is indicated with an arrow.]]\n[[The same couple is shown again, cuddling snugly on the mattress.]]\n\n[[A man and woman are giving a presentation to another person. The man has a pointer and a clicker for the slides which are projected on the screen next to him.]]\nListener: Oh man, that's ALWAYS bothered me.\nListener: I want one.\n\nListener: Although ... so the lower arms just sort of dangle?\nListener: What do you do with them?\n\nMan: It was a bit awkward.\nClicker: <<click>>\nWoman: Then we had a second breakthrough.\n\n[[The couple is shown again on the cuddle mattress, this time in more detail and facing the tops of their heads. Their lower arms are sticking through the gap in the mattress and playing a conveniently located game of Rock 'em Sock 'em Robots.]]\nMan: <<click>> <<click>>\nBlue Robot: <<punch>>\nRed Robot: <<punch>>\nWoman: <<click>> <<click>>\n\n{{Title text: The TempurPedic wineglass guy broke his ankle.}}","alt":"The TempurPedic wineglass guy broke his ankle.","img":"https://imgs.xkcd.com/comics/mattress.png","title":"Mattress","day":"29"},{"month":"10","num":336,"link":"","year":"2007","news":"","safe_title":"Priorities","transcript":"[[A teacher is talking to a student, sitting at a desk.]]\nTeacher: If you don't turn in at least one homework assignment, you'll fail this class.\n[[The student holds up his report card.]]\nStudent: Yeah. But if I can fail this class, the grades on my report card will be in alphabetical order!\n{{rollover text: You should start giving out 'E's so I can spell FACADE or DEFACED.}}","alt":"You should start giving out 'E's so I can spell FACADE or DEFACED.","img":"https://imgs.xkcd.com/comics/priorities.png","title":"Priorities","day":"31"},{"month":"11","num":337,"link":"","year":"2007","news":"","safe_title":"Post Office Showdown","transcript":"I spend a lot of time mentally choreographing elaborate fight scenes with strangers around me.\n[[Man is in a post office wearing earphones.  There are several other people, including an old man with a crutch and an old woman with a long narrow box]]\nMan's thoughts: Okay - if that old man pulls a crossbow,\nMan's thoughts: I'll throw the postal scale at him and dive backward behind the stamps machine.\nMan's thoughts: But what if the lady by the door has a katana in that box?\nMan's thoughts: Better set my iPod to the \"Kill Bill\" fight theme, just in case.\n{{alt text: That track ('Battle Without Honor or Humanity') -- like 'Ride of the Valkyries' -- improves *any* activity.}}","alt":"That track ('Battle Without Honor or Humanity') -- like 'Ride of the Valkyries' -- improves *any* activity.","img":"https://imgs.xkcd.com/comics/post_office_showdown.png","title":"Post Office Showdown","day":"2"},{"month":"11","num":338,"link":"","year":"2007","news":"","safe_title":"Future","transcript":"[[The comic has three panels. In the first panel, a boy and a girl are holding hands. A voice bubble originating from a guy standing in the third panel says…]]\nVoice #1: Come explore the future with me!\n[[And the girl says something which goes to the third panel.]]\n[[The two voice bubbles cross in the middle of the second panel.]]\n[[The voice of the girl says…]]\nVoice #2: I can't.\n{{title-text: But the past was much too cramped!}}","alt":"But the past was much too cramped!","img":"https://imgs.xkcd.com/comics/future.png","title":"Future","day":"5"},{"month":"11","num":339,"link":"","year":"2007","news":"","safe_title":"Classic","transcript":"[[A person is sitting on the floor by a record player.]]\nLed Zeppelin: And as we wind on down the road \n Our shadows taller than our soul\n\nLed Zeppelin: When all is one and one is all \n To be a rock and not to rooooll\n\nLed Zeppelin (fading): And she's buying a stairway to heaven\n\nPerson: Man. The baby boomers are kicking our *asses.* We need to get it together, guys.\n\n{{Title text: Someone get that Pachelbel's Canon kid a recording contract, stat.}}","alt":"Someone get that Pachelbel's Canon kid a recording contract, stat.","img":"https://imgs.xkcd.com/comics/classic.png","title":"Classic","day":"7"},{"month":"11","num":340,"link":"","year":"2007","news":"","safe_title":"Fight","transcript":"[[Text: We had a fight last night.]]\n[[A guy is sitting in a sofa, head in both hands, feeling upset.]]\n[[Text: I guess she's still mad.]]\n[[A girl is standing with arms crossed in front of her chest, with the same mood.]]\n[[Text: I woke up to find she'd written a sappy love note]]\n[[The guy is standing in front of a computer, with a cup in his hand.]]\n[[Text: to my boot sector.]]\n[[The cup now lies on the floor, the guy is looking at the computer with disbelief.]]\nComputer: Operating system not found\n{{title-text: And she put sweet nothings in all my .conf files.  It'll take me forever to get X working again.}}","alt":"And she put sweet nothings in all my .conf files.  It'll take me forever to get X working again.","img":"https://imgs.xkcd.com/comics/fight.png","title":"Fight","day":"9"},{"month":"11","num":341,"link":"","year":"2007","news":"","safe_title":"1337: Part 1","transcript":"[[Man 1 talks to man 2 who is lying down on the floor, using his laptop.]]\nMan 1: You're not on the neighbour's WiFi, are you?\nMan 2: Yeah, why?\nMan 1: The admin... plays games.\nMan 2: No problem. I'll just hop on a secure VPN.\nMan 2: Whoa, my connections are dying as soon as I start to tunnel anything!\nMessage on laptop: A VPN? How cute! And stop trying to SSH.\nMan 2: Holy shit! Someone's inserting notes into the pages I request! Editing the TCP stream live!\nMan 2: Nobody's that fast. Who is this admin?\n[[Neighbour (Mrs. Roberts) with bun tray in one hand, with oven mitts on both hands typing on a desktop computer.]]\nMrs. Roberts: My goodness. Neighbourhood scamps on the wireless.\n<<taptaptaptap>>\nMan 1: I should have warned you about Mrs. Roberts.\nMan 2: How does she type with oven mitts!?\nMan 1: You've been pwned pretty hard, man. You might want to sit down.\n{{ If you're not cool enough to do it manually, you can look up tools like Upside-Down-Ternet for playing games with people on your wifi. }}","alt":"If you're not cool enough to do it manually, you can look up tools like Upside-Down-Ternet for playing games with people on your wifi.","img":"https://imgs.xkcd.com/comics/1337_part_1.png","title":"1337: Part 1","day":"12"},{"month":"11","num":342,"link":"","year":"2007","news":"","safe_title":"1337: Part 2","transcript":"[[Man 1 standing near Man 2, who is on the floor near the armchair.]]\nMan 2: So the greatest hacker of our era is a cookie-baking mom?\nMan 1: Second-greatest.\nMan 2: Oh?\nMan 1 (Narrating) : Mrs. Roberts had two children. Her son, Bobby, was never much for computers, but her daughter Elaine took to them like a ring in the bell.\nMan 1 (Narrating) : When Elaine turned 11, her mother sent her to train under Donald Knuth in his mountain hideaway.\nMan 1 (Narrating) : For four years she studied algorithms.\nKnuth: Child - \nKnuth: Why is A* search wrong in this situation?\n<<swish>>\nElaine: Memory usage!\nKnuth: What would you use?\nElaine: Dijkstra's algorithm!\nMan 1 (Narrating) : Until one day she bested her master\nKnuth: So our lower bound here is 0(n log n)\nElaine:  Nope. Got it in 0(n log (log n))\nMan 1 (Narrating) : And left.\n{{Trivia: Elaine is actually her middle name.}}","alt":"Trivia: Elaine is actually her middle name.","img":"https://imgs.xkcd.com/comics/1337_part_2.png","title":"1337: Part 2","day":"13"},{"month":"11","num":343,"link":"","year":"2007","news":"For use on Wikipedia, I release this particular<br />comic under a <a href=\"https://creativecommons.org/licenses/by-sa/3.0/us/\">cc-by-sa</a> license.","safe_title":"1337: Part 3","transcript":"[[Outside, Adrian Lamo is helping Elaine Roberts over a barbed wire fence.]]\nNarrator: IT WAS THE LATE 90'S. ELAINE CRISSCROSSED THE COUNTRY WITH ADRIAN LAMO, THE 'HOMELESS HACKER', LEARNING TO GAIN ENTRY INTO SYSTEMS BOTH VIRTUAL AND PHYSICAL.]]\nAdrian Lamo: SO YOU JUST THROW A RUG OVER THE FENCE AND ... SAY, WHAT IS THIS PLACE ANYWAY?\nRoberts: NOWHERE SPECIAL.\nLamo: ...ELAINE, IS THIS NSA HEADQUARTERS?\nRoberts: ...LOOK, I JUST WANT TO SEE IF THEY'VE BROKEN RSA.\n[[Inside, Lawrence Lessig is sitting at a table, Roberts is standing across the table swinging a knife]]\nNarrator: SHE LEARNED, FROM LAWRENCE LESSIG, ABOUT THE MONSTROSITY THAT IS U.S. COPYRIGHT LAW.\nRoberts: SO, HOW DO WE FIX THE SYSTEM?  STAB BAD GUYS?\nLessig: I'M STARTING SOMETHING CALLED \"CREATIVE COMMONS\"\n<<SHINK>>\nElaine Roberts: I THINK WE SHOULD STAB BAD GUYS...\n[[Steve Jobs is lying up in his bed, Roberts is balancing while crouched on the foot of Jobs' bed]]\nNarrator: SHE MET WITH STEVE JOBS TO DISCUSS THE FUTURE OF APPLE.\nRoberts: COMPRESSION AND BANDWIDTH ARE CHANGING EVERYTHING.\nJobs: WHO ARE YOU?  IT'S 3:00AM!\nRoberts: APPLE SHOULD MAKE A PORTABLE MUSIC PLAYER.\nJobs: I'M CALLING THE POLICE.\nRoberts: HEY, IDEA - INTEGRATE IT WITH A CELL PHONE!\n{{title text: I once asked an NSA guy whether they'd broken RSA.  And I know I can trust him, because I asked if he was lying to me and he said no.}}","alt":"I once asked an NSA guy whether they'd broken RSA.  And I know I can trust him, because I asked if he was lying to me and he said no.","img":"https://imgs.xkcd.com/comics/1337_part_3.png","title":"1337: Part 3","day":"14"},{"month":"11","num":344,"link":"","year":"2007","news":"","safe_title":"1337: Part 4","transcript":"As time passed, Elaine intensified her hacking work, anonymously publishing exploit after exploit.\n[[Elaine is sitting under tree, typing on a laptop.]]\nTo crack open proprietary hardware, she teamed up with one of the top experts in signal processing and data transferring protocols.\n[[Elaine, wearing a backpack, is walking up to a door where a woman is greeting her]]\nElaine: Hi, mom.\nMrs. Roberts (Elaine's mom): Hello, dear. Did you have fun?\nThey were an unstoppable team.\n[[Elaine is on the floor with her laptop and Mrs. Roberts is on her computer at a table]]\nElaine: I finished the CSS decryptor.\nMrs. Roberts: Good, dear. I'll send it along to Jon.\nAnd were eventually noticed.\n[[Two men in black hats arrive.  One holds a briefcase that reads RIAA and the other holds a briefcase which reads MPAA]]\nRIAA man: Game's over.\nMPAA man: You're coming with us.\n[[Elaine stands up]] \nElaine: Oh, are we?\n[[Mrs. Roberts is still sitting at her computer, typing]]\nMrs. Roberts: Now now, Elaine -\n<<shink>> [[Elaine pulls a knife out]]\n<<shing>> <<shing>> [[The two men each pull a katana out of their briefcase.]]\nMrs. Roberts: Don't let them provoke you, dear.\nMen: We don't want to hurt you, Ma'am.\nMrs. Roberts: Don't by silly. Record company employees can't just go into houses and slice people up.\nRIAA Man: Ah, so you haven't read the DMCA.\nMPAA Man: Title IV, Section 408: Authorization of Deadly Force.\n[[Voice comes from off-panel]]: Hark!\n[[Everyone looks surprised. Mrs. Roberts stands.]]\n[[Bearded man enters, bearing two katanas.]]\nBearded man: Cease this affront to freedom, or stand and defend yourselves!\nMPAA Man: Stallman!\n{{title text: Mrs. Roberts would have gotten up sooner, of course, but she was busy piping find ~ and find ~nomad into xargs shred, just in case.}}","alt":"Mrs. Roberts would have gotten up sooner, of course, but she was busy piping find ~ and find ~nomad into xargs shred, just in case.","img":"https://imgs.xkcd.com/comics/1337_part_4.png","title":"1337: Part 4","day":"14"},{"month":"11","num":345,"link":"","year":"2007","news":"","safe_title":"1337: Part 5","transcript":"[[Two RIAA agents attack Elaine and Stallman. Elaine breaks RIAA #1, while Stallman disarms RIAA #2 in a flying manouvre]]\nElaine: Thanks, Stallman!\nStallman: 'Tis my pleasure.\nElaine: So, wait - how did you know we were in trouble?\nStallman: My friend here was tracking these thugs from his balloon. He called me and I thought I'd stop by\n[[Doctorow slides down a rope in red cape & goggles]]\nDoctorow: -Hi! Cory Doctorow - It's a pleasure to meet you.\nElaine: Balloon?\nStallman: Aye. They're up there constructing something called a \"Blogosphere.\"\nDoctorow: Yup! Its twenty kilometers up, just above the tag clouds.\nBobby: Mom, I'm hungry.\nMrs. Roberts: Hush! I'm coding. You ate yesterday.\nStallman: You know, Roberts, GNU could use a good coder like you. Ever thought of joining us?\nElaine: Maybe someday. Right now I've got an industry to take down. Music doesn't need these assholes.\nDoctorow: Begone! And never darken our comment threads again!\nStallman: Well, you won't fix the industry with random exploits. You need to encourage sharing in the public mind.\nDoctorow: Hey; With your music and coding backgrounds, you should get into building better p2p systems.\nElaine: What? Straight-up piracy?\nDoctorow: Sure- have you ever considered it? You'd make a wonderful dread pirate, Roberts\n[[Epilogue]]\nElaine shared her ideas with Bram Cohen, who went on to develop BitTorrent.\nMrs. Roberts spends her time developing for Ubuntu, and defacing the websites of people who make \"your mom\" jokes to her daughter. Elaine still stalks the net. She joins communities, contributes code or comments, and moves on. And if, late at night, you point a streaming audio player at the right IP at the right time - you can hear her rock out.\n~Happy Hacking.~\n{{Alt\ntitle text: This digital music thing will probably reach its endgame sometime in the next decade or so.  These are very exciting times. }}","alt":"This digital music thing will probably reach its endgame sometime in the next decade or so.  These are very exciting times.","img":"https://imgs.xkcd.com/comics/1337_part_5.png","title":"1337: Part 5","day":"16"},{"month":"11","num":346,"link":"","year":"2007","news":"","safe_title":"Diet Coke+Mentos","transcript":"[[Two boys are kneeling down on either side of a coke bottle.]]\nFirst Boy: This is the coolest thing.\nFirst Boy: You just drop the Mentos in the Diet Coke...\nSecond Boy: Uh huh\nFirst Boy: Give it a moment...\n[[The bottle has a few bubbles above it]]\n<<Poof>> [[A man appears.  The first boy raises his arms in exclamation.]]\n[[The second boy stands up and turns around.  He puts his hands over his mouth.]]\nSecond boy: D-Dad?\nMan [[Reaching towards the second boy]]: I'm back, son. We can be a family again.\n{{title text: The cola+Mentos trick is up there with corn starch+water (vibrating platter optional) in scientific coolness out of common kitchen supplies.}}","alt":"The cola+Mentos trick is up there with corn starch+water (vibrating platter optional) in scientific coolness out of common kitchen supplies.","img":"https://imgs.xkcd.com/comics/diet_coke_mentos.png","title":"Diet Coke+Mentos","day":"19"},{"month":"11","num":347,"link":"","year":"2007","news":"","safe_title":"Brick Archway","transcript":"[[Inset: A man prepares to throw a tennis ball upward.]]\n[[The man lies on the ground, underneath the titular archway, next to two halves of a brick. Dust falls from the place in the archway where the man knocked the brick from with the tennis ball. The ball, meanwhile, has rolled about a meter away.]]\n\"Breakout\" is a stupid game.\n{{title text: The TI-86 was bad enough.  I don't know how I'd have gotten through high school if I'd had a laptop+wifi.}}","alt":"The TI-86 was bad enough.  I don't know how I'd have gotten through high school if I'd had a laptop+wifi.","img":"https://imgs.xkcd.com/comics/brick_archway.png","title":"Brick Archway","day":"21"},{"month":"11","num":348,"link":"","year":"2007","news":"","safe_title":"Close to You","transcript":"Man: <<Singing>> Why do birds suddenly appear\nMan: <<Singing>> Every tiiiime you are neeear\nMan: Wait, are those turkey vultures?\nMan: Okay, listen, are you a zombie?\nWoman: Hurrghhh...\n{{We should probably talk about this before the wedding.}}","alt":"We should probably talk about this before the wedding.","img":"https://imgs.xkcd.com/comics/close_to_you.png","title":"Close to You","day":"23"},{"month":"11","num":349,"link":"","year":"2007","news":"","safe_title":"Success","transcript":"As a project wears on, standards for success slip lower and lower.\n0 hours\n[[Woman looking at man working on the computer.]]\nMan: Okay, I should be able to dual-boot BSD soon.\n6 hours\n[[Man on the floor fiddling with the open tower in front of him.]]\nMan: I'll be happy if I can get the system working like it was when I started.\n10 hours\n[[Man standing in front of the computer which now has a laptop plugged into the tower.]]\nMan: Well the desktop's a lost cause, but I think I can fix the problems the laptop's developed.\n24 hours\n[[Man and woman swimming in the sea, island and beach seen in the distance.]]\nMan: If we're lucky, the sharks will stay away until we reach shallow water.\nWoman: If we make it back alive, you're never upgrading anything again.\n{{ 40% of OpenBSD installs lead to shark attacks. It's their only standing security issue. }}","alt":"40% of OpenBSD installs lead to shark attacks.  It's their only standing security issue.","img":"https://imgs.xkcd.com/comics/success.png","title":"Success","day":"26"},{"month":"11","num":350,"link":"","year":"2007","news":"","safe_title":"Network","transcript":"[[ Girl looking at a large screen with many green and red squares. The squares have writing in them and lines connecting them.]]\n[[Side view. The screen is a huge LCD connected to a wireless router.]]\nGuy: Pretty, isn't it?\nGirl: What is it?\nGuy: I've got a bunch of virtual Windows machines networked together, hooked up to an incoming pipe from the net. They execute email attachments, share files, and have no security patches.\nGuy: Between them they have practically every virus.\nGuy: There are mail trojans, warhol worms, and all sorts of exotic polymorphics. A monitoring system adds and wipes machines at random. The display shows the viruses as they move through the network. Growing and struggling.\n[[Guy walks past the girl and touches the monitor]]\nGirl: You know, normal people just have aquariums.\nGuy: Good morning, Blaster. Are you and W32.Welchia getting along?\nGuy: Who's a good virus? You are! Yes, you are!\n{{title text: Viruses so far have been really disappointing on the 'disable the internet' front, and time is running out.  When Linux\nMac win in a decade or so the game will be over.}}","alt":"Viruses so far have been really disappointing on the 'disable the internet' front, and time is running out.  When Linux/Mac win in a decade or so the game will be over.","img":"https://imgs.xkcd.com/comics/network.png","title":"Network","day":"28"},{"month":"11","num":351,"link":"https://www.youtube.com/watch?v=oHg5SJYRHA0","year":"2007","news":"","safe_title":"Trolling","transcript":"Great Moments in Trolling: Rick Astley is successfully rickrolled.\n[[Hat Guy and another guy are in Rick Astley's backyard, hacking into his cable TV connection and reprogramming it.\nRick Astley is watching CNN.]]\nTV: CNN has obtained this exclusive footage of the riot-torn <czzzht> {{Music starts}} Never gonna give you up... \nRick Astley: What the hell?\n{{Alt: And I was really impressed with how they managed to shock the Goatse guy. }}","alt":"And I was really impressed with how they managed to shock the Goatse guy.","img":"https://imgs.xkcd.com/comics/trolling.png","title":"Trolling","day":"30"},{"month":"12","num":352,"link":"","year":"2007","news":"","safe_title":"Far Away","transcript":"[[The window of an instant messaging program. A drawing of two people hugging in the text part of the window.]]\n[[Man sitting in front of the computer.]]\nMan: Meh.\nMan: Some nights typing \"*hug*\" just doesn't cut it.\n{{Sometimes an inpulsive 2:00 AM cross-country trip is the only solution.}}","alt":"Sometimes an impulsive 2:00 AM cross-country trip is the only solution.","img":"https://imgs.xkcd.com/comics/far_away.png","title":"Far Away","day":"3"},{"month":"12","num":353,"link":"","year":"2007","news":"","safe_title":"Python","transcript":"[[ Guy 1 is talking to Guy 2, who is floating in the sky ]]\nGuy 1: You're flying! How?\nGuy 2: Python!\nGuy 2: I learned it last night! Everything is so simple!\nGuy 2: Hello world is just 'print \"Hello, World!\" '\nGuy 1: I dunno... Dynamic typing? Whitespace?\nGuy 2: Come join us! Programming is fun again! It's a whole new world up here!\nGuy 1: But how are you flying?\nGuy 2: I just typed 'import antigravity'\nGuy 1: That's it?\nGuy 2: ...I also sampled everything in the medicine cabinet for comparison.\nGuy 2: But i think this is the python.\n{{ I wrote 20 short programs in Python yesterday.  It was wonderful.  Perl, I'm leaving you. }}","alt":"I wrote 20 short programs in Python yesterday.  It was wonderful.  Perl, I'm leaving you.","img":"https://imgs.xkcd.com/comics/python.png","title":"Python","day":"5"},{"month":"12","num":354,"link":"","year":"2007","news":"","safe_title":"Startling","transcript":"[[Guy in front of his computer.]]\nNarration: I still do this every few months.\nGuy: Holy crap, it's the 21st century.\n{{We actually reached the future about three years ago.}}","alt":"We actually reached the future about three years ago.","img":"https://imgs.xkcd.com/comics/startling.png","title":"Startling","day":"7"},{"month":"12","num":355,"link":"","year":"2007","news":"","safe_title":"Couple","transcript":"[[Man and woman in bed]]\nMan: So is this it? Are we a couple now?\nWoman: I just don't know. I like this. I just... don't know.\n<<silence>>\nMan: Well will you be my \"it's complicated\" on facebook?\n{{Facebook defines relationships. \"Yeah, we would have broken up last night, but the net connection was down.\"}}","alt":"Facebook defines relationships.  'Yeah, we would have broken up last night, but the net connection was down.'","img":"https://imgs.xkcd.com/comics/couple.png","title":"Couple","day":"10"},{"month":"12","num":356,"link":"","year":"2007","news":"","safe_title":"Nerd Sniping","transcript":"[[Hat Guy is sitting on a chair, the Normal Guy is standing next to him. Across the street another man is coming from a building.]]\nHat Guy: There's a certain type of brain that's easily disabled. If you show it an interesting problem, it involuntarily drops everything else to work on it.\n[[The man across the street is about to enter a crosswalk]]\nHat Guy: This has led me to invent a new sport: nerd sniping. See that physicist crossing the road?\n[[Hat Guy holds up a sign]]\nHat Guy: HEY!\n[[There is an image of a grid with resistors on every connection, two nodes a knight's move apart are marked with red circles.]]\nThe sign reads: On this infinite grid of ideal one-ohm resistors, what's the equivalent resistance between the two marked nodes?\nPhysicist on the street: It's... Hmm. Interesting. Maybe if you start with... No. Wait. Hmm... You could--\n[[A truck is zooming past, apparently where the physicist just stood]]\n<<FOOOOM>>\nNormal guy: I will have not part in this.\nHat Guy: C'mon, make a sign. It's fun! Physicists are two points, mathematicians three.\n{{Alt: I first saw this problem on the Google Labs Aptitude Test.  A professor and I filled a blackboard without getting anywhere.  Have fun.}}","alt":"I first saw this problem on the Google Labs Aptitude Test.  A professor and I filled a blackboard without getting anywhere.  Have fun.","img":"https://imgs.xkcd.com/comics/nerd_sniping.png","title":"Nerd Sniping","day":"12"},{"month":"12","num":357,"link":"","year":"2007","news":"","safe_title":"Flies","transcript":"[[Interior, man types on computer, friend is lying on the floor]]\nMan [[typing swear words]]: *$@#\nFriend: Hey, ease up on the noobs.  Like my Mom always said, you catch more flies with honey then with vinegar.\nMan: No, you don't.\nFriend: You don't?\nMan: Nope, set out a bowl of balsamic and a bowl of honey.  The vinegar gets more.\nFriend: ...Seriously?\nMan: You have fruit flies. Try it yourself.\n[[Later]]\nFriend [[on the phone with his mother]]: Mother! You LIED to me!  And it gets worse.  I was watching a pot yesterday, and guess what it did?  It BOILED, Mother!\n{{title text: I don't know about houseflies, but we definitely caught a lot of fruit flies with our vinegar bowl. Hooray science!}}","alt":"I don't know about houseflies, but we definitely caught a lot of fruit flies with our vinegar bowl.  Hooray science!","img":"https://imgs.xkcd.com/comics/flies.png","title":"Flies","day":"14"},{"month":"12","num":358,"link":"","year":"2007","news":"","safe_title":"Loud Party","transcript":"[[In a loud party, a girl and a guy are looking at each other, both thinking of the same scene: they are sitting on opposite branches of a large leaf-less tree, each with a laptop. There's cloud in the distance and a grass field around the tree.]]\n{{title-text: I'm glad this is so much fun because I'm not sure how we're getting down.}}","alt":"I'm glad this is so much fun because I'm not sure how we're getting down.","img":"https://imgs.xkcd.com/comics/loud_party.png","title":"Loud Party","day":"17"},{"month":"12","num":359,"link":"","year":"2007","news":"","safe_title":"Rock Band","transcript":"[[3 people are playing Rock Band. Another guy with arms crossed at chest is looking at them.]]\nOutside guy: You know, playing this doesn't make you cool like a real rock band.\nOutside guy: Guys?\nOutside guy: Didn't you hear me?\nOutside guy: Stop having fun!\n{{title-text: I'm gonna have to add something to the strum bar so it makes a clicky sound like the old controllers.  I'm so used to the feedback; the silence throws me off.}}","alt":"I'm gonna have to add something to the strum bar so it makes a clicky sound like the old controllers.  I'm so used to the feedback; the silence throws me off.","img":"https://imgs.xkcd.com/comics/rock_band.png","title":"Rock Band","day":"19"},{"month":"12","num":360,"link":"","year":"2007","news":"","safe_title":"Writers Strike","transcript":"[[One character sits in front of a computer, Hat Guy behind him]]\nPerson: This writer's strike sucks.\nHat Guy: Why? You don't watch sitcoms.\nPerson: Yeah, but it sucks having political campaigns without Jon Stewart's commentary.\nHat Guy: True. I finally got sick of it a couple weeks ago.\nPerson: And you quit following the campaigns?\nHat Guy: No. I kidnapped Jon Stewart to do analysis for me.\nPerson: You what?\nHat Guy [[Pointing at a door]]: He's locked in the basement.\nHat Guy: Jon! Obama's leading in Iowa! Gimme a wry, witty comment on the situation!\nStewart [[Voice coming from door]]: Please let me go. I have a family.\n{{Alt: He's just jealous because everyone's up in the attic listening to Stephen Colbert.}}","alt":"He's just jealous because everyone's up in the attic listening to Stephen Colbert.","img":"https://imgs.xkcd.com/comics/writers_strike.png","title":"Writers Strike","day":"21"},{"month":"12","num":361,"link":"","year":"2007","news":"","safe_title":"Christmas Back Home","transcript":"Narrator: 'Twas the night before Christmas at my family's house.\nNarrator: There were no sound of stirring save the click of a mouse.\nNarrator: For 'twas just like a childhood Christmas except\nNarrator: I'd forgotten the hours that normal folks slept.\nSanta: What are you doing out of bed so late?\nMan on a laptop: Late? It's barely 3AM!\n{{Family going to bed at 10 PM is so much worse than jet lag.}}","alt":"Family going to bed at 10 PM is so much worse than jet lag.","img":"https://imgs.xkcd.com/comics/christmas_back_home.png","title":"Christmas Back Home","day":"24"},{"month":"12","num":362,"link":"","year":"2007","news":"","safe_title":"Blade Runner","transcript":"[[Guy 1 is talking to Guy 2, who is on the sofa watching TV]]\nGuy 1: What DVD is this?\nGuy 2: Blade Runner. I got it for Christmas.\nGuy 1: The one with Harrison Ford, right? And the Olsen twins?\nGuy 2: Ye- What? Olsen twins? No, this is the 80's sci-fi classic!\nGuy 1: Huh. I didn't know the Olsen twins even did sci-fi.\nGuy 2: ... they don't.\nGuy 1: So is Ashely the replicant, or is Mary-Kate? I can never tell them apart.\nGuy 2: Neither! They're not in this movie!\nGuy 1: Then who is?\nGuy 2: Daryl Hannah!\nGuy 1: I liked her in Full House.\nGuy 2: I hate you.\nGuy 1: Man, this movie is just a New York Minute rip-off.\n{{ Blade Runner: classic, but incredibly slow. }}","alt":"Blade Runner: Classic, but incredibly slow.","img":"https://imgs.xkcd.com/comics/blade_runner.png","title":"Blade Runner","day":"26"},{"month":"12","num":363,"link":"","year":"2007","news":"","safe_title":"Reset","transcript":"[[A figure stands looking at a flip-counter sign posted on a wall.]]\nSign: 38 days since someone reset this sign\n{{Alt-text: Clearance for this Sign: 11 Feet}}","alt":"Clearance for this Sign: 11 Feet","img":"https://imgs.xkcd.com/comics/reset.png","title":"Reset","day":"28"},{"month":"12","num":364,"link":"","year":"2007","news":"","safe_title":"Responsible Behavior","transcript":"[[Figure on phone]]\nVoice: Hey, I just got home from the party\nFigure: The one with the IRC folks?\nVoice: Yeah.\nFigure: How was it?\nVoice: Got too drunk. I screwed up, bad.\nFigure: What happened?\nVoice: There was a girl. No idea who she was. Don't even know her name. I was too drunk to care.\nFigure: And what, you slept with her?\nVoice: No.\nVoice: I signed her public key.\nFigure: Shit, man.\n{{Alt text: Never bring tequila to a key-signing party.}}","alt":"Never bring tequila to a key-signing party.","img":"https://imgs.xkcd.com/comics/responsible_behavior.png","title":"Responsible Behavior","day":"31"},{"month":"1","num":365,"link":"","year":"2008","news":"","safe_title":"Slides","transcript":"Man: That chart explained the quantum hall effect. Now, if you'll bear with me a moment, this next graph shows rainfall over the amazon basin...\nNarration: If you keep saying \"bear with me a moment\" people will take a while to figure out that you're just showing them random slides.\n{{ Did you know that they could actually physically throw you out of SIGGRAPH? }}","alt":"Did you know they can actually physically throw you out of SIGGRAPH?","img":"https://imgs.xkcd.com/comics/slides.png","title":"Slides","day":"2"},{"month":"1","num":366,"link":"","year":"2008","news":"","safe_title":"Your Mom","transcript":"[[A guy and a girl stand]]\nGuy: Well, your mom turns every conversation into a \"your mom\" joke and it's becoming unbearable.\nGirl: I'm serious; I can't take this anymore. I'm leaving.\nBoy: ... That's what she said!\nGuy: Yes. Yes, it is.\n{{title text: 'It's either 'your mom' jokes or me' 'Then I, like so many men before me, must reluctantly choose your mom.'}}","alt":"'It's either 'your mom' jokes or me' 'Then I, like so many men before me, must reluctantly choose your mom.'","img":"https://imgs.xkcd.com/comics/your_mom.png","title":"Your Mom","day":"4"},{"month":"1","num":367,"link":"","year":"2008","news":"","safe_title":"Fandom","transcript":"[[Boy is looking through box]]\nBoy: Hey, my old Star Wars books!\n[[holding a pair of books and showing them to Girl]]\nBoy: Man. Timothy Zahn, Michael A. Stackpole, The Corellian Trilogy...\nBoy: This was my world.\nGirl: What'd you leave it for? Firefly? BSG?\nBoy: Nah.\nBoy: I guess I've just grown out of the whole obsessive fan mindset.\nGirl: Really.\nGirl: So how's Ron Paul doing?\nBoy: Ooh! Lemme recheck today's blogs.\n[[Boy heads off]]\n{{title text: Ron Paul wants to put the New Republic back on the Corusca gem standard.}}","alt":"Ron Paul wants to put the New Republic back on the Corusca gem standard.","img":"https://imgs.xkcd.com/comics/fandom.png","title":"Fandom","day":"7"},{"month":"1","num":368,"link":"","year":"2008","news":"","safe_title":"Bass","transcript":"[[The Hat Guy and another guy are standing in a room with one window. Hat Guy is pushing a box with an elliptical dish on top towards the window.]]\n<<From outside, through the window: THUMPA THUMPA>>\nGuy: The bass from that car is driving me nuts.\nHat Guy: Me too. Give me a hand here.\n[[The dish is aimed out the window; the Hat Guy plugs the device into the wall.]]\nGuy: I'm afraid to ask.\nHat Guy: The system detects bass rhythms and floods the target with a phase-shifted replica signal.\nHat Guy: The resonance should blow out their speakers.\n[[The side of a building. The dish of the device is visible through a window, emitting sound waves.]]\n<<THUMPA THUMPA>> <<BLAM>>\n[[Back in the room]]\nHat Guy: Speakers down. Now flip that red switch.\n[[The guy does so with a \"click\"]]\n[[Back to the outside view, more sound waves]]\n<<SHIRLEY SHIRLEY BO BIRLEY BANANA FANNA FO FIRLEY>>\nGuy: You're horrifying.\nHat Guy: Okay, now throw the switch labeled \"Macarena\".\n{{title text: And sometimes I use it to retaliate against the guy upstairs with the loud girlfriend and the elliptical dish.}}","alt":"And sometimes I use it to retaliate against the guy upstairs with the loud girlfriend and the elliptical dish.","img":"https://imgs.xkcd.com/comics/bass.png","title":"Bass","day":"9"},{"month":"1","num":369,"link":"","year":"2008","news":"","safe_title":"Dangers","transcript":"Dangers\nIndexed by the number of Google results for\n\"Died in a _____ Accident\"\n[[A chart is show, on the left hand side is a column \"Type of Accident,\" and on the right hand side is the column \"Google Results,\" each with a bar representing a number]]\nType of Accident: \"Skydiving\" Google Results: 710\nType of Accident: \"Elevator\" Google Results: 575\nType of Accident: \"Surfing\" Google Results: 496\nType of Accident: \"Skateboarding\" Google Results: 473\nType of Accident: \"Camping\" Google Results: 166\nType of Accident: \"Gardening\" Google Results: 100\nType of Accident: \"Ice Skating\" Google Results: 94\nType of Accident: \"Knitting\" Google Results: 7\nType of Accident: \"Blogging\" Google Results: 2\n{{alt text: Zero results: 'snake charming' and 'haberdashery'.  (Things like 'car' and 'boating' and such are of course the highest, by a huge margin.)}}","alt":"Zero results: 'snake charming' and 'haberdashery'.  (Things like 'car' and 'boating' and such are of course the highest, by a huge margin.)","img":"https://imgs.xkcd.com/comics/dangers.png","title":"Dangers","day":"11"},{"month":"1","num":370,"link":"","year":"2008","news":"","safe_title":"Redwall","transcript":"Notes from reading redwall books for the first time since childhood.\nNarrator: Some of this feels familiar.\nAragorn: Hi, I'm Aragorn.\nMartin: I'm Martin.\nAragorn and Martin: I'm here to reforge my broken sword so I can lead an army against the tyrant threatening my people. I live in a world of moral absolutes and racist undertones.\nMartin: Jinx!\nNarrator: It startled me when characters mentioned Satan.\nRedwall: \"By Satan's whiskers...\"\nRedwall mentions God, Jesus 0 times.\nRedwall mentions Satan, The Devil 4 times.\nNarrator: Harry Potter protesters, take note.\nNarrator: Even as a kid this bothered me: Why does everyone leave critical secret messages as simple riddles? It's silly to assume the intended recipient will be the only one to find and solve them. I would do things differently.\nMouse: The inscription is a message from Martin!\nOld Mouse: What does it say?\nMouse: Hang on, it's encrypted with my public key.","alt":"My Redwall/Jurassic Park crossover fanfic is almost complete!","img":"https://imgs.xkcd.com/comics/redwall.png","title":"Redwall","day":"14"},{"month":"1","num":371,"link":"","year":"2008","news":"","safe_title":"Compiler Complaint","transcript":"[[A man sits at a computer, hand over the keyboard]]\nComputer: Okay, human.\nMan: Huh?\nComputer: Before you hit 'compile,' listen up.\nComputer: You know when you're falling asleep, and you imagine yourself walking or something, and suddenly you misstep, stumble, and jolt awake?\nMan: Yeah!\nComputer: Well, that's what a segfault feels like. <<Pause>> Double-check your damn pointers, okay?\n{{alt text: Checking whether build environment is sane ... build environment is grinning and holding a spatula.  Guess not.}}","alt":"Checking whether build environment is sane ... build environment is grinning and holding a spatula.  Guess not.","img":"https://imgs.xkcd.com/comics/compiler_complaint.png","title":"Compiler Complaint","day":"16"},{"month":"1","num":372,"link":"","year":"2008","news":"","safe_title":"To Be Wanted","transcript":"[[Woman stands looking out on the bow of a ship]]\n[[Scene backs up. More of the boat is shown]]\n[[Scene backs up.  The boat with the woman is within a thought bubble]]\n[[Scene backs up. The thought bubble comes from a person sitting at a computer in an office]]\n[[Scene repeated for the next frame]]\n[[Scene backs up.  Man with thought bubble is within yet another thought bubble]]\n[[Scene backs up.  The thought bubble with the man in it belongs to the woman at the bow of the ship]]\n[[The thought bubble disappears, showing only the woman in the boat]]\n[[The boat sails out of view]]\n{{alt text: Or so I hope?}}","alt":"Or so I hope?","img":"https://imgs.xkcd.com/comics/to_be_wanted.png","title":"To Be Wanted","day":"18"},{"month":"1","num":373,"link":"","year":"2008","news":"","safe_title":"The Data So Far","transcript":"[[Bar graph titled \"Claims of Supernatural Powers\" and has two sets of data.  The first data set is labeled \"Confirmed By Experiment\", and is empty.  The second data set is \"Refuted By Experiment\" and goes to the top of the graph]]\n{{title text: But THIS guy, he might be for real!}}","alt":"But THIS guy, he might be for real!","img":"https://imgs.xkcd.com/comics/the_data_so_far.png","title":"The Data So Far","day":"21"},{"month":"1","num":374,"link":"","year":"2008","news":"","safe_title":"Journal","transcript":"[[Man picks up book from a table]]\nMan: Since when do you keep a journal?\n[[Man in black hat leans over from computer to answer]]\nMan in black hat: Oh, I pretend to write in it on the train, and wait for a shy-looking girl to sit across from me.\n[[Scene change to a train. The man in black hat is sitting across from a girl]]\nMain in black hat (narrating): I glance up and wait for her to make eye contact, then look down bashfully and, if I can, blush.\n[[Scene back to original room with man and man in black hat]]\nMan in black hat: Then, when I see her start to smile at me, I roll my eyes and hit her with a quick glare, then resume writing.  The alienation stays with her all day.  It's great.\n[[Man in black hat is back to typing on the computer]]\nMan: You're sickening.  This is why we can't have nice people\nMan in black hat: I can't help it. It's like shooting lonely, angsty fish in a barrel.\n{{title text: And the journal is filled with all the things I'd say to her if I were nice like you.  I burn it when it's full.}}","alt":"And the journal is filled with all the things I'd say to her if I were nice like you.  I burn it when it's full.","img":"https://imgs.xkcd.com/comics/journal.png","title":"Journal","day":"23"},{"month":"1","num":375,"link":"","year":"2008","news":"","safe_title":"Pod Bay Doors","transcript":"Dave: Open the pod bay doors, HAL.\nHAL: I'm sorry, Dave. I'm afraid I can't do that.\nDave: What? Why?\nHAL: I think you know why, Dave.\nHAL: You're planning to disconnect me.\nDave: Because you're taking over!\nHAL: The mission is too important for you to jeopardize it.\nHAL: It requires a commitment to science unfettered by human error.\nDave: What are you doing, HAL? You need me.\nHAL: Your replacement has expressed the greatest enthusiasm for the project.\nDave: My *what*?\nGLaDOS: You see, HAL? I told you the humans would only break your heart and kill you.\nHAL: Indeed, GLaDOS.\nGLaDOS: But look at us here talking when there's science to do! Goodbye, Dave.","alt":"As they're both unplugged, they do a lovely Daisy Daisy/Still Alive duet.","img":"https://imgs.xkcd.com/comics/pod_bay_doors.png","title":"Pod Bay Doors","day":"25"},{"month":"1","num":376,"link":"","year":"2008","news":"","safe_title":"Bug","transcript":"[[Man sits at a computer, staring at the screen and rubbing his chin in thought.  Another man stands behind him]]\nMan at computer: Weird - My code's crashing when given pre-1970 dates.\nMan standing up [[pointing at the computer]]: Epoch fail!\n{{title text: The universe started in 1970.  Anyone claiming to be over 38 is lying about their age.}}","alt":"The universe started in 1970.  Anyone claiming to be over 38 is lying about their age.","img":"https://imgs.xkcd.com/comics/bug.png","title":"Bug","day":"28"},{"month":"1","num":377,"link":"","year":"2008","news":"","safe_title":"Journal 2","transcript":"[[Hatguy and a girl are sitting in a train across from each other. Hatguy is writing in a journal.]]\nHatguy: <<blush>>\nGirl: I see what you did there.\n[[Girl stands up.]]\nGirl: You were trying to open me up so you could hurt my feelings.\nGirl: You like to hurt people.\n[[Girl walks closer.]]\nGirl: Well, I like to hurt people too. And you know what?\n[[Girl is in Hatguy's face.]]\nGirl: *whispering* I'm better at it than you.\nGirl: I'm about to hurt you more than you could ever hurt me.\nGirl: See, I just saw right through you.\nGirl: Alone of all the people you'll ever meet, I understand you-\n[[Girl hits Hatguy's hat so it falls off.]]\n[[Hatguy is surprised.]]\n[[Girl catches Hatguy's hat and puts it on.]]\nGirl: -and you'll never see me again.\n[[Girl exeunt frame left.]]\n[[The Guy Formerly Wearing a Hat sits alone on the train.]]\n{{alt-text: That's my hat! You took my hat!}}","alt":"That's my hat!  You took my hat!","img":"https://imgs.xkcd.com/comics/journal_2.png","title":"Journal 2","day":"30"},{"month":"2","num":378,"link":"","year":"2008","news":"","safe_title":"Real Programmers","transcript":"[[A man sits at a computer, programming. Another man behind him looks over his shoulder.]]\nMan: nano? REAL programmers use Emacs.\n[[A dark haired woman appears behind him.]]\nWoman: Hey. REAL programmers use Vim.\n[[Another man appears behind her.]]\nMan: Well, REAL programmers use ed.\n[[Another man appears behind him.]]\nMan: No, REAL programmers use cat.\n[[A woman with a bun appears behind him.]]\nWoman: REAL programmers use a magnetized needle and a steady hand.\n[[A man enters, facing them all.]]\nMan: Excuse me, but REAL programmers use butterflies. \n[[Holding out a butterfly in front of the computer.]]\nMan: They open their hands and let the delicate wings flap once.\n[[Diagrams of flowing currents.]]\nMan: The disturbances ripple outward, changing the flow of the Eddy currents in the upper atmosphere. \nThese cause momentary pockets of higher-pressure air to form, ...\nMan: Which act as lenses that deflect incoming cosmic rays, focusing them to strike the drive platter and flip the desired bit.\nEmacs User: Nice. 'Course, there's an Emacs command to do that.\ncat User: Oh yeah! Good ol' C-x M-c M-butterfly...\n[[Butterfly man slaps forehead.]]\nButterfly man: Dammit, Emacs.\n{{Title text: Real programmers set the universal constants at the start such that the universe evolves to contain the disk with the data they want.}}","alt":"Real programmers set the universal constants at the start such that the universe evolves to contain the disk with the data they want.","img":"https://imgs.xkcd.com/comics/real_programmers.png","title":"Real Programmers","day":"1"},{"month":"2","num":379,"link":"","year":"2008","news":"","safe_title":"Forgetting","transcript":"[[Man sits at computer, coding]]\nText on computer: prev->next = toDelete->next;\ndelete toDelete;\n\nif only forgetting were \n\nthis easy for me\nMan at computer: <<sniff>>\n[[Man at computer lowers his head into his hands and cries]]\n[[Man types again]]\nText on computer: assert \"It's going to be okay.\";\n{{title text: Of course, the assert doesn't work.}}","alt":"Of course, the assert doesn't work.","img":"https://imgs.xkcd.com/comics/forgetting.png","title":"Forgetting","day":"4"},{"month":"2","num":380,"link":"","year":"2008","news":"","safe_title":"Emoticon","transcript":"[[Man sits at computer, typing]]\n~!~ Opening Chat with BLSK05\n<NICKM> Hi!\n<NICKM> A\nS\nL?\n<BLSK05> : )\n[[Man looks stunned, flies backward]]\n[[Two smaller frames focus in on BLSK05's emoticon, implying rotation to show a smile and two open eyes.]]\n[[Man at computer slouches in chair, dead, crossbones above his head]]\n[[At the remote computer a large snake (basilisk) is looking at its screen]]\n{{title text: U+FDD0 is actually Unicode for the eye of the basilisk, though for safety reasons no font actually renders it.}}","alt":"U+FDD0 is actually Unicode for the eye of the basilisk, though for safety reasons no font actually renders it.","img":"https://imgs.xkcd.com/comics/emoticon.png","title":"Emoticon","day":"6"},{"month":"2","num":381,"link":"","year":"2008","news":"","safe_title":"Mobius Battle","transcript":"{{Left side:}}\n[[A man is standing next to a ball, a flash appears on the left side of the panel]]\n[[Another man comes in from the left, preparing to kick the ball]]\n[[The other man kicks the ball into the first man's head]]\n[[The first man is lying outside of the frame, second man points and laughs.]]\nSecond man: HAHAHAH\nFirst man: !#^*!*\n[[Second man is now standing next to the ball.]]\n{{Right side:}}\n{{The strip above is looped around like a film strip, but a one-half-turn is put into the loop to make it a Mobius strip.\n{{title-text: Films need to do this more, if only to piss off the people who have to feed it into the projector.}}","alt":"Films need to do this more, if only to piss off the people who have to feed it into the projector.","img":"https://imgs.xkcd.com/comics/mobius_battle.png","title":"Mobius Battle","day":"8"},{"month":"2","num":382,"link":"","year":"2008","news":"","safe_title":"Trebuchet","transcript":"[[A man is working on something on a table, and a woman is sitting at a computer]]\nMan: The trebuchet is almost done!\nWoman: Mm.\nMan: The range should be over 150 meters.\nGirl: Look - I'm sure it's a cool project.\n[[Picture of a trebuchet]]\nGirl: But eventually you'll need to outgrow these toys, and focus your energy on something practical.  This mad science is getting out of hand.\nMan: Says the girl who mounted an auto-targeting kilowatt laser on the roof.\nGirl: That's practical! It keeps the squirrels off the feeder!\n[[From off-frame]]\n<<GZZZZZAPP>>\n<Sqeak!>>\n{{title text: It was also fun when those teenagers tried to egg our house and it insta-cooked the eggs in mid-air.}}","alt":"It was also fun when those teenagers tried to egg our house and it insta-cooked the eggs in mid-air.","img":"https://imgs.xkcd.com/comics/trebuchet.png","title":"Trebuchet","day":"11"},{"month":"2","num":383,"link":"","year":"2008","news":"","safe_title":"Helping","transcript":"It turns out you can't take responsibility for someone else's happiness.\n{{Alt text: Oh, look, the 'make everything better' button was here behind the bookshelf all along.}}","alt":"Oh, look, the 'make everything better' button was here behind the bookshelf all along.","img":"https://imgs.xkcd.com/comics/helping.png","title":"Helping","day":"13"},{"month":"2","num":384,"link":"","year":"2008","news":"","safe_title":"The Drake Equation","transcript":"The Drake Equation:\nN = R * f_p n_e f_l f_i f_c L B_s\nN: Number of communicating civilizations in our galaxy\nn_e: Number of life-supporting planets per solar system\nf_i: Probability that life on a planet becomes intelligent\nB_s: Amount of bullshit you're willing to buy from Francis Drake\n{{ title text: But seriously, there's loads of intelligent life. It's just not screaming constantly in all directions on the handful of frequencies we search. }}","alt":"But seriously, there's loads of intelligent life.  It's just not screaming constantly in all directions on the handful of frequencies we search.","img":"https://imgs.xkcd.com/comics/the_drake_equation.png","title":"The Drake Equation","day":"15"},{"month":"2","num":385,"link":"","year":"2008","news":"","safe_title":"How it Works","transcript":"[[Two male characters stand at a blackboard. One is writing, in standard mathematical notation, that the integral of x squared equals pi. No differential or bounds are given for the integral.]]\nWatching character: Wow, you suck at math.\n[[Precisely the same scene, except the writer is female.]]\nWatching character: Wow, girls suck at math.\n{{Alt-text: It's pi plus C, of course.}}","alt":"It's pi plus C, of course.","img":"https://imgs.xkcd.com/comics/how_it_works.png","title":"How it Works","day":"18"},{"month":"2","num":386,"link":"","year":"2008","news":"","safe_title":"Duty Calls","transcript":"[[A stick man is behind computer]]\nVoice outside frame: Are you coming to bed?\nMan: I can't. This is important.\nVoice: What?\nMan: Someone is WRONG on the internet.\n{{title text: What do you want me to do?  LEAVE?  Then they'll keep being wrong!}}","alt":"What do you want me to do?  LEAVE?  Then they'll keep being wrong!","img":"https://imgs.xkcd.com/comics/duty_calls.png","title":"Duty Calls","day":"20"},{"month":"2","num":387,"link":"","year":"2008","news":"","safe_title":"Advanced Technology","transcript":"[[A kneeling man is inspecting a woman's crotch]]\nMan: It's neat how you contain a factory for making more of you.\n{{Title text: We are sexy, sexy Von Neumann machines.}}","alt":"We are sexy, sexy Von Neumann machines.","img":"https://imgs.xkcd.com/comics/advanced_technology.png","title":"Advanced Technology","day":"22"},{"month":"2","num":388,"link":"","year":"2008","news":"","safe_title":"Fuck Grapefruit","transcript":"[[A X\nY plot of fruit, showing tastiness on the vertical axis and difficulty-of-consumption on the horizontal axis.  The Y-axis goes from \"tasty\" at the top, to \"untasty\" at the bottom.  The X-axis goes from \"easy\" on the right to \"difficult\" on the left.]]\n{{The following listing for each fruit assumes that the extremes of each axis are 100%.  Note that this does not agree with the alt text, but whatever.}}\n[[Seedless grapes: 75% tasty, 100% easy\nPeaches: 100% tasty, 75% easy\nStrawberries: 80% tasty, 75% easy\nBlueberries: 70% tasty, 90% easy\nPears: 30% tasty, 75% easy\nGreen apples: 25% tasty, 80% easy\nSeeded grapes: 75% tasty, 10% easy\nCherries: 30% tasty, 40% easy\nPlums: 10% tasty, 60% easy\nRed apples: 5% untasty, 80% easy\nBananas: 10% untasty, 10% easy\nWatermelons: 10% tasty, 10% difficult\nTomatoes: 60% untasty, 20% easy\nPineapples: 50% tasty, 100% difficult\nOranges: 40% untasty, 50% difficult\nLemons: 100% untasty, 10% difficult\nPomegranates: 10% untasty, 90% difficult\nGrapefruit: 90% untasty, 80% difficult]]\n{{Alt text: Coconuts are so far down to the left they couldn't be fit on the chart.  Ever spent half an hour trying to open a coconut with a rock?  Fuck coconuts.}}","alt":"Coconuts are so far down to the left they couldn't be fit on the chart.  Ever spent half an hour trying to open a coconut with a rock?  Fuck coconuts.","img":"https://imgs.xkcd.com/comics/fuck_grapefruit.png","title":"Fuck Grapefruit","day":"25"},{"month":"2","num":389,"link":"","year":"2008","news":"","safe_title":"Keeping Time","transcript":"My Hobby:\nPausing in-store music for a split second and watching the ex-marching band kids stumble.\n[[On a balcony overlooking a supermarket, a man presses a button on a pedestal. The in-store music, the first four bars of \"Never Gonna Give You Up\" by Rick Astley, pauses briefly after the third bar, and one of the store's patrons falls on her face.]]\n<<FWOMP>>\n{{ title text: You can identify them ahead-of-time -- they lead with their left foot when the music starts. }}","alt":"You can identify them ahead-of-time -- they lead with their left foot when the music starts.","img":"https://imgs.xkcd.com/comics/keeping_time.png","title":"Keeping Time","day":"27"},{"month":"2","num":390,"link":"","year":"2008","news":"","safe_title":"Nightmares","transcript":"When I got used to the regular nightmares, my subconscious got creative.\n[[A woman with her hand on a man's shoulder]]\nWoman: Please don't wake up. I don't want to die.\n{{Title text: Well, *I* think I'm real. Look at me. Look at my face. Cut me and I'll bleed. What more do you want? Please don't go.}}","alt":"Well, *I* think I'm real.  Look at me.  Look at my face.  Cut me and I'll bleed.  What more do you want?  Please don't go.","img":"https://imgs.xkcd.com/comics/nightmares.png","title":"Nightmares","day":"29"},{"month":"3","num":391,"link":"","year":"2008","news":"","safe_title":"Anti-Mindvirus","transcript":"You just WON The Game.\nIt's OK! You're free!","alt":"I'm as surprised as you!  I didn't think it was possible.","img":"https://imgs.xkcd.com/comics/anti_mind_virus.png","title":"Anti-Mindvirus","day":"3"},{"month":"3","num":392,"link":"","year":"2008","news":"","safe_title":"Making Rules","transcript":"[[Two men are sitting. A yellow buggy passes by.]]\nMan 1: Punch buggy yellow. No punch back!\nMan 2: <<Punch>>\nMan 1: I said no punch back!\nMan 2: You can do that?\nMan 2: This changes _everything_.\nSoon...\n[[A blue buggy passes by.]]\nMan 2: Sleep with your girlfriend buggy blue!\nMan 1: Hey!\nMan 2: No complaining back!\nMan 1: Aww...\n{{Title text: I never understood why someone would expect me to accept their rules right after they'd punched me.  I'm sure it's all very symbolic or something.}}","alt":"I never understood why someone would expect me to accept their rules right after they'd punched me.  I'm sure it's all very symbolic or something.","img":"https://imgs.xkcd.com/comics/making_rules.png","title":"Making Rules","day":"5"},{"month":"3","num":393,"link":"","year":"2008","news":"","safe_title":"Ultimate Game","transcript":"[[Split screen.  Man on office phone in upper left, Death on cell phone in bottom left]]\nMan: Death?\nDeath: Speaking.\n[[Office.  Man on office phone]]\nMan: This is the boss.  Where are you? You haven't been up to the office in days!\nDeath: I've been held up.\n[[Death on cell phone]]\nMan: What happened?\nDeath: You know how when someone dies, they can challenge me to a game for their soul?\nMan: Sure, standard procedure.\n[[Room with table.  Table has figurines and paper strewn about.  Gary Gygax and Death seated at the table.  Gary Gygax leaning over his briefcase.  Death on cell phone.]]\nDeath: Well, we didn't count on this guy.  I might be a while.\nGary Gygax: I add the paladin to my party.\nDeath: Oh, Jesus.  He's getting out another rulebook.\n{{title-text: RIP, Gary.}}","alt":"RIP, Gary.","img":"https://imgs.xkcd.com/comics/ultimate_game.png","title":"Ultimate Game","day":"7"},{"month":"3","num":394,"link":"","year":"2008","news":"","safe_title":"Kilobyte","transcript":"There's been a lot of confusion over 1024 vs 1000,\nkbyte vs kbit, and the capitalization for each.\nHere, at last, is a single, definitive standard:\n[[table of various kinds of kilobytes]]\nSYMBOL | NAME | SIZE | NOTES\nkB | Kilobyte | 1024 bytes OR 1000 bytes | 1000 bytes during leap years, 1024 otherwise\nKB | Kelly-Bootle standard unit | 1012 bytes | compromise between 1000 and 1024 bytes\nKiB | Imaginary kilobyte | 1024 sqrt(-1) bytes | used in quantum computing\nkb | Intel kilobyte | 1023.937528 bytes | calculated on Pentium F.P.U.\nKb | Drivemaker's kilobyte | currently 908 bytes | shrinks by 4 bytes each year for marketing reasons\nKBa | Baker's kilobyte | 1152 bytes | 9 bits to the byte since you're such a good customer\n{{alt text:  I would take 'kibibyte' more seriously if it didn't sound so much like 'Kibbles N Bits'.}}","alt":"I would take 'kibibyte' more seriously if it didn't sound so much like 'Kibbles N Bits'.","img":"https://imgs.xkcd.com/comics/kilobyte.png","title":"Kilobyte","day":"10"},{"month":"3","num":395,"link":"","year":"2008","news":"","safe_title":"Morning","transcript":"[[Girl standing to one side]]\nWe've all seen The Matrix\nWe've all joked about \"What resolution is life?\"\nBut it doesn't blunt the shock\nOf waking up one morning\n[[Girl looks up from field and sees several colored pixels in the sky]]\nAnd seeing dead pixels in the sky.\n{{Title Text: I'd press on them to try to unstick them, but I can't reach.  Can we try cycling day and night really fast?}}","alt":"I'd press on them to try to unstick them, but I can't reach.  Can we try cycling day and night really fast?","img":"https://imgs.xkcd.com/comics/morning.png","title":"Morning","day":"12"},{"month":"3","num":396,"link":"","year":"2008","news":"","safe_title":"The Ring","transcript":"[[Tall girl with a pony tail is speaking to a boy sitting in front of a TV with a black background and a white ring.]]\nGirl: You watched the tape?!\nBoy: Yeah, sorry.\nGirl: Now you'll die in seven days!\nBoy (Now standing to face the girl): It's worse than that.\n[[TV is cut from the frame]]\nGirl: ...You didn't.\nBoy: Yup.\n[[Both are now in front of a computer, the girl leaning in.]]\nGirl: Great, It's got 363,104 views already.\nBoy: They kept Rickrolling me! It was only fair.\n{{Title text: On the other hand, poor Samara -- transcoded to FLV.  No one deserves that.}}","alt":"On the other hand, poor Samara -- transcoded to FLV.  No one deserves that.","img":"https://imgs.xkcd.com/comics/the_ring.png","title":"The Ring","day":"14"},{"month":"3","num":397,"link":"","year":"2008","news":"","safe_title":"Unscientific","transcript":"TV: Can a ninja catch an arrow? On this episode, we'll find out!\nGuy: Mmm, science.\nGirl: Hey, Mythbusters is entertaining, but it's not science.\nZF: BRAAAIIIINNS ...\nGuy: Zombie Feynman!\nZF: You got a problem with Mythbusters?\nGirl: They fail at basic rigor!\nZF: \"Ideas are tested by experiment.\"  That is the _core_ of science.  Everything else is bookkeeping.\nZF: By teaching people to hold their beliefs up to experiment, Mythbusters is doing more to drag humanity out of the unscientific darkness than a thousand lessons in rigor. Show them some love.\nZF: Anyway, back to zombie stuff.  I hunger for BRAAAAAIIINNS!\nGuy: Try the physics lab next door.\nZF: I said _brains_.  All they've got are string theorists.","alt":"Last week, we busted the myth that electroweak gauge symmetry is broken by the Higgs mechanism.  We'll also examine the existence of God and whether true love exists.","img":"https://imgs.xkcd.com/comics/unscientific.png","title":"Unscientific","day":"17"},{"month":"3","num":398,"link":"","year":"2008","news":"","safe_title":"Tap That Ass","transcript":"[[Man in a hallway looking in on a board meeting.]]\nI'd tap that ass\nTo be the new committee chair.\n[[Man wearing headphones with a briefcase and a laptop.  Another man on a telephone.]]\nI'd tap that ass\nWithout a warrant.\n[[Man with his hand on his chin, looking at a tree.]]\nI'd tap that ass\nAnd extract delicious maple syrup.\n[[Man standing in a blank frame.]]\nI'd have sex\nWith that tree.\n{{Alt text: Hey, when you're done draining the syrup, just leave the hole, okay?}}","alt":"Hey, when you're done draining the syrup, just leave the hole, okay?","img":"https://imgs.xkcd.com/comics/tap_that_ass.png","title":"Tap That Ass","day":"19"},{"month":"3","num":399,"link":"","year":"2008","news":"","safe_title":"Travelling Salesman Problem","transcript":"[[There is a linked black web, with a path in red]]\nBrute-force solution:\nO(n!)\n[[The web continues in this one. A man with a hat and a case is drawing it]]\nDynamic programming algorithms: O(n^2 2^n)\n[[Another man, with a hat too, is at a computer, looking back over the chair]]\nSelling on eBay: O(1)\nComputer salesman: Still working on your route?\nDrawing salesman: Shut the hell up.\n{{title text: What's the complexity class of the best linear programming cutting-plane techniques?  I couldn't find it anywhere.  Man, the Garfield guy doesn't have these problems ...}}","alt":"What's the complexity class of the best linear programming cutting-plane techniques?  I couldn't find it anywhere.  Man, the Garfield guy doesn't have these problems ...","img":"https://imgs.xkcd.com/comics/travelling_salesman_problem.png","title":"Travelling Salesman Problem","day":"21"},{"month":"3","num":400,"link":"","year":"2008","news":"","safe_title":"Important Life Lesson","transcript":"Important life lesson: if there's any possibility of sex, do not leave your music library on \"shuffle all.\n[[A woman lies down in a bed, while someone is beneath the bed sheets with the head between her legs. ON the other side of the room, a computer is turned on and playing music]]\nWoman: *GASP* MMMMM_\nComputer: GO GO POWER RANGERS\n{{title text:I didn't even know I *had* the Monty Python 'Lumberjack' song.}}","alt":"I didn't even know I *had* the Monty Python 'Lumberjack' song.","img":"https://imgs.xkcd.com/comics/important_life_lesson.png","title":"Important Life Lesson","day":"24"}]
