[{"month":"3","num":400,"link":"","year":"2008","news":"","safe_title":"Important Life Lesson","transcript":"Important life lesson: if there's any possibility of sex, do not leave your music library on \"shuffle all.\n[[A woman lies down in a bed, while someone is beneath the bed sheets with the head between her legs. ON the other side of the room, a computer is turned on and playing music]]\nWoman: *GASP* MMMMM_\nComputer: GO GO POWER RANGERS\n{{title text:I didn't even know I *had* the Monty Python 'Lumberjack' song.}}","alt":"I didn't even know I *had* the Monty Python 'Lumberjack' song.","img":"https://imgs.xkcd.com/comics/important_life_lesson.png","title":"Important Life Lesson","day":"24"},{"month":"3","num":401,"link":"","year":"2008","news":"","safe_title":"Large Hadron Collider","transcript":"The Large Hadron Collider, CERN...\nWoman: Okay, moment of truth. <<click>>\n<<VVVVVRRMMMMM>>\nMan: Do you see the Higgs Boson?\nWoman: Nope.\nMan: Huh.\nWoman: Well, then.\nMan: Until the theorists get back to us, wanna try hitting pigeons with the proton stream?\nWoman: Already on it. Cool! I just gave a helicopter cancer.\n{{Alt text: When charged particles of more than 5 TeV pass through a bubble chamber, they leave a trail of candy.}}","alt":"When charged particles of more than 5 TeV pass through a bubble chamber, they leave a trail of candy.","img":"https://imgs.xkcd.com/comics/large_hadron_collider.png","title":"Large Hadron Collider","day":"26"},{"month":"3","num":402,"link":"","year":"2008","news":"","safe_title":"1,000 Miles North","transcript":"[[Van and truck travel toward mountains]]\nNarrator: 1,000 miles north of tornado alley\nNarrator: a new breed of scientists has emerged.\n[[Man with a laptop, woman with a probe in the ground]]\nNarrator: Half researchers, half adrenaline junkies\nWoman: What's the reading?\nMan: 3.9 meters down, gradient's off the charts!\n[[Truck driving very fast, man holding a radio up to his head]]\nNarrator: risking everything for the thrill of the hunt\nMale: The freeze line is shifting! We've never seen anything like it!\n[[4 - Barren field, mountains in background, woman holding large video camera up to tiny spot of grass]]\nNarrator: Permafrost chasers\nFemale: I'm getting some great footage here!\nRadio: Dammit, Harding, it's not worth your neck! Get the hell out of there!\n{{Title Text: Twister would've been a much better movie if they'd cut out the bad-guy storm chaser and all the emotional romance crap.  All you need for a good movie are tornados and scientists.  Actually, that's all you need for anything.}}","alt":"Twister would've been a much better movie if they'd cut out the bad-guy storm chaser and all the emotional romance crap.  All you need for a good movie are tornados and scientists.  Actually, that's all you need for anything.","img":"https://imgs.xkcd.com/comics/1000_miles_north.png","title":"1,000 Miles North","day":"28"}]
