[{"month":"4","num":405,"link":"","year":"2008","news":"XKCD updates every Monday, Wednesday, and Friday.<br />Previously: <a href=\"https://xkcd.com/374/\">Journal</a> and <a href=\"https://xkcd.com/377\">Journal 2</a>","safe_title":"Journal 3","transcript":"[[Two women ice-skating outside]]\nBlonde: Wait up!\nBrunette (wearing Hat Guy's Hat): Skate faster!\n[[Brunette sees cracking ice]] \n<<Crack>> <<Crack>>\n[[Brunette on chunk of ice broken off]] \n<<Crack>> <<Rumble>>\n[[Submarine dorsal fin emerging]]\n<<Awooga>>\n[[Hat Guy (minus hat) coming out of door]]\nHat Guy: Hi.  \nHat Guy: That's my hat you're wearing.\nBrunette (wearing Hat Guy's Hat):  So, you found me after all.\nHat Guy (out of frame): You didn't make it easy.\nHat Guy: You saw through me, all right.  But not quite well enough.\nHat Guy: Because if you wanted to stay lost forever, you made one mistake\n[[Hat Guy sliding down a sheet of ice]]\nHat Guy: You took my hat.\n[[Hat Guy swipes hat off of Brunette]]\n[[Hat Guy puts it on his head while sliding]]\nHat Guy: You took my hat.\nHat Guy: I LIKE my hat.\n[[Hat guy walking away]]\n[[Brunette left standing there]]\n{{title text: Oh, and, uh, if the Russian government asks, that submarine was always there.}}","alt":"Oh, and, uh, if the Russian government asks, that submarine was always there.","img":"https://imgs.xkcd.com/comics/journal_3.png","title":"Journal 3","day":"2"},{"month":"4","num":406,"link":"","year":"2008","news":"","safe_title":"Venting","transcript":"[[Above frame]]  When I need to blow off steam, I find a particularly stupid blog comment and reply with an exhaustively researched word-by-word rebuttal, which I sign \"Summer Glau\".\n[[Guy sitting at computer typing away]] ... In conclusion, on examining the above post by CrackMonkey74, after carefully working my way through the haze of spelling errors (documented in section 3), abuse of capitalization (section 4), and general crimes against grammar and syntax (sections 7-8), I have demonstrated that, beneath it all, the work betrays the author's staggering ignorance of the history and the workings of our electoral system.  While the author's wildly swerving train of thought did at one point flirt with coherence, this brief encounter was more likely a chance event (see statistical analysis in table 5) than a result of even rudimentary lucidity.\n     -Summer Glau\nP.S. Don't forget to check out the next season of the Sarah Connor Chronicles this fall on Fox!\n{{title text: P.P.S. I can kill you with my brain.}}","alt":"P.P.S. I can kill you with my brain.","img":"https://imgs.xkcd.com/comics/venting.png","title":"Venting","day":"4"},{"month":"4","num":407,"link":"","year":"2008","news":"","safe_title":"Cheap GPS","transcript":"[[Guy driving down the road, with a GPS reading \"COLD\"]] \nGPS: COLD... WARM... HOT! COLD...\n{{title text: In lieu of mapping software, I once wrote a Perl program which, given a USB GPS receiver and a destination, printed 'LEFT' 'RIGHT' OR 'STRAIGHT' based on my heading.}}","alt":"In lieu of mapping software, I once wrote a Perl program which, given a USB GPS receiver and a destination, printed 'LEFT' 'RIGHT' OR 'STRAIGHT' based on my heading.","img":"https://imgs.xkcd.com/comics/cheap_gps.png","title":"Cheap GPS","day":"7"},{"month":"4","num":408,"link":"","year":"2008","news":"","safe_title":"Overqualified","transcript":"[On phone] \nGirl: I know you're not that into my sister, but she's really crushing on you.\nBoy: Yeah, it's awkward.\nGirl: She's in a rough spot.  It's a lot to ask, but could you take her out and ... dissuade her, without rejecting her?\nBoy: Wait a second.  Are you asking me to show her a mediocre time?\nGirl: I know it's a weird--\nBoy: [Raising index finger.] No, no! This is the mission I was _born_ for.\nGirl: I figured you could handle it.\nBoy: One of my classic high-school dates coming up!\nGirl: Oh God.  Don't overdo it.\n[Alt text: To anyone I've taken on a terrible date, this is retroactively my cover story.]","alt":"To anyone I've taken on a terrible date, this is retroactively my cover story.","img":"https://imgs.xkcd.com/comics/overqualified.png","title":"Overqualified","day":"9"},{"month":"4","num":409,"link":"","year":"2008","news":"","safe_title":"Electric Skateboard (Double Comic)","transcript":"[[Guy showing off electric skateboard to girl reading something]]\nGuy: Check it out! An electric longboard!\nGirl: Sweet!\n[[Guy riding longboard with girl sitting onboard -- people in background]]\nLongboard: <<RRRR>>\n[[Girl turned around on longboard]]\nGirl: I feel like we're missing something...\nGuy: Yeah...\n[[Guy throwing 3 green Koopa Troopa shells; girl throwing 1 red Koopa Troopa shell -- like Mario Kart]]\n<<Music Playing>>\nLongboard: <<RRRR>>\n\n[[Guy and girl still on longboard, going up an incline]]\nGuy: Skating uphill like this is amazing.  Years of gliding downhill and pushing uphill, and now suddenly it's gliding both ways.\nLongboard: <<RRRR>>\n[[Guy and girl after passing an S-curve and boulder]]\nGuy: It's like going from C to Python.  You don't realize how much time you were spending on the boring parts until you don't have to do them anymore.\nGirl: But coding C or assembly makes you a better programmer.  Maybe the boring parts build character.\n[[Guy and girl on longboard...]]\nGuy: Yeah... but it depends how you want to spend your life.  See, my philosophy is --\n[[Longboard get into an accident]]\n<<*WHAM*>>\n[[Calvin and Hobbes laying down in the grass near the guy and girl laying down on the grass -- Calin and Hobbes's wagon is on the path, as is the longboard -- all characters seeing stars]]\n{{Title text: Unsafe vehicles, hills, and philosophy go hand in hand.}}","alt":"Unsafe vehicles, hills, and philosophy go hand in hand.","img":"https://imgs.xkcd.com/comics/electric_skateboard_double_comic.png","title":"Electric Skateboard (Double Comic)","day":"11"},{"month":"4","num":410,"link":"","year":"2008","news":"","safe_title":"Math Paper","transcript":"Lecturer: In my paper, I use an extension of the divisor function over the Gaussian integers to generalize the so-called \"friendly numbers\" into the complex plane. [[Points to equations on the board]]\nGuy in room: Hold on.  Is this paper simply a build-up to an \"imaginary friends\" pun?\n[[Lecturer stands speechless]]\nLecturer: It MIGHT not be.\nGuy in room: I'm sorry, we're revoking your math license.\n{{Alt: That's nothing. I once lost my genetics, rocketry, and stripping license in a single incident.}}","alt":"That's nothing.  I once lost my genetics, rocketry, and stripping licenses in a single incident.","img":"https://imgs.xkcd.com/comics/math_paper.png","title":"Math Paper","day":"14"},{"month":"4","num":411,"link":"","year":"2008","news":"","safe_title":"Techno","transcript":"[[Guy looking over girl's shoulder while girl is clicking her mouse with her other hand on her chin]]\nGuy: Wait, you're buying techno on iTunes?\nGirl: Yeah. So?\nGuy: Couldn't you just loop the 15-second free sample 20 times and get basically the same thing?\n{{title text: I don't know what's worse -- that there exists broken-hard-drive-sound techno, or that it's not half bad.}}","alt":"I don't know what's worse -- that there exists broken-hard-drive-sound techno, or that it's not half bad.","img":"https://imgs.xkcd.com/comics/techno.png","title":"Techno","day":"16"},{"month":"4","num":412,"link":"","year":"2008","news":"","safe_title":"Startled","transcript":"[[Man and woman standing to one side, looking and pointing at guy in black hat who is facing away.]]\n[[Woman sneaks up on Black Hat Guy.]]\n[[Close-up of woman with hands raised.]]\nWoman: Boo!\n[[Black Hat Guy looks shocked, and his hat jumps.]]\n[[The hat falls down over his head.]]\n[[The hat keeps falling, with only his legs still visible.]]\n[[The hat hits the ground.]]\n<<FWUMP>>\n[[Man and woman look at the hat.]]\n[[The hat scurries away.]]\n<<SCOOCH SCOOCH SCOOCH>>\n{{title text: ...}}","alt":"...","img":"https://imgs.xkcd.com/comics/startled.png","title":"Startled","day":"18"},{"month":"4","num":413,"link":"","year":"2008","news":"","safe_title":"New Pet","transcript":"[[Girl is placing EEE PC inside hamster ball. Guy scratches head]]\nGuy: What are you doing?\nGirl: Mounting your EEE PC in a hamster ball.\nGirl: Well, the TCO of a cat is like $1000\nyear, so we're saving money.\n[[Guy is typing]]\nGirl: Microcontrollers are all wired up. How's the brain coming?\nGuy: I've taught it obstacle avoidance and blogging.\nGuy: Aww, look, it's making friends with the Roomba.\"\n<<EEE PC: RRRRR>>\n<<Roomba: Beep!>>\nDiagram: Webcam, RF links, bearings, omni wheels, magnets, EEE PC, omni wheels, battery\n[[Hamster ball bounces down flight of stairs]]\n<<Hamster ball: Bonk, bonk>>\nOff-panel: Man, I hope it's OK that we're laughing at this.\n[[Girl picks up ball]]\nGirl: I think my mothering instinct took a wrong turn somewhere.\nGuy: You mean an awesome turn.\n[[Guy is typing]]\nGirl: Too bad we can't give it a soul.\nGuy: Sure we can. \nGuy types: import soul\nGirl: Oh, right. Python.\n{{Title text: ONE LAPTOP PER HAMSTER}}","alt":"ONE LAPTOP PER HAMSTER!","img":"https://imgs.xkcd.com/comics/new_pet.png","title":"New Pet","day":"21"},{"month":"4","num":414,"link":"","year":"2008","news":"","safe_title":"Mistranslations","transcript":"[A bed sits on the ground in the middle of the frame. At the left of the frame, a man stands atop a skateboard jump ramp twice his height, one foot on the back of a skateboard poised over the coping. At the bottom of the ramp is a small kicker ramp which will launch him over the bed. A woman to the right of the frame stands on the roof of a house grasping a rope which is affixed directly over the bed. They are both poised to begin their motion.]\nOur copy of the Kama Sutra has a couple mistranslations.\nWhich we refuse to fix.\n{{Alt: Oh, I think this word might mean 'Crisco'!}}","alt":"Oh, I think this word might mean 'Crisco'!","img":"https://imgs.xkcd.com/comics/mistranslations.png","title":"Mistranslations","day":"23"},{"month":"4","num":415,"link":"","year":"2008","news":"","safe_title":"Restraining Order","transcript":"[[Man and woman stand facing one another. Both hold sheets of paper.]]\nText reads: Not content with normal restraining orders, my ex got creative.\nMan: Wait... I can't get closer than 500 yards of you... or more than 600 yards away?\nWoman: You'll have to move somewhere within this ring.\n{{title text: On Mondays I go running, so you'll have to get up early and follow along a parallel street. What fun!}}","alt":"On Mondays I go running, so you'll have to get up early and follow along on a parallel street.  What fun!","img":"https://imgs.xkcd.com/comics/restraining_order.png","title":"Restraining Order","day":"25"},{"month":"4","num":416,"link":"","year":"2008","news":"","safe_title":"Zealous Autoconfig","transcript":"[[Guy sitting on a chair with his laptop in his lap]]\nLaptop: Starting WiFi autoconfig... searching for WiFi... Found no open networks.\nLaptop: Found secure net SSID \"Lenhart Family\"\nLaptop: Trying common passwords... Failed.  Checking for WEP Vulnerabilities...\nGuy: Um.\nLaptop: None found.\n[[Guy still sitting with laptop in his lap, but hand is on chin.  Phone on table across room starts vibrating]]\nLaptop: Connecting to Bluetooth phone... Calling local school... Found Lenhart children.\n[[Guy furiously typing on his laptop]]\nLaptop: Notifying field agents.  Children acquired.  Calling Lenhart parents.  Negotiating for WiFi password...\n<<CTRL-C  CTRL-C>>\n{{Title text: I hear this is an option in the latest Ubuntu release.}}","alt":"I hear this is an option in the latest Ubuntu release.","img":"https://imgs.xkcd.com/comics/zealous_autoconfig.png","title":"Zealous Autoconfig","day":"28"},{"month":"4","num":417,"link":"","year":"2008","news":"","safe_title":"The Man Who Fell Sideways","transcript":"[[A man standing, with a dotted line perpendicular to him and a 30 degree angle going downwards]]\nNarrator: From a young age, gravity pulled him wrong.\n[[The same man bouncing around his house]]\nNarrator: Sometimes east, sometimes west.  When he was restrained, it grew erratic.\n<WHAM> <WHAM>\n[[Man bouncing\nrolling on the ground]]\nNarrator: So he fell.\nMan: AAAA\n<THUMPA> <THUMPA>\n[[Man bouncing\nrolling on the ground in a desert]]\nNarrator: Constantly\nMan: AAAAAAAAA\n[[Man bouncing\nrolling off a rock on the ground in a desert]]\nNarrator: Over land...\nMan: AAAAA-<THUD>-A\n[[Man bouncing\nrolling on the ground in the desert]]\nMan: AAAAAAAAA\n[[Man bouncing\nrolling on the ground in the desert]]\nMan: A-<THUD>-AAAAAA\n[[Man bouncing\nrolling on the ground in the desert]]\nMan: AA-<THUD>-AAAAA\n[[Man under the surface of a body of water]]\nNarrator: And sea.\nMan: AAAAAAAAAAAA\n[[Man still under the surface of a body of water]]\nMan: AAAAAAAA\n[[Man temporarily standing on the surface of the body of water]]\nMan: AAAAAA\n[[Man under the surface of the body of water]]\nMan: AAAAAAAA\n[[Tree in the savanna, with the man off the panel]]\nNarrator: He found, where he could, food-\nMan: AAAAAAAAAAAA\n[[Tree in the savanna, with the man still off the panel, but zoomed out so that part of the man's bounce\nroll path is visible]]\nMan: AAAAAAAAA\n[[Man upside-down, still bouncing\nrolling in the savannah, with a gazelle galloping away from him]]\n<GALLOP> <GALLOP>\nMan: AAAAAAAAA\n[[Savanna with a tree in it]]\nMan: AAAAAAAAAAA\n[[Woman standing, with the man off screen]]\nNarrator: And love.\nMan: AAAA-<THUD>-AAAA\n[[Woman standing, with the man off screen]]\nMan: <THUD> ACK <CRASH>\n[[Man crashing into woman]]\nWoman: Hiwhat'syourname-\n<WHAM>\n[[Woman on the ground, with the man off screen]]\nMan: AAAAAAA-<THUD>-AAA\n[[Woman speaking to another man]]\nWoman: I met this guy.  He knocked me over and tumbled into the distance.\n[[Woman speaking to the same man from the previous panel, with the man's hand to his mouth]]\nWoman: We only shared a few seconds, but in his panicked scream I heard something beautiful.\n[[Woman speaking to the same man from the previous panel]]\nWoman: I think... I think I'm...\n[[Woman speaking to the same man from the previous panel]]\nMan: Falling for him?\nWoman: I wasn't going to say it.\n[[Woman at hospital with doctor, giving birth]]\nNarrator: She never saw him again.  But nine months later...\nDoctor: Okay, push!\n[[Woman at hospital with doctor and new baby, who is bouncing\nrolling away]]\nDoctor: It's a gir-\nWoman: !!\nDoctor: Whoops!\nBaby: Ga! Ga!\n[[Baby bouncing\nrolling out of hospital]]\nBaby: WHEEEEEEEEEEEEE\n[[Baby bouncing\nrolling in front of a sunset]]\nBaby: EEEEEEEEEEEEEEEEEEE\nNarrator: The End\n{{alt text: Strip originally conceived in conversation with Jeph Jacques.  Soon to be a major motion picture.}}","alt":"Strip originally conceived in conversation with Jeph Jacques.  Soon to be a major motion picture.","img":"https://imgs.xkcd.com/comics/the_man_who_fell_sideways.png","title":"The Man Who Fell Sideways","day":"30"},{"month":"5","num":418,"link":"","year":"2008","news":"","safe_title":"Stove Ownership","transcript":"[[Hand-drawn Graph is shown, on the Y axis, My Overall Health, on the X axis, Time.  Graph is generally steady through 3\n4 of the X axis, where is begins a steady decline, with a label \"The Day I Realized I Could Cook Bacon Whenever I Wanted.\"]]\n{{Title Text: Although maybe it's just a phase, like freshman year of college when I realized I could just buy frosting in a can.}}","alt":"Although maybe it's just a phase, like freshman year of college when I realized I could just buy frosting in a can.","img":"https://imgs.xkcd.com/comics/stove_ownership.png","title":"Stove Ownership","day":"2"},{"month":"5","num":419,"link":"","year":"2008","news":"","safe_title":"Forks and Spoons","transcript":"[[Presenter with pointer stick]] Presenter: A spoon crossed with a fork is a spork.\nOff-panel presenter's voice: Our lab has successfully crossed a spork with a spoon. [[Diagram showing the fractions of fork and spoon in each item.]]\n[Chart showing possible combinations of spoons a forks.]\n[[Presenter in front of audience]] \nPresenter: With your funding, we could create hybrids in proportions corresponding to any binary fraction.\n[[Fork-Spoon Spectrum]]\nAudience member: You're toying with powerful forces here.\nPresenter: We know what we're doing.\nPanel Title: Two weeks later:\n[[Picture of a destroyed lab with two dead bodies, blood everywhere and a spoon-fork hybrid hopping away.]]\n{{title text: Their biggest mistake was bringing Rachel Ray and Emeril to tour the lab and sign off on the project. That's when Spielberg caught wind of it.}}","alt":"Their biggest mistake was bringing Rachael Ray and Emeril to tour the lab and sign off on the project.  That's when Spielberg caught wind of it.","img":"https://imgs.xkcd.com/comics/forks_and_spoons.png","title":"Forks and Spoons","day":"5"},{"month":"5","num":420,"link":"","year":"2008","news":"","safe_title":"Jealousy","transcript":"[[Dark scene shown, with man and girl sitting in the moonlight let in by the only window.]]\nMegan and I first met at a party at her sister's.\nWe hit it off, opened up, shared secrets, and talked about everything. Around us, the party waned, but we hid from sleep together, talking through the deepest hours of the night.\nThe dawn found us curled up on a couch, asleep but still together.\nThat experience, connecting with a stranger and falling recklessly in love is one of life's greatest joys.\nAnd now that you're married, you'll never experience it again.\nIt's the price you pay for everlasting love. It's a small one, but I hope it stings a little.\nAnyway, I wish you and Megan the best. \n...Hey, man, you ASKED me to do a toast.\n{{title text: Oh, huh, so you didn't know that story?]]","alt":"Oh, huh, so you didn't know that story?","img":"https://imgs.xkcd.com/comics/jealousy.png","title":"Jealousy","day":"7"},{"month":"5","num":421,"link":"","year":"2008","news":"","safe_title":"Making Hash Browns","transcript":"[[A person stands holding a flaming tennis racket. He is throwing a potato in the air as if to serve like a tennis ball. Behind him is a red gas can and a sack of potatoes. Across from him is a another person holding a fork in one hand and balancing a serving tray with a glass of orange juice on it.]]\n{{Alt: There are at least fourteen ways this could go badly (seventeen if that fork is a dangerous crossbreed.)}}","alt":"There are at least fourteen ways this could go badly (seventeen if that fork is a dangerous crossbreed.)","img":"https://imgs.xkcd.com/comics/making_hash_browns.png","title":"Making Hash Browns","day":"9"},{"month":"5","num":422,"link":"","year":"2008","news":"","safe_title":"A Better Idea","transcript":"[[A boy wearing a bow tie stands holding hands with a girl wearing a dress.  On the left, there is a sign pointing left, which reads \"PROM\"; on the right, there is a sign pointing right, which reads \"LAN PARTY IN FORMAL ATTIRE\".]]\n{{Alt text: \"It's *almost* enough to make me want to redo high school.\"}}","alt":"It's *almost* enough to make me want to redo high school.","img":"https://imgs.xkcd.com/comics/a_better_idea.png","title":"A Better Idea","day":"12"},{"month":"5","num":423,"link":"","year":"2008","news":"","safe_title":"Finish Line","transcript":"[[Mario and Luigi in go carts, Luigi in the lead]]\nMario: Sometimes I stop right before the finish line.\nLuigi: Why?\n[[Cut to boy and girl playing the video game]]\nGirl: 'Cause I know I've won.\nGirl: It proves I'm playing for fun, on my own terms. That I don't need validation from the machine.\nGirl: That I'm not a rat pulling a lever.\n\nBoy:  ...Man. Good Call. Let's stop and explore the course for a - \n<<Player Two wins>>\nBoy:  Hey!\nGirl:  Ha ha!\nBoy:  Dammit, I'm a sucker for your \"Be a Rebel\" speech.\nGirl:  It's more fun than a blue shell.\n{{Alt text: The question with Lucy and the football was always whether, on some level, she believed the things she said.}}","alt":"The question with Lucy and the football was always whether, on some level, she believed the things she said.","img":"https://imgs.xkcd.com/comics/finish_line.png","title":"Finish Line","day":"14"},{"month":"5","num":424,"link":"","year":"2008","news":"","safe_title":"Security Holes","transcript":"[[Man sitting at computer]]I'll just comment out these lines...\n\nMD_update(&m, buf, j);\n\ndo_not_crash();\n\nprevent_911();\nIn the rush to clean up the debian-openssl fiasco, a number of other major security holes have been uncovered:\nFedora Core: Vulnerable to certain decoder rings\nXandros (EEE PC): Gives root access if asked in a stern voice\nGentoo: Vulnerable to flattery\nOLPC OS: Vulnerable to Jeff Goldblum's Powerbook\nSlackware: Gives root access if user says Elvish word for \"friend\"\nUbuntu: Turns out distro is actually just Windows Vista with a few custom Themes.\n{{title text: True story: I had to try several times to upload this comic because my ssh key was blacklisted.}}","alt":"True story: I had to try several times to upload this comic because my ssh key was blacklisted.","img":"https://imgs.xkcd.com/comics/security_holes.png","title":"Security Holes","day":"16"},{"month":"5","num":425,"link":"","year":"2008","news":"","safe_title":"Fortune Cookies","transcript":"Person 1: \"The ones you love will never let you down\"\nPerson 2: \"Your self-confidence is well placed.\"\nPerson 3: \"Seek nonviolence in everything you do.\"\nInstead of \"In bed\", I've found that fortune cookies are often more improved by appending \"EXCEPT in bed.\"\n{{Alt-text: \"You will have hot, steamy, sweaty sex... IN BED!\"}}","alt":"'You will have hot, steamy, sweaty sex ... IN BED!'","img":"https://imgs.xkcd.com/comics/fortune_cookies.png","title":"Fortune Cookies","day":"19"},{"month":"5","num":426,"link":"http://xkcd.com/geohashing","year":"2008","news":"What is this about?  See the <a href=\"http://wiki.xkcd.com/geohashing/\">wiki</a>.","safe_title":"Geohashing","transcript":"Date (example): 2005-05-26\nThat date's (or most recent) DOW opening: 10458.68\n[[Concatenate, with a hyphen: 2005-05-26-10458.68]]\nmd5: db9318c2259923d08b672cb305440f97\n[[Split it up into two pieces:]]\n0.db9318c2259923d0, 0.8b672cb305440f97\nTo decimal: 0.857713..., 0.544544...\nYour location (example): 37.421542, -122.085589\n[[Combine integer part of location with fractional part of hash:]]\nDestination Coordinates: 37.857713, -122.544544\nSample Implementation: http:\nxkcd.com\ngeohashing\n{{title text: Saturday is game night.}}","alt":"Saturday is game night.","img":"https://imgs.xkcd.com/comics/geohashing.png","title":"Geohashing","day":"21"},{"month":"5","num":427,"link":"","year":"2008","news":"","safe_title":"Bad Timing","transcript":"[[A couple, flying in a hot air balloon]] Man: I like you.  \nI'm just not feeling the relationship.\n[[Floating further in distance]]\nMan: I'm sorry.\n[[Close up of basket]]\nMan: It's just bad timing. Me with my classes, you with your work, the spiders...\nWoman: The what?\n[[Red Spiders crowding onto balloon, causing it to fall]]\n{{title text: Protip: Even without the red spiders, never have that conversation halfway through a balloon ride.}}","alt":"Protip: Even without the red spiders, never have that conversation halfway through a balloon ride.","img":"https://imgs.xkcd.com/comics/bad_timing.png","title":"Bad Timing","day":"23"},{"month":"5","num":428,"link":"","year":"2008","news":"","safe_title":"Starwatching","transcript":"Man: Just look at those stars.\nMan: My father once told me that the great bloggers of the past are up there, watching over us.\n\nMan: High above the blogosphere, a gap opens in the tag clouds.  Cory Doctorow's voice booms forth...\nWoman: You need to get out either more or less.  I can't decide.\n{{title text: I always figured the word 'blog' would sound *less* silly as the years went by.}}","alt":"I always figured the word 'blog' would sound *less* silly as the years went by.","img":"https://imgs.xkcd.com/comics/starwatching.png","title":"Starwatching","day":"26"},{"month":"5","num":429,"link":"","year":"2008","news":"","safe_title":"Fantasy","transcript":"[[A man sits hugging his knees.]]\nMan: If only there were some way we could be together.\n((He fades into a thought bubble containing the next four panels.))\n\n[[A man and woman are in a bed together.  The man is rubbing the woman's shoulders.]]\nWoman: We're so lucky to have each other. How did it happen, anyway?\nMan: I, uh... I don't remember.\n\nWoman: No, really, how did we get together? It's hard to imagine it happening.\nMan: It does strain the bounds of fantasy...\nWoman: ... Fantasy? That's it!\n\nWoman: My God, it's the only explanation: We're objects in some transient fantasy. We'll be gone when it ends!\nMan: We'll lose each other.\nWoman: Oh God.\n\n[[They leap from the bed.  The woman has a flaming torch.]]\nWoman: Well, I'm not going out quietly. I'm burning this fucking world.\nMan: Burn the world!\nWoman: Fire! Fire! Cleanse this hellish place --\n((The thought ends.))\n\n[[The man is puzzled.  What happened?]]\n\n{{Title text: I guess if she accepted irrational realities, she'd hardly be my fantasy.}}","alt":"I guess if she accepted irrational realities, she'd hardly be my fantasy.","img":"https://imgs.xkcd.com/comics/fantasy.png","title":"Fantasy","day":"28"},{"month":"5","num":430,"link":"","year":"2008","news":"","safe_title":"Every Damn Morning","transcript":"[[In background, a vivid dream scene is apparent, including mountains, a zeppelin, a city with a mushroom cloud, and some people interacting]] Inset: Man awakens, very surprised\n[[Dream's edges are fading, mountains, city and zeppelin less clear]]Inset: Man is seen running down stairs.\n[[Zeppelin, city, and mountains are very hazy and unclear. The people can still be seen]] Inset: Man gets attention of girl sitting at breakfast table\n[[Dream has completely faded, the outlines of maybe one person can still be seen]] Inset: Man looks confused\n{{Title Text: There was something about a cup and a sword and a tree and a green hill ...}}","alt":"There was something about a cup and a sword and a tree and a green hill ...","img":"https://imgs.xkcd.com/comics/every_damn_morning.png","title":"Every Damn Morning","day":"30"},{"month":"6","num":431,"link":"","year":"2008","news":"","safe_title":"Delivery","transcript":"[[In a delivery room]]\nDoctor:  There's the head... he's looking at me... Wait, he's crawling back into the womb.\nMother:  What?!\nDoctor:  Yeah, it's the darnedest thing.\nMother: Um, what does it mean?\nDoctor:  My guess?  Six more weeks of winter.\n{{title text: Ma'am, I admit that wasn't in the best taste, but you have to admire my delivery!  Ha ha, get it?  Oh God, don't throw those syringes!  Your baby's fine!}}","alt":"Ma'am, I admit that wasn't in the best taste, but you have to admire my delivery!  Ha ha, get it?  Oh God, don't throw those syringes!  Your baby's fine!","img":"https://imgs.xkcd.com/comics/delivery.png","title":"Delivery","day":"2"},{"month":"6","num":432,"link":"","year":"2008","news":"XKCD updates every Monday, Wednesday, and Friday.<br />Previously: <a href=\"https://xkcd.com/374/\">Journal</a>","safe_title":"Journal 4","transcript":"[[The man with the hat sits slumped over on a bench, holding his hat]]\nMan with hat: Sigh\n{{alt text: Man, this emo shit was supposed to be for people who didn't have hats.}}","alt":"Man, this emo shit was supposed to be for people who didn't have hats.","img":"https://imgs.xkcd.com/comics/journal_4.png","title":"Journal 4","day":"4"},{"month":"6","num":433,"link":"","year":"2008","news":"XKCD updates every Monday, Wednesday, and Friday.<br />Previously: <a href=\"https://xkcd.com/374/\">Journal</a>","safe_title":"Journal 5","transcript":"Guy with hat: <<park>>\nGuy with hat: <<knock knock>>\nGuy with hat: hi\nTrain girl: hi\nGuy with hat: I give up. you win. I have to know who you are.\nGuy with hat: We understand each other. I can't let that slip away.\nTrain girl: <<beep>>\n<<BOOM>>\nGuy with hat: What was that?!\nTrain girl: Remote mines under your car.\nGuy with hat: Oh, those? I moved them to your garage before knocking.\nTrain girl: Touché\nGuy with hat: ...This relationship is going to be tricky.\nTrain girl: There's still time to leave and find a non-crazy girl.\nGuy with hat: Not even slightly interested.\n{{Alt text: 'Pick you up at eight?' 'Nine. I've got to re-mine the driveway.'}}","alt":"'Pick you up at eight?' 'Nine.  I've got to re-mine the driveway.'","img":"https://imgs.xkcd.com/comics/journal_5.png","title":"Journal 5","day":"6"},{"month":"6","num":434,"link":"","year":"2008","news":"","safe_title":"xkcd Goes to the Airport","transcript":"[[Standing outside the Airport. There is a sign saying \"Airport\" and a plane in the background.]]\nGirl: Okay, what airline?\nGuy: I'm following you.\nGirl: ...I'm following *you*.\nGuy: I assumed we were walking to the bakery.\nGirl: You always assume that!\n[[Presumably the security checkpoint]]\nSecurity Guy: Lockpicks? These are... illegal, actually. Where did you get them?\nGuy: Oh man, it all started with this hacker girl.\nSecurity Guy: You need to come with -\nGuy: Sure, sure. But man, let me tell you about her!\n[[On a plane]]\nAnnouncement: If your device has a \"Transmit\" function, please disable it.\nGuy: Okay - hang on, I'm half way through the iwconfig man page.\n[[Security checkpoint]]\nSecurity guy: Sir, is this container under three ounces?\nGuy with hat: Not sure, how much blood is there in a churchmouse?\nSecurity guy: Why don't you just go.\n{{Alt text: Under three ounces, but it stains panties.}}","alt":"Under three ounces, but it stains panties.","img":"https://imgs.xkcd.com/comics/xkcd_goes_to_the_airport.png","title":"xkcd Goes to the Airport","day":"9"},{"month":"6","num":435,"link":"","year":"2008","news":"","safe_title":"Purity","transcript":"[[Texts reads 'Fields arranged by purity'. An arrow is shown pointing right with the text 'more pure'. Six people are shown representing six scientific fields. They stand on a scale of purity with the left end representing less purity and the right representing more purity. They appear in this order, from left to right: Sociology, Psychology, Biology, Chemistry, Physics, Mathematics. The mathematician stands much further to the right than any other field.]]\nPsychologist: Sociology is just applied Psychology.\nBiologist: Psychology is just applied Biology.\nChemist: Biology is just applied Chemistry\nPhysicist: Which is just applied Physics. It's nice to be on top.\nMathematician: Oh, hey, I didn't see you guys all the way over there.\n{{Alt-text: On the other hand, physicists like to say physics is to math as sex is to masturbation.}}","alt":"On the other hand, physicists like to say physics is to math as sex is to masturbation.","img":"https://imgs.xkcd.com/comics/purity.png","title":"Purity","day":"11"},{"month":"6","num":436,"link":"","year":"2008","news":"","safe_title":"How it Happened","transcript":"[[Two people standing]]\nPerson 1: Then she put her hands over mine, grinds against me, leans down and whispers, \"After tonight, we go and live our lives, no regrets. But I want this, I want you, one last time.\"\nPerson 2:{{Giving a thumbs up, pointing, surrounded by action lines}}That's what SHE said!\n[[Both continue to stand]]\nPerson 1: Yes.  Yes, it is.\n[[Both continue to stand]]\n{{Alt text: I was there, dude.}}","alt":"I was there, dude.","img":"https://imgs.xkcd.com/comics/how_it_happened.png","title":"How it Happened","day":"13"},{"month":"6","num":437,"link":"","year":"2008","news":"","safe_title":"SUV","transcript":"My Hobby:\nRenting an SUV and confusing the hell out of hybrid owners\n[[A man is pumping gas into a Prius at a gas station. The prices can be seen in the background, and read:]]\n$4.08\nM: $4.38\nP: $4.51\nD: $4.85\n[[Another man drives up alongside in an SUV and leans out the window]]\nSUV Driver: Check out those prices! Your Prius ain't looking so smart now, huh?\nPrius Driver: It's ... wait, what?\nSUV Driver: Maybe you'll go green next time, asshole!\n{{ Title text: Electric skateboards, by cost, get the equivalent of about 300 miles per gallon. Lithium batteries just need to get cheaper. }}","alt":"Electric skateboards, by cost, get the equivalent of about 300 miles per gallon.  Lithium batteries just need to get cheaper.","img":"https://imgs.xkcd.com/comics/suv.png","title":"SUV","day":"16"},{"month":"6","num":438,"link":"","year":"2008","news":"","safe_title":"Internet Argument","transcript":"[[Stick figure 1 is typing profanities into his computer]]\n[[Stick figure 2 is typing profanities into his computer]]\n[[A floating girl comes behind stick figure 1]]\n[[The girl lifts stick figure 1]]\n[[They are flying over mountains]]\n[[The girl and stick figure 1 are floating in front of stick figure 2 and his computer]]\n[[She sets stick figure 1 down in front of stick figure 2 and his computer]]\n[[The girl lifts stick figure 1 again]]\n[[They are flying]]\n[[The girl sets stick figure 1 down in his chair at his computer]]\n[[Stick figure 1 is typing at his computer]]\n[[Stick figure 2 is typing at his computer]]\n{{title text: It's easier to be an asshole to words than to people.}}","alt":"It's easier to be an asshole to words than to people.","img":"https://imgs.xkcd.com/comics/internet_argument.png","title":"Internet Argument","day":"18"},{"month":"6","num":439,"link":"","year":"2008","news":"","safe_title":"Thinking Ahead","transcript":"[[My Problem: Thinking Ahead]]\nMan: She's cute.\nWoman: This food is problematic.\nMan: Oh man, she's quoting Firefly.\nMan: It's the perfect opening. But wait. I'm moving in the fall. If we hit it off, how will I deal with that?\nMan: I don't want to ask her to derail her plans. And with things unresolved with Megan, can I really commit enough to make that kind of decision?\nMan: Oh God.\nMan: Gotta get out.\nMan: The window.\n<<CRASH>>\n{{Alt text: Did he just go crazy and jump out the window?}}","alt":"Did he just go crazy and jump out the window?","img":"https://imgs.xkcd.com/comics/thinking_ahead.png","title":"Thinking Ahead","day":"20"},{"month":"6","num":440,"link":"","year":"2008","news":"","safe_title":"Road Rage","transcript":"[[Man in black hat is driving and and the woman who seems to be his equal is in the passenger's seat.  They are closely followed by some other vehicle.]]\nMan in black hat: That guy's tailgating me.\nWoman: I'll take a look.\nWoman: His laptop's running, probably in the back seat. And... yup, the WiFi autoconnects.\nWoman: Now we just scan for remote exploits... install speech synth...\nWoman: and take a shot in the psychological dark.\nLaptop: Hello.\nTailgating man: What? Who's there?\nLaptop: She'd be alive if it weren't for you.\nTailgating man: ... Oh God.\n{{Title: Okay, now just as the loss hits him, slam on the brakes.}}","alt":"Okay, now just as the loss hits him, slam on the brakes.","img":"https://imgs.xkcd.com/comics/road_rage.png","title":"Road Rage","day":"23"},{"month":"6","num":441,"link":"","year":"2008","news":"","safe_title":"Babies","transcript":"It doesn't seem right that we're old enough to have kids.\nGirl: Sweet!  We made a baby!\nBoy: Are we sure we did it right?\nBoy: We should disassemble it, check all the parts, and put it back together.\n{{alt-text: I bet my future kids will read this someday.  DEAR FUTURE KIDS: how did you get internet in the cellar?}}","alt":"I bet my future kids will read this someday.  DEAR FUTURE KIDS: how did you get internet in the cellar?","img":"https://imgs.xkcd.com/comics/babies.png","title":"Babies","day":"25"},{"month":"6","num":442,"link":"","year":"2008","news":"XKCD updates every Monday, Wednesday, and Friday.<br />See: <a href=\"https://www.youtube.com/watch?v=at_f98qOGY0\">Original Discovery Channel video</a>","safe_title":"xkcd Loves the Discovery Channel","transcript":"{{The comic is in parody of the Discovery Channel commercial showing various clips of people singing a song with the chorus line \"Boom De Yada\"}}\n{{The comic is divided into a grid of 4 by 6 panels, each depicting a character or situation from a previous XKCD strip}}\n{{In each panel is written a part of a song similar to the song from the Discovery Channel commercial}}\nPanel 1: (Reference Comic 162)\n[[woman spinning around]]\nI love momentum.\nPanel 2: (Reference Comic 413)\n[[woman laying on floor tinkering with EEE PC hamster ball robot]]\nI love to engineer.\nPanel 3: (Reference Comic 452)\n[[man with beret standing in bakery holding a loaf of bread in each hand, sign with \"PIE!\" in background]]\nI love this bakery!\nPanel 4: (Reference Comic 239)\n[[man with goggles and red cape (Cory Doctorow) flying superman-style]]\nI love the blogosphere!\nPanel 5: (Reference Comic 152)\n[[man running in large hamster ball]]\nI love the whole world\nPanel 6:\n[[depiction of internet sludge (4chan \nb\n-Random)]]\nAnd all its messed-up folks.\nPanel 7: (Reference Comic 150)\n[[man and woman immersed in playpen balls]]\nBoom De Yada\nBoom De Yada\nPanel 8:\n[[mass of playpen balls with speech \"I put on my robe and wizard hat\" originating from it]]\nBoom De Yada\nBoom De Yada\nPanel 9: (Reference Comic 72)\n[[black hat man taking gift away from kid with party hat]]\nI love your suffering.\nPanel 10: (Reference Comic 153)\n[[diagram showing RSA fingerprint authentication between two people]]\nI love cryptography.\nPanel 11: (Reference Comic 230)\n[[man and woman in bed covered by red sheet]]\nI love entangled sheets.\nPanel 12: (Blag)\n[[man hanging from kite string holding camera]]\nAnd kite photography.\nPanel 13: (Reference Comic 256)\n[[map of the internet]]\nI love the whole world\nPanel 14: (Reference Comic 8)\n[[cube with red spider on top]]\nAnd all its mysteries.\nPanel 15: (Reference Comic 303)\n[[two people sword-fighting on rolling office chairs]]\nBoom De Yada\nBoom De Yada\nPanel 16: (Reference Comic 263)\n[[class room with two students and female teacher]]\nBoom De Yada\nBoom De Yada\nPanel 17:\n[[man saying \"Barack me Obamadeus!\" to another man speaking energetically at a podium]]\nI love elections.\nPanel 18:\n[[man holding schematic diagram depiction of transistor in front of his crotch]]\nI love transistors.\nPanel 19: (Reference Comic 69)\n[[man and woman in bed, man saying \"There must be taft slash fiction\"]]\nI love weird pillow talk.\nPanel 20: (Reference Comic 49, 279, 317)\n[[man speaking to woman]]\nI love your sister.\nPanel 21: (Reference Comic 249)\n[[roller coaster with person in front car holding chess board and thinking about a move]]\nI love the whole world.\nPanel 22: (Reference Comic 167)\n[[man with beret standing in the midst of leafless trees]]\nThe future's pretty cool!\nPanel 23: (Reference Comic 108)\n[[woman moving toward man by means of MC Hammer slide]]\nBoom De Yada\nBoom De Yada\nPanel 24: (Reference Comic 409)\n[[man and woman moving on electric skateboard]]\nBoom De Yada\nBoom De Yada\n{{Alt text: I love the title-text!}}","alt":"I love the title-text!","img":"https://imgs.xkcd.com/comics/xkcd_loves_the_discovery_channel.png","title":"xkcd Loves the Discovery Channel","day":"27"},{"month":"6","num":443,"link":"","year":"2008","news":"","safe_title":"Know Your Vines","transcript":"Virginia Creeper: Vines useful as impromptu rope\nPoison Ivy: Grows in same habitat as Virginia Creeper\nGirlfriend: Into light bondage\nArea around campsite: Too dark to see\nRelationship after camping trip: Strained\n{{title text: Friggin' modern tents don't have a single piece of rope.}}","alt":"Friggin' modern tents don't have a single piece of rope.","img":"https://imgs.xkcd.com/comics/know_your_vines.png","title":"Know Your Vines","day":"30"},{"month":"7","num":444,"link":"","year":"2008","news":"","safe_title":"Macgyver Gets Lazy","transcript":"[[Outside of a building with a door marked No Entry and a guard standing outside, Character 1 and Macgyver are hiding]]\nCharacter 1: Any ideas?\nMacgyver: I can use the trigger mechanism of this gun to ignite a small explosive charge, propelling a metal slug into the guard's head.\n{{Alt text: At the time of this writing, Wikipedia has a wonderful article titled 'List of problems solved by Macgyver'}}","alt":"At the time of this writing, Wikipedia has a wonderful article titled 'List of problems solved by Macgyver'.","img":"https://imgs.xkcd.com/comics/macgyver_gets_lazy.png","title":"Macgyver Gets Lazy","day":"2"},{"month":"7","num":445,"link":"","year":"2008","news":"","safe_title":"I Am Not Good with Boomerangs","transcript":"[[Man Throws a Boomerang]]\n[[Man gets hit in the face with the Boomerang]]\n[[Man Throws a Boomerang again]]\n[[Man is seen running away from 6 returning boomerangs]]\n[[Man Throws Boomerang]]\n[[Man barely avoids floating shark, trying to bite him]]\n[[Man Throws Boomerang]]\n[[Man is confronted by his presumed girlfriend]]\nGirl: I'm Leaving You.\n{{Title Text: Bonus strip: just read the rightmost panels straight down. }}","alt":"Bonus strip: just read the rightmost panels straight down. ","img":"https://imgs.xkcd.com/comics/i_am_not_good_with_boomerangs.png","title":"I Am Not Good with Boomerangs","day":"4"},{"month":"7","num":446,"link":"","year":"2008","news":"","safe_title":"In Popular Culture","transcript":"[[A fictional screen capture of the Wikipedia article for \"wood\" is shown]]\nWood is a hard, fibrous tissue found in many plants. It has been used for centuries for both fuel and as a construction material for [[cut in page]]\nIn popular culture:\nIn episode 6 of Firefly, \"Our Mrs. Reynolds,\" Jayne is given a wooden rain stick by a villager\nIn the Buffyverse, Buffy often slays Vampires using stakes made of wood.\nThe wand used by Harry Potter is made of wood from a holly tree.\nThe fence around the back yard of the house in The Simpsons is wooden.\nIn the 2004 TV series Battlestar Galactica [[rest of page is cut]]\n{{Title Text: Someday the 'in popular culture' section will have its own article with an 'in popular culture' section.  It will reference this title-text referencing it, and the blogosphere will implode.}}","alt":"Someday the 'in popular culture' section will have its own article with an 'in popular culture' section.  It will reference this title-text referencing it, and the blogosphere will implode.","img":"https://imgs.xkcd.com/comics/in_popular_culture.png","title":"In Popular Culture","day":"7"},{"month":"7","num":447,"link":"","year":"2008","news":"","safe_title":"Too Old For This Shit","transcript":"[[Two Boys standing somewhere]]\nBoy1: I wish I could do math like when i was young.\nBoy2: Huh?\nBoy1: It doesn't come easy like it once did.\nBoy2: Uh huh.\nBoy1: Math is a game for the young. I need to sit back and let the future happen.\nBoy2: You're thirteen.\nBoy1: Yes, and it's time I accept that.\n{{Title Text: They say if a mathematician doesn't do their great work by age eleven, they never will. }}","alt":"They say if a mathematician doesn't do their great work by age eleven, they never will.","img":"https://imgs.xkcd.com/comics/too_old_for_this_shit.png","title":"Too Old For This Shit","day":"9"},{"month":"7","num":448,"link":"","year":"2008","news":"","safe_title":"Good Morning","transcript":"[[A drowsy man walks over to another man on a computer]]\nMan 1: *Yawn* Good morning from Taipei.\nMan 2: You're drifting west. You were in Honolulu just yesterday.\nNarrator: Our sleep schedules are so messed up that's it's easiest to just refer where are internal clocks seem to be.\n{{title text: As my standard, I use going to sleep at midnight and waking up at 8 AM.}}","alt":"As my standard, I use going to sleep at midnight and waking up at 8 AM.","img":"https://imgs.xkcd.com/comics/good_morning.png","title":"Good Morning","day":"11"},{"month":"7","num":449,"link":"","year":"2008","news":"","safe_title":"Things Fall Apart","transcript":"girl: I wonder about us.\nboy: I love you.\ngirl: We don't have fun together.\nboy: I love you.\ngirl: it's like we're clinging to the \"relationship\" framework like it's all we got.\nboy: I love you\ngirl: who are you trying to reassur-\nboy: I love you I love you I love you I love you\n{{Alt: 'I'm nothing without you' is a fucked up sentiment.}}","alt":"'I'm nothing without you' is a fucked-up sentiment.","img":"https://imgs.xkcd.com/comics/things_fall_apart.png","title":"Things Fall Apart","day":"14"},{"month":"7","num":450,"link":"","year":"2008","news":"","safe_title":"The Sea","transcript":"[[The narrator stands on a beach at night, staring out across the moonlit ocean]]\nNarrator: THE SEA ALWAYS MAKES ME REALIZE\nNarrator: HOW SMALL I REALLY AM.\nNarrator: I SHOULD GET ONE OF THOSE PUMPS.\n{{Tooltip: And then a second one, to drain the ocean.}}","alt":"And then a second one, to drain the sea.","img":"https://imgs.xkcd.com/comics/the_sea.png","title":"The Sea","day":"16"},{"month":"7","num":451,"link":"","year":"2008","news":"","safe_title":"Impostor","transcript":"My Hobby: Sitting down with grad students and timing how long it takes them to figure out that I'm not actually an expert in their field.\nEngineering:\nStudents: Our big problem is heat dissipation\nMe: Have you tried logarithms?\n48 seconds\nLinguistics:\nMe: Ah, so does this Finno-ugric family include, say, Klingon?\n63 Seconds\nSociology:\nMe: Yeah, my latest work is on ranking people from best to worst.\n4 Minutes\nLiterary Criticism:\nMe: You see, the deconstruction is inextricable from not only the text, but also the self.\nEight papers and two books and they haven't caught on.\n{{Alt\ntitle text: If you think this is too hard on literary criticism, read the Wikipedia article on deconstruction.}}","alt":"If you think this is too hard on literary criticism, read the Wikipedia article on deconstruction.","img":"https://imgs.xkcd.com/comics/impostor.png","title":"Impostor","day":"18"},{"month":"7","num":452,"link":"","year":"2008","news":"","safe_title":"Mission","transcript":"[[Two figures, one in a beret, are rappelling down separate ropes into the interior workings of a large machine]]\nMan 1: Okay, we're in the belly of the machine. You got the charges?\nMan 2 (with beret): The what?\n[[The two are standing next to some large pieces of machinery]]\nMan 1 [[gesturing]: The explosive charges!\nMan 2 [[pulling out a bag]]: I just brought this bag for pastries.\nMan 1: The hell? We're on a mission here!\nMan 2 [[looking around]]: This isn't a bakery?\nMan 1 [[head in hand]]: Oh, Christ, not this shit again.\nMan 2 [[crouching by some lug nuts lying on a piece of machinery]]: What about these scones?\nMan 1: Those are lug nuts.\nMan 2 [[stuffing them in his mouth]]: ...Maybe SOME of them aren't. <<crunch>> Ow! <<crunch>>\n{{Title text: Don't you know? The chances of a random object being a scone are about one in six.}}","alt":"Don't you know?  The chances of a random object being a scone are about one in six.","img":"https://imgs.xkcd.com/comics/mission.png","title":"Mission","day":"21"},{"month":"7","num":453,"link":"","year":"2008","news":"","safe_title":"Upcoming Hurricanes","transcript":"[[An unlabeled map shows the region roughly between central Canada and northern Brazil. Dotted lines indicating hurricane paths cover the map, all red except where noted.\nHurricane Illinois-Has-It-Too-Easy comes from somewhere to the northwest, goes through Illinois, and then back to the northwest.\nHurricane Where-the-Hell-Is-Bermuda enters from the east side of the map, wanders around the Atlantic in a scribble, goes north for a while, and then peters out.\nHurricane Screw-It-Let's-Just-Trash-Florida-Again comes from the east, starts to curve to the north, and then turns sharply to head straight for Florida and zigzag through it.\nHurricane Freud starts in the Gulf of Mexico, draws a set of balls to Florida's cock, and then comes on land and stops.\nHurricane Red and Hurricane Blue (which is a blue line) are playing a game of Tron, zipping in straight lines and right angles around Haiti, Jamaica, and Cuba. Red successfully cuts off Blue and then dies shortly thereafter.\nHurricane cos(x) forms a graph of cos(x) along the bottom edge of the map.]]\n\n{{Title text: I'd like to see more damage assessments for hurricanes hitting New York and flooding Manhattan -- something like the 1938 Long Island Express, but aimed a bit more to the west.  It's just a matter of time.}}","alt":"I'd like to see more damage assessments for hurricanes hitting New York and flooding Manhattan -- something like the 1938 Long Island Express, but aimed a bit more to the west.  It's just a matter of time.","img":"https://imgs.xkcd.com/comics/upcoming_hurricanes.png","title":"Upcoming Hurricanes","day":"23"},{"month":"7","num":454,"link":"","year":"2008","news":"","safe_title":"Rewiring","transcript":"{{Title: Rewiring}}\n{{Heading: Upgrading phone wiring to Ethernet}}\n[[A man is feeding cable into a device on a desk labeled \"fax\"]]\n<<Fax: zzz zzz>>\n[[Outdoors, showing a plant and a lamp (indicates panels 1 and 3 are separate locations)]]\n[[A woman, laptop behind her, is pulling a cable out of a fax machine]]\n<<Fax: zzzzz>>\n{{Alt text: My friend Elizabeth tried to mail one end of the cable to me and thread the mail system.}}","alt":"My friend Finn tried to mail one end of the cable to me and thread the mail system.","img":"https://imgs.xkcd.com/comics/rewiring.png","title":"Rewiring","day":"25"},{"month":"7","num":455,"link":"","year":"2008","news":"","safe_title":"Hats","transcript":"[[The Black Hat Man is Walking]]\n[[The Black Hat Man stops in front of another Man with two Black Hats.]]\n[[After two panels, The Original Black Hat Man steps backward, shuddering slightly.]]\n{{Title Text: ...}}","alt":"...","img":"https://imgs.xkcd.com/comics/hats.png","title":"Hats","day":"28"},{"month":"7","num":456,"link":"","year":"2008","news":"","safe_title":"Cautionary","transcript":"Linux: A True Story:\n[[A man talks on a cell phone]]\nWeek One:\nFemale cousin [[via phone]]: Hey, it's your cousin. I got a new computer but don't want Windows. Can you help me install \"Linux\"?\nMan: Sure.\n[[The female cousin sits in an office chair with her laptop on her lap. She is on the phone]]\nWeek Two:\nFemale cousin: It says my XORG is broken. What's an \"XORG\"? Where can I look that up?\nMan [[via phone]]: Hmm, lemme show you man pages.\n[[The female cousin crouches on the floor with the laptop on her lap. She is still on the phone]]\nWeek Six:\nFemale cousin: Due to auto-config issues, I'm leaving Ubuntu for Debian.\nMan [[via phone]] Uh.\nFemale cousin: Or Gentoo.\nMan [[via phone]]: Uh oh.\n[[The female cousin lies on her stomach with the laptop on the floor. On the floor are several pieces of paper and a book. The man stands to her left]]\nWeek Twelve:\nMan: You haven't answered your phone in days.\nFemale cousin: Can't sleep. Must compile kernel.\nMan: I'm too late.\n[[Box with text:]]\nParents: talk to your kids about Linux... Before somebody else does.\n{{title text: This really is a true story, and she doesn't know I put it in my comic because her wifi hasn't worked for weeks.}}","alt":"This really is a true story, and she doesn't know I put it in my comic because her wifi hasn't worked for weeks.","img":"https://imgs.xkcd.com/comics/cautionary.png","title":"Cautionary","day":"30"},{"month":"8","num":457,"link":"","year":"2008","news":"","safe_title":"Frustration","transcript":"[[Bra with rubik's cube closure.]]\n{{title text: 'Don't worry, I can do it in under a minute.' 'Yes, I've noticed.'}}","alt":"'Don't worry, I can do it in under a minute.' 'Yes, I've noticed.'","img":"https://imgs.xkcd.com/comics/frustration.png","title":"Frustration","day":"1"},{"month":"8","num":458,"link":"","year":"2008","news":"","safe_title":"Regrets","transcript":"[[Bar Graph]]\nNumber of google results for:\n\"I _____ have kissed her\" (or him)\nShouldn't: 1,213\nShould: 10,230\n{{title text: And nothing for 'I'm glad I saw Epic Movie.'}}","alt":"And nothing for 'I'm glad I saw Epic Movie.'","img":"https://imgs.xkcd.com/comics/regrets.png","title":"Regrets","day":"4"},{"month":"8","num":459,"link":"","year":"2008","news":"","safe_title":"Holy Ghost","transcript":"Pope: this is a disaster.\nout-of-frame voice: is it really that bad?\nPope: do you know how much scripture we'll have to revise?\nout-of-frame voice: look, we've apologized--\nPope: i mean, we can't have a trinity with just a father and a son!\nout-of-frame voice: again, we're sorry.\nPope: sorry's not enough. guards, take their proton packs.\nGhostbusters: hey, we were just doing our jobs!\n{{title-text: okay, everyone, cross yourselves, then cross the streams.}}","alt":"Okay, everyone, cross yourselves, then cross the streams.","img":"https://imgs.xkcd.com/comics/holy_ghost.png","title":"Holy Ghost","day":"6"},{"month":"8","num":460,"link":"","year":"2008","news":"","safe_title":"Paleontology","transcript":"[[A man and a woman in a museum, near a reconstructed dinosaur fossil.]]\nWoman: Man, paleontology sucks these days.\nMan: Why?\nWoman: Jurassic Park came out 15 years ago.\nMan: So?\nWoman: Today's grad students got into dinosaurs after seeing it as kids. They don't care about fossils. Brats.\n[[A woman in a hat exploring a barren landscape.]]\nWoman: Before they had living dinosaurs handed to them by Hollywood, I was out in Texas digging up Arcocanthosaur teeth.\nMan: So, you were into dinosaurs when they were still underground?\nWoman: Exactly!\n{{title text: Dinosaurs totally jumped the ichthyosaur when they got rid of Brontosaurus.}}","alt":"Dinosaurs totally jumped the ichthyosaur when they got rid of Brontosaurus.","img":"https://imgs.xkcd.com/comics/paleontology.png","title":"Paleontology","day":"8"},{"month":"8","num":461,"link":"","year":"2008","news":"","safe_title":"Google Maps","transcript":"Narrator: MY ROAD TRIP WITH MY BROTHER RAN INTO TROUBLE AROUND PAGE THREE OF THE GOOGLE MAPS PRINTOUT\nGoogle Maps Printout: \n<- 70. SLIGHT LEFT AT RT-22 -- GO 6.8 MI\n-> 71. TURN RIGHT TO STAY ON RT-22 -- GO 2.6 MI\n<- 72. TURN LEFT AT LAKE SHORE RD GO -- 312 FT\n-> 73. TURN RIGHT AT DOCK ST -- GO 427 FT\n[[water replaces an arrow]] 74. TAKE THE FERRY ACROSS THE LAKE -- GO 2.8 MI\n[[A car is driving in the dark]]\nPerson 1: OKAY, NOW TAKE DOCK ST TOWARD THE FERRY\nPerson 2: WE'RE SUPPOSED TO TAKE A FERRY? IT'S PAST MIDNIGHT, AND THESE WOODS ARE CREEPY\nPerson 1: GOOGLE MAPS WOULDN'T STEER US WRONG.\n[[Person 1 and Person 2 stand outside the car.  The ferry has a sign on it reading CLOSED.\n[[Person 1 stands holding the google map print out next to Person 2 in the dark]]\n[[Still standing in the dark]]\nPerson 1: LET ME SEE THOSE DIRECTIONS.\nGoogle Maps Printout:\n[[water replaces an arrow]] 74. TAKE THE FERRY ACROSS THE LAKE -- GO 2.8 MI\n[[a diagonal upward arrow]] 75. CLIMB THE HILL TOWARD HANGMAN'S RIDGE, AVOIDING ANY MOUNTAIN LIONS -- UP 1,172 FT\n[[a \"u-turn\" arrow]] 76. WHEN YOU REACH AN OLD BARN, GO AROUND BACK, KNOCK ON THE SECOND DOOR, AND ASK FOR CHARLIE -- GO 52 FT\n[[a van]] 77. TELL CHARLIE THE DANCING STONES  ARE RESTLESS.  HE WILL GIVE YOU HIS VAN. -- CAREFUL\n[[a picture of the straw man]] 78. TAKE CHARLIE'S VAN DOWN OLD MINE ROAD.  DO NOT WAKE THE STRAW MAN. -- GO 97 MI\n-> 79. TURN LEFT ON COMSTOCK.  WHEN YOU FEEL THE BLOOD CHILL IN YOUR VEINS, STOP THE VAN AND GET OUT. -- GO 3.2 MI\n[[down arrow]] 80. STAND VERY STILL. EXITS ARE NORTH, SOUTH, AND EAST, BUT ARE BLOCKED BY A SPECTRAL WOLF. -- GO 0 FT\n[[a picture of a spectral wolf]] 81. THE SPECTRAL WOLF FEARS ONLY FIRE.  THE GOOGLE MAPS TEAM CAN NO LONGER HELP YOU, BUT IF YOU MASTER THE WOLF, HE WILL GUIDE YOU.  GODSPEED. -- GO ?? MI.\n{{Alt Text: Apparently Google assumes you're traveling during the ferry's normal operating hours. We lost two hours circling that damn lake (to say nothing of the Straw Man).}}","alt":"Apparently Google assumes you're traveling during the ferry's normal operating hours.  We lost two hours circling that damn lake (to say nothing of the Straw Man).","img":"https://imgs.xkcd.com/comics/google_maps.png","title":"Google Maps","day":"11"},{"month":"8","num":462,"link":"","year":"2008","news":"","safe_title":"Freemanic Paracusia","transcript":"[[A man is shown sitting behind a desk with a Computer]]\nNarrator: Freemanic Paracusia, A disorder wherein you hear everything you read in the comforting voice of Morgan Freeman.\n[[There is a thought bubble of the man's thoughts, within it is Morgan Freeman reading text]]\nMorgan Freeman: Why, you could enlarge your penis for cheap. My, my. Isn't that something?\n{{title text: It's amazing what it does for YouTube comments.}}","alt":"It's amazing what it does for YouTube comments.","img":"https://imgs.xkcd.com/comics/freemanic_paracusia.png","title":"Freemanic Paracusia","day":"13"},{"month":"8","num":463,"link":"","year":"2008","news":"","safe_title":"Voting Machines","transcript":"[[First Man sitting at computer reading an article]]\nArticle: Premier Election Solutions (formerly Diebold) has blamed ohio voting machine errors on problems with the machines' McAfee antivirus software.\nFirst Man: Wait. \"Antivirus software\"? On voting machines? {{italics}} You're doing it wrong.\n[[Second Man enters the frame and speaks to First Man]]\nSecond Man: Why? Security is good, right?\nFirst Man: Of course. But, well-\nFirst Man: Imagine you're at a parent-teacher conference, and the teacher reassures you that he always wears a condom while teaching.\nSecond Man: Ah. Strictly speaking, it's better than the alternative.\nFirst Man: -Yet someone is clearly doing their job horribly wrong.\n{{Alt Text: And that's *another* crypto conference I've been kicked out of. C'mon, it's a great analogy!}}","alt":"And that's *another* crypto conference I've been kicked out of.  C'mon, it's a great analogy!","img":"https://imgs.xkcd.com/comics/voting_machines.png","title":"Voting Machines","day":"15"},{"month":"8","num":464,"link":"","year":"2008","news":"","safe_title":"RBA","transcript":"[[Girl walks up to boy pouring himself a drink]]\nGirl: Now, this is a story all about how\nGirl: My life got flipped turned upside down\nGirl: And I'd like to take a minute\nGirl: Just sit right there\nGirl: I'll tell you how I became uncertain about our relationship. I think you just like having a girlfriend, it doesn't matter who.\nGirl: I think we should break up.\n[[Cut to dropped glass, drink spilled on ground]]\nNarrator: The reverse Bel-Air only works once, so make it something unforgettable.\nBoy: ...wait, seriously?\nGirl: Yeah.\n{{Alt-text: This is a story all about how I started drinking.}}","alt":"This is a story all about how I started drinking.","img":"https://imgs.xkcd.com/comics/rba.png","title":"RBA","day":"18"},{"month":"8","num":465,"link":"","year":"2008","news":"","safe_title":"Quantum Teleportation","transcript":"[[Reporter and a Scientist are facing each other, sitting in chairs.]]\nReporter:  So, Quantum Teleportation-\nScientist:  The name is misleading.  It's a particle statistics thing.\nReporter:  So it's not like Star Trek?  That's boring.\nScientist:  Okay, I'm sick of this.  Every time there's a paper on Quantum Teleportation, you reporters write the same disappointed story.\n[[Scientist leaves seat and moves behind it]]\nReporter:  But-\n[[Scientist has gone to device that was behind him and was out of the scope of the three previous panels.]]\nScientist:  Talk to someone else.  I'm going to the Bahamas.  <<Click>>\n[[The Scientist switches a device on.]]\n[[Device labeled \"TELEPORTER\" is switched from \"Quantum\" to \"Regular\".]]\n<<VRMMM>>\n{{The scientist is beamed up in classic Star Trek fashion}}\n{{alt-text: Science should be exactly as cool as the headlines sound. Like the \"RUSSIANS CUT APART AND REASSEMBLE DOGS\" thing}}","alt":"Science should be exactly as cool as the headlines sound.  Like the 'RUSSIANS CUT APART AND REASSEMBLE DOGS' thing.","img":"https://imgs.xkcd.com/comics/quantum_teleportation.png","title":"Quantum Teleportation","day":"20"},{"month":"8","num":466,"link":"","year":"2008","news":"","safe_title":"Moving","transcript":"There are few forces more powerful than geeks desperately trying to get internet in a new apartment.\nCharacter 1: Okay, the pringles cantenna has let us patch into the WiFi network across the road.\nCharacter 2: And they have internet?\nCharacter 1: No, but I think the cable van will hook up their house first.\n{{title text: We need a special holiday to honor the countless kind souls with unsecured networks named 'linksys'}}","alt":"We need a special holiday to honor the countless kind souls with unsecured networks named 'linksys'.","img":"https://imgs.xkcd.com/comics/moving.png","title":"Moving","day":"22"},{"month":"8","num":467,"link":"","year":"2008","news":"","safe_title":"X Girls Y Cups","transcript":"[[There is a table with eight columns and eight rows. Cups to the horizontal girls to the vertical.]]\n{{Title: Google results for <x> cups <y> girls}}\n(Note: the values will be displayed left to right and top to bottom.)\n0 girls: 3, 375, 9, 0, 0, 0, 0, 0\n1 girl: 7, 7503, 2007, 10, 5, 3, 6, 2\n2 girls: 9, 1929000, 247, 7, 14, 13, 2, 1\n3 girls: 7, 6335, 394, 34, 3, 2, 6, 0\n4 girls: 3, 3513, 34, 0, 63, 0, 0, 0\n5 girls: 1, 9, 5, 3, 0, 0, 3, 0\n6 girls: 3, 1461, 1, 1, 1, 0, 0, 0\n7 girls: 2, 19, 4, 2, 0, 0, 0, 0\n{{Alt-text: Also no results: 1girl10000cups, 2girls(5+3i)cups, 65536girls35563cups, or 3frenchhens2turtledoves1cup.}}","alt":"Also no results: 1girl10000cups, 2girls(5+3i)cups, 65536girls65536cups, or 3frenchhens2turtledoves1cup.","img":"https://imgs.xkcd.com/comics/x_girls_y_cups.png","title":"X Girls Y Cups","day":"25"},{"month":"8","num":468,"link":"","year":"2008","news":"","safe_title":"Fetishes","transcript":"Author Katherine Gates recently attempted to make a chart of all sexual fetishes.\nLittle did she know that Russel and Whitehead had already failed at this same task.\n[[Russel and Whitehead are standing with GÃ¶del, Russel holding a clipboard and smoking a pipe.]]\nRussel: Hey, GÃ¶del âÂ we're compiling a comprehensive list of fetishes.  What turns you on?\nGÃ¶del: Anything not on your list.\nRussel: Uhâ¦hm.\n{{title text: They eventually resolved this self-reference, but Cantor's 'everything-in-the-fetish-book-twice' parties finally sunk the idea.}}","alt":"They eventually resolved this self-reference, but Cantor's 'everything-in-the-fetish-book-twice' parties finally sunk the idea.","img":"https://imgs.xkcd.com/comics/fetishes.png","title":"Fetishes","day":"27"},{"month":"8","num":469,"link":"","year":"2008","news":"","safe_title":"Improvised","transcript":"Harrison Ford Famously Improvised His \"I know\" Line in E.S.B. (The Empire Strikes Back). Here are a few of his less-successful ad-libs:\n[[Han Solo stands in front of Princess Leia on the Cloud City Carbon Freezing Chamber]]\nLeia: I Love You.\nHan: Well, Duh\n[[Han Solo in the cockpit of the Millennium Falcon]]\nC-3P0: Sir, the possibility of successfully navigating an asteroid field is approximately 3720 to 1!\nHan: Seriously? ...Christ\n[[Han Solo stands in front of Princess Leia on the Cloud City Carbon Freezing Chamber]]\nLeia: I Love You.\nHan: Oh! Hey, that explains the kissing earlier.\n\n[[Han Solo stands in front of Princess Leia on the Cloud City Carbon Freezing Chamber]]\nLeia: I Love You.\nHan: I'm Nailing Your Brother.\n[[Han Solo standing in front of Luke Skywalker, who is holding the blast shield helmet. The training droid hovers between them]]\nHan: Hokey Religions and ancient weapons are no match for scissors, though they do beat paper and rock.\n[[Han Solo stands in front of Princess Leia on the Cloud City Carbon Freezing Chamber]]\nLeia: I Love You.\nHan: Cool. Listen, this thing is really, REALLY cold.\n[[Han Solo stands in front of Princess Leia on the Cloud City Carbon Freezing Chamber]]\nLeia: I Love You.\nHan: Wowzers.\n[[Han Solo sits with two others. General Madine approaches.]]\nMadine: General Solo, is your strike team assembled?\nHan: Barely.\nHan: They're pretty drunk.\n[[Han Solo and Princess Leia stand in an Ice Tunnel of Hoth]]\nLeia: I'd just as soon kiss a wookie.\nHan: Man, me too, but chewie never seems interested.\nHan: Maybe I should Grow My hair out.\n{{title text: Oh, your brother is Luke. Sorry, should've mentioned that first.}}","alt":"Oh, your brother is Luke.  Sorry, should've mentioned that first.","img":"https://imgs.xkcd.com/comics/improvised.png","title":"Improvised","day":"29"},{"month":"9","num":470,"link":"","year":"2008","news":"","safe_title":"The End is Not for a While","transcript":"[[Man with with two picket signs. Another woman with a picket sign stands partially out of the frame, staring at the man.]]\nNarrator: I get in trouble for showing up contented at protests.\nSign 1: Things are pretty okay!\nSign 2: Anyone up for scrabble later?\n{{Title text: I THINK EVERYONE INVOLVED HERE IS CUTE}}","alt":"I THINK EVERYONE INVOLVED HERE IS CUTE.","img":"https://imgs.xkcd.com/comics/the_end_is_not_for_a_while.png","title":"The End is Not for a While","day":"1"},{"month":"9","num":471,"link":"","year":"2008","news":"","safe_title":"Aversion Fads","transcript":"[[Two guys stand together as a young guy dressed up with small ears and a tail approaches.]]\nFirst Man: OH GOD, A FURRY. DON'T LET IT TOUCH YOU.\n[[The Furry hears someone call out to him]]\nUnknown: HEY, KID.\n[[A young woman is seen preparing a kite to be flown.]]\nWoman: FORGET THOSE ASSHOLES.  COME HELP ME.\n[[The Furry begins to help the woman set up the kite.]]\nFurry: THANKS, SO YOU'RE COOL WITH FURRIES?\nWoman: WELL, I THINK YOUR FETISH IS AS WEIRD AS HELL.  IT JUST BOTHERS ME HOW YOU'RE THIS DESIGNATED INTERNET PUNCHING BAG AMONG PEOPLE WHO ARE OTHERWISE DOWN WITH WEIRD FETISHES.  SO I STICK UP FOR YOU WHEN I CAN.\n[[The kite now successfully up in the air, the two continue.]]\nFurry: WELL, THANKS.  I OWE YOU ONE.\nWoman: NO BIG DEAL.\nFurry: NO, THIS IS LIKE THE LION AND THE MOUSE.\nWoman: ...LISTEN, CAN WE PICK A COMPARISON LESS LIKELY TO TURN YOU ON?\nFurry: SORRY.\n{{title text: Hey, are you friends with any hamsters.  This kite needs a passenger.}}","alt":"Hey, are you friends with any hamsters?  This kite needs a passenger.","img":"https://imgs.xkcd.com/comics/aversion_fads.png","title":"Aversion Fads","day":"3"},{"month":"9","num":472,"link":"https://www.amazon.com/House-Leaves-Mark-Z-Danielewski/dp/0375703764","year":"2008","news":"(Today's comic is a parody of <a href=\"https://www.amazon.com/House-Leaves-Mark-Z-Danielewski/dp/0375703764\">House of Leaves</a>.)","safe_title":"House of Pancakes","transcript":"{{All instances of the word \"House\" are in blue.}}\nEvery day a new city, a new IHOP. And yet every night the dreams get worse. I ply the highways, a nervous eye on the rear-view mirror, the back seat piled with stolen menus. Their doors are opened 24 hours, but forever closed to my soul. This is what my life has become. This is my hell.\n{{sidenote left: International}}\nHouse of Pancakes\n{{scribbled-out sidenote right: BLOGSPOT}}\nStrawberry Banana Pancakes\nFour pancakes filled with sliced fresh banana and crowned with cool strawberry topping, more [17] bananas and [23] whipped topping.\n[17] Driven by a nameless fear, a whisper in the dark behind me, I flee ahead of I know not what. Whenver I turn, there's nobody behind me.  And yet someone is clearly stealing the ketchup. WHY?\n[[The footnote is covered in fingerprints.]]\n[23] My life is feeding,\nfleeing,\nfighting,\nand\nforgetting.\n[[The above note is sandwiched in sideways in between the Stuffed French Toast and Ham and Egg Melt.]]\nRooty Jr.\nA kids only [19] version of our house signature Rooty Tooty. One scrambled egg, one strip of bacon, one pork sausage link and one fruit-topped buttermilk pancake.\n[19] The decision not to hyphenate \"kids only\" is likely connected to the omission of the serial comma. I wonder if the author is British. I wonder if he sleeps at night.\n[[The following passages are have a red substance underneath them, probably ketchup.]]\nRise 'N Shine\nTwo eggs, toast and hash browns served with your choice [21] of two strips of bacon or two pork sausage links.\n[21] {{illegible}} rent a storage unit. Sleep there. Fill it with pancakes. Leave.\nStuffed French Toast\nCinnamon raisin French [18] toast stuffed with sweet cream cheese filling, topped with cool strawberry or your choice of fruit compote and whipped topping.\n[18] Nightmares again. I wake up covered in sweat, and what appears to be a thin sheen of maple syrup\n{{Handwritten, underlined}} WHO IS MOHAWK GIRL?\n[[Slanted 90 degrees left]]\nHam & Egg Melt\nGrilled sourdough bread stuffed with ham, scrambled eggs, Swiss and American cheeses. [20]\n[[At normal orientation]]\n[20] Ordered this in at an IHOP in Rochester, New York. There was blood on the floor. Some of it was mine.\n[[Comic strip]]\nEnough with your pancakes.\nEnough with your GOD DAMN pancakes.\nThe Big Steak Omlette\nTender strips of steak, hash browns, {{redacted}} tomatoes and Cheddar cheese. Served [22] with house salsa.\n[22] Woke up in Las Vegas.  They're closing the Star Trek Experience today.  The IHOP up the strip had pancake platters named after various states.\nNone of them sounded like home.\n{{Alt text: Fuck it, I'm just going to Waffle House.}}\n{{External link: http:\nwww.amazon.com\nHouse-Leaves-Mark-Z-Danielewski\ndp\n0375703764}}","alt":"Fuck it.  I'm just going to Waffle House.","img":"https://imgs.xkcd.com/comics/house_of_pancakes.png","title":"<span style=\"color: #0000ED\">House</span> of Pancakes","day":"5"},{"month":"9","num":473,"link":"","year":"2008","news":"","safe_title":"Still Raw","transcript":"[[Man laying on sidewalk outside a house, surrounded by his belongings]]\nShe threw me out yelling \"You don't say those words, not in this house.\"\nIt's been two years. I thought the wounds had healed.\nBut I stand by what I said...\nPluto should never have been a planet.\n{{Title-text : We actually divorced once over the airplane\ntreadmill argument.  (Preemptive response to the inevitable threads arguing about it:  you're all wrong on the internet.) }}","alt":"We actually divorced once over the airplane/treadmill argument.  (Preemptive response to the inevitable threads arguing about it:  you're all wrong on the internet.)","img":"https://imgs.xkcd.com/comics/still_raw.png","title":"Still Raw","day":"8"},{"month":"9","num":474,"link":"","year":"2008","news":"","safe_title":"Turn-On","transcript":"[[A bar]]\nMan: So, the LHC's turning on. This could be our last night on earth.\nWoman: Gimme a break. They're not even colliding yet, and it won't do anything cosmic rays haven't.\n[[The man starts to turn away.]]\nWoman: Hey, I didn't say no.\nWoman: I'm a physics grad student. I need the excuse to party.\nMan: So, you're up for a night with a charming stranger?\nWoman: Depends. Top or bottom?\nMan: Hey, I haven't even bought you a drink.\nWoman: Barkeep, two whiskey sours, straight down.\n{{Alt text: Supercollider? I 'ardly know her!}}","alt":"Supercollider?  I 'ardly know 'er!","img":"https://imgs.xkcd.com/comics/turn-on.png","title":"Turn-On","day":"10"},{"month":"9","num":475,"link":"","year":"2008","news":"","safe_title":"Further Boomerang Difficulties","transcript":"[[Man is throwing boomerang \n Holding his hands up, man waits for return \n Continual waiting\n Man is dejected, head hangs low]]\n[[Man throws boomerang]] \n Man waits for boomerang]] \n Outside: Oh God \n Outside: The Ozone layer! [[Man is suprised]]\n[[Man throws boomerang banana \n Man waits]] \n Girl who walks in: That was our last banana \n Girl: You're such an asshole.\n[[Man throws boomerang \n Boomerang breaks out of the panel box]]\n[[Boomerang breaks out of a satellite, followed by the man]]\n{{Alt-Text: An eternity later, the universe having turned out to have a  positive curvature and a lot of mass, the boomerang hits him in the back of the head}}","alt":"An eternity later, the universe having turned out to have positive curvature and lots of mass, the boomerang hits him in the back of the head.","img":"https://imgs.xkcd.com/comics/further_boomerang_difficulties.png","title":"Further Boomerang Difficulties","day":"12"},{"month":"9","num":476,"link":"","year":"2008","news":"","safe_title":"One-Sided","transcript":"[[Caption Above Comic]] Sometimes my conversations with strangers go on for a while before I realize that they're talking on their phones.\nGuy With Backpack: Hi!\nNarrator: Hi.\nGuy With Backpack: What's up?\nNarrator: Uh, not a lot...\nGuy With Backpack: Shit. Does Bernanke own a crossbow?\n[[Background is a graph, with x-axis labeled \"Length of Conversation\" and y-axis labeled \"How Often This Happens\".  The graph looks parabolic towards the left-hand side, but as x approaches infinity, y approaches zero.  A vertical dashed line runs through the graph, slightly to the right of the peak of the graph.  To the right of the dashed line there is an arrow pointing to the right that is labeled \"Awkward Zone\".  The x-axis has a broken scale, and to the right of the break there is a very small increase in the graph that is parenthetically labeled \"My Second Relationship\".]]\n{{title text: He continued, 'Okay, Bernanke is uncontaminated.  Find a crossbow and get him into position behind one of the columns at the Fed entrance.  This is gonna get ugly.'}}","alt":"He continued, 'Okay, Bernanke is uncontaminated.  Find a crossbow and get him into position behind one of the columns at the Fed entrance.  This is gonna get ugly.'","img":"https://imgs.xkcd.com/comics/one-sided.png","title":"One-Sided","day":"15"},{"month":"9","num":477,"link":"","year":"2008","news":"","safe_title":"Typewriter","transcript":"[[A typewriter is shown with the following letter in it:\nDear Grandmom,    cnn.com\n    I hope this    reddit.com    letter\nfinds you well.    I wanted to say I\nreally    news.google.com    enjoyed the\ntrip you    boingboing.net    took us on,\nand am looking forward to    bbc.co.uk\nvisiting later    fivethirtyeight.com\nthis year.\n\t\t\t\tLove,    slashdot.org\n\n\t\t\t\tYour grandson,]]\nI didn't realize how bad my habit of tabbing to Firefox every few seconds to check news sites had gotten until I tried writing on a typewriter.\n{{title text: Somewhere in the world, my actual grandmothers are reading this and angrily exclaiming that I never write even malformed thank-you notes.  DEAR GRANDMOMS: I AM SORRY! YOU ARE WONDERFUL PEOPLE AND THANK YOU FOR EVERYTHING.  LOVE reddit.com RANDALL.}}","alt":"Somewhere in the world, my actual grandmothers are reading this and angrily exclaiming that I never write even malformed thank-you notes.  DEAR GRANDMOMS: I AM SORRY! YOU ARE WONDERFUL PEOPLE AND THANK YOU FOR EVERYTHING.  LOVE reddit.com RANDALL.","img":"https://imgs.xkcd.com/comics/typewriter.png","title":"Typewriter","day":"17"},{"month":"9","num":478,"link":"","year":"2008","news":"","safe_title":"The Staple Madness","transcript":"Man with Beret: I FOUND MEGAN'S STAPLE GUN! [[holds up staple gun]]\nMan: [[holding forehead]] OH NO.\nMan: [[outside of the panel]] OH GOD WHAT ARE YOU--\nMan with Beret: [[kneeling at laptop, stapling DVD to laptop]] INSTALLING DEBIAN! <<KA CHUNK>>\nMan with Beret: SANDWICHES! <<ka CHUNK ka CHUNK>>\nMan with Beret: [[running with staple gun]] MUST AFFIX EVERYTHING TO EVERYTHING\n<<ka CHUNK ka CHUNK ka CHUNK ka CHUNK ka CHUNK ka CHUNK>>\n[[Megan enters holding tote bag]]\nMegan: ...HAVE YOU BEEN ABUSING MY STAPLE GUN?\nMan with Beret: NO.\nGod: [[outside of scene, as voice from above]] YES!","alt":"Staple guns: because duct tape can't make that 'kaCHUNK' noise.","img":"https://imgs.xkcd.com/comics/the_staple_madness.png","title":"The Staple Madness","day":"19"},{"month":"9","num":479,"link":"","year":"2008","news":"","safe_title":"Tones","transcript":"[[Man standing in room next to round table, looking out window. Blue and orange sunset visible outside the window]]\nNarrator: I haven't lived a perfect life.\nMade plenty of mistakes.\nGot my share of regrets.\n[[Viewpoint zooms in onto man and table. Cell phone visible on table.]]\nNarrator: But there's one thing of which I'm proud.\nOne stand on which I've never wavered.\n[[Viewpoint zooms in onto cell phone on table.]]\nNarrator: When someone calls my phone,\nit makes a goddamn RINGING sound.\n{{Alt Text: I need a lawn, so I can yell at kids to stay off it.}}","alt":"I need a lawn, so I can yell at kids to stay off it.","img":"https://imgs.xkcd.com/comics/tones.png","title":"Tones","day":"22"},{"month":"9","num":480,"link":"","year":"2008","news":"","safe_title":"Spore","transcript":"[[User sitting at computer desk, surrounded by game boxes]]\nUser: Sweet, beat 'Populous'. Now, on to 'Alpha Centauri'.\nCaption: Until I can afford 'Spore', I'm just playing through all my old games in order of scale.\n{{title text: Way to not support the GMA 950 under OS X, Spore.  :(}}","alt":"Way to not support the GMA 950 under OS X, Spore.  :(","img":"https://imgs.xkcd.com/comics/spore.png","title":"Spore","day":"24"},{"month":"9","num":481,"link":"","year":"2008","news":"","safe_title":"Listen to Yourself","transcript":"[[Man in Hat approaches a girl tying at a computer]]\nMan in Hat: What are you writing?\nGirl: Virus.\nMan in Hat: What's it do?\nGirl: When someone tries to post a YouTube comment, it first reads it aloud back to them.\nNarrator: Soon everywhere:\n[[A person is commenting on YouTube]]\n<<type>><<type>><<type>>\n[[Youtube comment is read back]]\nCommenter: ...I'm a moron.\n[[Commenter leaves desk]]\n[[Commenter is seen sitting on steps, depressed]]\n[[Commenter has head in hands]]\nCommenter: I...\nCommenter: I didn't know.\n{{alt text: Man, I just wanted to know how babby was formed.}}","alt":"Man, I just wanted to know how babby was formed.","img":"https://imgs.xkcd.com/comics/listen_to_yourself.png","title":"Listen to Yourself","day":"26"},{"month":"9","num":482,"link":"https://store.xkcd.com/products/height-poster","year":"2008","news":"This comic is available as <a href=\"https://store.xkcd.com/products/height-poster\">a poster print</a>.<br/>","safe_title":"Height","transcript":"[[Map of the universe from observable universe to Earth. Each area of item is labled]]\nLables [[Left to Right, Up to Down]]:\n[[Man in Hat is throwing a black kitty down]] Black Cat: mrowl! \n Top of Observable Universe \n 46 Billion Light Years Up \n Hubble Deep Field Objects \n-One Billion Light Years- \n Great Attractor\nAntanne Galaxies (Colliding) \nAndromeda \n  Holy Crap Lots of Space \n - One Million Light Years- \n Magellanic Clouds \n Edge of Galaxy \n Galactic Center \n Crab Nebula \n Orion Nebula \n Horsehead Nebula \n Romulan Neutral Zone \n  The PLEIADS, Duh. \n Rigel \n Bete (Geuse) \n Ford Prefect \n - Expanding Shell of Radio Transmissions [[Arrows are pointing up]] -  \n Edge of Federation Sector 0-0-1 \n Pollux \n Arcturus \n Missing Winds \n Alpha Centauri \n Sirius \n Barnard's Star\n- One Parsec - \n - One Light Year - \n Oort Cloud (?) \n Bupkis \n Comet Which will destroy Earth in late 2063 \n Pioneer 10 \n Eris (All hail Discordia!) \n Voyager I \n Pluto (Not a planet. Neener neener.) \n Neptune \n Uranus \nSaturn \n Asteroids \n  <~life~> \n Jupiter \n Venus \n Mars \n Sun \n Mercury \n Aircraft: Hey a heaping bowl of salt! \n \"Open the fridge door, Hal.\" \n Moon \n Human Altitude Record (Apollo 13) \n 2nd Place: Snoop Dogg \n Space Elevator - One of these days, promise! \n - Geosynchronous Orbit- \n GPS Satellites \n Aircraft 2: I have no idea how to land \n Aircraft 2[[continued]]: In retrospect, they [[underlined]] shouldn't [[\nunderline]] have sent a poet \n International Space Station \n Space Junk \n - Official Edge of Space (100 km) - \n Meteors \n - 1\n10 ATM - \n High Altitude Balloons \n Airliners \n - 1\n2 ATM -  \n Cory Doctrow \n Shuttle Columbia Lost \n Everest \n Helicoptors \n Man: Woo Python! \n - 800 m - \n - 1 km - \n [[Height progressivly gets smaller and smaller]] \n Burj Dubai (~800 m) \n Eiffel Tower (325 m) \n Kites \n Great Pyramid (140 m) \n Redwood (115 m) \n Pop Fly \n Oak (20 m) \n \"Hey Squirrels!\" \n Tallest Stilts \n Brachiosaur (13 m) \n Giraffe (8 m) \n [[A man and a woman]] Folks\nMap Title Text : The Observable Universe, from Top to Bottom ~ On a log scale~\nMap Disclaimer: Sizes are not to scale, but heights above the Earth's surface are accurate on a log scale (that is, each step up is double the height.)\n{{Alt-text: Interestingly, on a true vertical log plot, I think the Eiffel Tower's sides would really  be straight lines.}}","alt":"Interestingly, on a true vertical log plot, I think the Eiffel Tower's sides really would be straight lines.","img":"https://imgs.xkcd.com/comics/height.png","title":"Height","day":"29"},{"month":"10","num":483,"link":"","year":"2008","news":"","safe_title":"Fiction Rule of Thumb","transcript":"[[Line graph shown with an inverse curve]] \n [[Y-Axis: Probability book is good]] \n [[X-Axis: Number of words made up by author]] \n [[The curve becomes less steep as the number of words increase]] \n {{Quote at the bottom of the text}}\"The Elders, or Fra'as, guarded the farmlings (children) with their krytoses, which are like swords but awesomer...\" {{Fra'as, farmlings, krytoses and awesomer are italicised}} \n {{Alt-Text: Except for anything by Lewis Carroll and Tolkien, you get five made-up words per story. I'm looking at you, Anathem.}}","alt":"Except for anything by Lewis Carroll or Tolkien, you get five made-up words per story.  I'm looking at you, Anathem.","img":"https://imgs.xkcd.com/comics/fiction_rule_of_thumb.png","title":"Fiction Rule of Thumb","day":"1"},{"month":"10","num":484,"link":"","year":"2008","news":"","safe_title":"Flash Games","transcript":"[[On the left side of the panel, is a massive TV screen, large speakers, and similar devices, all connected to a \"Game Station 20,000\" console. A man, however, is over on the right side of the panel, on a modestly-sized computer.]]\nMan: Ooh, I think I've got it figured out! Okay, one more hour.\n<<Beep>> <<Plunk>>\nCaption: The most powerful gaming systems in the world still can't match the addictiveness of tiny in-browser Flash games.\n{{title text: Although ... who else can't wait for them to incorporate that Wiimote head-tracking stuff into games? Man, the future's gonna be *awesome*.}}","alt":"Although ... who else can't wait for them to incorporate that Wiimote head-tracking stuff into games?  Man, the future's gonna be *awesome*.","img":"https://imgs.xkcd.com/comics/flash_games.png","title":"Flash Games","day":"3"},{"month":"10","num":485,"link":"","year":"2008","news":"","safe_title":"Depth","transcript":"Sizes Accurate on a vertical log scale\n[[Series of images of characters doing various things. Thei things they are doing are listed in left to right order]]\nMan and woman playing in a ball pen \n Woman using witchcraft to ban vista \"Out, Vista!\"\nTwo girls play Rock Band \n Man and woman are having \"fun\" on a shaking bed.\n[[Below this series of images, an image of a man on the computer]]: \nMan is on computer and the image expands as it goes down. Here are the labels from left to right, up to down:\nCD \n DVD \n Case \n North Bridge \n Ps\n2 \n Mouse (a physical mouse) \n RAM \n CPU Socket Pin \n 2,767 Angels Dancing (one more and they'd roll over and become 32,768 Devils), Rice, Torrent (a bug), CPU, upcoming segfault \n dust mite \n hair \n OVUM \n Data (a pixel on Rick Astley's shoulder), rust mite, fork(); \n Peter Norton fighting a baxteriophage \n memory \n carbon nanotubes \n space elevator \n a line of silicon (Si), Electron Cloud, a man made out of arrows saying \"sup? \n Silicon nucleus \n IPod femto \n Brian Greene knitting furiously <<clank, clunk>>\n{{Alt Text: The Planck length is another thousand or two pixels below the comic.}}","alt":"The Planck length is another thousand or two pixels below the comic.","img":"https://imgs.xkcd.com/comics/depth.png","title":"Depth","day":"6"},{"month":"10","num":486,"link":"","year":"2008","news":"","safe_title":"I am Not a Ninja","transcript":"[[Man and woman are in the same panel]] Woman: we need to talk.\n[[Pans back to a panel with a window, which the man looks back at]]\n[[Man throws grenade]] <<POW>>\n[[Grenade fizzles, man and woman both look down at it]] <<sssss>>\nWoman: [[puts her hand to her face]]<<cough>>\n[[Alarm above them starts beeping]][[Man and woman look up]]\nBEEP BEEP BEEP BEEP BEEP BEEP BEEP BEEP BEEP BEEP--\n[[Man and woman look down at the grenade again]]\n[[Man slowly walks away as the alarm continues to beep]]\n[[Man opens the window]] <<Rattle rattle>>\n[[Pans back to the full view, the alarm is still beeping and the man looks back at the woman, who is face-palming]]\n[[Woman walks away, man looks at window]]\n{{Alt-Text: 'The sad thing is that I just wanted to talk about your poor smoke-bomb techniques.'}}","alt":"'The sad thing is that I just wanted to talk about your poor smoke-bomb techniques.'","img":"https://imgs.xkcd.com/comics/i_am_not_a_ninja.png","title":"I am Not a Ninja","day":"8"},{"month":"10","num":487,"link":"","year":"2008","news":"","safe_title":"Numerical Sex Positions","transcript":"Title text: XKCD presents a guide to numerical sex positions:\n69 \n[[traditional sixty-nine position, mutual oral sex]]\n99 \n[[sort of a standing doggy-style position]]\n71 \n[[girl is bent over a table]]\n34 \nGuy: Uh. \n[[guy and girl look confusedly at each other]]\n8^(1\n2) \nNarrator: Guys? \n[[guy and girl are staring blankly at each other]]\nln(2 pi) \nNarrator: Aww, c'mon... \n[[girl begins walking away]]\n{{title text: We didn't even get to the continued fractions!}}","alt":"We didn't even get to the continued fractions!","img":"https://imgs.xkcd.com/comics/numerical_sex_positions.png","title":"Numerical Sex Positions","day":"10"},{"month":"10","num":488,"link":"","year":"2008","news":"Note: the <a href=\"https://www.amazon.com/MP3-Music-Download/b?ie=UTF8&node=163856011\">Amazon.com MP3 store</a> sells DRM-free music.  Kudos.","safe_title":"Steal This Comic","transcript":"Thinking of buying from audible.com or iTunes?\nRemember, if you pirate something, it's yours for life.  You can take it anywhere and it will always work.\n[[There is a flowchart whose paths are (You're a Criminal)<-Pirate<-(Buy or Pirate)->Buy->(Things Change)->(You Try to Recover Your Collection)->(You're a Criminal)]]\nBut if you buy DRM-locked media, and you ever switch operating systems or new technology comes along, your collection could be lost.\nAnd if you try to keep it, you'll be a criminal (DMCA 1201).\nSo remember: if you want a collection you can count on, PIRATE IT.\nHey, you'll be a criminal either way.\n(If you don't like this, demand DRM-free files)\n{{Title text: I spent more time trying to get an audible.com audiobook playing than it took to listen to the book.  I have lost every other piece of DRM-locked music that I ever paid for.}}","alt":"I spent more time trying to get an audible.com audio book playing than it took to listen to the book.  I have lost every other piece of DRM-locked music I have paid for.","img":"https://imgs.xkcd.com/comics/steal_this_comic.png","title":"Steal This Comic","day":"13"},{"month":"10","num":489,"link":"","year":"2008","news":"","safe_title":"Going West","transcript":"[[Man and woman are talking, and the man is walking away from the woman. Woman is holding a an open envelope]]\nWoman: I'm sorry. The google maps team hired me.\nMan: But I can't move to California\nWoman: Then I guess this is the end.\nMan: It can't be! ... Listen.\n[[Man is holding woman's hands in his]]\nMan: When I look deep into your eyes, I see a future for us.\nWoman: Look deeper.\n[[Man looks deeper into Woman's eyes.]]\nMan: \"We're sorry, but we don't have imagery at this zoom level\"?\nThey... they have you already.\n{{Alt-Text: Listen, they request that you stop submitting a listing for your house labeled 'WHERE YOU BROKE MY HEART'.}}","alt":"Listen, they request that you stop submitting a listing for your house labeled 'WHERE YOU BROKE MY HEART'.","img":"https://imgs.xkcd.com/comics/going_west.png","title":"Going West","day":"15"},{"month":"10","num":490,"link":"","year":"2008","news":"","safe_title":"Morning Routine","transcript":"Morning Routine:\n1. Wake up\n2. Catch up on the lives of friends from around the world\n3. Get out from under the covers\nLaptops are weird.\n{{title text: I had a really hard time not writing '... profit!'}}","alt":"I had a really hard time not writing '... profit!'","img":"https://imgs.xkcd.com/comics/morning_routine.png","title":"Morning Routine","day":"17"},{"month":"10","num":491,"link":"","year":"2008","news":"","safe_title":"Twitter","transcript":"[[A person with a handheld device sits on an office chair]]\n(Every other panel is the device making a \"beep beep\")\nDevice: On Twitter\nDevice: An odd regression:\nDevice: Ancient memes\nDevice: Find new expression\nDevice: Burma-shave\n{{title text: If long tooltips \n cut off for you \n then upgrade from \n Firefox 2 \n Burma Shave}}","alt":"If long tooltips / cut off for you / then upgrade from / Firefox 2 / Burma Shave","img":"https://imgs.xkcd.com/comics/twitter.png","title":"Twitter","day":"20"},{"month":"10","num":492,"link":"","year":"2008","news":"","safe_title":"Scrabble","transcript":"[[A first-person view of a family scrabble game at a table. The two letters on the board are 'HI' and the letters in your hand are 'CLTORIS']]\nThis always happens to me in family scrabble games.\n{{title text: A veteran Scrabble player will spot the 'OSTRICH' option.}}","alt":"A veteran Scrabble player will spot the 'OSTRICH' option.","img":"https://imgs.xkcd.com/comics/scrabble.png","title":"Scrabble","day":"22"},{"month":"10","num":493,"link":"","year":"2008","news":"","safe_title":"Actuarial","transcript":"Person: I know you shouldn't feed the trolls, but sometimes they just provoke me to where I can't help replying.\nHat Guy: Yeah, me too. Yesterday this guy kept spamming \"First!\" So I got a set of actuarial tables and spent twenty minutes telling him when all his childhood heroes would likely die.\nPerson: ...\nPerson: Remind me never to upset you, ever.\nHat Guy: 2038: Last of the original Star Wars cast dies.\nPerson: Augh!\n{{Title Text: I started to do the tables for more famous people but it got really depressing and morbid and I had to go outside. Hat guy wins again.}}","alt":"I started to do the tables for more famous people but it got really depressing and morbid and I had to go outside.  Hat guy wins again.","img":"https://imgs.xkcd.com/comics/actuarial.png","title":"Actuarial","day":"24"},{"month":"10","num":494,"link":"","year":"2008","news":"","safe_title":"Secretary: Part 1","transcript":"Spring 2009- The new president faces a crisis...\n[[Man is talking to an unseen Mr. President, who is sitting behind a desk.]]\nMan: Mr. President, the bloggers are restless\nMr. President: What are they a-twitter about now?\nMan: It's the tubes sir. They're clogged. We put too much stuff on them.\nMr. President: How bad is it?\nMan: The internet could be inoperative within days.\nMan: We can't let a crucial resource go unshepherded.\nMr. President: Go on.\nMan: I recommend you appoint a Secretary of the Internet. Someone to impose some orders on this mess.\nMr. President: Ordering bloggers around? Doesn't sound easy.\nMan: No; it's like herding lolcats.\nMr. President: What?\nMan: Nothing.\nMr. President: Do you have someone in mind for the post?\nMan: I know just the guy.\nSoon:\nPhone: <<Ring>>\n[[Man-with-hat looks away from his computer at the ringing phone]]\n{{Alt-Text: The blueprints for the Department of the Internet offices call for Ceiling cat-themed sprinkler heads.}}","alt":"The blueprints for the Department of the Internet offices call for Ceiling Cat-themed sprinkler heads.","img":"https://imgs.xkcd.com/comics/secretary_part_1.png","title":"Secretary: Part 1","day":"27"},{"month":"10","num":495,"link":"","year":"2008","news":"","safe_title":"Secretary: Part 2","transcript":"News Anchor: Breaking news--the President has made a nomination to the new post of Internet Secretary. We know little about the man, shown here.\nImage Caption: Possibly a haberdasher?\nNews Anchor: Attempts to reach the nominee at home were unsuccessful.\nReporter: What the hell kind of apartment has a moat?\nNews Anchor: To understand the culture from which he came--and which he may soon administer--we sent a reporter to what we're told is the source of that culture. Tom?\nTom: I'm coming to you live from the 4chan \nb\n board. Despite the tube cloggage, nascent memes are flying fast and furious.\nNews Anchor: Why are you wearing a helmet, Tom?\nTom: I'm not sure.\n[[Meanwhile in Ron Paul's blimp...]]\nRon Paul: Ahoy! What news of the blogs?\nPilot: Dr. Paul! The President's named his nominee!\nRon Paul: It's not me?\nRon Paul: Wait! I remember that guy from the campaign! He's a notorious troll!\nRon Paul: They mustn't put him in charge. Quick, call the capitol!\nPilot: Can't, sir. The tubes just went down completely.\nRon Paul: Blast!\nRon Paul: Then we'll go ourselves. Full speed ahead!\n{{The blimp advances minutely.}}\n{{The blimp advances minutely.}}\n{{The blimp advances minutely.}}\nRon Paul: I said full speed!\nPilot: It's a blimp, sir!\n{{Title text: That helmet won't save him.}}","alt":"That helmet won't save him.","img":"https://imgs.xkcd.com/comics/secretary_part_2.png","title":"Secretary: Part 2","day":"28"},{"month":"10","num":496,"link":"","year":"2008","news":"","safe_title":"Secretary: Part 3","transcript":"[[The confirmation hearings begin...]]\nSenator: It appears you have quite an arrest record.\nSenator: Is it true you completely disassembled someone's car outside a Starbucks?\nHat Guy: It was parked across two spaces.\nSenator: You stole a red Fokker triplane and strafed the snoopy float at the Macy's Thanksgiving day parade?\nHat Guy: Got three mimes, too.\nSenator: You disrupted a 9\n11 truth meeting, insisting the Twin Towers never actually collapsed?\nHat Guy: I have evidence! Don't trust the media! Wake up, sheeple!\nSenator: You were fired from Radio Shack after you built a death ray and vaporized a customer?\nHat Guy: I was just testing it! Figures that'd be the one day there was a shopper in the aisle.\nSenator: And you were thrown out of Microsoft headquarters for... trying to feed a squirrel through a fax machine?\nHat Guy: I forgot about that! it was part of an argument with Steve Ballmer about Vista.\nWhich I won, by the way.\nSenator: This is the worst history of vandalism, gleeful mayhem, and general recalcitrance we've seen in a nominee since Ruth Bader Ginsburg. \nSenator: And this--you stole a nuclear submarine?\nHat Guy: I plead the third.\nSenator: You mean the fifth?\nHat Guy: No, the third.\nSenator: You refuse to quarter troops in your house?\nHat Guy: I have few principles, but I stick to them.\nMeanwhile...\n[[Aboard Ron Paul's blimp]]\nPilot: We're nearing Washington, sir.\nWait... There's something ahead on the sensors.\nPilot: It's a balloon.\nRon Paul: ...Oh, no.\n{{Title Text: He actually installed each piece in a different car on the lot, then built a new car in the spot from the displaced pieces. It's a confusing maneuver known as the auto-troll shuffle.}}","alt":"He actually installed each piece in a different car in the lot, then built a new car in the spot from the displaced pieces.  It's a confusing maneuver known as the auto-troll shuffle.","img":"https://imgs.xkcd.com/comics/secretary_part_3.png","title":"Secretary: Part 3","day":"29"},{"month":"10","num":497,"link":"","year":"2008","news":"","safe_title":"Secretary: Part 4","transcript":"[[The Ron Paul Revolution blimp floats]]\nPilot: Sir! The balloon is hailing us!\n[[Cory Doctorow's balloon appears]]\nCory: Ahoy.\nRon Paul: Doctorow!\nCory: I won't let you stop this nomination. We bloggers watch out for our own.\nRon Paul: Stand aside, Cory.\nCory: Nay!\nRon Paul: Very well. Battle stations!\n[[The Ron Paul Revolution blimp's gun takes aim]]\n<<Whirrr kachunk>>\n[[Cory Doctorow's balloon's gun takes aim]]\n<<Whirrrr kachunk>>\n[[Both airships open fire]]\n<<Pew pew pew>>\n<<Pew pew>>\n<<Boing! Boing!>>\n[[Inside the Ron Paul Revolution blimp's control room]]\nPilot: We're taking damage!\nRon Paul: Keep firing!\nPilot: No good! We're losing altitude!\n[[Outside the Ron Paul Revolution blimp, it hangs smoking in the air]]\nRon Paul: All engines full! Pull up!\nPilot: Can't, sir!\n[[The Ron Paul Revolution blimp begins to sink, smoking more heavily]]\n[[The blimp sinks further]]\nPilot: Sir, maybe if we dropped all this gold...\nRon Paul: Never!\n[[Inside the control room, tilted slightly]]\nPilot: We've lost, sir. We have to abort.\nRon Paul: Not yet, we don't! Open the loading bay doors.\n[[Camera zooms out slightly]]\nRon Paul: You take the blimp and fall back.\n<<click>>\nRon Paul: I've got a message to deliver.\n<<Whirr>>\n[[Ron Paul tosses his cane aside]]\n[[Ron Paul steadily transforms into Tron Paul]]\nNarrator: RON PAUL evolves into TRON PAUL\n[[Light cycle begins to form]]\n[[Tron Paul bends over the light cycle]]\n[[Light cycle finishes its formation]]\n[[Light cycle speeds off, trailing an American flag]]\n{{title text: It's time to draw the line.}}","alt":"It's time to draw the line.","img":"https://imgs.xkcd.com/comics/secretary_part_4.png","title":"Secretary: Part 4","day":"30"},{"month":"10","num":498,"link":"","year":"2008","news":"","safe_title":"Secretary: Part 5","transcript":"{{The Senate. Hat Guy sits before the committee at his hearing to become Internet Secretary.}}\nChairman: We were convened here to review your nomination for the position of internet secretary.\nChairman: However, on review of your qualifications, we've decided to sentence you to death.\nChairman: An unorthodox move, sure. But the vote was unanimous.\n{{Hat Guy is leaning back in his chair.}}\n[[Meanwhile . . .]]\nTron Paul: There's no grid! How do I steeeeer!!!!!\n{{Back at the Senate. Hat Guy is standing.}}\nHat Guy: Well, it's been fun. But I was never actually interested in taking the position. Good lord; listening to internet arguments all day? No thank you.\nChairman: Then why did you sit through all those hearings?\nHat Guy: It was taking us a while to move the pumps into the maintenance tunnels.\n{{The committee members murmur among themselves.}}\n{{There is a panel in the floor between Hat Guy and the committee.}}\n<<RUMBLE>>\n<<plink>> <<plink>>\n{{A red playpen ball bursts out of the panel and rolls towards the committee chairman.}}\n<<plink>>\n{{The room is still. Hat Guy's arms are folded.}}\n{{A geyser of red, white, and blue playpen balls bursts through the panel in the floor. Hat Guy is already gone.}}\n<<FOOM>>\n{{The committee members chase Hat Guy out the door as the Senate floor floods with playpen balls.}}\n{{The chase continues into the rotunda, as does the flood of playpen balls.}}\n{{Hat Guy stands in the middle of the rotunda as it fills with playpen balls, surrounded by members of the committee.}}\nCommittee Members: Security! Someone!\nCommittee Members: Get Him!\n{{Tron Paul bursts through the wall.}}\n<<CRASH>>\nTron Paul: Aaaaa!\n{{Hat Guy grabs the bottom of the lightcycle as Tron Paul goes by.}}\n<<snag>>\nTron Paul: Hey!\n{{Hat Guy swings onto the top of the light cycle.}}\n{{Hat Guy crouches on top of the light cycle.}}\nTron Paul: Get Off!\n{{Tron Paul and Hat Guy crash through the far wall of the rotunda.}}\n<<CRASH>>\n{{Tron Paul hits the ground.}}\n<<WHAM>>\nTron Paul: Ow!\n{{Hat Guy runs away.}}\nTron Paul: Ughhh.\n{{The lightcycle disappears.}}\nTron Paul: I feel queasy . . .\nCory Doctorow, above: Hey!\nHat Guy: Hi, Cory.\nCory Doctorow: Need a lift?\nHat Guy: Sure.\n{{Hat Guy and Cory Doctorow depart in Doctorow's balloon.}}\nCory Doctorow: So are you, like, a fugitive now?\nHat Guy: Well, I never did give them my name . . .\n[[But in the rotunda]]\n{{Senators play in the playpen balls.}}\nSenators: Let's jump down here from the balcony!\nSenators: Senior senators first!\nSenators: Wheeee!\nSenators: I'm a submarine!\n[[All is forgiven.]]\n{{title text: And they choose Al Gore as Internet Secretary.}}","alt":"And they choose Al Gore as Internet Secretary.","img":"https://imgs.xkcd.com/comics/secretary_part_5.png","title":"Secretary: Part 5","day":"31"},{"month":"11","num":499,"link":"","year":"2008","news":"","safe_title":"Scantron","transcript":"[[A classroom scene. There are two desks, and the front one is occupied by the STUDENT. The TEACHER stands panel right facing the student.]]\nMiss Lenhart (Teacher): Okay class, I've turned in your exams for grading. Now --\nStudent: Miss Lenhart?\n[[View is now simply student in desk and teacher. Teacher looks horrified.]]\nStudent: I used a #3 pencil instead of a #2. Will that mess anything up?\nMiss Lenhart (Teacher): You WHAT?\n[[Teacher stands, covering her head, in front of an off-panel right explosion. The UNSEEN SPEAKER is off-panel right.]]\n<<AIEE>>\n<<BLAM>>\nUnseen Speaker: OH GOD!\n[[The student and teacher are left-panel, both looking shocked. The UNSEEN SPEAKER is still off-panel right.]]\nUnseen speaker: OH GOD!\nUnseen speaker: I've never seen so much blood!\n{{Title text: Also, after all the warnings about filling in the bubbles completely, I spent like 30 seconds on each one.}}","alt":"Also, after all the warnings about filling in the bubbles completely, I spent like 30 seconds on each one.","img":"https://imgs.xkcd.com/comics/scantron.png","title":"Scantron","day":"3"},{"month":"11","num":500,"link":"","year":"2008","news":"","safe_title":"Election","transcript":"[[Character sits at his computer desk, staring at his computer.]]\nIt's over.\nAfter twenty months it's finally over.\nI don't have to be an election junkie anymore.\n[[Closeup of character's face and screen.]]\nI don't have to care about opinion polls, exit polls, margins of error, attack ads, game-changers, tracking polls, swing states, swing votes, the Bradley effect, or <name> the <occupation>.\nI'm free.\n[[Character staring at his computer screen, full shot.]]\n[[Character types on his computer.]] <<Tap Tap>>\n[[On screen]]Google  \"2012 polling statistics\"\n{{Title text: \"Someday I'll be rich enough to hire Nate Silver to help make all my life decisions.  'Should I sleep with her?'  'Well, I'm showing a 35% chance it will end badly.' \"}}","alt":"Someday I'll be rich enough to hire Nate Silver to help make all my life decisions.  'Should I sleep with her?'  'Well, I'm showing a 35% chance it will end badly.'","img":"https://imgs.xkcd.com/comics/election.png","title":"Election","day":"5"},{"month":"11","num":501,"link":"","year":"2008","news":"","safe_title":"Faust 2.0","transcript":"Satan: Mortal! I come offering a deal - \nGuy: Read the sign.\nSatan: \"By entering this room, you agree to forfeit your own soul rather than negotiate with the mortal within...\" Wait, you can't - \nGuy: Too late.\nCaption: Mephistopheles encounters the E.U.L.A.","alt":"The only blood these contracts are signed in is from me cutting my hand trying to open the goddamn CD case.","img":"https://imgs.xkcd.com/comics/faust_20.png","title":"Faust 2.0","day":"7"},{"month":"11","num":502,"link":"","year":"2008","news":"","safe_title":"Dark Flow","transcript":"[[Man in a beret sits at a computer.  A second man sits on the couch, which is facing the opposite direction, reading a book]]\nMan in beret: According to the A.S.T paper, every galaxy is being pulled toward one area of the sky\nMan in beret [[off-panel]]: They hypothesize that it may be due to a supermassive object beyond the edge of the visible universe.\nMan on the couch: Maybe it's your mom - Zing!\nMan in the beret: Do you think?\n[[Outside at night.  Man in the beret is looking through a telescope.]]\nMan in beret: Pull Harder, Mom. - I Miss you.\n{{Title text: The Pioneer anomaly is due to the force of my love.}}","alt":"The Pioneer anomaly is due to the force of my love.","img":"https://imgs.xkcd.com/comics/dark_flow.png","title":"Dark Flow","day":"10"},{"month":"11","num":503,"link":"","year":"2008","news":"","safe_title":"Terminology","transcript":"[[Map of world with North America centered. An \"x\" is placed near east coast. Asia is labeled \"The East\" and Europe \"The West.\"]]\n\"The East\" <- West x (me) East -> \"The West\"\nThis always bugged me.","alt":"Also, is it just me, or do Japan and New Zealand look suspiciously similar?  Has anyone seen them at a party together?","img":"https://imgs.xkcd.com/comics/terminology.png","title":"Terminology","day":"12"},{"month":"11","num":504,"link":"","year":"2008","news":"","safe_title":"Legal Hacks","transcript":"[[A woman sits at her computer, a man standing behind her. The woman speaks first.]]\nWoman: Another ISP's filtering content.\nMan: Thank God for Crypto.\n[[The man stands alone; the woman is presumably off-panel left.]]\nMan: It wasn't that long ago that RSA was illegal to export. Classified a munition.\n[[The woman, sitting in her chair, is looking back towards the man, presumably off-panel right.]]\nWoman: You know, I think the crypto community took the wrong side in that fight. We should've lobbied to keep it counted as a weapon.\nMan: Why?\n[[She is now turned around in the chair looking at the man, who is in-panel again.]]\nWoman: Once they get complacent, we break out the second amendment.\n[[The man has his hand on his chin, contemplatively.]] \nMan: ...Damn.\n{{Title text: It's totally a reasonable modern analogue.  Jefferson would have been all about crypto.}}","alt":"It's totally a reasonable modern analogue.  Jefferson would have been all about crypto.","img":"https://imgs.xkcd.com/comics/legal_hacks.png","title":"Legal Hacks","day":"14"}]
