[{"month":"11","num":505,"link":"","year":"2008","news":"","safe_title":"A Bunch of Rocks","transcript":"[[Man is walking, alone in desert.  Man is narrating his own situation]]\nNarrator: So I'm stuck in this desert for eternity.\nNarrator: I don't know why. I just woke up here one day.\nNarrator: I never feel hungry or thirsty.\nNarrator: I just walk.\nNarrator: Sand and rocks...\nNarrator: ...stretch to infinity.\nNarrator: As best as I can tell.\n[[Man is sitting in the desert, in a contemplative position]]\nNarrator: There's plenty of time for thinking out here.\nNarrator: An eternity really.\n[[Man is sketching stuff in the sand]]\nNarrator: I've rederived modern math in the sand\nNarrator: and then some.\n[[Different graph types are depicted]]\nNarrator: Physics too.  I worked out the kinks in quantum mechanics and relativity.\nNarrator: Took a lot of thinking, but this place has fewer distractions than a Swiss patent office.\n[[Man is walking along the desert, laying out rocks]]\nNarrator: One day I started laying down rows of rocks.\n[[Man continues to deploy rocks]]\nNarrator: Each new row followed from the last in a simple pattern.\n[[Image continues to zoom out showing laid out rocks]]\nNarrator: With the right set of rules and enough space,\nNarrator: I was able to build a computer.\nNarrator: Each new row of stones is the next iteration of the computation.\nNarrator: Sure it's rocks instead of electricity, but it's the same* thing.\nNarrator: Just slower.\nNotation: *Turing-complete\n[[Man in contemplative pose]]\nNarrator: After a while, I programmed it to be a physics simulator.\n[[Image of binary encoding depicted in rocks]]\nNarrator: Every piece of information about a particle was encoded as a string of bits written in the stones.\n[[Representations of two particles interacting]]\nNarrator: With enough time and space, I could fully simulate two particles interacting.\n[[Man standing before the vastness of the desert]]\nNarrator: But I have infinite time and space.\n[[Depiction of a universe]]\nNarrator: So I decided to simulate a universe.\n[[Man is walking about his rocks, changing placement]]\nNarrator: The eons blur past as I walk down a single row.\n[[Zoom out of the rows of rocks]]\nNarrator: The rows blur past to compute a single step.\n[[Shows placement of two rocks]]\nNarrator: And in the simulation...\n[[The two rocks have moved; an after-image of their previous placement is present]]\nNarrator: ...another instant ticks by.\n[[Man #2 observes a mote of dust vanish]]\nNarrator: So if you see a mote of dust vanish from your vision in a little flash or something\n[[Man is rearranging rocks]]\nNarrator: I'm sorry. I must have misplaced a rock...\nNarrator: ...sometime in the last few billions and billions of millennia. \n[[Man in front of the vastness of his infinite desert]]\nNarrator: Oh and...\n[[Man is in a classroom setting, girl and professor are present]]\nNarrator: if you think the minutes in your morning lecture are taking a long time for _YOU_...\n{{title text: I call Rule 34 on Wolfram's Rule 34.}}","alt":"I call Rule 34 on Wolfram's Rule 34.","img":"https://imgs.xkcd.com/comics/a_bunch_of_rocks.png","title":"A Bunch of Rocks","day":"17"},{"month":"11","num":506,"link":"","year":"2008","news":"","safe_title":"Theft of the Magi","transcript":"[[Black Hat Guy is holding up a video game.  Woman is holding up a harness.]]\nBlack Hat Guy: Hey. I sold your Roomba on Craigslist so I could buy myself Left 4 Dead.\nWoman: But I eBayed your XBox so I could get this dueling harness for my Roomba!\nBlack Hat Guy: Aww.\nWoman: Aww.\n\n{{alt text: Every Roomba needs a dueling harness..}}","alt":"Every Roomba needs a dueling harness.","img":"https://imgs.xkcd.com/comics/theft_of_the_magi.png","title":"Theft of the Magi","day":"19"},{"month":"11","num":507,"link":"","year":"2008","news":"","safe_title":"Experimentation","transcript":"[[A young male and female are holding hands, and the female is pointing off to the side.]]\nFemale:  Oh, hey, it's twelve of the dudes from control group B!\nI'm cool with her past lesbian experimentation, but I wish she hadn't insisted the experiments be scientifically rigorous.\n{{title text: I understand large sample sizes are key to a low sigma, but the entire sophomore class?}}","alt":"I understand large sample sizes are key to a low standard error of the mean, but the entire sophomore class?","img":"https://imgs.xkcd.com/comics/experimentation.png","title":"Experimentation","day":"21"},{"month":"11","num":508,"link":"","year":"2008","news":"","safe_title":"Drapes","transcript":"Man: So does the carpet match the drapes?\nWoman: Yes but not the upholstery.\n[[Woman walks away]]\n[[Man looks confused]]\n{{title text: Wait, What?}}","alt":"Wait, what?","img":"https://imgs.xkcd.com/comics/drapes.png","title":"Drapes","day":"24"},{"month":"11","num":509,"link":"","year":"2008","news":"","safe_title":"Induced Current","transcript":"[[A man wearing a beret, extension cord in hand, approaches Randall as he works at his computer.]]\nBeret: Can I plug my extension cord over here?\nRandall: No.\nBeret: Why?\nRandall: Solar Flares.\n[[A diagram is displayed, illustrating the Earth's magnetic field being permanently impacted by a large solar flare (represented by a large arrow).]]\n[[A second diagram is presented, illustrating the Earth's rotation and the resulting impact that the solar flare would have on the earth's magnetic field. ]]\nRandall: A large solar flare could dent the Earth's magnetic field inwards. The Earth's spin could then induce a strong current in any long conductors, melting them and starting fires. By extending your cord, you could kill us all.\n[[Stunned, the man wearing the beret looks down at the cord he carries.]]\nBeret: Really?\nRandall: Warn your friends.\n[[Dejected, the man walks away, cord in tow.]]\n[[Randall looks up from his computer as he is braced by his girlfriend, a stern look in her face.]]\nGirlfriend: That was MEAN.\nRandall: Listen, SOMEBODY has to keep MythBusters in business. Next season should be fun.\n{{title text: The MythBusters need to tackle whether a black hole from the LHC could REALLY destroy the world.}}","alt":"The MythBusters need to tackle whether a black hole from the LHC could REALLY destroy the world.","img":"https://imgs.xkcd.com/comics/induced_current.png","title":"Induced Current","day":"26"},{"month":"11","num":510,"link":"","year":"2008","news":"","safe_title":"Egg Drop Failure","transcript":"[[Boy tosses contraption off of building with egg in it.]]\n[[Egg cracks and little chick flies out while people look quizzically at the hatched egg.]]\n<<crack!>><<chirp, chirp>>\n[[Device with cracked egg lands on ground.]]\n{{Title: I hear my brother Ricky won his school's egg drop by leaving the egg inside the hen.}}","alt":"I hear my brother Ricky won his school's egg drop by leaving the egg inside the hen.","img":"https://imgs.xkcd.com/comics/egg_drop_failure.png","title":"Egg Drop Failure","day":"28"},{"month":"12","num":511,"link":"","year":"2008","news":"","safe_title":"Sleet","transcript":"[[Rainy, cold, windy street; girl is walking along street; narration is from girl's point-of-view]]\nNarrator: The weather outside is frightful.\nNarrator: I hate trudging through the icy slush and biting sleet.\nNarrator: But it beats lying in our warm, cozy bed\nNarrator: Listening to you talk about DRM for hours on end\nBoy: (offscreen) Come back! Just listen to this one quote from \nFree Culture\n\n{{title text: I mean, I can barely hear myself complaining about Battlestar Galactica.}}","alt":"I mean, I can barely hear myself complaining about Battlestar Galactica.","img":"https://imgs.xkcd.com/comics/sleet.png","title":"Sleet","day":"1"},{"month":"12","num":512,"link":"","year":"2008","news":"","safe_title":"Alternate Currency","transcript":"Television: With the collapse of the dollar, the government has endorsed an alternate currency.  Your monetary worth is now determined by the number of funny pictures saved to your hard drive.\nCaption: I have been preparing for this moment all my life.\n{{Title text:  For the first time ever, the phrase, 'I'd like to thank everyone at 4chan for making me successful and happy' is uttered.}}","alt":"For the first time ever, the phrase 'I'd like to thank everyone at 4chan for making me successful and happy' is uttered.","img":"https://imgs.xkcd.com/comics/alternate_currency.png","title":"Alternate Currency","day":"3"},{"month":"12","num":513,"link":"","year":"2008","news":"","safe_title":"Friends","transcript":"[[A boy is talking to a girl.]]\nBoy: I have a crush on you.\n[[Boy is shown alone.]]\nBoy: I could ask you out, and move on with my life if you said no.\nBoy: Or, WE COULD BE FRIENDS!\nBoy: See, I don't want to consider that you might not be attracted to me. I'm scared of rejection, so I've decided relationships should grow smoothly out of friendships.\n[[Girl is shown sitting at her computer.]]\nBoy: When you have problems, I'll be there for you, night after night.\nBoy: Selflessly.\nComputer (Instant message from boy): *hug*\n[[Girl is shown slamming door and walkng to boy to get a hug.]]\nBoy: I'll tear down the jerks you date, and wait for you to realize how good I am for you. That only I will ever understand you.\n<<SLAM>>\nGirl: <<Sniff>>\nBoy: There there\n[[Boy is shown alone again.]]\nBoy: You don't want to hurt my feelings, and I won't ever force the issue. I'll tell myself it's because I \"Value our friendship.\"\nBoy: Bit by bit, I'll make you depend on me.\n[[Boy and girl are shown sitting on a rock in a park, reading a book together.]]\nBoy: You'll think about how long it would take to build this kind of connection again.\n[[Boy and girl are shown sitting on a couch drinking, getting closer, and kissing.]]\nBoy: And in a moment of weakness\nBoy: and loneliness\nBoy: you'll give in.\n[[Girl is shown sitting at the computer with boy behind her facing the other way washing dishes]]\nBoy: It'll feel comfortable and natural. You'll quietly revise your definition of love and try to be happy. And sometimes you will be.\n[[Girl is shown siting at the computer.]]\nBoy: Only the wistfulness in your gaze and the tiny pause before you say \"I love you\" will hint that this wasn't the ending you'd hoped for.\nBoy: Sound good?\n[[Girl is holding hands with another boy, talking to boy.]]\nGirl: ...I'm going to date this jerk.\nBoy: But he doesn't respect you!\n{{title text: Friends with detriments.}}","alt":"Friends with detriments.","img":"https://imgs.xkcd.com/comics/friends.png","title":"Friends","day":"5"},{"month":"12","num":514,"link":"https://en.wikipedia.org/wiki/Relativity_of_simultaneity","year":"2008","news":"","safe_title":"Simultaneous","transcript":"Male: \"Mmm, simultaneous orgasms\"\nFemale: \"That wasn't simultaneous\"\nMale: \"Huh?  It totally was!\"\nA common disagreement when one of you is doing all the moving\n{{Alt Text: I'm leaving you for your twin.  He's more mature than you by now.}}","alt":"I'm leaving you for your twin.  He's more mature than you by now.","img":"https://imgs.xkcd.com/comics/simultaneous.png","title":"Simultaneous","day":"8"},{"month":"12","num":515,"link":"","year":"2008","news":"","safe_title":"No One Must Know","transcript":"[[Man with hat and his female lover are talking and holding hands]]\nHat Man: You're my dearest darling danish.\nHat Man's Girl: And you're my lovely cutie pie.\nHat Man: Well, you're --\n[[Another man enters]]\n[[Hat man and his female lover look at each other]]\n[[Hat man is holding a bloody sack, while his female lover is pushing down on a shovel to make a hole for the body.]]\n{{Alt-Text: Or perhaps they knew he was there, and were just trying to torment him first.}}","alt":"Or perhaps they knew he was there, and were just trying to torment him first.","img":"https://imgs.xkcd.com/comics/no_one_must_know.png","title":"No One Must Know","day":"10"},{"month":"12","num":516,"link":"","year":"2008","news":"","safe_title":"Wood Chips","transcript":"[[Man leans on desk; Woman sits behind desk.]]\nMan: Did you ever figure out those mysterious woodchips?\nWoman: The ones in the hallway? No.\nMan: You didn't suspect that they matched the timber used in 1861 to build the \"ghost ship\" Mary Celeste, prompting you to send them to a lab for analysis, the results of which raised new and stranger questions?\nWoman: No, I threw them out. Why?\n{{My hoaxes need to get a lot less subtle.}}\n{{alt-text: You didn't run a chemical analysis against the Shroud of Turin? Man, all that work for NOTHING.}}","alt":"You didn't run a chemical analysis against the Shroud of Turin?  Man, all that work for NOTHING.","img":"https://imgs.xkcd.com/comics/wood_chips.png","title":"Wood Chips","day":"12"},{"month":"12","num":517,"link":"","year":"2008","news":"","safe_title":"Marshmallow Gun","transcript":"Narrator: I got this gun that shoots marshmallows.\n[[A man removes a marshmallow gun from a box.]]\n[[Man shoots woman with marshmallow gun from offpanel.]]\n<<POP POP POP>>\n<<WHAP WHAP WHAP>>\n<<POP>>\n[[Woman sighs]]\n<<POP POP>>\n[[Woman removes a super soaker from desk drawer.]]\n[[Woman shoots offscreen man with super soaker.]]\nMan: (offscreen) AUGH!\n<<FWOOSH>>\nMan: (offscreen) Man, I forgot that was there.\nNarrator: The next day, everyone else got them too.\n[[Woman and beret guy brandish marshmallow guns.]]\nWoman: Hey noob!  Eat stay-puft(R)!\n[[Woman shoots marshmallow gun.]]\n<<POP POP POP>>\n[[Man shoots marshmallow gun.]]\n<<POP POP POP>>\n[[Woman and man shoot marshmallows into the air, crossing the streams of fire.]]\nBeret Guy: (offscreen) No, don't cross the ~\n<<FOOM>>\n<<ROAAAR>>\n[[Woman, Man, and Beret Guy are all standing with weapons pointed at the ground]]\nWoman: Okay, this is bad.\nOffscreen: You're shooting what?\n{{title text: Except in reality crossing a stream of marshmallows would create a giant Bill Murray.}}","alt":"Except in reality crossing a stream of marshmallows would create a giant Bill Murray.","img":"https://imgs.xkcd.com/comics/marshmallow_gun.png","title":"Marshmallow Gun","day":"15"},{"month":"12","num":518,"link":"","year":"2008","news":"","safe_title":"Flow Charts","transcript":"A guide to [[line break, bigger text]] understanding flow charts [[line break, normal text]] presented in flow chart form.\n0.Box: Start\n   [[Arrow|Text=null Target=1.Box]]\n1.Box: Do you understand flow charts?\n   [[Arrow|Text='Yes' Target=2.Box]]\n   [[Arrow|Text='No' Target=4.Box]]\n2.Box: Good\n   [[Arrow|Text='Yes' Target=3.Box]]\n3.Box: Let's go drink.\n   [[Arrow|Text='6 drinks' Target=Final.Box]]\n4.Box: Okay. You see the line labeled \"yes\"?\n   [[Arrow|Text='Yes' Target=6.Box]]\n   [[Arrow|Text='No' Target=5.Box]]\n5.Box: But you see the ones labeled \"no\".\n   [[Arrow|Text='Yes' Target=End1.Box]]\n   [[Arrow|Text='No' Target=End2a.Box]]\nEnd1.Box: Wait, what?\n   [[NoArrows]]\nEnd2a.Box: Listen.\n   [[Arrow|Text=null Target=End2b.Box]]\nEnd2b.Box: I hate you.\n   [[NoArrows]]\n6.Box: ...and you can see the ones labeled \"no\"?\n   [[Arrow|Text='Yes' Target=3.Box]]\n   [[Arrow|Text='No' Target=7.Box]]\n7.Box: But you just followed them twice!\n   [[Arrow|Text='Yes' Target=8a.Box]]\n   [[Arrow|Text='No' Target=8a.Box]]\n8a.Box: (That wasn't a question.)\n   [[Arrow|Text=null Target=8b.Box]]\n8b.Box: Screw it.\n   [[Arrow|Text=null Target=3.Box]]\nFinal.Box: Hey I should try installing FreeBSD!\n{{Title text: At 8 drinks, you switch the torrent from FreeBSD to Microsoft Bob. C'mon, it'll be fun!}}","alt":"At 8 drinks, you switch the torrent from FreeBSD to Microsoft Bob.  C'mon, it'll be fun!","img":"https://imgs.xkcd.com/comics/flow_charts.png","title":"Flow Charts","day":"17"},{"month":"12","num":519,"link":"","year":"2008","news":"","safe_title":"11th Grade","transcript":"[[Bar graph title: Usefulness to career success]]\n900 hours of classes [[small bar]]\n400 hours of homework [[small bar]]\nOne weekend messing with Perl [[huge bar]]\n{{title text: And the ten minutes striking up a conversation with that strange kid in homeroom sometimes matters more than every other part of high school combined.}}","alt":"And the ten minutes striking up a conversation with that strange kid in homeroom sometimes matters more than every other part of high school combined.","img":"https://imgs.xkcd.com/comics/11th_grade.png","title":"11th Grade","day":"19"},{"month":"12","num":520,"link":"","year":"2008","news":"","safe_title":"Cuttlefish","transcript":"We visit a bio lab: [[Man and woman visit a bio lab where they look into a tank that the scientists point at.]]\nScientist- \"These are cuttlefish.\"\n[[Image of a cuttlefish]] They're frighteningly smart, have manipulating arms and tentacles, have ink jets, can dart backwards and see the polarization of light through their w-shaped pupils. And their sides are 200 dpi display screens which they use for camouflage and communication.\nScientist - \"When we realized how intelligent they were, we began to teach them. They've advanced quickly. Cuttlefish: GO.\"\n[[Cuttlefish float out of the tank at man and woman]]\nCuttlefishes- \"Kill the physicists... kill the physicists\"\n[[Cuttlefish zap the man and Megan as they fall]]\nMan- [[Waking up from his sleep]] \"Oh god. I knew it.\"\nXKCD - Salutes Bio Majors\n[[Bottle is pouring into a flask, and a man takes the flask and drinks from it]] If we join you against the chemists, will you train your fleshy minions to leave us alive?\n{{Alt-Text: Unless the CS Majors finish the robot revolution before you finish the cephalopod one}}","alt":"Unless the CS students finish the robot revolution before you finish the cephalopod one.","img":"https://imgs.xkcd.com/comics/cuttlefish.png","title":"Cuttlefish","day":"22"},{"month":"12","num":521,"link":"","year":"2008","news":"","safe_title":"2008 Christmas Special","transcript":"The 2008 XKCD Christmas Special\nNarrator: Due to the slowing economy, we could only afford to produce the prime-numbered panels.\nNarrator: You should be able to infer the missing parts of the story easily enough.\nNarrator: We apologize for the inconvenience.\n[[The first panel is blank]]\n[[Girl carrying Christmas lights and guy watching]]\nGirl: I'm going to one-up those Christmas light displays on YouTube.\n[[Girl thinking]]\nGirl: Hmm. Needs more flair. Do you know what happens when you fire sodium pellets into a snowbank?\nGuy: No.\nGirl: Me neither.\n[[The next panel is blank]]\n[[Girl sitting in front of a console]]\nGirl: Whoops, one of the Arduino control boards sublimated.\nGirl: If only I could make it self-repairing...\n[[The next panel is blank]]\nGirl: Shit. The system has become sentient.\nGuy: Friggin' Python.\nSystem: GRAAARR!\n[[The next three panels are blank]]\n[[Girl showing laptop to guy]]\nGirl: But according to this email forward, Santa is secretly a Muslim!\nGuy: It explains everything!\n[[The next panel is blank]]\nGirl: Okay, the cloned raptors are hunting the last of the cyborgs. We're safe.\nGuy: Are you sure you thought this through?\n[[The next three panels are blank]]\n[[Two couples appear in this next panel]]\nGuy: Are the raptors contained?\nSecond girl: Sure. Unless they figure out how to build lightsabers.\n[[The next panel is blank]]\n[[Guy with hat fighting with a raptor using lightsabers]]\nGuy: It's all right. I've got her.\n[[Lightsaber appears from behind]]\n<<Snap-hiss!>>\nGuy: ...Clever girl.\n[[The next three panels are blank]]\n[[Bill Gates is holding a weapon over Santa's body. The two girls are watching]]\nGirl: Great. Bill Gates kills Santa.\nBill Gates: I thought it was Stallman with a dyed beard.\n[[The next five panels are blank]]\n[[Girl and guy with hat are looking at a tree]]\nGirl: Where did you get this Christmas tree?\nGuy: Nowhere.\nGirl: Did you cut down the Yggdrasil?\nGuy: ...Maybe.\n[[The next panel is blank]]\n[[Girl and guy holding hands and looking at reader]]\nNarrator: Merry Christmas from XKCD <3\n[[The last panel is blank]]\n{{title text: 'How could you possibly think typing 'import skynet' was a good idea?'}}","alt":"'How could you possibly think typing 'import skynet' was a good idea?'","img":"https://imgs.xkcd.com/comics/2008_christmas_special.png","title":"2008 Christmas Special","day":"24"},{"month":"12","num":522,"link":"","year":"2008","news":"","safe_title":"Google Trends","transcript":"Bloggers were recently amused to discover that, according to Google Trends, the search term \"men kissing\" is most popular in conservative Utah.  A few other embarrassing correlations:\nSearch Term, Top City\nInstalling Ubuntu, Redmond, WA\nRunning for President in 2010, Wasilla, AK\nLincoln Fan Fiction, Chicago, IL\nRaptors on Hoverboards, Somerville, MA\nHow is babby formed?, Wasilla, AK\nI hate this website, Mountain View, CA\n{{Alt Text:  Obama has been writing Lincoln\nObama erotic fan fiction on his secret livejournal.  Excerpt:  Lincoln lay back on the bed, nude save for his trademark stovepipe hat.  'Tell me,' he purred seductively, as he and Obama formed a more perfect union.  'When you come, is it 10% ethanol?'}}","alt":"Obama has been writing Lincoln/Obama erotic fan fiction on his secret livejournal.  Excerpt:  Lincoln lay back on the bed, nude save for his trademark stovepipe hat.  'Tell me,' he purred seductively, as he and Obama formed a more perfect union. 'When you come, is it 10% ethanol?'","img":"https://imgs.xkcd.com/comics/google_trends.png","title":"Google Trends","day":"26"},{"month":"12","num":523,"link":"","year":"2008","news":"","safe_title":"Decline","transcript":"[[A man is pointing at a line graph at a specific point where it slopes down. The Y Axis shows that as Y increases, Love increases.]]\nMan: \"Our relationship entered its decline at this point.\"\nWoman[[Outside of panel]]: \"That's when you started graphing everything.\"\nMan: \"Coincidence!\"\n{{title text: 'There is also a spike on the Fourier transformation at the one month mark where--'  'You want to stop talking right now.'}}","alt":"'There's also a spike on the Fourier transform at the one-month mark where --' 'You want to stop talking right now.'","img":"https://imgs.xkcd.com/comics/decline.png","title":"Decline","day":"29"},{"month":"12","num":524,"link":"","year":"2008","news":"","safe_title":"Party","transcript":"Hat guy: And so I hired Rick Astley to show up at her party.\nGuy: And rickroll her? Isn't that a little...last year?\nHat guy: Ah, but he's not going to sing.\nGirl 1: Hey is that Rick Astley?\nGirl 2: I think it is. He just came in.\nGirl 1: Oh no. Brace yourself.\nGirl 1:  Wait. He's just standing there. Where's the song?\nGirl 1:  He's staring at me.\nGirl 1:  This is a little creepy.\nGirl 1:  What's going on?\nGirl 1:  That's actually Rick Astley Staring at me.\nGirl 1:  What's he doing?\nGirl 1:  Oh God, I keep expecting it, hearing it in my head.\n[[Girl 1 pulls at her hair]]\nGirl 1: Just do it already!\n[[Girl 1 runs stage right]]\nGirl 1: AAAAAAAA\n<<SLAM>>\nGirl 2: Mr. Astley?\nRick Astley: Yes?\nGirl 2: What did you do to her? What was that?\nRick Astley: That, my dear,\n[[Rick Astley puts on sunglasses]]\nRick Astley: Is how I roll.\n{{title text: I wonder what 2008 meme will go bizarrely mainstream in 2009 like Rickrolling did 2007-2008.  I Accidentally <noun>?  Yo dawg?  Place your bets now!}}","alt":"I wonder what 2008 meme will go bizarrely mainstream in 2009 like Rickrolling did 2007-2008.  I Accidentally <noun>?  Yo dawg?  Place your bets now!","img":"https://imgs.xkcd.com/comics/party.png","title":"Party","day":"31"},{"month":"1","num":525,"link":"","year":"2009","news":"","safe_title":"I Know You're Listening","transcript":"Now and then, I announce \"I know you're listening\" to empty rooms.\n[[Man is sitting in an armchair, reading.  He murmurs something.]]\n[[Second man in front of a large computer terminal jumps out of chair after hearing the first man mumble. His chair has fallen over]]\nIf I'm wrong, no one knows.  And if I'm right, maybe I just freaked the hell out of some secret organization.\n{{Title Text: Basically it's Pascal's Wager for the paranoid prankster}}","alt":"It's basically Pascal's Wager for the paranoid prankster.","img":"https://imgs.xkcd.com/comics/i_know_youre_listening.png","title":"I Know You're Listening","day":"2"},{"month":"1","num":526,"link":"","year":"2009","news":"","safe_title":"Converting to Metric","transcript":"Guide to Converting to Metric\nThe key to converting to metric is establishing\nnew reference points.  When you hear \"26 degrees centigrade\",\ninstead of thinking \"That's 79 degrees fahrenheit\" you should think,\n\"that's warmer then a house but cool for swimming.\"\nhere are some helpful tables of reference points:\nTemperature:\n60 degrees centigrade - Earth's Hottest\n45 degrees centigrade - Dubai Heat Wave\n40 degrees centigrade - Southern US Heat Wave\n35 degrees centigrade - Northern US Heat Wave\n30 degrees centigrade - Beach weather\n25 degrees centigrade - Warm Room\n20 degrees centigrade - Room Temperature\n10 degrees centigrade - Jacket Weather\n0 degrees centigrade - Snow!\n-5 degrees centigrade - Cold Day (Boston)\n-10 degrees centigrade - Cold Day (Moscow)\n-20 degrees centigrade - FuckFuckFuckCold\n-30 degrees centigrade - Fuuuuuuuuuuuuck!\n-30 degrees centigrade - Spit goes \"ckink\"\n[[Stick figure next to last three lines]]\nMan: <<Pthoo>> [[Man spits]]\nSpit: <<Clink!>> [[Spit bounces off ground]]\nLength\n1cm - Width of microSD card\n3cm - Length of SD card\n12cm - CD Diameter\n14cm - Penis\n15cm - BIC pen\n80cm - Doorway width\n1m - Lightsaber Blade\n170cm - Summer Glau\n200cm - Darth Vader\n2.5m - Ceiling\n5m - Car-length\n16m4cm - Human tower of Serenity crew\n[[Human tower of Serenity crew stick figures depicted taking up from second line of panel to bottom]]\nSpeed\n5 kph - 1.5 m\ns - Walking\n13 kph - 3.5 m\ns - Jogging\n25 kph - 7 m\ns - Sprinting\n35 kph - 10 m\ns - Fastest Human\n45 kph - 13 m\ns - Housecat\n55 kph - 15 m\ns - Rabbit\n75 kph - 20 m\ns - Raptor\n100 kph - 25 m\ns - Slow Highway\n110 kph - 30 m\ns - Interstate (65 MPH)\n120 kph - 35 m\ns - Speed you actually go when it says \"65\"\n140 kph - 40 m\ns - Raptor on Hoverboard\nVolume\n3mL - Blood in a fieldmouse\n5mL - Teaspoon\n30mL - Nasal Passages\n40mL - Shot Glass\n  So when it's {{Nasal Passages}} blocked, the mucus in your nose could about fill a shot glass.\n  [[Image of a shot glass]] Related: I've invented the worst mixed drink ever.\n350mL - Soda Can\n500mL - Water Bottle\n3L - Two-Liter Bottle\n5L - Blood in a Human Male\n30L - Milk Crate\n55L - Summer Glau\n65L - Dennis Kucinich\n75L - Ron Paul\n200L - Fridge\n[[Stick figure shoving stick figures of Ron Paul, Summer Glau, and Dennis Kucinich into fridge]]\n[[Above fridge, circled, is 55+65+75 < 200]]\nMass\n3g - Peanut M&M\n100g - Cell Phone\n500g - Bottled Water\n1kg - Ultraportable Laptop\n2kg - Light-Medium Laptop\n3kg - Heavy Laptop\n5kg - LCD Monitor\n15kg - CRT Monitor\n4kg - Cat [[Drawing of cat]]\n4.1kg - Cat (With Caption) [[Drawing of cat, going \"Mrowl?\", and holding a caption]]\n60kg - Lady\n70kg - Dude\n150kg - Shaq\n[[Stick figure of lady and dude beside previous 3 lines]]\n200kg - Your Mom\n220kg - Your Mom (incl. cheap jewelrey)\n223kg - Your Mom (also incl. Makeup)\n{{Alt-text: According to River, 'adequate' vacuuming systems drain the human body at about half a liter per second.}}","alt":"According to River, 'adequate' vacuuming systems drain the human body at about half a liter per second.","img":"https://imgs.xkcd.com/comics/converting_to_metric.png","title":"Converting to Metric","day":"5"},{"month":"1","num":527,"link":"","year":"2009","news":"","safe_title":"Keynote","transcript":"[[Man with top hat talking to Man sitting at computer]]\nMan sitting at computer: Huh-Steve Jobs isn't doing a keynote this year, citing massive weight loss due to some hormonal problem.\nMan with top hat: Too bad. I bet Apple was excited about unveiling the thinnest and lightest CEO in the industry.   \n{{title text: He should be better soon -- now that the Apple Store is getting rid of DRM, Cory Doctorow will get rid of his Steve Jobs voodoo doll.}}","alt":"He should be better soon -- now that the Apple Store is getting rid of DRM, Cory Doctorow will get rid of his Steve Jobs voodoo doll.","img":"https://imgs.xkcd.com/comics/keynote.png","title":"Keynote","day":"7"},{"month":"1","num":528,"link":"","year":"2009","news":"","safe_title":"Windows 7","transcript":"[[A girl is standing behind a guy sitting at a desk using his laptop]]\nGirl: What are you doing?\nGuy: Trying the Windows 7 beta.\nGirl: Why is it showing a picture of Hitler?\n[[The laptop's screen is shown with Adolph Hitler's face on it]]\nGuy: I don't know.  I can't get it to do anything else.\nGirl: There's no UI?\nGuy: No, just Hitler.\n[[Return to the original scene, except the girl is now scratching her head in confusion]]\nGirl: Did you try Ctrl-Alt-Delete?\nGuy: It just makes Hitler's eyes flash.\nGirl: Huh.\n[[Scene remains basically the same, except the girl is no longer scratching her head and the guy is no longer typing on the laptop]]\nGirl: Well, it's better than Vista.\nGuy: True.\n{{title text: Disclaimer: I have not actually tried the beta yet.  I hear it's quite pleasant and hardly Hitler-y at all.}}","alt":"Disclaimer: I have not actually tried the beta yet.  I hear it's quite pleasant and hardly Hitler-y at all.","img":"https://imgs.xkcd.com/comics/windows_7.png","title":"Windows 7","day":"9"},{"month":"1","num":529,"link":"","year":"2009","news":"","safe_title":"Sledding Discussion","transcript":"[[Girl looks out window through blinds]]\nGirl: It's snowing!\nBoy: [[from off-screen]] Sled time!\n[[Girl and boy outside with sled, at the top of a hill]]\nBoy: It depresses me that I'm too old to learn another language fluently.  My brain's solidified.\n[[Girl and boy sledding down the hill]]\nGirl: Is there one you wish you knew?\nBoy: No, I just hate having options closed to me.  Like I've given up a life that was once possible.\n[[At the bottom of the hill, sled has stopped]]\nGirl: Which reminds me -- our anniversary is coming up.\nGirl: Man, that ride failed to be a metaphor for our conversation.\nBoy: Guess this isn't the Calvin & Hobbes-model toboggan.\n{{title text: If you get your hands on that one, it's the worst place to have a breaking-up conversation.}}","alt":"If you get your hands on that one, it's the worst place to have a breaking-up conversation.","img":"https://imgs.xkcd.com/comics/sledding_discussion.png","title":"Sledding Discussion","day":"12"},{"month":"1","num":530,"link":"","year":"2009","news":"","safe_title":"I'm An Idiot","transcript":"[[Ponytailed stick figure approaches stick figure, who is sitting on porch steps, laptop in lap and backpack open]]\nPonytailed stick figure: Should  I ask?\nStick figure: I'm locked out, and I'm trying to get my roommate to let me in.\n[[unplugged cell phone on table]]\nStick figure: First I tried her cell phone, but it's off.\n[[Stick figure sitting on steps, laptop in lap and gesturing]]\nStick figure: Then I tried IRC, but she's not online.\n[[Stick figure standing in front of house and looking up at window]]\nStick figure: I couldn't find anything to throw at her window,\n[[living room with couch\neasy chair and computer set up]]\nStick figure: so I SSH'd into the Mac Mini in the living room and got the speech synth to yell at her for me.\nComputer: Hey I'm locked out downstairs\n[[Roommate sitting at table with laptop open]]\nStick figure: But I think I left the volume way down, so I'm reading the OS X docs to learn to set the volume via command line.\n[[Ponytailed stick figure facing stick figure, who is still sitting on the porch with his laptop.]]\nPonytailed stick figure: Ah.\nPonytailed stick figure: I take it the doorbell doesn't work?\n[[Ponytailed stick figure characters remain in place, Stick figure tilts head back slightly, as if staring in realization]]","alt":"Sadly, this is a true story.  At least I learned about the OS X 'say' command.","img":"https://imgs.xkcd.com/comics/im_an_idiot.png","title":"I'm An Idiot","day":"14"},{"month":"1","num":531,"link":"","year":"2009","news":"","safe_title":"Contingency Plan","transcript":"[[A woman and a man holding a green bottle are standing beside a crib. Another green bottle is lying on the floor.]]\nWoman: More sugary drinks? Are you \ntrying\n to give her diabetes?\nMan: Yeah - then we keep her supplied with insulin unless things go wrong.\nNarration: I take the Jurassic Park approach to parenting.\n{{title text: Kids are genetic experiments.  We're just experimenting responsibly!}}","alt":"Kids are genetic experiments.  We're just experimenting responsibly!","img":"https://imgs.xkcd.com/comics/contingency_plan.png","title":"Contingency Plan","day":"16"},{"month":"1","num":532,"link":"","year":"2009","news":"","safe_title":"Piano","transcript":"[[Man is holding a box with an open lid. A miniature piano is inside. The girl is looking at it]]\nMan: My hobby is making miniatures. Check this out-- it's a fully-functional grand piano.\nWoman: Woah - beautiful.\n[[Man looks at the miniature piano]]\nMan: Sadly, I've never head what proper music sounds like on it-the keys are too small to play.\n[[Man closes lid to the piano.]]\nMan: I once asked a genie for someone who could play it for me, but I think he misheard.\nGirl: ... are you doing anything later?\n{{Alt-Text: Good thing he didn't make it smaller, or it'd need someone three inches tall to play it.}}","alt":"Good thing he didn't make it smaller, or it'd need someone three inches tall to play it.","img":"https://imgs.xkcd.com/comics/piano.png","title":"Piano","day":"19"},{"month":"1","num":533,"link":"","year":"2009","news":"","safe_title":"Laptop Hell","transcript":"Mephistopheles: Welcome to Hell. Here's-\nMephistopheles: Wait. I know you. \nMephistopheles: You're the Fujitsu exec who killed the Q-series. \nFujitsu Exec: ...Yes?\nMephistopheles: The Q2010 was the perfect laptop!\nMephistopheles: Powerful, durable, had every feature, and made the Air look <u>bulky<\nu> And that was back in 2006!\nFujitsu Exec: But noone bought it!\nMephistopheles: Then you marketed it wrong!\nFujitsu Exec: Wait. Don't you <i>encourage<\ni> evil acts down here? \nMephistopheles: In theory, yes, but we need laptops too!\nMephistopheles: Although it's moot, since we have an exclusive deal with Sony. \nFujitsu Exec: I <i>knew<\ni> it!\n{{Alt text: The xkcd.com sysadmin has a Q2010, and I can attest that it can handle a fall down several flights of concrete steps. Relatedly, he's upset with me - I hope he doesn't take revenge by messing with my site's contenDISREGARD THAT I SUCK COCKS}}","alt":"The xkcd.com sysadmin has a Q2010, and I can attest that it can handle a fall down several flight of concrete steps.  Relatedly, he's upset with me -- I hope he doesn't take revenge by messing with my site's contenDISREGARD THAT I SUCK COCKS","img":"https://imgs.xkcd.com/comics/laptop_hell.png","title":"Laptop Hell","day":"21"},{"month":"1","num":534,"link":"","year":"2009","news":"","safe_title":"Genetic Algorithms","transcript":"[[Code displayed, presumably from an IDE]]\ndef getSolutionCosts(navigationCode):\n    fuelStopCost = 15\n    extraComputationCost = 8\n[[There is a giant arrow pointing to the next line]]\n    thisAlgorithmBecomingSkynetCost = 999999999\n    waterCrossingCost = 45\nNarration: Genetic algorithms tip: *Always* include this in your fitness function.\n{{title text: Just make sure you don't have it maximize instead of minimize.}}","alt":"Just make sure you don't have it maximize instead of minimize.","img":"https://imgs.xkcd.com/comics/genetic_algorithms.png","title":"Genetic Algorithms","day":"23"},{"month":"1","num":535,"link":"","year":"2009","news":"","safe_title":"It Might Be Cool","transcript":"[[Man #1 is administering the presidential oath to Man #2]]\nMan #1: You know, it might be cool to be a woman.\nMan #2: It... might be cool to be a woman?\nMan #1: Yeah, but the menstruation thing is freaky.\nMan #2: Yeah, but... the, um.  What?\nNarration: Turns out I'm even worse at administering the presidential oath than John Roberts.\n{{title text: 'And ovaries.  Man, ovaries, huh?'  [awkward pause]  '... faithfully.'}}","alt":"'And ovaries.  Man, ovaries, huh?'  [awkward pause]  '... faithfully.'","img":"https://imgs.xkcd.com/comics/it_might_be_cool.png","title":"It Might Be Cool","day":"26"},{"month":"1","num":536,"link":"","year":"2009","news":"","safe_title":"Space Elevators","transcript":"[[A man and a woman sit beside a moonlit lake.]]\nMan: Arthur C. Clarke said space elevators will be build 50 years after everybody stops laughing.\n[[Closeup on the man.]]\nMan: So all we have to do is get Mind of Mencia on every channel and wait.\nWoman: Oh, hush.\n{{title text: If you think space elevators are good, but just too boring and practical, check out the 'space fountain'.}}","alt":"If you think space elevators are good, but just too boring and practical, check out the 'space fountain'.","img":"https://imgs.xkcd.com/comics/space_elevators.png","title":"Space Elevators","day":"28"},{"month":"1","num":537,"link":"","year":"2009","news":"","safe_title":"Ducklings","transcript":"(Ducklings follow mother duck in procession)\nChick: Ready?\nDude: Ready.\n(Dude and chick regard duck procession.)\n(Diagram of duck procession showing linear west-to-east motion)\nDude: (on right side of duck procession) Roar! Boo!\n(Mother duck is alarmed.)\n(Mother duck proceeds south, then west. Ducklings follow.)\n(Chick seizes mother duck, lifts upwards.)\nYoink!\nMother duck: Quack\n(First ducking begins to follow final duckling, such that ducklings form a loop, rotating clockwise.)\nOperation: Duckling Loop\n{{Alt text: DUCKLOOP'D?}}","alt":"DUCKLOOP'D?","img":"https://imgs.xkcd.com/comics/ducklings.png","title":"Ducklings","day":"30"},{"month":"2","num":538,"link":"","year":"2009","news":"","safe_title":"Security","transcript":"A Crypto nerd's imagination:\nGuy [[Holding Laptop]]: His laptop's encrypted. Let's build a million-dollar cluster to crack it.\nOther guy: No good! It's 4096-bit RSA!\nGuy: Blast! Our evil plan is foiled!\nWhat would actually happen:\nGuy [[Holding money tag and wrench]]: His laptop's encrypted. Drug him and hit him with this $5 wrench until he tells us the password.\nOther guy [[taking the wrench]]: Got it.\n{{Alt-Text: Actual Actual Reality: Nobody really cares about his secrets. (Also, I would be hard pressed to find that wrench for $5.)}}","alt":"Actual actual reality: nobody cares about his secrets.  (Also, I would be hard-pressed to find that wrench for $5.)","img":"https://imgs.xkcd.com/comics/security.png","title":"Security","day":"2"},{"month":"2","num":539,"link":"","year":"2009","news":"","safe_title":"Boyfriend","transcript":"Girl (on the phone): Can my boyfriend come along?\nGuy: I'm not your boyfriend!\nGirl: You totally are.\nGuy: I'm casually dating a number of people.\nGirl (pointing to a chart): But you spend twice as much time with me as with anyone else. I'm a clear outlier.\nGuy: Your math is irrefutable.\nGirl: Face it - I'm your statistically significant other.\n{{title text: ... okay, but because you said that, we're breaking up.}}","alt":"... okay, but because you said that, we're breaking up.","img":"https://imgs.xkcd.com/comics/boyfriend.png","title":"Boyfriend","day":"4"},{"month":"2","num":540,"link":"","year":"2009","news":"","safe_title":"Base System","transcript":"[[A man and woman are talking; she's sitting on the back of a chair with her feet on the seat, and he's sitting on the floor facing her.]]\nWoman: So how far did you get with her?\nMan: Second base?\n\nWoman: Wait, which one is that? Below the waist, but... not under the clothes?\nMan: I think that's... shortstop?\n\nWoman: You should try crossing the pitcher's mound. Then down the 50-yard line, and right past her ten-pin.\nMan: Sounds tricky.\n\nWoman: Yeah. Last time I tried it, I got a red flag. If you know what I mean.\nMan: I really don't.\n\n[[A diagram of a baseball diamond.]]\nThe \"Base\" Metaphor Explained\n[[Bases and x points are marked, as well as dashed lines covering the field.]]\n[[Along the first base line is \"Your Base\"]]\n[[Slightly right of that is a binary base:\n0110 0010 0110 0001\n0111 0011 0110 0101\n0010 0000 0011 0010]\n[[First base: Kissing]]\n[[Second base: Hands under the shirt and\nor licking]]\n[[Third base: Oral sex (formerly \"hands in the pants\")]]\n((The following are x marks.\nSlightly right of home plate: Eye contact.\nAlong the first base line: Passing notes.\nSlightly before first base: Downloading Star Trek fanfiction and replacing Riker's name with your Crush's.\nRight field: Eye contact from Janeane Garofalo.\nBetween the pitcher and second base: Using the scroll thingy on that one Apple mouse.\nNear the shortstop: Dry humping.\nLeft of second base: Fursuits.\nFarther left: Fursuits (crotchless).\nJust before home plate: Thigh contact.\nBeyond 3rd base, along the 3rd base line: Standing anywhere near Peaches.\nFoul of the third base line: Anal sex (fill in your won \"Foul Ball\" pun here.)\nLeft outfield: 2outfielders1glove.\nLeft outfield: Retrograde wheelbarrow.))\n((The following are dashed lines:\nA region along the line from first to second base: The Boring Zone.\nA line traveling across the second to third baseline, and towards home plate: The orgasm line. ((dry humping is on the \"orgasm\" side.))\nBetween third base and home: \"Virginity\" (Maginot) line.))\n((Arrows pointing out various other features:\nAn arrow crossing the \"Virginity\" line: Teens.\nAn arrow nearer to home plate: Sharing root PWs.\nAn arrow crossing the orgasm line in the outfield: Napoleon's forces.))\n\n{{Title text: I once got to second base with a basketball player.  She was so confused.}}","alt":"I once got to second base with a basketball player.  She was so confused.","img":"https://imgs.xkcd.com/comics/base_system.png","title":"Base System","day":"6"},{"month":"2","num":541,"link":"","year":"2009","news":"","safe_title":"TED Talk","transcript":"[[Randall Monroe on stage]]\nRandall - Hi. I'm Randall. Welcome to my TED talk.\nRandall - it's an honor to speak to you, some of the brightest innovators from so many fields, about a problem in desperate need of your attention:\nRandall - How DO you end parenthetical statements with emoticons? I can't figure out a good way.\n[[Screen next to him shows two statements, both crossed out in red]]\nScreen - \"Linux (or BSD :) would...\"\n (in red) \"looks mismatched\"\n\"Linux (or BSD :)) would...\"\n (in red) \"looks mismatched and weird\"\n[[Randall writing on a desk]]\nRandall's List - Conferences I'm banned from:\nSiggraph \n Eurocrypt \n Defcon \n Pycon \n International Astronomical Union\n Canadian Paleontology Conference \n Every American Furry Convention \n American Baking Society \n Asian Dolphin-Training Conference \n TED\n{{Alt-text:  The IAU ban came after the 'redefinition of the 'planet' to include the IAU president's mom' incident.}}","alt":"The IAU ban came after the 'redefinition of 'planet' to include the IAU president's mom' incident.","img":"https://imgs.xkcd.com/comics/ted_talk.png","title":"TED Talk","day":"9"},{"month":"2","num":542,"link":"","year":"2009","news":"","safe_title":"Cover-Up","transcript":"[[Hat Guy is holding blood stained rags while woman is holding an equally bloody mop]]\nHat Guy: Okay, got the blood off the walls. \nWoman: I finished the floor\nHat Guy: Good; he'll be home any- Oh crap! We forgot to clean the ceiling!\nWoman: There's no time!\nHat Guy: Wait, I'll handle it.\n[[Man with briefcase enters the house]]\nHat Guy: Hi. Did you know \"gullible\" is written on your ceiling?\nMan: Hah. Yeah, right.\n{{title text: Man, this trick has saved me so many times.}}","alt":"Man, this trick has saved me so many times.","img":"https://imgs.xkcd.com/comics/cover_up.png","title":"Cover-Up","day":"11"},{"month":"2","num":543,"link":"","year":"2009","news":"","safe_title":"Sierpinski Valentine","transcript":"[[shows an adaptation of the sierpinski triangle fractal, using hearts instead of triangles]]\ncenter:  Happy valentine's day\nbottom right:  -xkcd\n{{Title text:   Especially you mouseover -text readers.  You're the best.  <3}}","alt":"Especially you mouseover-text readers.  You're the best.  <3","img":"https://imgs.xkcd.com/comics/sierpinski_valentine.png","title":"Sierpinski Valentine","day":"13"},{"month":"2","num":544,"link":"","year":"2009","news":"","safe_title":"Pep Talk","transcript":"Coach : OK TEAM. WE'RE SIXTEEN POINTS DOWN. IF WE WANT TO COME BACK FROM THIS\nCrowd : WOO!! SCORE!!!\nCoach : OKAY, NOW WE'RE EIGHTEEN POINTS DOWN...LISTEN - I'M STARTING TO THINK WE SHOULD ONLY TAKE THESE BREAKS AT HALFTIME.\n{{title text: Listen!  They said a team of chess players coached by someone with no understanding of basketball would never be competitive in the NBA!  Well, it turns out they're pretty perceptive.}}","alt":"Listen!  They said a team of chess players coached by someone with no understanding of basketball would never be competitive in the NBA!  Well, it turns out they're pretty perceptive.","img":"https://imgs.xkcd.com/comics/pep_talk.png","title":"Pep Talk","day":"16"},{"month":"2","num":545,"link":"","year":"2009","news":"","safe_title":"Neutrality Schmeutrality","transcript":"Trivia: It's possible to create events which Wikipedia cannot cover neutrally\nMan in Hat: In a week, I will be donating $1,000,000 to a recipient determined by the word count of the Wikipedia article about this event. If it's even, the money goes to pro-choice activists. If it's odd, pro-life.\n{{title text: 'Hey, everyone, you can totally trust that I didn't do a word count on MY edit!'}}","alt":"'Hey, everyone, you can totally trust that I didn't do a word count on MY edit!'","img":"https://imgs.xkcd.com/comics/neutrality_shmeutrality.png","title":"Neutrality Schmeutrality","day":"18"},{"month":"2","num":546,"link":"","year":"2009","news":"","safe_title":"Music DRM","transcript":"[[Interior, a man sits at his computer typing, woman enters]]\nMan [typing]: ...and that's why music DRM is bad for listeners and artists!\nWoman[off-panel]: What are you doing?\nWoman: In case you didn't notice, we won the music DRM war.  The big stores are DRM free.\nWoman: So close the comment thread, get out the debit card, buy us some music, and let's rock the fuck out.\nMan: But I don't actually like music, I just like being self-righteous on the web.\nWoman: Lucky for you, that will always be free.\n{{title text: Just yesterday I bought my first non-DRM'ed songs (The Last Vegas, in keeping with my 'I only listen to things from Guitar Hero' theme).","alt":"Just yesterday I bought my first non-DRM'd songs (The Last Vegas, in keeping with my 'I only listen to things from Guitar Hero' theme).","img":"https://imgs.xkcd.com/comics/music_drm.png","title":"Music DRM","day":"20"},{"month":"2","num":547,"link":"","year":"2009","news":"","safe_title":"Simple","transcript":"[[A man points to a diagram of a particle accelerator]]\nMan 1: Do you have any thoughts regarding the particle accelerator's tertiary F.E.L. Guidance System?\nMan 2: We can't put the broken part in the machine.  It wouldn't smash the right tiny things together.  Then the machine might break.  That would be very bad.\n[[Text at the bottom reads \"I spent all night reading simple.wikipedia.org, and now I can't stop talking like this.]]\n{{Title text: Actually, I think if all higher math professors had to write for the Simple English Wikipedia for a year, we'd be much better shape academically.}}","alt":"Actually, I think if all higher math professors had to write for the Simple English Wikipedia for a year, we'd be in much better shape academically.","img":"https://imgs.xkcd.com/comics/simple.png","title":"Simple","day":"23"},{"month":"2","num":548,"link":"","year":"2009","news":"","safe_title":"Kindle","transcript":"[[A guy is looking at a kindle]]\nGirl: A Kindle? E Books, huh?\nGuy: Ebooks are for chumps.\nGirl: Why get a kindle, then?\nGuy: One reason:\nFREE Cellular web access. Even if I spend months broke and drunk in a strange city, I'll still be able to use wikipedia and wikitravel to learn about anything I need.\nGirl: Why does that sound familiar? Gimme that. [[Girls takes the kindle]]\n[[The top of the kindle says \"Amazon Kindle\"]]\n[[Girl scratches at the top]] <<scrape, scrape, scrape>>\nTop of \"kindle\": Hitchhiker's Guid...\n{{Alt-text: I'm happy with my Kindle 2 so far, but if they cut off the free Wikipedia browsing, I plan to show up drunk on Jeff Bezos's lawn and refuse to leave.}}","alt":"I'm happy with my Kindle 2 so far, but if they cut off the free Wikipedia browsing, I plan to show up drunk on Jeff Bezos's lawn and refuse to leave.","img":"https://imgs.xkcd.com/comics/kindle.png","title":"Kindle","day":"25"},{"month":"2","num":549,"link":"","year":"2009","news":"","safe_title":"Westley's a Dick","transcript":"Buttercup: Oh, my sweet Westley!\nButtercup: Why did you let me think you were dead?\nWestley: You shacked up with the prince!\nButtercup: After years of mourning! The worst pain of my life!\nButtercup: And now you ... kill people?\nWestley: I'd hardly be a dread pirate if I didn't.\nButtercup: How lovable.\nWestley: It was for the sake of the narrative!\nButtercup: Fuck the narrative. I'm going to go see if that Spaniard's single.\nWestley: ... As you wish.\n{{Alt text: Inigo\nButtercup 4eva <3}}","alt":"Inigo/Buttercup 4eva <3","img":"https://imgs.xkcd.com/comics/westleys_a_dick.png","title":"Westley's a Dick","day":"27"},{"month":"3","num":550,"link":"","year":"2009","news":"","safe_title":"Density","transcript":"[[Guy is in a bed with a girl]]\nGuy: Sup dawg, I herd you didn't liek forming babby, but I accidentally in your base.\n[[Out of the panel text]]\nCons: Ruined life.\nPros: Sentence set the new meme destiny record.\n{{Alt-Text: If only I had asked 4chan for ideas for what I should do to prevent this!}}","alt":"If only I had asked 4chan for ideas for what I should do to prevent this!","img":"https://imgs.xkcd.com/comics/density.png","title":"Density","day":"2"},{"month":"3","num":551,"link":"","year":"2009","news":"","safe_title":"Etch-a-Sketch","transcript":"[[A male xkcd figure is playing with an etch-a-sketch]]\nMale: Hey. If  draw enough lines, I can see what's behind the screen.\nMale: Oh man, almost...\nEtch-a-Sketch: Hi!\n[[Head of a female xkcd figure appears behind etch-a-sketch]]\nFemale: You're cute!\nMale: Wha-\nFemale: I'm the one who draws when you turn the knobs.\nFemale: It's lonely in here.\nMale: It's lonely out here too.\nFemale: I'm glad you found me, then!\nFemale: Let's be friends.\nFemale: And never be lonely again.\n[[Panels break apart into thought bubbles coming from male as he sits with his etch-a-sketch]]\nMale: *sigh*\n[[Etch-a-sketch shows what is behind the glass; it is just the mechanics of the machine]]\n[[Male shakes etch-a-sketch]]\n{{title text: Surrounded by boring mysteries.}}","alt":"Surrounded by boring mysteries.","img":"https://imgs.xkcd.com/comics/etch-a-sketch.png","title":"Etch-a-Sketch","day":"4"},{"month":"3","num":552,"link":"","year":"2009","news":"","safe_title":"Correlation","transcript":"[[A man is talking to a woman]]\nMan: I used to think correlation implied causation.\nMan: Then I took a statistics class.  Now I don't.\nWoman: Sounds like the class helped.\nMan: Well, maybe.\n{{Title text: Correlation doesn't imply causation, but it does waggle its eyebrows suggestively and gesture furtively while mouthing 'look over there'.}}","alt":"Correlation doesn't imply causation, but it does waggle its eyebrows suggestively and gesture furtively while mouthing 'look over there'.","img":"https://imgs.xkcd.com/comics/correlation.png","title":"Correlation","day":"6"},{"month":"3","num":553,"link":"","year":"2009","news":"","safe_title":"Pirate Bay","transcript":"[[Awaiting the judges' ruling at the Pirate Bay trial]]\nCharacter 1: I wish this were in America.\nCharacter 2: Why?\nCharacter 1: I hear we'd go before a jury of our peers, and I've always seeded generously\n{{Alt Text: We find you guilty of closing your torrents as soon as they finish.  Your sentence is unremovable Hungarian subtitles on everything.}}","alt":"We find you guilty of closing your torrents as soon as they finish.  Your sentence is unremovable Hungarian subtitles on everything.","img":"https://imgs.xkcd.com/comics/pirate_bay.png","title":"Pirate Bay","day":"9"},{"month":"3","num":554,"link":"","year":"2009","news":"","safe_title":"Not Enough Work","transcript":"Narration: Signs your coders don't have enough work to do:\n[[A man sitting at his workstation; a female co-worker behind him]]\nMan: I'm almost up to my old typing speed in dvorak\n[[Two men standing by a server rack]]\nMan #1: Our servers now support gopher.\nMan #1: Just in case.\n[[A woman standing near her workstation speaking to a male co-worker]]\nWoman: Our pages are now HTML, XHTML-STRICT, and haiku-compliant\nMan: Haiku?\nWoman: <div class=\"main\">\nWoman: <span id=\"marquee\">\nWoman: Blog!<\nspan><\ndiv>\n[[A woman sitting at her workstation]]\nWoman: Hey!  Have you guys seen this webcomic?\n{{title text: It's even harder if you're an asshole who pronounces <> brackets.}}","alt":"It's even harder if you're an asshole who pronounces <> brackets.","img":"https://imgs.xkcd.com/comics/not_enough_work.png","title":"Not Enough Work","day":"11"},{"month":"3","num":555,"link":"","year":"2009","news":"","safe_title":"Two Mirrors","transcript":"[[A girl sets up a full mirror adjacent to a bathroom-counter mirror]]\n[[The girl looks through the bathroom-counter mirror to see the infinite reflections]]\nGirl: Bloody Mary, Bloody Mary, Bloody Mary.\n<<RAAGHHHHH>>\n[[Girl ducks as the infinite Bloody Marys pop out between the two mirrors above her head]]\n{{Alt-Text: If you actually do this, what really happens is Douglas Hofstadter appears and talks to you for eight hours about strange loops.}}","alt":"If you actually do this, what really happens is Douglas Hofstadter appears and talks to you for eight hours about strange loops.","img":"https://imgs.xkcd.com/comics/two_mirrors.png","title":"Two Mirrors","day":"13"},{"month":"3","num":556,"link":"","year":"2009","news":"","safe_title":"Alternative Energy Revolution","transcript":"[[A field of windmills is silhouetted against dusk sky.]]\n[[Man and woman are standing and sitting on the ground overlooking the windmills.]]\nMan: I'm all for green energy, but those turbines creep me out. They remind me of War of the Worlds, or the Tripod books.\nWoman: They -are- unnerving.\nMan: I can't shake the feeling that at any moment they'll--\n<<RUMBLE>>\n[[A leg begins to split off one windmill.]]\n<<crack>>\n[[The leg separates from the body of the windmill.]]\n[[The new leg lands on the ground.]]\n<<BOOM>>\n[[Another leg begins to split off the other side of the windmill's body.]]\n<<crack>>\n[[The new leg hits the ground, forming a tripod base.]]\n<<BOOM>>\n[[Smoke rises from destroyed buildings as the windmills rampage across the field.]]\n[[Man and woman are now standing.]]\nWoman: Oh no.\nMan: Al Gore, you've doomed us all.\nWoman: It's coming this way!\nMan: Run!\n[[One of the enormous tripod windmill feet lands right behind the running couple, sending debris flying.]]\n<<BOOM>>\n[[Man and woman run.]]\nWoman: What now?\nMan: Someone has to stop them.\nWoman: But who could--\nVoice from next panel: Stand aside!\n[[Don Quixote sits mounted at the top of a hill, lance at the ready.]]\n{{title text: The moment their arms spun freely in our air, they were doomed -- for Man has earned his right to hold this planet against all comers, by virtue of occasionally producing someone totally batshit insane.}}","alt":"The moment their arms spun freely in our air, they were doomed -- for Man has earned his right to hold this planet against all comers, by virtue of occasionally producing someone totally batshit insane.","img":"https://imgs.xkcd.com/comics/alternative_energy_revolution.jpg","title":"Alternative Energy Revolution","day":"16"},{"month":"3","num":557,"link":"","year":"2009","news":"","safe_title":"Students","transcript":"[[A teacher speaks in a crowded classroom, one of the students seems confused.]]\nTeacher: Your projects are due today by 5:00 PM.\nStudent: ((...I didn't even know we had one.))\nStudent: ((Wait. I don't think I've been attending. I must have forgotten I had this class. Shitshitshit.))\nStudent: ((Okay, I'm gonna fail. Will it hold me back? I just want to get out of here. I thought I had <i>finished<\ni> my requirements already.))\nStudent: ((In fact, I think I remember graduating.))\nStudent: ((What the hell is--))\n[[Scene fades to the 'student' waking up.]]\nFun Fact: Decades from now, with school a distant memory, you'll <u>still<\nu> be having this dream.\n{{Mouseover: The same goes for the one where you're wrestling the Green Ranger in the swimming pool full of Crisco. You guys all have that dream, right? It's not just me. Right?}}","alt":"The same goes for the one where you're wrestling the Green Ranger in the swimming pool full of Crisco.  You guys all have that dream, right?  It's not just me.  Right?","img":"https://imgs.xkcd.com/comics/students.png","title":"Students","day":"18"},{"month":"3","num":558,"link":"","year":"2009","news":"","safe_title":"1000 Times","transcript":"Dishonest:\n[[woman sitting behind desk]] sign: bailout: $170 billion; bonuses: $165 million\nHonest:\n[[woman sitting behind desk]] sign: bailout: $170,000 million; bonuses: $165 million\nDear news organizations: stop giving large numbers without context or proper comparison. The difference between a million and a billion is the difference between a sip of wine and 30 seconds with your daughter, and a bottle of gin and a night with her.\n{{Alt-text: And 0.002 dollars will NEVER equal 0.002 cents.}}","alt":"And 0.002 dollars will NEVER equal 0.002 cents.","img":"https://imgs.xkcd.com/comics/1000_times.png","title":"1000 Times","day":"20"},{"month":"3","num":559,"link":"","year":"2009","news":"","safe_title":"No Pun Intended","transcript":"My Hobby: Appending \"no pun intended\" to lines with no pun in them.\n[[Random guy is talking to a guy with a beret]]\nRandom guy: I think he's internalized his girlfriend's attitudes - no pun intended - and so...\n{{Three hours later:}}\n[[Beret guy is thinking]]\nBeret guy: \"Internalized?\" Lied? Analyzed? Or is it \"attitudes\"? Dammit.\n{{alt: Like spelling 'dammit' correctly -- with two m's -- it's a troll that works best on the most literate.}}","alt":"Like spelling 'dammit' correctly -- with two m's -- it's a troll that works best on the most literate.","img":"https://imgs.xkcd.com/comics/no_pun_intended.png","title":"No Pun Intended","day":"23"},{"month":"3","num":560,"link":"","year":"2009","news":"","safe_title":"Lithium Batteries","transcript":"Timeline of Commercial Uses of Lithium Batteries:\n[[The panel has a timeline that goes from Past to Present. The timeline has 4 notches on it]]\nPast\n[[the first notch, closest to the past side, has a picture of an old man with a walking stick]]\nPacemakers\n[[The second notch has an image of a man in a car, who is talking on his cell phone]]\nPhones for Rich Business People\n[[The third notch, has a teen taking on his cellphone]]\nPhones for Teenagers\n[[The forth notch, closest to the present on the timeline, hac an image of a toy plane box with $10 written on it]]\nReally cheap r\nc planes and helicopters\nPresent\n[[Below the main panel]]\nLife would be so much better if I was one of those people who aged backward. \n{{Title text: I'm normally a pretty frugal person, but I still compulsively buy any R\nC aircraft that's less than $30.  In the last few years, this has become a problem.}}","alt":"I'm normally a pretty frugal person, but I still compulsively buy any R/C aircraft that's less than $30.  In the last few years, this has become a problem.","img":"https://imgs.xkcd.com/comics/lithium_batteries.png","title":"Lithium Batteries","day":"25"},{"month":"3","num":561,"link":"","year":"2009","news":"","safe_title":"Well","transcript":"[[A sign sits by a well]] Sign: The Uncomfortable Truths Well\n[[A guy and a girl are lined up for the well; the guy throws a coin in]] Well: For a universe that's supposed to be half Chinese, Firefly sure doesn't have any Asians.\n[[The guy is gone, a couple arrives behind the girl from the previous pane; the girl throws a coin in]] Well: There's no solid evidence DVORAK's better than QWERTY. The standard histories are urban legends.\n[[Just the couple remain; the boyfriend throws another coin in]] Well: You've never said \"I love you\" and meant it. It was always just words.\n[[The girlfriend now throws in a coin]] Well: You meant it every time.\n{{title text: I'll concede ergonomics anecdotally, but none of the studies of Dvorak were at all rigorous (the most-cited Navy study was overseen by Dvorak himself), and QWERTY had a lot of fair competition.  And the 'slow typists down' thing is basically a myth.  Also EMACS RULES WOOOOOOO!}}","alt":"I'll concede ergonomics anecdotally, but none of the studies of Dvorak were at all rigorous (the most-cited Navy study was overseen by Dvorak himself).  And the 'slow typists down' thing is a myth.  Also EMACS RULES VI DROOLS WOOOOOOO!","img":"https://imgs.xkcd.com/comics/well.png","title":"Well","day":"27"},{"month":"3","num":562,"link":"","year":"2009","news":"","safe_title":"Parking","transcript":"[[Hat guy is in a car driving around a parking lot]]\n[[Hat guy's car pulls up next to a red car, that's parked over a line at an angle that block two spaces]]\n[[Hat guy gets out of his car]]\n<<SLAM>>\n[[Hat guy is now holding a flamethrower and a rotary saw, He's also wearing goggles and fuel tanks on his back. The flamethrower is lit]]\n<<Fwoosh>>\n[[The badly parked car has been cut in half along a diagonal, and the half of the car that was in the second slot has been moved into the same slot as the rest of the car. Hat guy's car occupies the newly freed space.]]\n{{Alt Text: Police reported three dozen cheerful bystanders, yet no one claims to have seen who did it.}}","alt":"Police reported three dozen cheerful bystanders, yet no one claims to have seen who did it.","img":"https://imgs.xkcd.com/comics/parking.png","title":"Parking","day":"30"},{"month":"4","num":563,"link":"","year":"2009","news":"There are xkcd prints available in the <a href=\"https://store.xkcd.com/\">store</a>.<br /><a href=\"https://www.google.com/search?hl=en&q=sqrt(2%2F(pi*18000%2F(mi^2)*80%2Fyear*30+minutes)\">Example Google sex calculation</a>.","safe_title":"Fermirotica","transcript":"Pd   Regional Population Density (e.g. 18,600\nmi^2)\nXf   Average Person's Frequency of Sex (e.g. 80\nYear)\nXd   Average Duration of Se (e.g. 30 Minutes)\nr=sqrt(2\npi*Pd*Xr*Xd)\nOn average, someone within distance r of you is having sex\n[[Man standing at easel]]\nMan: Mmm, That probable couple 150 meters away is so hot.  Oh yeah, theoretically work it, baby.\nFrom out of frame: Hey! No statistical voyeurism!\n{{Alt Text: I love how google handles dimensional analysis.  Stats are ballpark and vary wildly based on time of day and whether your mom is in town.}}","alt":"I love how Google handles dimensional analysis.  Stats are ballpark and vary wildly by time of day and whether your mom is in town.","img":"https://imgs.xkcd.com/comics/fermirotica.png","title":"Fermirotica","day":"1"},{"month":"4","num":564,"link":"","year":"2009","news":"","safe_title":"Crossbows","transcript":"[[Man 1 is pulling a crossbow out of a desk]]\nMan 1: Why do you have a crossbow in your desk?\nWoman (off-screen): You _don't_?\n[[Woman is on panel]]\nMan 1 (off-screen): No -- why would...\nWoman: You _are_ studying the consequences of Higgs excitation, aren't you?  Like the rest of the lab?\n[[Two men, both holding crossbows, joing the woman on panel]]\nMan 1: Yes, but why--\nMan 2: Maybe he's slow with the math.\nWoman: Well, he has until Tuesday.\nMan 2: Poor guy.\n{{Alt-Text: I hate being the slowest guy in the lab}}","alt":"I hate being the slowest guy in the lab.","img":"https://imgs.xkcd.com/comics/crossbows.png","title":"Crossbows","day":"3"},{"month":"4","num":565,"link":"","year":"2009","news":"","safe_title":"Security Question","transcript":"[[A male stick figure sits at a computer.]]\nComputer Screen: \"-Email Account Setup- To verify your identity, we need to ask you a question nobody else could answer.\"\nComputer Screen: \"Q: Where are the bodies buried? A:\"\n{{A text field is shown with \"Behind the\" typed.}}\n[[Three stick figures, two wearing police hats and one wearing headphones, watch another computer.]]\n{{The same text field is shown with \"Behind the ... nice try.\" typed.}}\nFigure in Headphones: Damn.\n{{Title Text: \"Let's invite him to a party and play 'I never'. Okay, I never hid any bodies SOUTH of Main Street. ... he's taking a drink!\"}}","alt":"Let's invite him to a party and play 'I never'.  Okay, I never hid any bodies SOUTH of Main Street. ... he's taking a drink!","img":"https://imgs.xkcd.com/comics/security_question.png","title":"Security Question","day":"6"},{"month":"4","num":566,"link":"","year":"2009","news":"","safe_title":"Matrix Revisited","transcript":"Narrator: Today was the ten-year anniversary of the release of 'The Matrix'.  I sat down to watch it again.\nWoman: Holy Fuck, ten years ago?\n{{Replay of various scenes from The Matrix..}}\n[[Scene 1]]\nMorpheus: Unfortunately, no one can explain what the matrix is.  You have to see it for yourself.\nTrinity (correcting Morpheus): Sure you can.  It's a computer simulation in which you live, thinking it's reality.\nNeo: Oh.\nTrinity (to Morpheus, who is glaring at her): ... What?  Look, maybe you just suck at explaining.\n[[Scene 2]]\nMorpheus (to Neo): ...Or you take the red pill, and I show you how deep the rabbit hole goes.\n[[Neo takes BOTH pills from Morpheus...]]\n[[Neo crushes both the red and blue pills into purple powder on a table top...]]\n[[Neo snorts the purple powder...]]\n[[Morpheus and Neo are shown upside down in a frame with inverted colors, i.e., black background with white lines]]\nMorpheus: NOW look what you've done.\nNeo: Where are we?\nMorpheus: I have no idea.\n[[Scene 3]]\n[[Neo, wearing the long  black trench coat, at a metal detector, is accosted by the security guard.]]\nGuard: Please remove any keys, metallic items, weapons--\n[[Neo opens his trench coat, his back to the reader, towards the guard, who is facing the reader.  The reader can't see what Neo has under his coat.]]\n[[Same scene as above, but side view: Neo, on the left, is opening his coat toward the guard, who is on the right.  Nobody speaks.]]\n[[Side view again.]]\nGuard: Eww.\n{{End of scene replays}}\n[[View of room, where three characters have obviously just finished watching The Matrix. Man1 is sitting on the floor nearest to the TV.  Woman is sitting on the floor, farther from the TV.  Man2 is sitting on a chair, farthest from the TV.]]\nMan1: I forgot how good that movie was.\nMan2: Wanna put on the other two?\n[[Man1 has turned to face Woman.  They exchange looks without speaking.]]\n[[View of room, which is now empty, as is the chair.]]\n<<Sounds from off panel:  Crash \n Wham \n Someone saying \"Ow! Ow!\">>\n[[Man1 and Woman are back in the room, but the chair is still empty.  Man2 is nowhere to be seen.]]\nMan1: I forgot how good that movie was.\nWoman: Too bad they never made any sequels.\nMan1: True.","alt":"I actually remember being entertained by both the sequels while in the theater.  They just don't hold up nearly as well in later comparison.","img":"https://imgs.xkcd.com/comics/matrix_revisited.png","title":"Matrix Revisited","day":"8"},{"month":"4","num":567,"link":"","year":"2009","news":"","safe_title":"Urgent Mission","transcript":"[[Guy steps out of rift. Benjamin Franklin is sitting at his desk with quill and parchment.]]\nGuy: Benjamin Franklin?\nFranklin: Yes?\nGuy: I bring a message from the future! I don't have much time.\nFranklin: What is it?\nGuy: The convention you're setting for electric charge is backward. The one left on glass by silk should be the negative charge.\n{{Caption: We were going to use the time machine to prevent the robot apocalypse, but the guy who built it was an electrical engineer.}}\n{{Mouseover: Sure, we could stop dictators and pandemics, but we could also make the signs on every damn diagram make sense.}}","alt":"Sure, we could stop dictators and pandemics, but we could also make the signs on every damn diagram make sense.","img":"https://imgs.xkcd.com/comics/urgent_mission.png","title":"Urgent Mission","day":"10"},{"month":"4","num":568,"link":"","year":"2009","news":"","safe_title":"Well 2","transcript":"[[People are lined up by a well. A sign says \"The Uncomfortable Truths Well.\" The first person in line drops in a coin.]]\nWell: Science may discover immortality, but it won't happen in the next eighty years.\n\n[[The next person drops in a coin.]]\nWell: You'll never find a programing language that frees you from the burden of clarifying your ideas.\nProgrammer: But I know what I mean!\n\n[[The next person drops in a coin.]]\nWell: You avoid your friend Mike because you're uncomfortably attracted to him.\n\nPerson: Nice try, Mike.\nPerson: Get out of the well.\nWell\nMike: Aww.\n\n{{Title text: But I've made $13.72 already today! Ow, stop throwing pennies.}}","alt":"But I've made $13.72 already today!  Ow, stop throwing pennies.","img":"https://imgs.xkcd.com/comics/well_2.png","title":"Well 2","day":"13"},{"month":"4","num":569,"link":"","year":"2009","news":"","safe_title":"Borders","transcript":"[[Two stick figures stand on a hill overlooking a great city. Between them and the city stands an embassy flying a red flag.]]\nTHREE YEARS AGO, THE KINGDOM OF LIATE OVERTHREW THEIR OLD ORDER AND ESTABLISHED A CONSTITUTIONAL MONARCHY. OUR LEADERS SIGNED A TREATY WITH THEIR QUEEN, AND OUR BORDERS WERE SET BY THE YABRIS ACCORDS.\nMANY SAID WAR WOULD BE UNENDING, THAT PEACE WOULD ALWAYS BE A DREAM DEFERRED. BUT TODAY, OUR FLAG FLIES PROUDLY OVER OUR EMBASSY IN THEIR KINGDOM, AND THEY WALK OUR LANDS WITHOUT FEAR.\nSO COME, TRAVELER. LAY DOWN YOUR GRUDGES AND JOIN US IN BROTHERHOOD. IT IS TIME NOT TO FIGHT, BUT TO LIVE.\n[[Stick figure sitting at computer]]\nTHIS IS THE WORST CAPTURE-THE-FLAG SERVER EVER.\n{{title text: Eventually a UN is set up.  And then a lone rebel runs down the line of flags in front of it, runs back to his base, and gets a kajillion points.}}","alt":"Eventually a UN is set up.  And then a lone rebel runs down the line of flags in front of it, runs back to his base, and gets a kajillion points.","img":"https://imgs.xkcd.com/comics/borders.png","title":"Borders","day":"15"},{"month":"4","num":570,"link":"","year":"2009","news":"","safe_title":"New Car","transcript":"Person 1: When'd you get the car?\nPerson 2: It's the darndest thing. We bought it as a prize for the 100,000,000th visitor to our website.\nPerson 1: And they didn't want it?\nPerson 2: Apparently.\nPerson 1: Maybe they didn't see the notice.\nPerson 2: It was flashing and everything!\nPerson 1: How bizarre.\n{{title text: Somewhere out there is a company that has actually figured out how to enlarge penises, and it's helpless to reach potential customers.}}","alt":"Somewhere out there is a company that has actually figured out how to enlarge penises, and it's helpless to reach potential customers.","img":"https://imgs.xkcd.com/comics/new_car.png","title":"New Car","day":"17"},{"month":"4","num":571,"link":"","year":"2009","news":"","safe_title":"Can't Sleep","transcript":"[[Someone is in bed, presumably trying to sleep. The top of each panel is a thought bubble showing sheep leaping over a fence.]]\n1 ... 2 ...\n<<baaa>>\n[[Two sheep are jumping from left to right.]]\n\n... 1,306 ... 1,307 ...\n<<baaa>>\n[[Two sheep are jumping from left to right. The would-be sleeper is holding his pillow.]]\n\n... 32,767 ... -32,768 ...\n<<baaa>> <<baaa>> <<baaa>> <<baaa>> <<baaa>>\n[[A whole flock of sheep is jumping over the fence from right to left. The would-be sleeper is sitting up.]]\nSleeper: ?\n\n... -32,767 ... -32,766 ...\n<<baaa>>\n[[Two sheep are jumping from left to right. The would-be sleeper is holding his pillow over his head.]]\n\n{{Title text: If androids someday DO dream of electric sheep, don't forget to declare sheepCount as a long int.}}","alt":"If androids someday DO dream of electric sheep, don't forget to declare sheepCount as a long int.","img":"https://imgs.xkcd.com/comics/cant_sleep.png","title":"Can't Sleep","day":"20"},{"month":"4","num":572,"link":"","year":"2009","news":"","safe_title":"Together","transcript":"[[A male and female are running in a field, holding hands. Another male and female stand in the background, next to a table.]]\n[[The man and woman are in a boat on a lake, very romantic. The man is speaking to the woman, illustrated with a heart.]]\n[[The man and woman sit together on a bench on a beach, watching the sunset.]]\n[[The man and woman stand at an altar. They have married.]]\n[[The man and woman, having grown old together, sit together on their doorstep, holding hands.]]\n[[The man begins walking away with his cane.]]\nWoman: Dear? Where are you--Come back!\n[[The man approaches the other couple from the first panel, who are now just as old.]]\n[[The man picks up a piece of paper from the table in the first panel and begins to write.]]\nMan: Okay,\n[[The paper is shown: a scavenger hunt list. \"Happiness\" has just been checked off.]]\nMan: What's next?\n[[Full list:\nSCAVENGER HUNT:\n[X] Indian-head penny\n[X] Snake skin\n[X] Happiness\n[  ] Four-leaf clover\n[  ] Shark tooth\n[...]\n]]\n{{Alt text: This scavenger hunt is getting boring. Let's go work on the treehouse!}}","alt":"This scavenger hunt is getting boring.  Let's go work on the treehouse!","img":"https://imgs.xkcd.com/comics/together.png","title":"Together","day":"22"},{"month":"4","num":573,"link":"","year":"2009","news":"","safe_title":"Parental Trolling","transcript":"The Future\n[[Man is sitting at a futuristic desktop computer, and a girl is standing behind him with a portable ultra-thin screen]]\nGirl: Hey dad, look at this old music video.\nVideo: We're no strangers to love...\nDad: Wow, you got me.\nGirl: Did your generation really use this to troll people?  SO lame.  Your generation sucked at pranks.\nDad: Did we?  I once raised a kid with conditioning so her speech centers shut down when she was upset.\nGirl: What?  No, you couldn't have bleegle warble yargle arggh!\nDad: Teehee!\n{{title-text: They'll pick music and culture that they know annoys you.  Building in behavioral easter eggs is a fair retaliation!}}","alt":"They'll pick music and culture that they know annoys you.  Building in behavioral easter eggs is a fair retaliation!","img":"https://imgs.xkcd.com/comics/parental_trolling.png","title":"Parental Trolling","day":"24"},{"month":"4","num":574,"link":"","year":"2009","news":"","safe_title":"Swine Flu","transcript":"Twitter is great for watching uninformed panics unfold live.\n[[Twitter search results page with \"Swine flu\" in the search box]]\nRealtime results for Swine flu\n1,918 more results since you started searching.  Refresh to see.\n{{All tweets are \"Less than 10 seconds ago from web\"}}\nSKEEVE37: Oh God I ate pork yesterday before I knew about swine flu!\nHANNELOREEC: Without duct tape I can't seal the door to keep out swine flu but I can't get duct tape without going outside! Help!\nPAULYSHOREFAN: How long until the swine flu reaches me here in Madagascar?\nCRACKMONKEY74: Swine flu is God's punishment for the ACLU and lesbians and 9\n11 and nanobots!\nTWILIGHT7531: I fell down the stairs and there was a crack and a jagged white thing is sticking out of my arm guys is this swine flu?\nWIGU: @UNTOWARD: No, that sounds like syphilis, not swine flu. What did you say you did with a pig?\n2011SENIORSRULE: My Dad said flu vaccines are linked to autism, so to be safe from swine flu I'm trying to lick an autistic kid.\n{{title text: Bad flu epidemics can hit young adults hardest because they provoke their powerful immune systems into overreaction, so to stay healthy spend the next few weeks drunk and sleep-deprived to keep yours suppressed.}}","alt":"Bad flu epidemics can hit young adults hardest because they provoke their powerful immune systems into overreaction, so to stay healthy spend the next few weeks drunk and sleep-deprived to keep yours suppressed.","img":"https://imgs.xkcd.com/comics/swine_flu.png","title":"Swine Flu","day":"27"},{"month":"4","num":575,"link":"","year":"2009","news":"","safe_title":"Tag Combination","transcript":"Guy: So you can come up with a song title fitting any tag combination?\nGirl: Try me.\nGuy: Lesbian voyeurism one-hit wonder mash-up.\nGirl: \"I wish that Stacey's Mom had Jessie's Girl.\"\n<<silence>>\nGuy: Well, that was one, but-\nGirl: \"When you Come On Eileen I touch myself.\"\nGuy: Okay, wow.\n{{Title-text: I love Eileen \n and want you to love her \n When you're around \n I'm one floor above her \n If you could see \n just how much I adore her \n Oh, that pretty red dress \n I'd do anything for her \n  (Too ra loo ra too ra loo rye ayy)}}","alt":"I love Eileen / and want you to love her / When you're around / I'm one floor above her / If you could see / just how much I adore her / Oh, that pretty red dress / I'd do anything for her /  (Too ra loo ra too ra loo rye ayy)","img":"https://imgs.xkcd.com/comics/tag_combination.png","title":"Tag Combination","day":"29"},{"month":"5","num":576,"link":"","year":"2009","news":"","safe_title":"Packages","transcript":"[[A dude is sitting at his computer.]]\nMan: I love getting pacakges.\n[[A woman enters.]]\nMan: I set up a script to search eBay et. al. (sic) for $1 items with free shipping.\n[[The man checks his doorstop; a package is waiting for him.]]\nMan: I gave it $365, so each day it can buy me something random.\nWoman: What if you just end up with lots of crap?\nMan: I'll give it away.  But I'm sure I'll end up with some interesting stuff.\n[[Day 1: Length of rubber hose]]\nMan: Could be handy around the house.\n[[Day 2: Ski mask]]\nMan: It's spring, but hey.\n[[Day 3: Bear trap]]\nMan: Huh.\n[[Day 4: Tourist map of the Pentagon]]\nWoman: Uh oh.\n[[Day 5: Lube]]\nMan: I'm stopping this before I end up on every F.B.I. watch list ever.\n{{alt-text: Day six: 'The hell? Who mails a bobcat?'}}","alt":"Day six: 'The hell?  Who mails a bobcat?'","img":"https://imgs.xkcd.com/comics/packages.png","title":"Packages","day":"1"},{"month":"5","num":577,"link":"","year":"2009","news":"For this week, xkcd will update once a day.","safe_title":"The Race: Part 1","transcript":"Huh, cool. Nathan Fillion (Mal from Firefly) has an electric skateboard. Just like you!\nDid you hear that? Nathan-\nI heard. Gimme the computer. I need to book a flight.\nTo be continued...","alt":"Great, and you JUST finished paying off the settlement over the Wayne Coyne hamster ball incident.","img":"https://imgs.xkcd.com/comics/the_race_part_1.png","title":"The Race: Part 1","day":"4"},{"month":"5","num":578,"link":"","year":"2009","news":"For this week, xkcd will update once a day (through Friday).","safe_title":"The Race: Part 2","transcript":"[[Man with skateboard and gear and woman are talking]]\nMan: \"Why race him?\" He's Captain Reynolds!\nWoman: Mr. Fillion is an actor. Firefly was years ago.\n[[They go over to a computer; the man is using a phone and presumably looking up a phone number]]\nWoman: He has his own life to live, and I'm sure the last thing he wants to do is indulge a fan by playing Mal for him.\n[[Nathan Fillion is standing in front of a mirror in a trenchcoat]]\nNathan: (into the mirror) Name's Captain Reynolds, ma'am. *ahem* Name's Captain Reynolds, ma'am.\nSomeone offpanel: Nathan? Telephone!\nNathan: That's Captain!\nSomeone offpanel: Fine, Captain Nathan.\nNathan: No, use my space name!\nSomeone offpanel: *sigh*\n[[Nathan and the skateboarder talk on the phone]]\nSkateboarder: So, how about we race for charities?\nNathan: Sure. Always did want a charity of my own.\nText between them: Come again?\nNathan: You know, boxes in supermarkets collecting food. 'Course, ought to tack up a list sayin' which wines I like best...\nSkateboarder: Uh, that's not quite...\nNathan: Listen, I'm the captain here.\nSkateboarder: ...I just got goosebumps when you said that.\nNathan: Yeah, happens to me too whenever I get captainy. I cut such a strapping figure. Buckle! Swash! All right, let's do this race.\n{{title text: The Hammer + Captain Tightpants == Captain Hammerpants?}}","alt":"The Hammer + Captain Tightpants == Captain Hammerpants?","img":"https://imgs.xkcd.com/comics/the_race_part_2.png","title":"The Race: Part 2","day":"5"},{"month":"5","num":579,"link":"","year":"2009","news":"For this week, xkcd will update once a day (through Friday).","safe_title":"The Race: Part 3","transcript":"[[Malcolm, Munrovian Male, and Summer Glau standing around with electric skateboards]]\nMalcolm Reynolds: meet a few of my friends. this is-\nMale: Summer Glau! you were the best part of Chronicles.\nSummer: I eat my bodyweight in food every 31 days. that's slightly faster than the human average.\n[[Summer stares off into space]]\nMalcom: yeah, there's a reason she only plays strange roles.\nMale: Ah.\nSummer (offscreen): I'm part of the floor now.\n[[They find Jewel Staite working on a skateboard's engine]]\nMalcolm: and this is Kaylee.\nJewel: my name is Jewel, Nathan.\nMalcolm: Kaylee-\nJewel: Jewel.\nMalcolm Jewel is fixin' up my new board.\nJewel:  almost done!\nMale: so wait. Summer's actually weird, Jewel's actually a mechanical whiz...\nMale: ...will Morena Baccarin be here? is she really a-\nMalcolm and Jewel: NO.\n[[Setting up for the race]]\nMalcolm: Kaylee, I've been gunnin' the radio hand throttle thingy for a while, but it ain't movin'\nJewel: oh, I must've set it to the wrong frequency!\nMale (riding around on haywire board): AAAAAAAA\n{{title text: No, the best things about The Sarah Connor Chronicles were: (1) watching Sarah and Cameron try to pass for normal, and (2) Cameron throwing people and things through walls.  Everything else was pretty secondary.}}","alt":"No, the best things about The Sarah Connor Chronicles were: (1) watching Sarah and Cameron try to pass for normal, and (2) Cameron throwing people and things through walls.  Everything else was pretty secondary.","img":"https://imgs.xkcd.com/comics/the_race_part_3.png","title":"The Race: Part 3","day":"6"},{"month":"5","num":580,"link":"","year":"2009","news":"For this week, xkcd will update once a day (through Friday).","safe_title":"The Race: Part 4","transcript":"[[Randall\nxkcd\nman and Nathan Fillion are ready on the start line on their electric skateboards]]\nVoice off panel: On your mark...\nVoice: Get set...\nNathan: Remember episode 11, when I got all naked in that desert?\nVoice: Go!\n[[Nathan speeds away leaving Randall standing at the start line]]\nvoice: ... I said \"Go.\"\nvoice: someone throw some water on him\nRandall: Can't...get it...out of my head...\n[[Nathan on walkie talkie, speeding on his skateboard]]\nNathan: He's right behind me. Kaylee, I'm gonna try a Crazy Ivan.\nKaylee [[on walkie talkie]]: That doesn't make any sense, Nathan.\nNathan: Trust me.\nKaylee: No, I mean it's not a skateboard maneuver[sic]. The concept doesn't even apply to this situation.\nNathan [[via walkie talkie]]: That's why it just might work!\nKaylee: No, that's the opposite of true!\nNathan: On my mark, override the remote differential and throw her into a spin.\nKaylee [[via walkie talkie]] okay, but-\nNathan: Mark!\n<<WHAM>>\n[[Nathan lying injured on the ground next to his skateboard, Randall\nMan cruises past]]\n<<Whirrrrrrrr>>\n[[Nathan, trying to stand up]]\nNathan: I'm down. Tell Summer \"The chickens are in the hayloft. Plan Gamma is a go.\"\n[[Nathan, one foot on skateboard, looking at walkie talkie]]\n<<mumbling from walkie talkie>>\nKaylee: She says, \"Plan gamma acknowledged. The meerkats are in the bad.\n[[Summer Glau is walking off panel]]\nKaylee [[to walkee talkie]]: So we're good?\nNathan: Hard to tell with her. Do you see an actual bag of meerkats?\nKaylee: No.\nNathan: Then we're probably good.\n[[Randall\nMan screeching to a halt as he sees Summer Glau]]\nRandall: Oh! Hi, Miss Glau! I'd love to talk, but Nathan's back on his feet and catching up.\n[[Summer grabs Randalls arm]]\n<<Grab>>\nRandall: Wha-\n[[Summer kicks Randall in the face whilst pulling his arm towards her, he flies off his skateboard]]\n[[Summer walking away as Randall lies crippled on the floor with his sunglasses beside him]]\n[[Randall still lying on the floor]]\nRandall [[thinking]]: I've never been so turned on in my life.\n{{Alt text: Things are rarely just crazy enough to work, but they're frequently just crazy enough to fail hilariously. Title: The Race: Part 4. Comic: xkcd. Tags: firefly, nathan fillion, summer glau, crazy ivan, serenity, whedon}}","alt":"Things are rarely just crazy enough to work, but they're frequently just crazy enough to fail hilariously.","img":"https://imgs.xkcd.com/comics/the_race_part_4.png","title":"The Race: Part 4","day":"7"},{"month":"5","num":581,"link":"","year":"2009","news":"","safe_title":"The Race: Part 5","transcript":"Of the potential responses to my brakes' failure, I did not choose the best.\n[[A car, in silhouette, is sailing off the edge of a cliff. The voice comes from a phone inside the car.]]\nVoice: Hello, you're on Car talk.\n{{Title text: It was the funniest 6.5 seconds of my life, although as usual like 80% of it was just Tom and Ray's gasping, hacking laughter.}}","alt":"It was actually canceled because they just noticed he's been naked under that coat the whole time.  There's a petition on Facebook to get Fox to un-cancel it, and one on Livejournal to get him to take off the coat.","img":"https://imgs.xkcd.com/comics/the_race_part_5.png","title":"The Race: Part 5","day":"8"},{"month":"5","num":582,"link":"","year":"2009","news":"","safe_title":"Brakes","transcript":"Narrator: Of the potential responses to my brakes' failure, I did not choose the best.\n[[A cliff is visible, with a car flying off it.]]\nVoice from car: Hello, you're on Car Talk.\n\n{{Title text: It was the funniest 6.5 seconds of my life, although as usual like 80% of it was just Tom and Ray's gasping, hacking laughter.}}","alt":"It was the funniest 6.5 seconds of my life, although as usual like 80% of it was just Tom and Ray's gasping, hacking laughter.","img":"https://imgs.xkcd.com/comics/brakes.png","title":"Brakes","day":"11"},{"month":"5","num":583,"link":"","year":"2009","news":"","safe_title":"CNR","transcript":"[[A woman is sitting at a computer.]]\nSpeech2Text Commander\nBug #167801\nSpeech recognition fails on young child voices.\nWoman: Hmm.\n\n[[The view enlarges to show a man sitting at another desk.]]\nWoman: Hey, can you do me without a condom? We need a young child for something.\nMan: Okay.\n\n[[A pregnancy test is displayed.  The label indicates not pregnant.]]\n\n[[The woman is at the computer again.]]\nBug #167801\nStatus: Closed\nReason: Could not reproduce.\n\n{{Title text: Can't and shouldn't.}}","alt":"Can't and shouldn't.","img":"https://imgs.xkcd.com/comics/cnr.png","title":"CNR","day":"13"},{"month":"5","num":584,"link":"","year":"2009","news":"","safe_title":"Unsatisfied","transcript":"[[A blonde and a man are holding hands, looking at another woman with black hair.]]\n((Two arrows direct the comic into a pair of different paths.))\n\n((Left path.))\n[[The man is holding hands with the blonde woman, but he is thinking about the woman with black hair.]]\n((Right path.))\n[[The man approaches the woman with black hair.  He is thinking about the blonde.]]\n\n((Left path.))\n[[The man is performing oral sex on the blonde, and still thinking about the woman with black hair.]]\n((Right path.))\n[[The man and the black-haired woman have sex on the arm of a chair.  The man is thinking about the blonde.]]\n\n((Left path.))\n[[The man and the woman are drawing something together, and the man is thinking about the woman with black hair.]]\n((Right path.))\n[[The man and woman are hiking together.  The man is thinking about the blonde woman.]]\n\n((Left path.))\n[[The man and the woman are holding hands, and the man is thinking of the woman with black hair.]]\n((Right path.))\n[[The man and the woman are holding hands, and the man is thinking of the blonde woman.]]\n((The path unites again.))\n[[Two gravestones are next to each other.  One of them is thinking about a third gravestone.]]\n\n{{Title text: Forever comparing, never evaluating on any external scale.  If you were a sort function, you'd never break the nlogn barrier.}}","alt":"Forever comparing, never evaluating on any external scale.  If you were a sort function, you'd never break the nlogn barrier.","img":"https://imgs.xkcd.com/comics/unsatisfied.png","title":"Unsatisfied","day":"15"},{"month":"5","num":585,"link":"","year":"2009","news":"","safe_title":"Outreach","transcript":"[[A group of scientists with goggles and labcoats stand around a pair of beakers.]]\nScientist: The tracking tag will record the shark's movement and habits.\n\n[[The capsule floats upward.]]\nScientist: Then, it will pop free and float to the surface.\n\n[[A coast is shown, with arrows directed from water to land.]]\nScientist:  We can't afford a recovery program, so the capsules will inflate helium balloons, drift over land,\n\nScientist: And hopefully be found and mailed to us. Any questions?\n[[The capsule has a caption on it.]]\nIf found please call\n\n[[The scientist is standing over a groggy shark.]]\n<<Chunk>>\n\n[[The shark is dropped off a boat, into the water.]]\n<<Sploosh>>\nShark: !!!\n\n[[The course of the shark is shown, weaving around islands.]]\n\n[[The capsule is shown stickign out of the shark.]]\n<<Click>>\n\n[[The capsule remains attached to the shark.]]\n\n[[The balloon starts to inflate, still attached to the shark and underwater.]]\n<<Hissss>>\n\n[[As the balloon inflates, it starts to pull the shark to the surface.]]\nShark: ??\n\n[[The balloon breaks the surface, pulling the shark with it.]]\n\n[[A man and a child are standing together.]]\n\n[[Two scientists run past, screaming.  One is holding a microscope.]]\nScientists: AAAAAAAA\n\n[[A shark attached to a huge balloon floats past following the scientists.]]\nShark: <<Chomp chomp>>\n\nChild: Daddy?\nFather: Yes?\nChild: I want to be a scientist.\n\n{{Title text: Completely implausible? Yes. Nevertheless, worth keeping a can of shark repellent next to the bed.}}","alt":"Completely implausible? Yes. Nevertheless, worth keeping a can of shark repellent next to the bed.","img":"https://imgs.xkcd.com/comics/outreach.png","title":"Outreach","day":"18"},{"month":"5","num":586,"link":"","year":"2009","news":"","safe_title":"Mission to Culture","transcript":"[[A man is pulling a woman by the legs.  She is holding onto the ground.]]\nMan: We're getting some culture in you if it \nkills\n you.\nWoman: Don't wanna.\n\n[[The man is pushing the woman through a door.]]\nMan: All you listen to is techno.\nWoman: But... the \nsymphony?\n\n\n[[The couple stand in line between other people.]]\nWoman: I think we're the only people here under 60.\nMan: Shhh.\n\nWoman: The right side is definitely better.\nMan: Better? \nWoman: They've all got bigger instruments. I bet they make more money.\nMan: <<Sigh>>\n\n{{Title text: It can't be very MUCH money ... they apparently can't even afford a sampler.  I mean, with a little remixing, some of this could be kinda good!}}","alt":"It can't be very MUCH money ... they apparently can't even afford a sampler.  I mean, with a little remixing, some of this could be kinda good!","img":"https://imgs.xkcd.com/comics/mission_to_culture.png","title":"Mission to Culture","day":"20"},{"month":"5","num":587,"link":"","year":"2009","news":"","safe_title":"Crime Scene","transcript":"[[A crime scene is surrounded in tape.  A large black pool is on the ground, with splashes around it, and some sort of tool.  Two people are standing outside the tape.]]\nPoliceman: Looks like a murder-suicide.\nGeorge: Any interesting mathematical patterns?\nPoliceman: No, George, just two dead bodies and a lot of blood.\nGeorge: Two... that's the third Fibonacci number!\nPoliceman: Not now, George.\n\nWhen Mathnet shut down, the officers had trouble reintegrating into the regular L.A.P.D.\n\n{{Title text: I think I see a Mandelbrot set! No, that's just blood splatters. Golly.}}","alt":"I think I see a Mandelbrot set! No, that's just blood splatters. Golly.","img":"https://imgs.xkcd.com/comics/crime_scene.png","title":"Crime Scene","day":"22"},{"month":"5","num":588,"link":"","year":"2009","news":"","safe_title":"Pep Rally","transcript":"[[A cheerleader stands in front of crowded bleachers.]]\n[[The cheerleader is waving pompoms.]]\nCheerleader: Lakeview High is the best!\nCrowd: Yeah!\nSomeone: Wait, why?\n\nCheerleader: What?\nVoice: A guy on the North High football team helped me rebuild my deck.\nVoice: It seems ungrateful to presume we're better.\n\nVoice: I mean, school districts are just based on zip codes.\nVoice #2: Their principal donated a kidney to my dad.\n\nVoice: I'm texting with my friend there now. He says it's okay, and we're invited to their events if we want.\nVoice: But he sounded kind of hurt.\nVoice #2: Why are we doing this, rally, again?\n[[The cheerleader looks dejected.]]\n\n{{Title text: You know, pep rallies weirded me out in high school, and they've only gotten creepier in retrospect.}}","alt":"You know, pep rallies weirded me out in high school, and they've only gotten creepier in retrospect.","img":"https://imgs.xkcd.com/comics/pep_rally.png","title":"Pep Rally","day":"25"},{"month":"5","num":589,"link":"","year":"2009","news":"","safe_title":"Designated Drivers","transcript":"[[Four people are outside a bar.]]\nMan #1: Wait, who's driving?\nMan #2: Why?\nMan #2: Tom, right?\n\nMan #1: Yes, but we have to leave in two groups. One of which will need at least two drivers.\n\n[[There is a complicated flowchart with arrows between a group of people and 3 locations, labeled 'bar', 'dinner', and 'party'.  Lines point from the group of people to the bar, then to the party or dinner, then from dinner to the party and vice versa, as well as leaving the panel or entering the panel in several other directions.]]\nNarrator: Someone has to get Paul, and Julia and Emily have to leave by 10:00.\nNarrator: The logistics of who can get drunk are nontrivial.\n\n[[The third man has an animal on a string behind him, which was previously not visible.]]\nMan #3: Yeah, and I can't ride in a car with the wolf because he'll eat my goat.\nMan #1: Dammit, guys.\n\n{{Title text: Calling a cab means cutting into beer money.}}","alt":"Calling a cab means cutting into beer money.","img":"https://imgs.xkcd.com/comics/designated_drivers.png","title":"Designated Drivers","day":"27"},{"month":"5","num":590,"link":"","year":"2009","news":"","safe_title":"Papyrus","transcript":"My Hobby:\nGetting typography geeks heartfelt cards printed in \"papyrus\" and watching them struggle to act grateful.\nWoman: Thank you for the <<Twitch>> ... lovely... <<Twitch>> birthday card!\n[[The woman is holding a card open and looking at someone.  An angry tic is flicking on her forehead.]]\n\n{{Title text: I secretly, deep in my guilty heart, like Papyrus and don't care if it's overused. [Cue hate mail in beautifully-kerned Helvetica.]}}","alt":"I secretly, deep in my guilty heart, like Papyrus and don't care if it's overused. [Cue hate mail in beautifully-kerned Helvetica.]","img":"https://imgs.xkcd.com/comics/papyrus.png","title":"Papyrus","day":"29"},{"month":"6","num":591,"link":"","year":"2009","news":"","safe_title":"Troll Slayer","transcript":"[[A website where people can post comments along side pictures.]]\n((Next to a picture of a website.)) Hey, let's troll the fuck out of the Twilight boards.\n((Next to a picture of some people)) I'm in.  Should be fun.\n((Next to a picture of a man with sword and trumpet)) Me too. Signing on now.\n((Next to a picture of \"LOL\")) Lol angsty teens.\n\nHours Later:\n[[Stephenie Meyer, at a computer.]]\nStephenie Meyer: Hi, it's Stephenie Meyer. Fine, you don't like my books. But please leave us alone.\nComputer (Nerd): Show us your tits.\nStephenie Meyer: I asked politely. Don't make me get tough.\n\n[[Pimply nerd at computer.]]\nNerd: And what, call the internet police? You don't get it, do you? We've been trolling for years. We're all anonymous. There's nothing you can do to hurt us. We're the net's hate machine.\nComputer (Stephenie): Okay. Just remember, I gave you a chance. <<Disconnected>>\n\nSix Months Later\n[[A page from a book.]]\nVampires! Book VI\nEdward ran a pale hand through his perfect golden-bronze hair, then signed on to 4chan.org, the darkest place on the internet, where all his vampire compatriots spent their time.\nSuddenly, there was a loud knock at the door [...] swept in [...] ing\n[[The rest of the page is cut off.]]\n\nShortly Thereafter:\n[[On the same website as the first panel.]]\n((Next to a picture of two people hugging)) OMG I love this place it's so edgy being anonymous.\n(next to a picture of \"DAWNE\") Whos your favorite vampire\n(next to a picture of someone with black hair and shirt) Check out my pic Im so dark just like this site\n(Next to a picture of a chess piece) Any Twilight fans in Dallas want to meet a lonely (...)\n\n[[The same nerd at his computer.]]\nNerd: Oh... Oh God.\n\n{{Title text: We have met the enemy and he is us.}}","alt":"We have met the enemy and he is us.","img":"https://imgs.xkcd.com/comics/troll_slayer.png","title":"Troll Slayer","day":"1"},{"month":"6","num":592,"link":"","year":"2009","news":"","safe_title":"Drama","transcript":"[[Three people are sitting together.]]\nWoman: Man, sex has all these crazy social rules. They just create drama.\nMan #2: Let's agree to change them, and make sex simple!\nMan #1: Okay!\n\nMan: Hooray! We've solved the problem of drama!\nMan: I'll go tell everyone!\n[[The man opens a door.]]\n\n[[There is a graph, showing time vs. drama.  A vertical dotted line indicates the rule change.  Drama is low before the line, then steadily increases afterward.]]\n\n[[The man closes and leans against the door.]]\nMan: Holy shit\nMan: Guys\nMan: People are \ncomplicated!\n\n\n{{Title text: This happens in geek circles every so often. The 'Hey, this is just a system I can figure out easily!' is also a problem among engineers first diving into the stock market.}}","alt":"This happens in geek circles every so often. The 'Hey, this is just a system I can figure out easily!' is also a problem among engineers first diving into the stock market.","img":"https://imgs.xkcd.com/comics/drama.png","title":"Drama","day":"3"},{"month":"6","num":593,"link":"","year":"2009","news":"","safe_title":"Voynich Manuscript","transcript":"[[Weird root vegetables surround a strange script.]]\n\n[[Woman holding up book.]]\nWoman: This is the Voynich manuscript -- a book, allegedly 500 years old, written in an unrecognized script.  It's some kind of visual encyclopedia of imaginary plants and undeciphered \"recipes\".\n\n[[The man opens the book.]]\nWoman: It could be a hoax, a lost language, a cipher, an alien text, glossolatia -- no one knows.\nMan: No one? But it's obvious.\n\nWoman: ... Obvious?  Linguists and cryptographers have been stumped for decades.\nMan: They forget. Human nature doesn't change.\n\nMan: Just imagine someone found a book from _our_ time, full of lists, illustrations, tables, and long, dry descriptions of nonexistent worlds written in an invented language.  What have they found?\nWoman: ... Dear Lord. It \nis\n obvious.\n\n500 Years Earlier:\n[[Three people are standing around pawns and a die.  One is holding a sheet of paper, another is holding a book, the third is holding a scythe.]]\nPerson #1: Forsooth! I concoct an elixir of courage.\nPerson #2: Nae! The source booke sayeth that requires some wolfsbane!\nPerson #3: Your druid doth lose two points.\n\n{{Title text: Wait, is that the ORIGINAL voynich manuscript?  Where did you GET that?  Wanna try playing a round of Druids and Dicotyledons?}}","alt":"Wait, is that the ORIGINAL voynich manuscript?  Where did you GET that?  Wanna try playing a round of Druids and Dicotyledons?","img":"https://imgs.xkcd.com/comics/voynich_manuscript.png","title":"Voynich Manuscript","day":"5"},{"month":"6","num":594,"link":"","year":"2009","news":"","safe_title":"Period","transcript":"Voice: Ugh. Stupid uterus.\nMan: Hey, your period is every 28 days, right?\n\nVoice: Yes, why?\nMan: Well, preiod = T = 1\nf.\nVoice: So?\n\nMan: Using this, we can calculate something you already know.\nVoice: What?\n\nMan: Your uterus-hertz.\nVoice: If I could get up I'd smack you.\n\n{{Title text: 413 nanohertz, by the way.}}","alt":"413 nanohertz, by the way.","img":"https://imgs.xkcd.com/comics/period.png","title":"Period","day":"8"},{"month":"6","num":595,"link":"","year":"2009","news":"","safe_title":"Android Girlfriend","transcript":"[[A couple and a man face each other.  The man is holding something.]]\nMan with android: Check out my new android girlfriend.\nMan #2: Is she a sex bot?\n\n[[The android grabs the cherry out of the man's hand.]]\n\n[[The android pulls the stem off.]]\n<<Plink>>\n\n[[The android puts the stem in its mouth.]]\n<<Nom>>\n\n[[There is a bright flash around the android's mouth.  The rest of the panel is dark.]]\n\nMan #2: I don't think arc-welding a cherry stem counts as sexy.\nAndroid: Remove your pants.\nMan #2: No.\n\n{{Title text: Programming the sexbots to enjoy sex seemed a sensible move at the time, but we didn't realize the consequences of their developing fetishes.}}","alt":"Programming the sexbots to enjoy sex seemed a sensible move at the time, but we didn't realize the consequences of their developing fetishes.","img":"https://imgs.xkcd.com/comics/android_girlfriend.png","title":"Android Girlfriend","day":"10"},{"month":"6","num":596,"link":"","year":"2009","news":"","safe_title":"Latitude","transcript":"[[The Black Hat Guy is holding a phone up to someone.]]\nBlack Hat Guy: We're in a narrow window in which people are using Google Latitude, but haven't learned the habit of turning it off when they're doing something discreetly.\nBlack Hat Guy: I wrote an app to log friends' locations and work out addresses and business names.\n\n[[A timetable is visible.  Each column represents a different person.]]\n[[First column: Megan.]]\n11:00AM Home\n12:30PM Eastview Adult Toy Store\n1:30PM Home\n2:00PM Laketown Sex Toy Shop\n2:30PM Home\n3:00PM Fry's Electronics\n3:30PM Ed's Power Tool Emporium\n4:00PM Home\n4:10PM Hospital Burn Ward\n\n[[Second column: Rober - the rest of the name is cut off, as well as the end nof each entry.]]\n12:30PM Home\n2:00PM Schoo\n3:30PM Subwa\n\n{{Title text: The G1, especially with the new Android upgrade, is way better than I originally thought.}}","alt":"The G1, especially with the new Android upgrade, is way better than I originally thought.","img":"https://imgs.xkcd.com/comics/latitude.png","title":"Latitude","day":"12"},{"month":"6","num":597,"link":"","year":"2009","news":"","safe_title":"Addiction","transcript":"[[A man is typing at a computer.]]\nComputer: Constant novelty saps my initiative. I'm gonna try to spend a weekend at home without internet.\nMan: I give you an hour.\n\n[[A woman stands up, turns off the computer in front of her.]]\n<<Click>>\n\n[[The woman stands proudly in front of the computer.]]\n\n[[The man is at his computer.]]\nComputer: So far, it's not actually too bad!\nMan: Ahem?\nComputer: Wait. Shit.\n\n{{Title text: But if you unplug everything, it gets so quiet you hear that high-pitched empty-room hum.  And then the whispers begin.}}","alt":"But if you unplug everything, it gets so quiet you hear that high-pitched empty-room hum.  And then the whispers begin.","img":"https://imgs.xkcd.com/comics/addiction.png","title":"Addiction","day":"15"},{"month":"6","num":598,"link":"","year":"2009","news":"","safe_title":"Porn","transcript":"[[A man is hunched up at a computer.  A circle surrounds him; the rest of the panel is black.]]\nNarrator: I shouldn't have watched all that porn as a teenager.\n\nNarrator: It's not that it scarred me.\n[[The computer screen is visible.  It shows an online video player, with what appears to be someone performing cunnilingus.  Ads are also visible, though what they depict is not.]]\n\nNarrator: It's just that we had dial-up.\n[[A 14.4kbps modem is shown.]]\nNarrator: And now I'm stuck with a fetish.\n\nNarrator: For video compression.\n[[A man and a woman are in bed together.]]\nMan: Can you try to look... blockier?\n\n{{Title text: I have a thing for corrupt women.}}","alt":"I have a thing for corrupt women.","img":"https://imgs.xkcd.com/comics/porn.png","title":"Porn","day":"17"},{"month":"6","num":599,"link":"","year":"2009","news":"","safe_title":"Apocalypse","transcript":"[[An apocalyptic scene.  Flaming balls rain down on a darkened landscape.  The sky is red.]]\n\nMan with beret: The Apocalypse! The skies burn, the seas turn to blood, and the dead walk the Earth!\n\nMan #1: The dead what?\nMan with beret: Walk the Earth!\n\nMan #1: I have to go.\n\n[[Man #1 sits down at a table to write.  A series of formulas floats above his head.]]\n<<Scribble>>\n<<Scribble>>\n[[Sum for i = 0 to n of i to the power h times 1 over i.]]\n[[Square root of 163.]]\n[[log(n).]]\n\n[[The man runs with paper and pencil.]]\n\n[[The man goes through a door marked \"Math Dep't\".]]\nMan #1: The dead return!\nMan #1: Everyone, quick, get your names on here!\n\n[[5 people line up.  The first in line is signing the paper.]]\nWoman #1: At last.\nMan #2: I hope there's time!\n\n[[Man #1 runs on, holding paper and pencil.]]\n\n[[The man approaches a sign that says \"Cemetery\".]]\nVoice: Hurrghhh\n\n[[The man approaches a half-open grave, with a dirty man climbing out.]]\n\n[[The man in the grave looks up.]]\nMan #1: Paul Erds?\nPaul Erds: Yes?\nMan #1: We need you to sign this.\n\n{{Title text: I wonder if I still have time to go shoot a short film with Kevin Bacon.}}","alt":"I wonder if I still have time to go shoot a short film with Kevin Bacon.","img":"https://imgs.xkcd.com/comics/apocalypse.png","title":"Apocalypse","day":"19"},{"month":"6","num":600,"link":"","year":"2009","news":"","safe_title":"Android Boyfriend","transcript":"[[Two couples meet.]]\nWoman #2: I thought your android girlfriend was cool so I got myself an android boyfriend.\n\nWoman #2: He's really great. I like how --\nWoman #2: Uh.\n[[Woman #1, the android girlfriend, rushes over to Man #2, the android boyfriend.]]\n\n<<Zip>>\nVoice: Mmmmm...\n[[Man #1 and Woman #2 look at something which is off the panel.]]\n\nMan #1: ... Huh.\nWoman #2: It's like somebody stuck a vibrator in a fleshlight.\n\n<<Whirrr>\nVoice: Mmmm\n<<Click>>\n\n{{Title text: Which is, coincidentally, the most unsettling mantlepiece decoration in my house.}}","alt":"Which is, coincidentally, the most unsettling mantlepiece decoration in my house.","img":"https://imgs.xkcd.com/comics/android_boyfriend.png","title":"Android Boyfriend","day":"22"},{"month":"6","num":601,"link":"","year":"2009","news":"","safe_title":"Game Theory","transcript":"[[A man is sitting at a computer.  The text appearing is implied to be what he sees on the screen.]]\nA.I. Loaded\n>>> Analyze love\n\n[[An hourglass appears over the computer.]]\n\n[[The hourglass continues to display.]]\n\nComputer: A strange game. The only winning move is not to play.\n\n{{Title text: Wait, no, that one also loses. How about a nice game of chess?}}","alt":"Wait, no, that one also loses. How about a nice game of chess?","img":"https://imgs.xkcd.com/comics/game_theory.png","title":"Game Theory","day":"24"},{"month":"6","num":602,"link":"","year":"2009","news":"","safe_title":"Overstimulated","transcript":"[[There is a group of people.  Three women and four men.  They are standing around a table with a drink on it.]]\nMan #3: Have you seen John lately?\n\nWoman #3: He and Claire blew off this party to see Jeff.\nMan #4: They do that a lot.\n\nMan #1: Yeah; I don't know what his problem is with hanging out lately.\nMan #3: He's like Katie - ever noticed how she only goes somewhere if Jeff's there?\n\nSomebody: It's so lame how s he hangs around him even when he's not single:\nSomebody: HE LIKES IT. \nSomebody: SOMEONE SERIOUSLY NEEDS TO DATE HER.\nSomebody: TOTALLY.\nSomebody: And honestly I feel like a jerk but I wouldn't mind if she hung around with us a little less. She needs other friends, you know!\n[[Man #2 is cringing away from all the text; none of the word is attributed to specific people.]]\n\n[[Man #2 peels a hole in the panel.  The numbers '1', '2', and '3' are visible through the gap.]]\nSomebody: HAVE YOU \nNOTICED\n HOW EVERY DUDE SHE DATES IS A TOTAL DRUGGIE?\nSomebody: I'm glad I'm not the only one who thought that was weird.\nSomebody: Michelle dates potheads like Elaine but at least they both have real jobs.\nSomebody: Michelle does? She designs those book covers, right?\nSomebody: And it's not like she smokes a lot.\nSomebody: Elaine is one of those girls who\n\n[[The previous panel's text appears again, but peeled back even further.  Man #2 looks up.]]\n1 2 3 4 5 6 7 8 9 10 11 12\n\n[[The man starts taking down the prime numbers.]]\n1     4   6   8 9 10    12    14 15\n  2 3   5   7        11    13\n[[The man grabs and squeezes the 2, so it is half as wide and twice as tall.]]\n\n[[A formula: \\Sum_{i=1}^{\\infty}{1\nP_i} = h]]\n[[ie. The sum from 1 to infinity of the inverse of each prime.]]\n[[The panel shows a 2 that is 2 units tall and 1\n2 wide, a 3 that is 3 units tall and 1\n3 wide, and so on.  The man is moving the 7.]]\n\n[[Man #2 writes h = infinity.  The numbers are piled on their side next to a scale.]]\nVoice: Don't you agree?\nVoice: Hey, wake up.\n\nMan #1: You zoned out or something.\nMan #2: Sorry; I must be... tired.\n\nMan #1: I don't blame you. All day cooped up working on papers.\nMan #3: Must be nice to get out and relax, huh?\nMan #2: Yeah.\n[[Girl #3 reaches for the glass on the table.]]\n\n{{Title text: My favorite thing to do at parties is to talk judgementally about people who aren't there.}}","alt":"My favorite thing to do at parties is to talk judgmentally about people who aren't there.","img":"https://imgs.xkcd.com/comics/overstimulated.png","title":"Overstimulated","day":"26"},{"month":"6","num":603,"link":"","year":"2009","news":"","safe_title":"Idiocracy","transcript":"Man #1: Idiocracy is so true.\nMan #2: I know, right? It used to be that the intelligent, upper classes had more children.\n\nMan #2: Sadly, the recent reversal of this trend has dragged IQ scores and average education steadily downward.\nMan #1: Depressing, huh?\n\nMan #2: Yeah, except \neverything I just said was wrong.\n\nMan #1: Huh?\nMan #2: Wrong. False. The opposite of true.\n\nMan #2: Your'e like the religious zealots who are \nburdened\n by their superiority with the sad duty of decrying the \nobvious\n moral decay of each new generation.\nMan #2: And you're just as wrong.\n\nMan #1: But look at how popular --\nMan #2: More harm has been done by people panicked over societal decline than societal decline ever did.\n\nMan #1: Look -- all we need is a program that limits breeding to --\n[[The second man is walking off panel.]]\nMan #2: New theory: Stupid people reproduce more because the alternative is sleeping with \nyou\n.\n\n{{Title text: People aren't going to change, for better or for worse. Technology's going to be so cool. All in all, the future will be okay! Except climate; we fucked that one up.}}","alt":"People aren't going to change, for better or for worse. Technology's going to be so cool. All in all, the future will be okay! Except climate; we fucked that one up.","img":"https://imgs.xkcd.com/comics/idiocracy.png","title":"Idiocracy","day":"29"},{"month":"7","num":604,"link":"","year":"2009","news":"","safe_title":"Qwertial Aphasia","transcript":"Narrator: I hate how when I'm talking while I type, sometimes I accidentally type a word I'm saying.\n[[A man is sitting at a computer.]]\nComputer: Wanna go get food later?\n\n[[A woman runs over, holding a giraffe.]]\nWoman: Check out what I found in the closet!\n<<Type type>>\nMan ((typing)): Sorry, I really shouldn't.\n\nMan ((talking)): Aww, what an adorable stuffed giraffe!\n<<Type type>>\nMan ((typing)): I can't afford to keep eating out this giraffe.\nNarrator: \nFrequently!\n I meant \n'frequently'!\n\n\n{{Title text: If this were SMBC, the alt-text drawing thingy would be a giraffe hooker fluttering her eyelashes.}}","alt":"If this were SMBC, the alt-text drawing thingy would be a giraffe hooker fluttering her eyelashes.","img":"https://imgs.xkcd.com/comics/qwertial_aphasia.png","title":"Qwertial Aphasia","day":"1"}]
