[{"month":"7","num":605,"link":"","year":"2009","news":"","safe_title":"Extrapolating","transcript":"My Hobby: Extrapolating\n[[There is a graph.  Time runs along the horizontal axis; Number of Husbands on the vertical graph.  Yesterday and today are labeled in time, 0 and 1 in number of husbands.  Points are plotted with 0 at yesterday, 1 at today.  A straight line is fitted through them.]]\n[[A man is holding a pointer to the graph, and looking at a woman wearing a dress and veil.]]\nMan: As you can see, by late next month you'll have over four dozen husbands. Better get a bulk rate on wedding cake.\n\n{{Title text: By the third trimester, there will be hundreds of babies inside you.}}","alt":"By the third trimester, there will be hundreds of babies inside you.","img":"https://imgs.xkcd.com/comics/extrapolating.png","title":"Extrapolating","day":"3"},{"month":"7","num":606,"link":"","year":"2009","news":"","safe_title":"Cutting Edge","transcript":"((A woman is standing.  A man sits at a computer.]]\nWoman: Where've you been all week?\nMan: Playing Half-Life 2!\nWoman: ... that came out in 2004.\n\nMan: I get games on a five-year lag. That way, I never have to buy a high-end system, but get the same steadily-advancing gaming experience as people who do -- and at a fraction of the price.\n\nMan: There are no downsides!\nWoman: I can think of \none\n...\n\nEarly 2013.\nMan: Guys!\nMan: The cake is a lie!\n[[Musical notes surround an italic line, suggesting the man is singing.]]\nMan: This was a triumph.\nMan: The cake is a lie!\nWoman, Man #2: <<Sigh>>\n\n{{Title text: I remember trying to log in to the original Command and Conquer servers a year or two back and feeling like I was knocking on the boarded-up gates of a ghost town. }}","alt":"I remember trying to log in to the original Command and Conquer servers a year or two back and feeling like I was knocking on the boarded-up gates of a ghost town. ","img":"https://imgs.xkcd.com/comics/cutting_edge.png","title":"Cutting Edge","day":"6"},{"month":"7","num":607,"link":"","year":"2009","news":"","safe_title":"2038","transcript":"I'm glad we're switching to 64-bit, because I wasn't looking forward to convincing people to care about the UNIX 2038 problem.\n\nMan #1: What's that?\nMan #2: Remember Y2K? This could be even \nworse!\n\n\n{{Title text: If only we'd chosen 1944-12-02 08:45:52 as the Unix epoch, we could've combined two doomsday scenarios into one and added a really boring scene to that Roland Emmerich movie.}}","alt":"If only we'd chosen 1944-12-02 08:45:52 as the Unix epoch, we could've combined two doomsday scenarios into one and added a really boring scene to that Roland Emmerich movie.","img":"https://imgs.xkcd.com/comics/2038.png","title":"2038","day":"8"},{"month":"7","num":608,"link":"","year":"2009","news":"","safe_title":"Form","transcript":"[[There is a sheet of paper, with a series of check boxes.  A white rectangle is the focus.]]\nDo not write in this space.\n\n[[A man is standing with a pencil, looking at the page.]]\n\n[[The man writes something on the page.]]\n\n[[A group of people with helmets, black goggles, and rifles look at display screens.  There is a radar system on a table between them.]]\n[[The screens show sheets of paper.  On one screen, it shows the man writing on one.]]\n[[One of the men arms his weapon.]]\n<<Cha-click>>\n\n{{Title text: 'This space intentionally left blank' is less immediately provocative but more Hofstadterially confusing.}}","alt":"'This space intentionally left blank' is less immediately provocative but more Hofstadterially confusing.","img":"https://imgs.xkcd.com/comics/form.png","title":"Form","day":"10"},{"month":"7","num":609,"link":"https://tvtropes.org/pmwiki/pmwiki.php/Main/UniversalTropes","year":"2009","news":"","safe_title":"Tab Explosion","transcript":"[[A man is sitting at a computer.]]\n\n<<Click>>\n\nMan: Huh.\n\n<<Click>>\n<<Click>>\n\n<<Click>>\n\n[[The man stares at the computer.]]\n\nMan: I never noticed that!\n\n<<Click>>\n\nMan: Haha, yeah.\n\n<<Click>>\n\n<<Click>>\n<<Click>>\n\n<<Click>>\n\n<<Click>>\n\nMan: So true.\n\n<<Click>>\n\n[[The man stares at the computer.]]\n\n[[The man stares at the computer.]]\n\n<<Click>>\n\n<<Click>>\n<<Click>>\n\n<<Click>>\n\n[[The man stares at the computer.]]\n\n<<Click>>\n\nVoice: Are you in there?\nMan: Help!\n\nWoman: Okay, who linked you to TVTropes? What's \nwith\n that site?\nMan: Can't... stop...\nWoman: It's like Rickrolling, but you're trapped all day.\n\n{{Title text: Cracked.com is another inexplicable browser narcotic.  They could write a list of '17 worst haircuts in the Ottoman Empire' and I'd read through to the end, then click on all the links at the end.}}","alt":"Cracked.com is another inexplicable browser narcotic.  They could write a list of '17 worst haircuts in the Ottoman Empire' and I'd read through to the end, then click on all the links at the end.","img":"https://imgs.xkcd.com/comics/tab_explosion.png","title":"Tab Explosion","day":"13"},{"month":"7","num":610,"link":"","year":"2009","news":"","safe_title":"Sheeple","transcript":"((A thought bubble is shared between the five occupants of a subway car.))\nAll: Look at these people. Glassy-eyed automatons going about their daily lives, never stopping to look around and \nthink!\n  I'm the only conscious human in a world of sheep.\n\n{{Title text: Hey, what are the odds -- five Ayn Rand fans on the same train!  Must be going to a convention.}}","alt":"Hey, what are the odds -- five Ayn Rand fans on the same train!  Must be going to a convention.","img":"https://imgs.xkcd.com/comics/sheeple.png","title":"Sheeple","day":"15"},{"month":"7","num":611,"link":"","year":"2009","news":"","safe_title":"Disaster Voyeurism","transcript":"[[A woman is watching TV.  The Black Hat Guy is leaning on the back of her chair.]]\nWoman: I've realized that I always secretly root for hurricanes. I watch the news hoping that they'll get really big and hit a city. I know my hopes don't actually affect it, but I feel bad.\n\nBlack Hat Guy: Nah, that's just natural human attraction to spectacle. It's like watching the shuttle launch because you don't want to miss it if there's a disaster.\nWoman: ... I guess?\n\nBlack Hat Guy: Or dressing as an intern to sneak into operating rooms, in case a patient dies and you can watch them harvest organs.\nWoman: Wait, you \ndo\n that?\n\nBlack Hat Guy:  Or stealing detour signs to direct highway drivers downw backwoods roads strewn with caltrops. After the tires burst, you start shooting out their windows.\n\nBlack Hat Guy: Then, when they flee the car in terror, you hunt them on horseback, like \nmen\n once did.\nWoman: I realized a while back that we're having entirely different conversations.\n\n{{Title text: Hurricane forums are full of excited comments about central pressure and wind speed and comparisons to Camille and 1931 and 1938, with hastily-tacked-on notes about how it will be tragic if anyone dies and they hope it's a dud.}}","alt":"Hurricane forums are full of excited comments about central pressure and wind speed and comparisons to Camille and 1931 and 1938, with hastily-tacked-on notes about how it will be tragic if anyone dies and they hope it's a dud.","img":"https://imgs.xkcd.com/comics/disaster_voyeurism.png","title":"Disaster Voyeurism","day":"17"},{"month":"7","num":612,"link":"","year":"2009","news":"","safe_title":"Estimation","transcript":"[[A man is in a car, talking on his phone.]]\nMan: I'm just outside town, so I should be there in fifteen minutes.\nMan: Actually, it's looking more like six days.\nMan: No, wait, thirty seconds.\n\nThe author of the Windows file copy dialog visits some friends.\n\n{{Title text: They could say \"the connection is probably lost,\" but it's more fun to do naive time-averaging to give you hope that if you wait around for 1,163 hours, it will finally finish.}}","alt":"They could say \"the connection is probably lost,\" but it's more fun to do naive time-averaging to give you hope that if you wait around for 1,163 hours, it will finally finish.","img":"https://imgs.xkcd.com/comics/estimation.png","title":"Estimation","day":"20"},{"month":"7","num":613,"link":"","year":"2009","news":"","safe_title":"Threesome","transcript":"Woman: We had a threesome last night.\nMan: How was it?\n\nWoman: Awkward -- it was with a physicist.\nMan: Why's that awkward?\n\nWoman: They can't solve the three-body problem.\nMan: Ah, yes.\n\n{{Title text: I wanted us to try finding an approximate numeric solution, but noooo.}}","alt":"I wanted us to try finding an approximate numeric solution, but noooo.","img":"https://imgs.xkcd.com/comics/threesome.png","title":"Threesome","day":"22"},{"month":"7","num":614,"link":"","year":"2009","news":"","safe_title":"Woodpecker","transcript":"[[A man with a beret and a woman are standing on a boardwalk, leaning on a handrail.]]\nMan: A woodpecker!\n<<Pop pop pop>>\nWoman: Yup.\n\n[[The woodpecker is banging its head against a tree.]]\nWoman: He hatched about this time last year.\n<<Pop pop pop pop>>\n\n[[The woman walks away.  The man is still standing at the handrail.]]\n\nMan: ... woodpecker?\nMan: It's your birthday!\n\nMan: Did you know?\n\nMan: Did... did nobody tell you?\n\n[[The man stands, looking.]]\n\n[[The man walks away.]]\n\n[[There is a tree.]]\n\n[[The man approaches the tree with a present in a box, tied up with ribbon.]]\n\n[[The man sets the present down at the base of the tree and looks up.]]\n\n[[The man walks away.]]\n\n[[The present is sitting at the bottom of the tree.]]\n\n[[The woodpecker looks down at the present.]]\n\n[[The woodpecker sits on the present.]]\n\n[[The woodpecker pulls on the ribbon tying the present closed.]]\n\n((full width panel))\n[[The woodpecker is flying, with an electric drill dangling from its feet, held by the cord.]]\n\n{{Title text: If you don't have an extension cord I can get that too.  Because we're friends!  Right?}}","alt":"If you don't have an extension cord I can get that too.  Because we're friends!  Right?","img":"https://imgs.xkcd.com/comics/woodpecker.png","title":"Woodpecker","day":"24"},{"month":"7","num":615,"link":"","year":"2009","news":"","safe_title":"Avoidance","transcript":"[[A man is standing talking to a man in a chair, who is holding a phone.]]\nMan #1: Did you call that hot girl from the party yet?\nMan #2: I've been trying.\n\nMan #2: It's weird. I swear I got her the first time.  But now it says the number's wrong.\n\nMan #1: What did you say she did, again? \nMan #2: Voice work. At Verizon, I think.\nMan #2: Why?\nMan #1: No reason.\n\n[[A woman is talking into a phone, in an italic voice.]]\nWoman: We're sorry, your call could not be completed as dialed.\nMan #2: Damn.\n<<Click>>\nWoman: Please check the number and try again.\n\n{{Title text: Hobby: seeing how many menu selections you can get someone to go through before they realize you're not an automated system and\nor hang up.}}","alt":"Hobby: seeing how many menu selections you can get someone to go through before they realize you're not an automated system and/or hang up.","img":"https://imgs.xkcd.com/comics/avoidance.png","title":"Avoidance","day":"27"},{"month":"7","num":616,"link":"","year":"2009","news":"","safe_title":"Lease","transcript":"[[A man is holding a sheet of paper.]]\nMan #1: Okay, any other concerns before you sign the lease?\n\nMan #2: I'm concerned that we're sitting here like I'm a responsible adult. I'm pretty sure I stopped growing up in my teens and have been faking ever since.\n\nMan #2: For god's sake, you're entrusting me with a \nbuilding\n. I still make LEGO buildings sometimes.\n\nMan #1: Sir, does any of this impact your fulfillment of the lease terms?\nMan #2: I don't know what you just said because I was thinking about Batman.\n\n{{Title text: You should talk to the girl down the hall; I think you'd like her.  Lemme know if you find out why she's ordering all those colored plastic balls.}}","alt":"You should talk to the girl down the hall; I think you'd like her.  Lemme know if you find out why she's ordering all those colored plastic balls.","img":"https://imgs.xkcd.com/comics/lease.png","title":"Lease","day":"29"},{"month":"7","num":617,"link":"","year":"2009","news":"","safe_title":"Understocked","transcript":"[[A bearded man with glasses and a police man are swearing at each other on a stoop.]]\n\n[[The bearded man is sitting behind bars.]]\n\n[[The President is standing at a podium with a fancy logo on the front.]]\nPresident: To defuse this misunderstanding, I've invited both men to have a beer with me at the white house.\n\n[[The policeman, the bearded man, and the president are in a room with a couch and an oval carpet.]]\n\n[[The president is looking in a cabinet.]]\nPresident: Actually, it seems we're out of beer.\nVoice: Is there anything else?\n\n[[The president sees a bottle of Tequila.]]\n\n[[The Presidential Limo is being driven at high speed.  The bearded man and the policeman are standing out of the sunroof.  The policeman is waving his hat and holding the bottle of tequila.]]\nAll: WOOOOOOOOOOOO\n\n[[The policeman, the bearded man, and the president are sitting behind bars.]]\n\n{{Title text: My biology grad student friends tell me that different types of alcohol don't actually have different effects. I trust their expertise, not because of the 'biology' part, but because of the 'grad student'.}}","alt":"My biology grad student friends tell me that different types of alcohol don't actually have different effects. I trust their expertise, not because of the 'biology' part, but because of the 'grad student'.","img":"https://imgs.xkcd.com/comics/understocked.png","title":"Understocked","day":"31"},{"month":"8","num":618,"link":"","year":"2009","news":"","safe_title":"Asteroid","transcript":"[[The panel appears like a news report.]]\n[[There is a picture of a rocket, captioned 'Breaking news']]\nNews-anchor: Astronomers have confirmed that the asteroid is headed for Earth.\n\nNews-anchor: NASA has launched a heroic mission to land a rover on the asteroid, drill into it, and destroy it with nuclear bombs.\n[[The picture of the rocket fills the panel.  In an inset picture is the rover.]]\n\n[[A woman is sitting at an interface. A man stands next to it.  Both are wearing headsets with microphones.]]\nWoman with headset: The robot has landed successfully and planted the nukes! We're saved!\nMan with headset: Hooray!\nVoice: We're heroes!\n\n[[Digital countdown.]]\n0:05...\n0:04...\n0:03...\n[[The Little Prince is looking at the NASA rover, which has drilled into the asteroid.  Beside him is the rose, and a small volcano.]]\n\n{{Title text: My Deep Impact\nLittle Prince crossover fanfic has been poorly received by the community.}}","alt":"My Deep Impact/Little Prince crossover fanfic has been poorly received by the community.","img":"https://imgs.xkcd.com/comics/asteroid.png","title":"Asteroid","day":"3"},{"month":"8","num":619,"link":"","year":"2009","news":"","safe_title":"Supported Features","transcript":"Man #1: It took a lot of work, but this latest Linux patch enables support for machines with 4,096 CPUs, up from the old limit of 1,024.\nMan #2: Do you have support for smooth full-screen Flash video yet?\nMan #1: No, but who uses \nthat?\n\n[[Man #2 is holding a laptop.]]\n\n{{Title text: I hear many of you finally have smooth Flash support, but me and my Intel card are still waiting on a kernel patch somewhere in the pipeline before we can watch Jon Stewart smoothly.}}","alt":"I hear many of you finally have smooth Flash support, but me and my Intel card are still waiting on a kernel patch somewhere in the pipeline before we can watch Jon Stewart smoothly.","img":"https://imgs.xkcd.com/comics/supported_features.png","title":"Supported Features","day":"5"},{"month":"8","num":620,"link":"","year":"2009","news":"","safe_title":"Wings","transcript":"Man: Titan's gravity is 14% of Earth's, and its atmosphere 50% denser.\n\nMan: So if you can generate 9% of your body weight in lift, you can fly on Titan.\n\nMan: With wings, a stage harness, a cable, and 91% of my bodyweight in in bricks, I want to test this.\n[[There is a heap of materials on the ground.  The man is holding a stage harness.]]\n\n[[Large diagram of a bridge.  A rope leads through pulleys tied to the bridge.  One end goes to the man, one end to a pile of bricks.]]\n\n[[The man is standing with wings attached to his arms.]]\n\n[[The man flaps the wings, and appears to be floating.]]\n\n[[The man glides.]]\n\nMan: It works!\nWoman: Except you have two problems.\nMan: What?\n\nWoman: You used hot glue on your wing joints and you have friends into Greek mythology.\nMan: Huh?\n\n[[Black Hat Guy is standing on the bridge, with a large lamp labeled 'heat lamp' attached to a battery.]]\n\n[[The wing segments fall off the man and he tumbles downward.]]\n\n{{Title text: Please do not try any of this and die or get arrested.}}","alt":"Please do not try any of this and die or get arrested.","img":"https://imgs.xkcd.com/comics/wings.png","title":"Wings","day":"7"},{"month":"8","num":621,"link":"","year":"2009","news":"","safe_title":"Superlative","transcript":"Narrator: He has dreams.\n[[Man is gesturing to woman.]]\nMan: I was in this weird cross between work and my old house...\nNarrator: Which he'll tell you all about.\n\nNarrator: He can speak French.\nNarrator: Or could in high school, anyway.\nNarrator: A little.\nMan: Man, I knew all these tenses and stuff once.\n\nNarrator: His blog has four posts, all apologies for not posting more.\n[[The man is sitting at a desk, typing.]]\nMan: Sorry, I've been trying to think of stuff to put here.\n\nNarrator: He is\nNarrator: The least interesting man in the world.\n[[The man is sitting at a table.  Two women are paying no attention to him.]]\nMan: I don't always drink beer, but when I do, I stick to a glass or two. Any more and I feel sick.\n\n{{Title text: Stay while I recount the crazy TF2 kill I managed yesterday, my friends.}}","alt":"Stay while I recount the crazy TF2 kill I managed yesterday, my friends.","img":"https://imgs.xkcd.com/comics/superlative.png","title":"Superlative","day":"10"},{"month":"8","num":622,"link":"","year":"2009","news":"","safe_title":"Haiku Proof","transcript":"[[Students are sitting at desks.]]\nStudent #1: How do you know there are an infinite number of primes?\nProfessor: I'll answer in haiku!\n\nProfessor: Top prime's divisors'\n\n[[The professor floats into the air.]]\nProfessor: Product (plus one)'s factors are...?\n\n[[The professor wafts over the students.]]\nProfessor: Q.E.D., bitches!\nStudent #2 ((in thought bubble)) Wow, after the 48-hour sleep-dep mark, lectures get \nreally\n interesting.\n\n{{Title text: After somewhere around 40 hours, there's no academic reason to go to the class. Only go for the hallucinations.}}","alt":"After somewhere around 40 hours, there's no academic reason to go to the class. Only go for the hallucinations.","img":"https://imgs.xkcd.com/comics/haiku_proof.png","title":"Haiku Proof","day":"12"},{"month":"8","num":623,"link":"","year":"2009","news":"","safe_title":"Oregon","transcript":"History of 19th-Century Oregon\n[[Timeline, with relevant images next to each date.]]\n1805\n[[Two men stand at the edge of a cliff. One has a walking staff.]]\nArrival of Lewis & Clark\n\n1825\nEarly settlers arrive\n\n1841\nOregon trail established\n\n1843\nLarger western migration begins\n\n1848\n[[A horse is pulling a covered wagon. A gun peeks out the back.]]\nHuge wave of 500,000+ settlers arrives from Missouri. Largely children and adolescents, most bring nothing but cartloads of bullets for hunting.\n\n1849\n[[Two men with rifles aim at something.]]\nOverhunting begins to devastate ecosystem \nDysentery epidemic\n\n1850\n[[Tombstones.  Bodies.]]\nShooting deaths skyrocket\nTyphoid epidemic\nMeasles epidemic\nCholera epidemic\n\n1851\nAll mammals larger than squirrels wiped out by overhunting.\nMassive famine\n\n1852\n[[Sun low over a land, devoid of life.  Scattered remains of corpses.]]\nLast survivors flee\nOregon territory abandoned\n{{Title text: A century later, the harrowing flight of the survivors from Oregon was dramatized in a popular video game.}}","alt":"A century later, the harrowing flight of the survivors from Oregon was dramatized in a popular video game.","img":"https://imgs.xkcd.com/comics/oregon.png","title":"Oregon","day":"14"},{"month":"8","num":624,"link":"","year":"2009","news":"","safe_title":"Branding","transcript":"Browsing without adblock\n[[A man is sitting at a computer.]]\n[[Pop-up window with red background.]]\nThe Facebook of SEX! Click now!\nMan: Sigh.\n<<Close>>\n\n[[Pop-up window with green background.]]\nTwitter for 18+ singles! Join today!\nMan: Does every porn site have to brant itself like this?\n<<Close>>\n\n[[Pop-up window with blue background.]]\nWe're like Google Reader for S&M!\nMan: ((in italics)) Really?\n<<Close>>\n\n[[Pop-up window with orange background.]]\nTry the new GitHub for lesbians!\nMan: Ok, wait, what?\n\n{{Title text: Actually, 'RSS&M' is kinda catchy.}}","alt":"Actually, 'RSS&M' is kinda catchy.","img":"https://imgs.xkcd.com/comics/branding.png","title":"Branding","day":"17"},{"month":"8","num":625,"link":"","year":"2009","news":"","safe_title":"Collections","transcript":"Man: I now have every Discworld book!\nWoman: Eh. Building a Kindle collection seems pointless.\n\nMan: Yeah, I know the DRM means I'll probably lose them someday.\nWoman: No, pointless in general.\n\nWoman: Sure, you satisfy deep magpie-like urges by building neat collections, but you still die alone.\n\nMan: Sorry, sometimes I mistake your existential crises for technical insights.\nWoman: Sometimes I mistake this for a universe that cares.\n\n{{Title text: You know what really helps an existential crisis? Wondering how much shelf space to leave for a Terry Pratchett collection.}}","alt":"You know what really helps an existential crisis? Wondering how much shelf space to leave for a Terry Pratchett collection.","img":"https://imgs.xkcd.com/comics/collections.png","title":"Collections","day":"19"},{"month":"8","num":626,"link":"","year":"2009","news":"","safe_title":"Newton and Leibniz","transcript":"Newton, 1666\n[[A guy with long white hair holds up a sheet of paper.]]\nNewton: I've invented calculus!\n\nLeibniz, 1674\n[[A man with long black hair holds up a sheet of paper.]]\nLeibniz: I've invented calculus!\n\nNewton: Really? Sounds a little bit...\n\n[[Newton puts on a pair of sunglasses.]]\n\nNewton: [[in italics]] Derivative.\n\n{{Title text: YEEEEEEAAAAAAHHHHHH!}}","alt":"YEEEEEEAAAAAAHHHHHH!","img":"https://imgs.xkcd.com/comics/newton_and_leibniz.png","title":"Newton and Leibniz","day":"21"},{"month":"8","num":627,"link":"","year":"2009","news":"","safe_title":"Tech Support Cheat Sheet","transcript":"Narrator: Dear various parents, grandparents, co-workers, and other \"not computer people.\"\nNarrator: We don't magically know how to do everything in every program. When we help you' we're usually just doing this:\n\n[[There is a flowchart there.  Numbers are included to improve clarity, and do not appear in the original.]]\n\nRectangle: Start. \n[[go to 1]]\n\n{{1. Diamond}} Find a menu item or button which looks related to what you want to do. \n[[I can't find one - go to 2]] \n[[ok - go to 3]]\n\n{{2. Diamond}} Pick one at random. \n[[I've tried them all - go to 4]] \n[[Ok - go to 3]]\n\n{{3. Rectangle}} Click it. \n[[go to 5]]\n\n{{4. Rectangle}} Google the name of the program plus a few words related to what you want to do. Follow any instructions.\n[[go to 5]]\n\n{{5. Diamond}} Did it work?\n[[Yes - go to 8]]\n[[No - go to 6]]\n\n{{6. Diamond}} Have you been trying this for over half an hour?\n[[Yes - go to 7]]\n[[No - go to 1]]\n\n{{7. Rectangle}} Ask someone for help or give up.\n[[End of flowchart]]\n\n{{8.  Rectangle}} You're done!\n[[End of flowchart]]\n\nNarrator: Please print this flowchart out and tape it near your screen. Congratulations; you're now the local computer expert!\n\n{{Title text: 'Hey Megan, it's your father. How do I print out a flowchart?'}}","alt":"'Hey Megan, it's your father. How do I print out a flowchart?'","img":"https://imgs.xkcd.com/comics/tech_support_cheat_sheet.png","title":"Tech Support Cheat Sheet","day":"24"},{"month":"8","num":628,"link":"","year":"2009","news":"","safe_title":"Psychic","transcript":"Man: I'm psychic, you know.\nWoman: There's no such thing.\n\nMan: Okay, think of a number from one to one hundred.\nWoman: Okay.\nMan: 43.\nWoman: Holy shit!\n\nMan: I try not to let it affect my life too much.\nWoman: Wait, I can't believe this.\n\nMan: Don't worry about it. Forget I said anything.\nWoman: But--\nMan: Let's get to the movie.\nWoman: I, uh... Ok, sure.\nNarrator: This trick may only work 1% of the time, but when it does, it's totally worth it.\n\n{{Title text: You can do a lot better than 1% if you start keeping track of the patterns in what numbers people pick.}}","alt":"You can do a lot better than 1% if you start keeping track of the patterns in what numbers people pick.","img":"https://imgs.xkcd.com/comics/psychic.png","title":"Psychic","day":"26"},{"month":"8","num":629,"link":"","year":"2009","news":"","safe_title":"Skins","transcript":"[[Man is packing luggage.]]\nVoice: Where are you going?\nMan: Convention.\n\nVoice: What for?\nMan: Well, you know furries, right?\nVoice: Sure...\n[[Man closes suitcase.]]\n\nMan: We're furries whose animal identities have a thing for pretending to be humans.\nVoice: I see.\n\n[[A convention.  People sit behind booths in the background.]]\nMan with glasses: How's the weather?\nWoman: Great! I've been driving my car and having a job all day!\nMan with glasses: Did you meow?\nWoman: Not once!\n{{Title text: There's Livejournal drama between those who want to wear human suits over fursuits and those who just take off the fursuits.}}","alt":"There's Livejournal drama between those who want to wear human suits over fursuits and those who just take off the fursuits.","img":"https://imgs.xkcd.com/comics/skins.png","title":"Skins","day":"28"},{"month":"8","num":630,"link":"","year":"2009","news":"","safe_title":"Time Travel","transcript":"Woman: I've traveled here from the year 1983 to say this:\nWoman: {{In italics}} Are there any bagels left?\n[[A man is eating something.]]\nNarrator: While it's technically true, I wish she'd stop prefacing every sentence with that.\n{{Title text: She also starts every letter with \"Dear Future <your name>\".}}","alt":"She also starts every letter with \"Dear Future <your name>\".","img":"https://imgs.xkcd.com/comics/time_travel.png","title":"Time Travel","day":"31"},{"month":"9","num":631,"link":"","year":"2009","news":"","safe_title":"Anatomy Text","transcript":"Plate 15: Female breast.\n[[There is a drawing of a breast, with 'breast', 'areola', and 'nipple' labeled.]]\n\nPlate 16: External female genitalia\n[[There is a picture of external female genitalia.  'labia majora', 'labia minora', 'clitoris', 'urethral opening', and 'vagina' are labeled.]]\nVoice #1: HEY!\n\nPlate 17: External male genitalia\n[[There is salt, ketchup, and mustard to one side.]]\nVoice #2: Shit!\nVoice #1: What the hell?  You can't do that in here.\nVoice #2: Megan, get off the table!\nVoice #2: Grab the tripod!\n\nPlate 18: Erect Penis\n[[The picture appears to be at an angle.]]\nVoice #1: We're calling the cops!\nVoice #2: RUN!\nVoice #1: TGI Friday's is a family establishment!\n\n{{Title text: For many of the anatomy pictures on Wikipedia, I think this is actually not far from reality. They only look all formal and professional due to careful cropping.}}","alt":"For many of the anatomy pictures on Wikipedia, I think this is actually not far from reality. They only look all formal and professional due to careful cropping.","img":"https://imgs.xkcd.com/comics/anatomy_text.png","title":"Anatomy Text","day":"2"},{"month":"9","num":632,"link":"","year":"2009","news":"","safe_title":"Suspicion","transcript":"[[A man is sitting at a computer, typing.]]\nMan: I've loved our online chats these past few months, Lisa.\nComputer: Me too. I really like you, Rob.\n\n[[The man continues to type.]]\nMan: It's just... now and then you mention products you like, and... I worry.\nComputer: What? Honey...\n\n[[The man types.]]\nMan: Before this goes any further, I think we should go get tested. You know, together.\nComputer: You don't trust me?\nMan: I just want to be sure.\n\n[[A web browser is open.]]\nVK Couples Testing\nTest ID: 21871138\nWaiting...Partner connected.\n((A pair of CAPTCHA images))\n[You] Library\n[Partner] Kittens\nMan: Okay, mine says \"library\". Yours?\nComputer: I... uh...\nMan: Oh god.\nComputer: I'm more than a spambot! Our love was real!\nMan: Goodbye, Lisa.\n{{Title text: Fine, walk away.  I'm gonna go cry into a pint of Ben&Jerry's Brownie Batter(tm) ice cream [link], then take out my frustration on a variety of great flash games from PopCap Games(r) [link].}}","alt":"Fine, walk away.  I'm gonna go cry into a pint of Ben&Jerry's Brownie Batter(tm) ice cream [link], then take out my frustration on a variety of great flash games from PopCap Games(r) [link].","img":"https://imgs.xkcd.com/comics/suspicion.png","title":"Suspicion","day":"4"},{"month":"9","num":633,"link":"","year":"2009","news":"","safe_title":"Blockbuster Mining","transcript":"Man: We've acquired some new rights, but I'm not sure it's in the spirit to make it a blockbuster --\nVoice: Do it anyway. Take $100 million, hire Michael Bay.\nMan: But --\nVoice: [[in italics]] NEXT!\n\n[[Panel is inverted, white on black background.]]\nGirl: They said if I were captured I should take my own life.\nGirl: But I'd just as soon take yours.\n[[Girl is pointing two handguns at two men with machine guns.]]\n\n<<BOOM>>\n[[Girl explodes off a cliff, carrying a rectangular object and a gun.  In the background is a helicopter, some mountains, and the sea.]]\n\n[[Panel is inverted, white and red on black background.\nMan: Stop! I'll talk!\nGirl: No, I know everything, this is just for fun.\n[[Girl is holding a bloody pipe. Man is tied to a chair.  There is blood pooling on the ground under the chair.]]\n\n[[Crosshairs follow a man.]]\nGirl: I'll be watching.\n\n[[The panel is inverted colour, white on black.]]\nHarriet\nthe\n[[in red]] SPY\n[[A bloody spiral notebook, with blood streaks leading from it.]]\n\n{{Title text: The 2007 Bridge to Terebithia trailer put me off too much to see that particular movie, but I am cautiously optimistic about Where the Wild Things Are.}}","alt":"The 2007 Bridge to Terebithia trailer put me off too much to see that particular movie, but I am cautiously optimistic about Where the Wild Things Are.","img":"https://imgs.xkcd.com/comics/blockbuster_mining.png","title":"Blockbuster Mining","day":"7"},{"month":"9","num":634,"link":"","year":"2009","news":"","safe_title":"Date","transcript":"[[Two people are sitting at a table, with a candle-lit dinner.  The man is holding up a sheet of paper, and the woman is scribbling.]]\nMan: Both my parents were colorblind, so...\nWoman: Hey, if we made more than two, we'd have a better-than-even chance of adorable red hair.\nMan: Ooh, and check this: green eyes!\nNarrator: Trivia: 30% of biologist first dates disintegrate into making Punnett squares.\n\n{{Title text: Well, the kid's definitely getting the biology geek phenotype.}}","alt":"Well, the kid's definitely getting the biology geek phenotype.","img":"https://imgs.xkcd.com/comics/date.png","title":"Date","day":"9"},{"month":"9","num":635,"link":"","year":"2009","news":"","safe_title":"Locke and Demosthenes","transcript":"[[Valentine is laying on her back on the ground.  Peter is feeding a squirrel.]]\nValentine: Ender's up there saving the world, but down here it's fallig apart politically. What can we do?\n\nPeter: I know -- we get on the nets and anonymously post political opinions.  People reading our articles will see our intelligence, recognize how clear and logical our arguments are, and insist that we be put in charge, so we can fix everything!\nValentine: Brilliant!\n[[The squirrel is vomiting.]]\n\n[[A blog.]]\n((Header.))\nLOCKE\nPowered by Wordpress\n\n((Articles, partly scrolled down.))\n[...] which is why we must reach out to the Russian leadership.\n  Posted at 3:15AM by Locke\n  Comments (0)\n\n((In a larger font))\nThe Problem with China\nIn recent months much has been made of [...]\n\n((In a sidebar))\nRecent posts:\n>> A few thoughts on...\n  Comments (0)\n>> Russian Aggression...\n  Comments (1)\n>> Trade policy and the...\n  Comments (0)\n>> And one more thing...\n  Comments (0)\n>> Everyone's wrong about...\n  Comments (1)\n\n((A list of links to other websites.))\nBlogroll:\n>> Demosthenes\n>> FiveThirtyEight\n\n{{Title text: Dear Peter Wiggin: This letter is to inform you that you have received enough upvotes on your reddit comments to become president of the world.  Please be at the UN tomorrow at 8:00 sharp.}}","alt":"Dear Peter Wiggin: This letter is to inform you that you have received enough upvotes on your reddit comments to become president of the world.  Please be at the UN tomorrow at 8:00 sharp.","img":"https://imgs.xkcd.com/comics/locke_and_demosthenes.png","title":"Locke and Demosthenes","day":"10"},{"month":"9","num":636,"link":"","year":"2009","news":"","safe_title":"Brontosaurus","transcript":"[[Two people are sitting at a bench.  The woman is holding a turtle.]]\nWoman: Our love is like a turtle.\n\n[[The woman sets down the turtle and turns to her partner.  They hold hands.]]\nWoman: Humble and simple, enduring by virtue of perfect design.\n\nPartner: Our love is like a brontosaurus.\n\nPartner: Recognized as a mistaken combination long ago, lingering only out of misplaced affection for an imagined past.\n\n{{Title text: Well, sex is like a velociraptor: despite your movie-fueled lifelong neurotic obsession, unlikely to be found in your house.}}","alt":"Well, sex is like a velociraptor: despite your movie-fueled lifelong neurotic obsession, unlikely to be found in your house.","img":"https://imgs.xkcd.com/comics/brontosaurus.png","title":"Brontosaurus","day":"14"},{"month":"9","num":637,"link":"","year":"2009","news":"","safe_title":"Scribblenauts","transcript":"((In Scribblenauts word input format))\nLARGE HADRON COLLIDER\n<<Click>>\nWoman: Wow, Scribblenauts even lets you summon the LHC.\n\n[[A man is sitting at a computer.  The woman talks from off-panel.]]\n<<Fwoosh>>\nWoman: And it makes a black hole! This game rules.\nMan: I guess it's okay, for a DS kids game.\n\n((In Scribblenauts word input format))\nPRETENTIOUS ASSHOLE\n<<Click>>\n[[The woman looks up.]]\nWoman: Oh, hi! It worked!\n\n{{Title text: Let me look away and type 'guy who's just jealous that I beat all his MarioKart times' and turn back, and ... yup, there you are again!}}","alt":"Let me look away and type 'guy who's just jealous that I beat all his MarioKart times' and turn back, and ... yup, there you are again!","img":"https://imgs.xkcd.com/comics/scribblenauts.png","title":"Scribblenauts","day":"16"},{"month":"9","num":638,"link":"","year":"2009","news":"","safe_title":"The Search","transcript":"Ant:  We've searched dozens of these floor tiles for several common types of pheromone trails.\nAnt: If there were intelligent life up there, we would have seen its messages by now.\n\nThe world's first ant colony to achieve sentience calls off the search for us.\n\n{{Title text: I am so excited about the Kepler mission. This is the second most important thing our species has ever done, right behind inventing the concept of delivery pizza.}}","alt":"I am so excited about the Kepler mission. This is the second most important thing our species has ever done, right behind inventing the concept of delivery pizza.","img":"https://imgs.xkcd.com/comics/the_search.png","title":"The Search","day":"18"},{"month":"9","num":639,"link":"","year":"2009","news":"","safe_title":"Lincoln-Douglas","transcript":"[[Lincoln stands before an audience.]]\nHeckler: Oh yeah? Well, fourscore and seven years ago your MOM brought forth on this continent a new nation, conceived in liberty, and dedicated to the proposition that all men are created equal!\n\nNarrator: After his 1860 loss to Lincoln, Stephen Douglas's famed debating skills entered a rapid decline.\n\n{{Title text: Stephen Douglas actually died soon after the debates and election, but if you demand historical accuracy in your webcomics you should be reading Hark! A Vagrant.}}","alt":"Stephen Douglas actually died soon after the debates and election, but if you demand historical accuracy in your webcomics you should be reading Hark! A Vagrant.","img":"https://imgs.xkcd.com/comics/lincoln_douglas.png","title":"Lincoln-Douglas","day":"21"},{"month":"9","num":640,"link":"","year":"2009","news":"","safe_title":"Tornado Hunter","transcript":"[[Two people are in a car, which is driving past a cactus.  The passenger has a pith helmet and a mustache.]]\nDriver: The tornado's three miles west, moving northeast at 15 mph.\nPassenger: Go right; get ahead of it.\n\n[[A tornado is visible.  The passenger pulls out a gun, and stands up in the car.]]\nPassenger: Okay, we're in range! Stop here!\n\n[[The passenger fires a gun at the tornado.]]\n<<BANG>>\nTornado: AUGH!\n\nPassenger: Big one! Must be an F-3!\nDriver: I'm not sure we're doing this right.\nPassenger: Help me mount it on the hood.\n[[The passenger is holding the tornado by its tail.]]\n\n{{Title text: The Fujita Scale was replaced by the Enhanced Fujita Scale in 2007, but I think 'EF-5' sounds stupid, so I vote we just use the new measurements for assigning numbers but still call them 'F-whatever'.}}","alt":"The Fujita Scale was replaced by the Enhanced Fujita Scale in 2007, but I think 'EF-5' sounds stupid, so I vote we just use the new measurements for assigning numbers but still call them 'F-whatever'.","img":"https://imgs.xkcd.com/comics/tornado_hunter.png","title":"Tornado Hunter","day":"23"},{"month":"9","num":641,"link":"","year":"2009","news":"","safe_title":"Free","transcript":"[[A shelf holds 3 boxes of cereal.  Each box shows a bowl of cereal.]]\nGenCo Oat Cereal\nStayPuft Oat Cereal\nRedFarm Oat Cereal ((with additional text in a star)) Asbestos-free!\nNarrator: I hate whatever marketer first realized you could do this.\n\n{{Title text: Asbestos is bad; definitely get the one on the right. Wait -- this one over here has no swine flu!  Now I can't decide.}}","alt":"Asbestos is bad; definitely get the one on the right. Wait -- this one over here has no swine flu!  Now I can't decide.","img":"https://imgs.xkcd.com/comics/free.png","title":"Free","day":"25"},{"month":"9","num":642,"link":"","year":"2009","news":"","safe_title":"Creepy","transcript":"[[Two people are sitting on chairs.]]\nMan: Hey, cute netbook.\nWoman: \nWhat.\n\n\nMan: Your laptop. I just --\nWoman: No, why are you talking to me.\n\nWoman: Who do you think you are? If I were even slightly interested, I'd have shown it.\n\nWoman: Hey everyone, this dude's hitting on me.\nVoice #1: Haha\nVoice #2: Creepy\nVoice #3: Let's get his picture for Facebook to warn others.\n\n((This panel fades into a thought bubble of the actual man.))\n[[The girl is typing on her laptop.]]\nDear blog,\nCute boy on train still ignoring me.\n\n{{Title text: And I even got out my adorable new netbook!}}","alt":"And I even got out my adorable new netbook!","img":"https://imgs.xkcd.com/comics/creepy.png","title":"Creepy","day":"28"},{"month":"9","num":643,"link":"","year":"2009","news":"","safe_title":"Ohm","transcript":"[[A man is holding another by the shoulders.]]\nSitting man: Remember: With great power comes great current squared times resistance.\nNarrator: Ohm never forgot his dying uncle's advice.\n\n{{Title text: More generally, with great power comes great dEnergy\ndt.}}","alt":"More generally, with great power comes great dEnergy/dt.","img":"https://imgs.xkcd.com/comics/ohm.png","title":"Ohm","day":"30"},{"month":"10","num":644,"link":"","year":"2009","news":"","safe_title":"Surgery","transcript":"[[A surgeon is standing over a patient on a gurney.]]\nPatient: While you're doing the surgery, can you also implant this in my arm?\n\nSurgeon: A USB port?\nMan: Just wire it up to some nerves.\n\nSurgeon: ... This won't let your brain control USB devices, you know.\nMan: Sure -- I just want the hardware.\n\nMan: The rest is software; I'm sure there will be a project to patch together support eventually.\nSurgeon: Ah -- you're a Linux user, I see.\nMan: Yeah, how'd you know?\n\n{{Title text: Damn. Not only did he not install it, he sutured a 'Vista-Ready' sticker onto my arm.}}","alt":"Damn. Not only did he not install it, he sutured a 'Vista-Ready' sticker onto my arm.","img":"https://imgs.xkcd.com/comics/surgery.png","title":"Surgery","day":"2"},{"month":"10","num":645,"link":"","year":"2009","news":"Comic today's you confuses <a href=\"https://en.wikipedia.org/wiki/Reverse_Polish_notation\">here</a> click if.","safe_title":"RPS","transcript":"[[A sausage is sitting to the right of an empty bun.]]\nReverse Polish Sausage.\n\n{{Title text: It looks good, but it needs more postfixins.}}","alt":"It looks good, but it needs more postfixins.","img":"https://imgs.xkcd.com/comics/rps.png","title":"RPS","day":"5"},{"month":"10","num":646,"link":"","year":"2009","news":"","safe_title":"Conversations","transcript":"[[A graph plots time vs. 3 lines.]]\n[[Dysentery cases starts high, drops to near zero with time.]]\n[[Laptop sales starts at zero, then raises.]]\n[[Frequency of conversations in which one participant is on the toilet - falls as dysentery cases falls, then rises again with laptop sales.]]\n\n{{Title text: If the dysentery graph looks historically inaccurate it's because I got all my data from Oregon Trail.}}","alt":"If the dysentery graph looks historically inaccurate it's because I got all my data from Oregon Trail.","img":"https://imgs.xkcd.com/comics/conversations.png","title":"Conversations","day":"7"},{"month":"10","num":647,"link":"","year":"2009","news":"","safe_title":"Scary","transcript":"[[Rob and his nephew are sitting on the ground. Rob is holding a flashlight up to his face.]]\nRob: But they NEVER FOUND THE GHOST'S HEAD!\nNephew: Lame story, Uncle Rob.\nRob: And you could do scarier?\nNephew: Sure.\n\nRob: Try me.\nNephew: 9\n11 happened before I was born, yet I'm old enoguh to have this conversation with you.\n\n[[Rob has dropped the flashlight.]]\n\n[[Rob has curled up and wrapped his arms around himself.]]\n\n{{Title text: I'm teaching every 8-year-old relative to say this, and every 14-year-old to do the same thing with Toy Story.  Also, Pokemon hit the US over a decade ago and kids born after Aladdin came out will turn 18 next year.}}","alt":"I'm teaching every 8-year-old relative to say this, and every 14-year-old to do the same thing with Toy Story.  Also, Pokemon hit the US over a decade ago and kids born after Aladdin came out will turn 18 next year.","img":"https://imgs.xkcd.com/comics/scary.png","title":"Scary","day":"9"},{"month":"10","num":648,"link":"","year":"2009","news":"","safe_title":"Fall Foliage","transcript":"[[A man and woman are standing on a cliff overlooking a forest of gorgeous orange foliage. She's holding up a camera, and he has the case.]]\n\nMan: Instead of driving all this way, we could've just taken our summer pictures and messed with the \"hue\" slider in Photoshop.\"\nWoman: Hush.\nCamera: <<click>>\n\n{{Title text: And I could replace you with older pictures of you, from back when you looked happy.}}","alt":"And I could replace you with older pictures of you, from back when you looked happy.","img":"https://imgs.xkcd.com/comics/fall_foliage.png","title":"Fall Foliage","day":"12"},{"month":"10","num":649,"link":"","year":"2009","news":"","safe_title":"Static","transcript":"[[It's dark. There are only the voices of a man and his lover.]]\n\nLover: Hang on, I can't see--did you put on a condom?\nMan: It's okay. I've got a wrist thing on.\n\nLover: A what? Let me see that.\n<<fumble>>\nLover: This is an anti-static strap.\n\nMan: You mean it doesn't ...\nLover: No. Why would you even THINK that?\nMan: I guess I was mixed up.\n\nMan: Wait, so when I was replacing that RAM last week ...\nLover: Yeah, I THOUGHT that was weird.\nMan: Oh, but it explains why the geek squad fired me.\n\n{{Title text: I firmly believe that nothing can go wrong on a project if you're wearing one of those wrist things.}}","alt":"I firmly believe that nothing can go wrong on a project if you're wearing one of those wrist things.","img":"https://imgs.xkcd.com/comics/static.png","title":"Static","day":"14"},{"month":"10","num":650,"link":"","year":"2009","news":"","safe_title":"Nowhere","transcript":"[[A woman is sitting on a couch with a man lying in her lap.]]\nMan: There's nowhere I'd rather be\nMan: than with you\nMan: here\nMan: right now.\n\n[[Silence.]]\n\n[[The woman is imagining herself riding an apatosaurus.]]\n\n{{Title text: I mean, seriously, NOWHERE? For starters, there are like a thousand species of dinosaur.}}","alt":"I mean, seriously, NOWHERE? For starters, there are like a thousand species of dinosaur.","img":"https://imgs.xkcd.com/comics/nowhere.png","title":"Nowhere","day":"16"},{"month":"10","num":651,"link":"","year":"2009","news":"","safe_title":"Bag Check","transcript":"[[A man and woman are at a security checkpoint in an airport. A guard is holding an open backpack and a bottle of water, and the man is arguing with him.]]\nMan: But if you're worried about bombs, why are you letting me keep my laptop batteries? If I overvolted them and breached the cells, it would make a sizeable explosion.\nWoman: Oh god.\nMan: It's okay, dear. In a moment he'll realize I have a good point and return my water.\n\n{{Title text: A laptop battery contains roughly the stored energy of a hand grenade, and if shorted it ... hey!  You can't arrest me if I prove your rules inconsistent!}}","alt":"A laptop battery contains roughly the stored energy of a hand grenade, and if shorted it ... hey!  You can't arrest me if I prove your rules inconsistent!","img":"https://imgs.xkcd.com/comics/bag_check.png","title":"Bag Check","day":"19"},{"month":"10","num":652,"link":"","year":"2009","news":"","safe_title":"More Accurate","transcript":"[[A man with a shotgun approaches a woman.]]\nMan: Sarah! Come with me if you want to live! A robot assassin has been sent here to kill you!\n\n[[The woman holds her hands over her mouth.]]\nMan: I'm here to save you. I may not be as strong or fast as a machine, but I'll fight to keep you --\n\n[[There's a huge orange and yellow explosion.  The two are disintegrated.]]\n<<BOOM>>\n\n[[A flying robot assassin is above the bomb site.]]\n\n{{Title text: We live in a world where there are actual fleets of robot assassins patrolling the skies. At some point there, we left the present and entered the future.}}","alt":"We live in a world where there are actual fleets of robot assassins patrolling the skies. At some point there, we left the present and entered the future.","img":"https://imgs.xkcd.com/comics/more_accurate.png","title":"More Accurate","day":"21"},{"month":"10","num":653,"link":"","year":"2009","news":"","safe_title":"So Bad It's Worse","transcript":"Protip: Even at \"Bad Movie Night,\" avoid the Star Wars holiday special.\n[[A graph plots movie enjoyability against movie quality. It drops steadily through points marked \"Good Movie\" to \"Okay Movie\" to \"Bad Movie,\" rises up again for \"So-Bad-It's-Good (Plan 9, Rocky Horror, etc),\" and then drops off the bottom of a graph with an arrow pointing to where \"Star Wars Holiday Special\" would be. There are three mini-panels below the graph, arranged from \"Good\" to \"Bad\" along the movie quality axis.]]\n[[Three friends are on a couch, drinking and gesticulating enthusiastically.]]\n[[The same three are sitting quietly, with a bottle on the floor.]]\n[[The three are sitting around a table, drinking and looking miserable.]]\n\n{{Title text: You think it's so legendarily bad that you'll torrent it and sit through it just for the kitschy nerd cred. I, too, once thought as you did.}}","alt":"You think it's so legendarily bad that you'll torrent it and sit through it just for the kitschy nerd cred. I, too, once thought as you did.","img":"https://imgs.xkcd.com/comics/so_bad_its_worse.png","title":"So Bad It's Worse","day":"23"},{"month":"10","num":654,"link":"","year":"2009","news":"","safe_title":"Nachos","transcript":"[[A man is on the phone with a woman, who's on her computer in the other half of a split panel.]]\nMan: Hello? ... Oh, hey. Looking for Megan? She's gaming.\nWoman: I know. You know what's delicious? Nachos.\n\n[[The woman clicks on her computer while talking.]]\nWoman: When you layer the cheese so it gets on every chip ... then smother them in sour cream and salsa ...\n\nMan: Mm, that IS delicious. And I've got the ingredients, too!\nWoman, on phone: You should make some!\nMan: I will!\nWoman, on phone: Hurry.\n\n[[The man is making nachos in the microwave.]]\nMicrowave: <<beep>> <<beep>> <<whirrrr>>\n\nMegan, at her computer: My wifi signal!\n\n[[The woman who called is at her computer.]]\nComputer: Boom! Headshot.\n\n{{Title text: 'Cheater!' 'Hey, gaming on wifi? You have only yourself to blame.'}}","alt":"'Cheater!' 'Hey, gaming on wifi? You have only yourself to blame.'","img":"https://imgs.xkcd.com/comics/nachos.png","title":"Nachos","day":"26"},{"month":"10","num":655,"link":"","year":"2009","news":"","safe_title":"Climbing","transcript":"[[A man is apparently ascending a climbing wall.]]\n\n[[We see him again in silhouette, as well as the edge of another person standing at a ninety degree angle to him with her feet on the wall above him.]]\n\n[[The \"climber\" stops and looks up at the woman, who is standing on the \"vertical\" wall, looking at him.]]\n\nWoman: Your facebook rock climbing pictures just got a lot less impressive.\n\n{{Title text: Where did you even get this wall? Return it there and stand it back up right now.}}","alt":"Where did you even get this wall? Return it there and stand it back up right now.","img":"https://imgs.xkcd.com/comics/climbing.png","title":"Climbing","day":"28"},{"month":"10","num":656,"link":"","year":"2009","news":"","safe_title":"October 30th","transcript":"[[A kid dressed up in a lab coat and goggles is standing on a neighbor's doorstep.]]\nKid: Trick or treat!\nNeighbor: Nice Doc Brown costume, but today's October 30th.\nKid: Great Scott, I must have overshot!\n\n{{Title text: Not enough houses on your block?  Just hit them at 30-year intervals from here to 2300 and get 10x the candy.}}","alt":"Not enough houses on your block?  Just hit them at 30-year intervals from here to 2300 and get 10x the candy.","img":"https://imgs.xkcd.com/comics/october_30th.png","title":"October 30th","day":"30"},{"month":"11","num":657,"link":"https://xkcd.com/657/large/","year":"2009","news":"This comic is also available as a poster <a href=\"https://store.xkcd.com/collections/posters/products/movie-narrative-charts-poster\">here</a>!<br />Click on today's comic to view the full-size version!","safe_title":"Movie Narrative Charts","transcript":"These charts show movie character interactions. The horizontal axis is time. The vertical grouping of the lines indicates which characters are together at a given time.\n\n[[Lord of the Rings. A mass of colored lines weaves back and forth across the chart, representing various characters. Sauron is represented by a huge black bar at the bottom with branches for nazgul, orcs, etc. Major locations (Moria) and plot points (the breaking of the fellowship) are marked. Gandalf, especially at the beginning, jumps all over the map in a short time. Eagles appear and then disappear a couple of times. Treebeard's line is flat except for the march to Isengard. At the end, the ship to the West drifts off into a corner.]]\n\n[[Star Wars (original trilogy). This chart is simpler. Luke, mostly accompanied by R2-D2, joins and parts from other sets of characters. There's a dotted alternative path on Jabba's line for the special edition. Yoda appears about halfway through (where Luke's Jedi training is marked). All the surviving lines group up at Endor except for Vader, the Emperor, Luke, and Lando; after the climactic duel, the latter two join the rest.]]\n\n[[Jurassic Park. The human characters are in black; dinosaurs are in red. Dilophosaurus appears briefly to eat Nedry and then fades out again. The three raptors are together at the beginning, but split up about halfway through. One has a dotted portion of line between \"locked up\" and \"escapes.\" In the meantime, they cut off the lines of Arnold and Muldoon. The raptor lines all end when t-rex's swoops down to meet them at the end, and all the surviving humans leave together.]]\n\n[[12 Angry Men. The lines are labeled Juror 1 through Juror 12. They are all perfectly horizontal and parallel.]]\n\n[[Primer. Three lines start on the left labeled Abe, Aaron, and Granger. They enter a mass of scribbling. Somewhere vaguely towards the end, three lines emerge and fade out, all labeled with question marks.]]\n\n{{Title text: In the LotR map, up and down correspond LOOSELY to northwest and southeast respectively.}}","alt":"In the LotR map, up and down correspond LOOSELY to northwest and southeast respectively.","img":"https://imgs.xkcd.com/comics/movie_narrative_charts.png","title":"Movie Narrative Charts","day":"2"},{"month":"11","num":658,"link":"","year":"2009","news":"","safe_title":"Orbitals","transcript":"[[A person is holding up a pointer in front of a diagram of a dorm apartment. On the diagram, there are two connected pairs of dots in each bedroom, and one dot on the couch.]]\nPerson: Thus, one all the dorm bedrooms are occupied by romantic pairs, additional roommates are forced into less restful \"living room couch\" orbitals.\nThe Pauli Sexclusion Principle\n\n{{Title text: Except the people filtering in late are the partiers, so you end up with drunkn makeouts in the living room and the next roommate to return home has to sleep in the hall lounge orbital.}}","alt":"Except the people filtering in late are the partiers, so you end up with drunken makeouts in the living room and the next roommate to return home has to sleep in the hall lounge orbital.","img":"https://imgs.xkcd.com/comics/orbitals.png","title":"Orbitals","day":"4"},{"month":"11","num":659,"link":"","year":"2009","news":"","safe_title":"Lego","transcript":"[[A girl and her father are putting away Lego bricks.]]\nFather: When you take apart a Lego house and mix the pieces into the bin, where does the house go?\nGirl: It's in the bin.\n\nFather: No, those are just pieces. They could become spaceships or trains. The house was an arrangement. The arrangement doesn't stay with the pieces and it doesn't go anywhere else. It's just gone.\n\n[[The girl, older, is standing at a desk. She's holding a couple of Lego bricks.]]\n\n[[The girl looks at the bricks.]]\n\n[[She checks off a box next to the words \"Organ Donor\" on something on the desk.]]\n\n{{Title text: Dad, where is Grandpa right now?}}","alt":"Dad, where is Grandpa right now?","img":"https://imgs.xkcd.com/comics/lego.png","title":"Lego","day":"6"},{"month":"11","num":660,"link":"","year":"2009","news":"","safe_title":"Sympathy","transcript":"[[A bereaved person and his friend are talking.]]\nBereaved: The moment my brother died, I felt a searing pain in my heart.\n\nRight:\nFriend: I'm so sorry.\n\nWrong:\nFriend: Was it instant, or was there a speed-of-light delay?\n\nVery Wrong:\nFriend: If it was instant, with the right arrangement of moving reference frames, we could use this to send signals back in time and violate causality! How many remaining siblings do you have?\n\n{{Title text: Excellent recovery: ... which we could try to use to somehow save your original brother!}}","alt":"Excellent recovery: ... which we could try to use to somehow save your original brother!","img":"https://imgs.xkcd.com/comics/sympathy.png","title":"Sympathy","day":"9"},{"month":"11","num":661,"link":"","year":"2009","news":"","safe_title":"Two-Party System","transcript":"[[A girl stands at a podium, giving a speech.]]\nGirl: And if I'm elected, I'll try to fix some of these problems.\nBoy, off-panel: Yeah, right!\n\n[[A boy in the audience is standing on his chair.]]\nBoy: The REAL problem is the corporate-run two party system. Until we fix THAT, we'll have no real change!\n\nGirl: Billy, I'm running for class president. We don't even have political parties.\n\nBoy: That's because the two-praty, uh ... estab ... uh.\n\nGirl: Billy, did you learn about politics from the internet?\nBoy: I thought that one reply was all I ever needed!\n\n{{Title text: I favor approval voting or IRV chiefly because they mean we might get to bring back The Bull Moose party.}}","alt":"I favor approval voting or IRV chiefly because they mean we might get to bring back The Bull Moose party.","img":"https://imgs.xkcd.com/comics/two_party_system.png","title":"Two-Party System","day":"11"},{"month":"11","num":662,"link":"","year":"2009","news":"","safe_title":"iPhone or Droid","transcript":"[[A woman sitting at her computer is talking to a man standing behind her.]]\nWoman: Well, it depends what you want. The iPhone wins on speed and polish, but the Droid has that gorgeous screen and physical keyboard.\n\nMan: What if I want something more than the pale facsimile of fulfillment brought by a parade of ever-fancier toys? To spend my life restlessly producing instead of sedately consuming?\nMan: Is there an app for THAT?\n\nWoman: Yeah, on both.\nWoman: Wait, no, looks lke it was rejected from the iPhone store.\nMan: Droid it is, then.\n\n{{Title text: It may be a fundamentally empty experience, but holy crap the Droid's 265 ppi screen is amazing.}}","alt":"It may be a fundamentally empty experience, but holy crap the Droid's 265 ppi screen is amazing.","img":"https://imgs.xkcd.com/comics/iphone_or_droid.png","title":"iPhone or Droid","day":"13"},{"month":"11","num":663,"link":"","year":"2009","news":"","safe_title":"Sagan-Man","transcript":"Bitten by a radioactive Carl Sagan in 1995, Sagan-Man possesses the powers and abilities of Carl Sagan.\n\nVictim, off-panel: Help! Thief!\n\n[[Sagan-Man spins around. A blue cape appears on his back.]]\n\n[[Sagan-Man runs towards the direction of the shout.]]\n\n[[He encounters the thief, holding a purse.]]\nSagan-Man: Hey, you!\nThief: What?\n\nSagan-Man: Do you realize just how crazy it is that we've BEEN TO THE MOON?\n\n{{Title text: They laugh now, but within 10 years the city's entire criminal class will have quit to work on space research.}}","alt":"They laugh now, but within 10 years the city's entire criminal class will have quit to work on space research.","img":"https://imgs.xkcd.com/comics/sagan-man.png","title":"Sagan-Man","day":"16"},{"month":"11","num":664,"link":"","year":"2009","news":"","safe_title":"Academia vs. Business","transcript":"[[A programmer sits at a desk in front of a computer. There are cans on the desk and more crushed ones on the floor.]]\nProgrammer: I just wrote the most beautiful code of my life.\n\nProgrammer: They casually handed me an impossible problem. In 48 hours and 200 lines, I SOLVED it.\n\n((Lines divide the comic into two possible end panels here, labeled \"Academia\" and \"Business.\"))\n\n[[Academia]]\nProfessor: My god ... this will mean a half-dozen papers, a thesis or two, and a paragraph in every textbook on queueing theory!\n\n[[Business]]\nBoss: You got the program to stop jamming up? Great. While you're fixing stuff, can you get Outlook to sync with our new phones?\n\n{{Title text: Some engineer out there has solved P=NP and it's locked up in an electric eggbeater calibration routine.  For every 0x5f375a86 we learn about, there are thousands we never see.}}","alt":"Some engineer out there has solved P=NP and it's locked up in an electric eggbeater calibration routine.  For every 0x5f375a86 we learn about, there are thousands we never see.","img":"https://imgs.xkcd.com/comics/academia_vs_business.png","title":"Academia vs. Business","day":"18"},{"month":"11","num":665,"link":"","year":"2009","news":"","safe_title":"Prudence","transcript":"[[A girl is running towards a closed wardrobe.]]\nSomeone off-panel: Everyone hide! 99 ... 98 ... 97 ...\n\n[[The girl opens the wardrobe.]]\nWardrobe: <<click>>\n\nGirl, looking inside: !!!\n\n[[The girl looks thoughtful.]]\n\n[[The girl walks away.]]\n\n[[The girl returns with an armful of electronics.]]\n\n[[The girl is kneeling, typing on a laptop, which has a cord extending into the wardrobe.]]\n\n[[A robotic probe is approaching Mr. Tumnus, the faun, under the lamppost in narnia.]]\n\n{{Title text: Moments later, the White Witch rolls up and, confused, tries to tempt the probe with a firmware upgrade.}}","alt":"Moments later, the White Witch rolls up and, confused, tries to tempt the probe with a firmware upgrade.","img":"https://imgs.xkcd.com/comics/prudence.png","title":"Prudence","day":"20"},{"month":"11","num":666,"link":"","year":"2009","news":"","safe_title":"Silent Hammer","transcript":"[[Hat guy is hammering something on a table.]]\nGuy: What--\nHat Guy: Silent hammer. I've made a set of silent tools.\nGuy: Why?\nHammer: <<whoosh whoosh whoosh>>\n\nHat Guy: Stealth carpentry. Breaking into a house at night and moving windows, adjusting walls, etc.\n[[He takes his silent hammer over to a tool bench with other things on it. Two boxes underneath are labeled \"Drills\" and \"Non-Drills.\"]]\n\nHat Guy, narrating: After a week or so of questioning his own sanity, the owner will stay up to watch the house at night. I'll make scratching noises in the walls, pipe in knockout gas, move him up to his bed, and never bother him again.\n[[The events he's describing are shown in two mini-panels below.]]\n\nGuy, off-panel: Nice prank, I guess, but what's the point?\nHat Guy: Check out the owner's card, on the table.\nGuy, off-panel: Chair of the American Skeptics Society? Oh, god.\nHat guy: Yeah, this doesn't end well for him.\n\n{{Title text: I bet he'll keep quiet for a couple weeks and then-- wait, did you nail a piece of scrap wood to my antique table a moment ago?}}","alt":"I bet he'll keep quiet for a couple weeks and then-- wait, did you nail a piece of scrap wood to my antique table a moment ago?","img":"https://imgs.xkcd.com/comics/silent_hammer.png","title":"Silent Hammer","day":"23"},{"month":"11","num":667,"link":"","year":"2009","news":"","safe_title":"SkiFree","transcript":"[[We see a screenshot of SkiFree, with the abominable snowman running towards the player]]\n\n[[A girl is sitting at her computer.]]\nGirl: (thinking) I've always thought of the SkiFree monster as a metaphor for the inevitability of death.\n\n[[Her friend comes up behind her.]]\nFriend: SkiFree, huh? You know, you can press \"F\" to go faster than the monster and escape.\n\n[[The screenshot again. The player is zooming away from the monster.]]\n\n[[The girl sits at her computer in silence.]]\n\n{{Title text: And from that day on, I wore this little 'F' key pendant everywhere I went.}}","alt":"And from that day on, I wore this little 'F' key pendant everywhere I went.","img":"https://imgs.xkcd.com/comics/skifree.png","title":"SkiFree","day":"25"},{"month":"11","num":668,"link":"","year":"2009","news":"","safe_title":"Pandora","transcript":"[[There is a venn diagram of two circles. The left circle is labeled \"Music You Like.\" The right circle is labeled \"Deeply Embarrassing Music.\" The segment on the left is labeled \"What Pandora Plays,\" and the intersection is labeled \"What Pandora Plays If Anyone Is Around.\"]]\n\n{{Title text: What?  Oh, no, the 'Enchanted' soundtrack was just playing because Pandora's algorithms are terrible.  [silence] ... (quietly) That's how you knooooooow ...}}","alt":"What?  Oh, no, the 'Enchanted' soundtrack was just playing because Pandora's algorithms are terrible.  [silence] ... (quietly) That's how you knooooooow ...","img":"https://imgs.xkcd.com/comics/pandora.png","title":"Pandora","day":"27"},{"month":"11","num":669,"link":"","year":"2009","news":"","safe_title":"Experiment","transcript":"[[Darkness.]]\n\n[[Someone is standing next to a laptop, looking groggy.]]\nPerson: Ugh ...\nPerson: What happened?\n\nPerson: Where am I?\n<<FWOOOOOOSH>>\nPerson: Help! Someone help me--\n[[His speech fades out into nothing.]]\n\n[[He holds his hands to his mouth.]]\n\n[[He looks shocked.]]\n\n[[He tries to run, but has no traction against the ground.]]\n\n[[He falls over.]]\n\n[[He lies prone.]]\n\n[[Hat guy and hat girl are watching this scene from outside the room. He is holding a clipboard.]]\nHat Guy: Huh. Looks like physics professors don't like working in frictionless vacuums after all.\nHat Girl: They're such liars.\n\n{{Title text: The other two are still lost on the infinite plane of uniform density.}}","alt":"The other two are still lost on the infinite plane of uniform density.","img":"https://imgs.xkcd.com/comics/experiment.png","title":"Experiment","day":"30"},{"month":"12","num":670,"link":"","year":"2009","news":"","safe_title":"Spinal Tap Amps","transcript":"[[Nigel Tufnel of Spinal Tap is showing off his amplifier to a person, who varies.]]\nNigel: These amps go to 11.\nPerson: Is that louder?\nNigel: It's one louder.\n\nNormal Person:\nNormal Person: Why not make 10 louder and make 10 the highest?\n\nEngineer:\nEngineer: But 11 doesn't have any units. It's an arbitrary scale mapping otuputs--\nNigel: Zzzz\n\nSmart Engineer:\nSmart Engineer: For $2,000 I'll build you one that goes to 12.\n\n{{Title text: Wow, that's less than $200 per ... uh ... that's a good deal!}}","alt":"Wow, that's less than $200 per ... uh ... that's a good deal!","img":"https://imgs.xkcd.com/comics/spinal_tap_amps.png","title":"Spinal Tap Amps","day":"2"},{"month":"12","num":671,"link":"","year":"2009","news":"","safe_title":"Stephen and Me","transcript":"[[Beret Guy is speaking into a mic in front of a sign that says Volvo Cars. A woman is filming him, and another is walking by with a briefcase.]]\nBeret Guy: I'm documenting my quest to meet with the CEO of Volvo.\nBusinesswoman: Get lost.\n\n[[Security guards are attempting to restrain Beret Guy and the camerawoman.]]\nBeret Guy: Wait! I've come so far! Just let me see him!\n\n[[They've reached the CEO's desk, which has the Volvo logo on it.]]\nCEO: All right, you've reached me. What is it you want to talk about?\n\nBeret Guy: Do you realize how much your company's name sounds like \"vulva\"?\nCEO: Security?\n\n{{Title text: Hey, let go! We were all thinking it! Someone had to speak truth to power!}}","alt":"Hey, let go! We were all thinking it! Someone had to speak truth to power!","img":"https://imgs.xkcd.com/comics/stephen_and_me.png","title":"Stephen and Me","day":"4"},{"month":"12","num":672,"link":"","year":"2009","news":"","safe_title":"Suggestions","transcript":"[[A man is sitting at his computer. Facebook sidebar messages appear on the top of each panel, with a user photo and a few lines of text.]]\nFacebook: Susie \n Reconnect with her \n (phone icon) Send her a text\nMan: Come on, Facebook. I know I shouldn't.\n\nFacebook: Susie \n She'd come over \n (bed icon) You don't have to fall asleep alone.\nMan: It's been so hard to stop. But she's falling for me, and I can't keep getting her hopes up like this.\n\nFacebook: Susie \n Life is complicated \n (icon of stick figures embracing) She's so warm against you. You both want it.\nMan: (pulling out phone) Maybe if I just make it clear it's not going to be a thing ...\nMan: Yeah, we'll just have a talk.\n\nFacebook: Susie \n Oh yeah. Mmm ... \n (webcam icon) Leave your webcam on so I can watch.\nMan: Okay, this feature is getting creepier and creepier.\n\n{{Title text: An hour later: SUGGESTION: LICK HER NIPPLE MORE.}}","alt":"An hour later: SUGGESTION: LICK HER NIPPLE MORE.","img":"https://imgs.xkcd.com/comics/suggestions.png","title":"Suggestions","day":"7"},{"month":"12","num":673,"link":"","year":"2009","news":"","safe_title":"The Sun","transcript":"Coming this March from the makers of The Core ...\n[[A woman is looking through a telescope in an observatory. Two men are nearby.]]\nWoman: The sun's fusion is failing!\nMan 1: (small) Does that make sense?\nMan 2: (small) Whatever.\n\nWoman: If we don't send a ship to restart it, it could go out completely!\nMan 1: Call NASA!\nMan 2: (on the phone) Assemble our hottest astronauts.\n\n[[Four astronauts stand at the other end of the phone. The one holding the handset has the helmet of a space suit under his arm.]]\nAstronaut: The earth bathed in eternal darkness? A night without a dawn? Not on my watch!\nAstronaut: Saddle up.\n\n[[The four astronauts are shown in silhouette on gray, casting huge shadows towards the bottom of the panel from the sun in the center.]]\nIt's DAYLIGHT SAVING TIME.\n(caption) Never fall back.\n\n{{Title text: Obligatory bad guy: This operation is sheer foolishness, and it's not happening on my watch!  Mainly because I can't figure out how to adjust the time.}}","alt":"Obligatory bad guy: This operation is sheer foolishness, and it's not happening on my watch!  Mainly because I can't figure out how to adjust the time.","img":"https://imgs.xkcd.com/comics/the_sun.png","title":"The Sun","day":"9"},{"month":"12","num":674,"link":"","year":"2009","news":"","safe_title":"Natural Parenting","transcript":"[[A man and woman are standing with a baby in between them.]]\nMan: Oh man, we made a baby.\nWoman: Don't panic. Don't panic.\nBaby: Baby!\n\nMan: Parenting can't be that hard. Let's just do what comes naturally.\n\n[[Beat frame.]]\n\nSoon:\n[[There are now two babies in between them.]]\nWoman: Aw, crap.\n\n{{Title text: On one hand, every single one of my ancestors going back billions of years has managed to figured it out.  On the other hand, that's the mother of all sampling biases.}}","alt":"On one hand, every single one of my ancestors going back billions of years has managed to figure it out.  On the other hand, that's the mother of all sampling biases.","img":"https://imgs.xkcd.com/comics/natural_parenting.png","title":"Natural Parenting","day":"11"},{"month":"12","num":675,"link":"","year":"2009","news":"","safe_title":"Revolutionary","transcript":"Person: Yes, science is an open process in which a good idea can come from anybody.\n\nPerson: Yes, widely-believed theories are \non occasion\n overturned by simple thought experiments.\n\nPerson: And yes, your philosophy degree equips you to ask interesting questions sometimes.\n\n[[The person is talking to a philosopher with a goatee, who is sitting at a computer.]]\nPerson: But you did not just overturn special relativity, a subject you learned about an hour ago, with your \"racecar on a train\" idea.\nPhilosopher: You just don't like that I'm turning a rational eye to your dogma. Hey, what's the email for the president of physics?\n\n{{Title text: I mean, what's more likely -- that I have uncovered fundamental flaws in this field that no one in it has ever thought about, or that I need to read a little more?  Hint: it's the one that involves less work.}}","alt":"I mean, what's more likely -- that I have uncovered fundamental flaws in this field that no one in it has ever thought about, or that I need to read a little more?  Hint: it's the one that involves less work.","img":"https://imgs.xkcd.com/comics/revolutionary.png","title":"Revolutionary","day":"14"},{"month":"12","num":676,"link":"","year":"2009","news":"","safe_title":"Abstraction","transcript":"[[A person is sitting at a computer.]]\nAn x64 processor is screaming along at billions of cycles per second to run the XNU kernel, which is frantically working through all the POSIX-specified abstraction to create the Darwin system underlying OS X, which in  turn is straining itself to run Firefox and its Gecko renderer, which creates a Flash object which renders dozens of video frames every second\nbecause I wanted to see a cat jump into a box and fall over.\nI am a god.\n\n{{Title text: If I'm such a god, why isn't Maru *my* cat?}}","alt":"If I'm such a god, why isn't Maru *my* cat?","img":"https://imgs.xkcd.com/comics/abstraction.png","title":"Abstraction","day":"16"},{"month":"12","num":677,"link":"","year":"2009","news":"","safe_title":"Asshole","transcript":"[[A couple watches Beret Guy drive by in an SUV.]]\nMan: Look at that asshole in his SUV, thinking he's so badass while he guzzles gas driving around suburbia.\nBeret Guy: Oh no! Am I an asshole? I hope not.\n\n[[Beret Guy trades in his keys at the dealership.]]\n\n[[Now he is driving by in a hybrid sedan.]]\nMan: Look at that smug asshole thinking he's better than us because he drives a hybrid.\nBeret Guy: ...\n\n[[He trades in his keys again.]]\n\n[[The couple is standing.]]\nOff-panel: <<RUMBLE>>\n\n[[Beret Guy drives a backhoe in and smacks the couple out of the panel with the digger.]]\n\n[[He drives off, whistling.]]\n\n{{Title text: [Shortly thereafter, at a nearby bakery] ::CRASH:: ::RUMBLE:: ::VRRRRRR:: '... I don't know, officer.  It just scooped up an entire rack of scones and drove away!'}}","alt":"[Shortly thereafter, at a nearby bakery] ::CRASH:: ::RUMBLE:: ::VRRRRRR:: '... I don't know, officer.  It just scooped up an entire rack of scones and drove away!'","img":"https://imgs.xkcd.com/comics/asshole.png","title":"Asshole","day":"18"},{"month":"12","num":678,"link":"","year":"2009","news":"","safe_title":"Researcher Translation","transcript":"((A table showing two columns. The left column is labeled \"If a researcher says a cool new technology should be available to consumers in...\", and the right column is labeled \"What they mean is...\"))\n[[The fourth quarter of next year - The project will be canceled in six months.]]\n[[Five years - I've solved the interesting research problems. The rest is just business, which is easy, right?]]\n[[Ten years - We haven't finished inventing it yet, but when we do, it'll be awesome.]]\n[[25+ years - It has not been conclusively proven impossible.]]\n[[We're not really looking at market applications right now. - I like being the only one with a hovercar.]]\n{{Title text: A technology that is '20 years away' will be 20 years away indefinitely.}}","alt":"A technology that is '20 years away' will be 20 years away indefinitely.","img":"https://imgs.xkcd.com/comics/researcher_translation.png","title":"Researcher Translation","day":"21"},{"month":"12","num":679,"link":"","year":"2009","news":"","safe_title":"Christmas Plans","transcript":"[[Character A is standing behind Character B, who is sitting at a computer.]]\nCharacter A: Hey, will you be in town the day after Christmas?\nCharacter B: Couldn't say - I'm Jewish.\nCharacter A: But.. how does being Jewish keep you from knowing your plans?\nCharacter B: I know my plans - I just don't know when Christmas is.\nCharacter A: Really? Why not look it up?\nCharacter B:  Well, I'm also a physicist.\nCharacter A: So?\nCharacter B: I believe that since I don't observe Christmas, it can't have a definite date.\n{{Title text: Physicists who want to protect traditional Christmas realize that the only way to keep from changing Christmas is not to observe it.}}","alt":"Physicists who want to protect traditional Christmas realize that the only way to keep from changing Christmas is not to observe it.","img":"https://imgs.xkcd.com/comics/christmas_plans.png","title":"Christmas Plans","day":"23"},{"month":"12","num":680,"link":"","year":"2009","news":"","safe_title":"December 25th","transcript":"[[On one side, a family of four gathered around a Christmas tree, the daughter and son looking excitedly at the presents under the tree; on the other, a character wearing a party hat, sitting dejectedly before a birthday cake. The panel edges are decorated with holly and a wreath.]]\nHappy Birthday to those of you born on the 25th!\nSorry you get kinda shafted by the overlap with Christmas.\n{{Title text: If you're turning 27 and were born in the Northeast, maybe you were conceived in the blizzard of 1982. Imagine: snowed in, candles, massage oil, your mom sporting nothing but her early 80's haircut and a smile ... aren't you glad you read the title-text?}}","alt":"If you're turning 27 and were born in the Northeast, maybe you were conceived in the April blizzard of 1982. Imagine: snowed in, candles, massage oil, your mom sporting nothing but her early 80's haircut and a smile ... aren't you glad you read the title-text?","img":"https://imgs.xkcd.com/comics/december_25th.png","title":"December 25th","day":"25"},{"month":"12","num":681,"link":"https://xkcd.com/681_large/","year":"2009","news":"Click on the comic to view the full-size version.","safe_title":"Gravity Wells","transcript":"((A schematic of the depths of the gravity wells of each planet in the solar system and several moons. At extreme left, an arrow pointing down and to the left, labeled \"To Sun, very very far down\". From left to right the gravity wells depicted are: Mercury; Venus; Earth, 5,478 km; Moon, 288 km; Mars, 1,286 km; Ganymede; Io; Jupiter; Europa; Titan, with two small bumps captioned \"WEEOOOEEOOOEEEOOO\"; Saturn, with its rings depicted as various-colored horizontal bands; Uranus; and Neptune, with a figure exclaiming, \"An even more glorious dawn awaits!\"\n\nInset below Earth, the Moon, and Mars are three panels depicting Mars', Deimos's, and Phobos's gravity wells. The Mars inset shows Mars' gravity well, 1,286 km deep, in relation to its moons, Deimos and Phobos, and a NASA Mars Exploration Rover. The Deimos inset shows Deimos' gravity well and a person, labeled \"to scale\"; the gravity well is approximately two thirds the height of the person, and the caption reads, \"You could escape Deimos with a bike and a ramp.\" The Phobos inset is similar, except that the gravity well is approximately three times the height of the person included for scale, and reads, \"A thrown baseball could escape Phobos.\"\n\nTo the right of Jupiter's gravity well is a diagram of a well. The height of the well is labeled \"very deep\"; at the bottom is a figure labeled \"your mom\"; and three figures, labeled \"local football team\", are shown falling in head first. Beneath that, the text reads, \"Jupiter is not much larger than Saturn, but much more massive. At its size, adding more mass just makes it denser due to the extra squeezing of gravity. If you dropped a few dozen more Jupiters into it, the pressure would ignite fusion and make it a star.\"\n\nAt the right of the panel is an inset diagram detailing Earth's gravity well, which is labeled as being 6,379 km deep. Also depicted are the altitudes of low Earth orbit, the ISS, the Space Shuttle, GPS satellites, geosynchronous orbit, and the Moon's gravity well, 288 km deep. A figure standing on the Earth's \"surface\" says, \"This is why it took a huge rocket to get to the moon, but only a small one to get back.\" Beneath that, the text, \"It takes the same amount of energy to launch something on an escape trajectory away from Earth as it would to launch it 6,000 km upward under constant 9.81 m\ns Earth gravity. Hence, Earth's well is 6,000 km deep.\"\n))\nGravity wells, scaled to Earth surface gravity\n\nThis chart shows the 'depth' of various solar system gravity wells.\n\nEach well is scaled such that rising out of a physical well of that depth -- in constant Earth surface gravity -- would take the same energy as escaping from that planet's gravity in reality.\n\nEach planet is shown cut in half at the bottom of its well, with the depth of the well measured down to the planet's _flat_ surface.\n\nThe planet sizes are to the same scale as the wells. Interplanetary distances are not to scale.\n\nDepth = (G x PlanetMass) \n (g x PlanetRadius)\n\nG = Newton's constant\ng = 9.81 meters per second squared\n{{Title text: This doesn't take into account the energy imparted by orbital motion (or gravity assists or the Oberth effect), all of which can make it easier to reach outer planets.}}","alt":"This doesn't take into account the energy imparted by orbital motion (or gravity assists or the Oberth effect), all of which can make it easier to reach outer planets.","img":"https://imgs.xkcd.com/comics/gravity_wells.png","title":"Gravity Wells","day":"28"},{"month":"12","num":682,"link":"","year":"2009","news":"","safe_title":"Force","transcript":"[[Two EMTs are rushing Darth Vader away from a front door on a stretcher.]]\n\n[[There is a room with a desk in the foreground and a full-length mirror in the corner. On the desk is a laptop displaying the Wikipedia page for autoerotic asphyxiation.]]\n\n{{Title text: Force-choking the chicken.}}","alt":"Force-choking the chicken.","img":"https://imgs.xkcd.com/comics/force.png","title":"Force","day":"30"},{"month":"1","num":683,"link":"","year":"2010","news":"","safe_title":"Science Montage","transcript":"Movie Science Montage\n\n[[One scientist passes a test tube to another, who's sitting at a machine. They're both wearing lab coats and goggles. Lights and screens are shining, and there's a hamster ball and a Newton's cradle on a shelf behind them.]]\n\n[[There's a glowing sample next to a rat in a cage. One of the scientists is holding a glowing implement; she has another rat in her hand and one on her head. The other scientist is on the phone.]]\nCaged Rat: Squeak!\n\n[[One of the scientists pulls levers on another machine, which is shooting some kind of ray downwards a a sample.]]\n\n[[The other scientist is operating a machine with a scope, flasks, coils, and bubbles.]]\nScientist (in panel): Paint flecks from the killer's clothing match an antimatter factory in Belgrade!\nScientist (off panel): Let's go!\n\nActual Science Montage\n\n[[Two scientists in lab coats and goggles place a sample into a machine. There's a clock on the wall.]]\n\n[[Time has passed.]]\nMachine: <<...whirrrrrr...>>\n\n[[Time has passed. One of the scientists has removed his goggles.]]\nMachine: <<...whirrrr...bing!>>\n\n[[They examine the sample.]]\nMale Scientist: Okay, we've determined there's neither barium nor radium in this sample.\nFemale Scientist: Probably.\n\n{{Title text: The rat's perturbed; it must sense nanobots! Code grey!  We have a Helvetica scenario!}}","alt":"The rat's perturbed; it must sense nanobots! Code grey!  We have a Helvetica scenario!","img":"https://imgs.xkcd.com/comics/science_montage.png","title":"Science Montage","day":"1"},{"month":"1","num":684,"link":"","year":"2010","news":"","safe_title":"We Get It","transcript":"[[Two people are talking.]]\nPerson 1: Avatar? Yeah, I saw it last week with ...\n\n[[Person 1 walks out of the panel.]]\n\n[[Person 1 returns with a ladder.]]\n\n[[Person 1 stands on top of the ladder, shouting through a megaphone.]]\nPerson 1: ... MY GIRLFRIEND.\n\nPerson 2: You know, if this phase of your relationship lasts more than a week, I'm legally allowed to stab you both.\nPerson 1: What phase?\nPerson 1: So, did I mention I'm seeing someone?\n\n{{Title text: The most brutal way I've ever seen someone handle this was 'Oh, you have a girlfriend. Are you going to get married?'  'I, uh, don't know--' 'Well, do you love her?' '...' 'Anyway, what were you saying about the movie?'}}","alt":"The most brutal way I've ever seen someone handle this was 'Oh, you have a girlfriend. Are you going to get married?'  'I, uh, don't know--' 'Well, do you love her?' '...' 'Anyway, what were you saying about the movie?'","img":"https://imgs.xkcd.com/comics/we_get_it.png","title":"We Get It","day":"4"},{"month":"1","num":685,"link":"","year":"2010","news":"","safe_title":"G-Spot","transcript":"A study published in the journal of sexual medicine suggests that the g-spot may not actually exist.\nWe go live to the researchers' press conference:\n\n[[Reporters stand below a researcher at a podium.]]\nReporter: Is it true you've been unable to find evidence that the g-spot exists?\n\nResearcher: My research is in solar cells. I think you have the wrong press conference.\n\n[[Pause]]\n\nResearcher: But ... yes.\n\n{{Title text: The BBC lead was 'The elusive erogenous zone said to exist in some women may be a myth, say researchers who have hunted for it.'  I couldn't read it with a straight face.}}","alt":"The BBC lead was 'The elusive erogenous zone said to exist in some women may be a myth, say researchers who have hunted for it.'  I couldn't read it with a straight face.","img":"https://imgs.xkcd.com/comics/g-spot.png","title":"G-Spot","day":"6"},{"month":"1","num":686,"link":"","year":"2010","news":"","safe_title":"Admin Mourning","transcript":"[[The text is over a white-on-black terminal showing a bit of output from ps -el, with processes running from root and sam.]]\nWhen a user dies, their connections time out,\nbut their screen sessions linger.\n\n[[The end of the command line is a |grep sam.]]\nThe server's uptime grows\nbecause you can't bring yourself to reboot\n\nand wipe out\ntheir last earthly presence\n\n[[The processes listed are screen, zsh, irssi, and grep sam.]]\nthe ghost in zshell.\n\n{{Title text: And every day it gets harder to fight the urge to su to the user and freak people out.}}","alt":"And every day it gets harder to fight the urge to su to the user and freak people out.","img":"https://imgs.xkcd.com/comics/admin_mourning.png","title":"Admin Mourning","day":"8"},{"month":"1","num":687,"link":"","year":"2010","news":"","safe_title":"Dimensional Analysis","transcript":"[[On a blackboard.]]\n(Plank energy\nPressure at the Earth's core) x (Prius combined EPA gas mileage\nMinimum width of the English Channel) = pi\n\n[[A teacher indicates this equation with a pointer in front of a class.]]\nTeacher: It's correct to within experimental error, and the units check out. It must be a fundamental law.\nStudent: But what if they build a better Prius?\nTeacher (italic): Then England will drift out to sea.\n\n{{Title text: Or the pressure at the Earth's core will rise slightly.}}","alt":"Or the pressure at the Earth's core will rise slightly.","img":"https://imgs.xkcd.com/comics/dimensional_analysis.png","title":"Dimensional Analysis","day":"11"},{"month":"1","num":688,"link":"","year":"2010","news":"","safe_title":"Self-Description","transcript":"[[There is a pie chart, mostly white with a black slice. The white is labeled \"Fraction of this image which is white.\" The black is labeled \"Fraction of this image which is black.\"]]\n\n[[There is a bar graph labeled \"Amount of black ink by panel.\" Bar 1 is medium height, Bar 2 higher, Bar 3 lowest.]]\n\n[[There is a scatterplot labeled \"Location of black ink in this image.\" It is the positive quarter of a coordinate grid with the zeroes marked. The graph is, of course, the whole comic scaled to fit the axes, including a smaller version of itself in the last panel, etc.]]\n\n{{Title text: The contents of any one panel are dependent on the contents of every panel including itself. The graph of panel dependencies is complete and bidirectional, and each node has a loop. The mouseover text has two hundred and forty-two characters.}}","alt":"The contents of any one panel are dependent on the contents of every panel including itself. The graph of panel dependencies is complete and bidirectional, and each node has a loop. The mouseover text has two hundred and forty-two characters.","img":"https://imgs.xkcd.com/comics/self_description.png","title":"Self-Description","day":"13"},{"month":"1","num":689,"link":"","year":"2010","news":"","safe_title":"FIRST Design","transcript":"Team Member 1 (out of panel): Wow, this is a much better design.\nTeam Member 2 (out of panel): Let's build it.\n[[A blue print depicting a robot design for the FIRST competition. It consists of a standard mobile platform, with a pusher blade at the front. Additional parts include an umbrella on top and a trailer unit consisting a telescoping pole with a matchbox and match on top.]]\n\nReferee (out of panel): Go!\n<<CLICK>>\n[[A FIRST competition field, with teams at opposite ends. Various robots appear on the field, and the team whose design appears above activates their robot.]]\n\n[[The robot's trailer unit detaches as the telescoping pole begins to extend, and the mobile platform with umbrella rolls forward.]]\n<<VRRR>>\n<<CLICK>>\n\n[[Telescoping pole extends further.]]\n<<VRRRR>>\n\n[[Telescoping pole extends further.]]\n<<VRRRR>>\n\n[[Telescoping pole extends further, approaching a sprinkler head fixture.]]\n<<VRRR>>\n\n[[Telescoping pole stops extending, placing the matchbox and match very near the sprinkler head fixture.]]\n\n[[The mobile platform stops moving.]]\n\n[[The umbrella deploys, extending beyond the dimensions of the mobile platform.]]\n<<FWOOMP>>\n\n[[The match box and match are lit beneath the sprinkler head.]]\n<<FWOOSH>>\n\n[[The heat from the match triggers the sprinkler's valve, and water sprays out of the sprinkler into the room below.]]\n<<PSSSSHH>>\n\n[[Water pours from the sprinkler onto the competition field, causing the electrical components of the opposing team's robotics platform to short and malfunction. The opposing team appears distressed and confused.]]\n<<FZZZT>>\n<<BWooooooo!!!>>\n\n[[The initial robot, still protected by its umbrella, pushes along the balls toward the goal zone without any difficulty.]]\n\n{{Title text: Pool on the roof must've sprung a leak.}}","alt":"Pool on the roof must've sprung a leak.","img":"https://imgs.xkcd.com/comics/first_design.png","title":"FIRST Design","day":"15"},{"month":"1","num":690,"link":"","year":"2010","news":"","safe_title":"Semicontrolled Demolition","transcript":"[[A person is holding up a pointer to a screen with an image of the World Trade Center towers mid-disaster.]]\nPerson: Based on my analysis, I believe the government faked the plane crash and demolished the WTC north tower with explosives.\nPerson: The south tower, in a simultaneous but unrelated plot, was brought down by actual terrorists.\nThe 9\n11 truthers responded poorly to my compromise theory.\n\n{{Title text: I believe the truth always lies halfway between the most extreme claims.}}","alt":"I believe the truth always lies halfway between the most extreme claims.","img":"https://imgs.xkcd.com/comics/semicontrolled_demolition.png","title":"Semicontrolled Demolition","day":"18"},{"month":"1","num":691,"link":"","year":"2010","news":"","safe_title":"MicroSD","transcript":"[[Two figures approach a table]]\nFigure 1: Hey, what's up?\nFigure 2: Shhhhh.\nFigure 1: Hrm?\nFigure 2: There's a microSD card on your table.\n\n[[A microSD card sits next to an assortment of coins for size reference.]]\nFigure 1 (out of panel): So?\nFigure 2 (out of panel): I dunno, high storage densities freak me out. A whole aisle of library shelves on something smaller than a dime.\n\n[[The two figures stand near the table, the second figure peering at the coins and card on the table.]]\nFigure 2: Libraries are unnerving enough--millions of ideas surrounding you, towering over you. These cards fill me with that same reverence, that same intimidation.\n\n[[The first figure stands alone]]\nFigure 2 (out of panel): ...that same faint arousal. Maybe I'll just touch it.\nFigure 1: If you lose that card I'm _NOT_ helping you find it.\n\n{{Title text: That card holds a refrigerator carton's worth of floppy discs, and a soda can full of those cards could hold the entire iTunes store's music library. Mmmm.}}","alt":"That card holds a refrigerator carton's worth of floppy discs, and a soda can full of those cards could hold the entire iTunes store's music library. Mmmm.","img":"https://imgs.xkcd.com/comics/microsd.png","title":"MicroSD","day":"20"},{"month":"1","num":692,"link":"","year":"2010","news":"","safe_title":"Dirty Harry","transcript":"[[Detective \"Dirty\" Harry Callahan stands near a wall, pointing a revolver at another figure, presumably a suspect, reclined on the ground. A shotgun is on the ground next to the reclined figure.]]\nHarry Callahan: I know what you're thinking--\"Did he fire six shots or only five?\" In all this excitement, I--\nSuspect: Six. Definitely six.\nHarry Callahan: Shit.\n\nDirty Harry Meets Rain Man\n\n{{Title text: Sci-fi has energy weapons because otherwise the people like me who watch it get distracted counting shots.}}","alt":"Sci-fi has energy weapons because otherwise the people like me who watch it get distracted counting shots.","img":"https://imgs.xkcd.com/comics/dirty_harry.png","title":"Dirty Harry","day":"22"},{"month":"1","num":693,"link":"","year":"2010","news":"","safe_title":"Children's Fantasy","transcript":"[[Kid is sitting on the ground with his chin in his hand.]]\nKid: I'm such a loser--\n<<POP>>\n[[Princess sticks her head through a portal.]]\nPrincess: Come quickly, young one!\nKid: Holy crap, a portal!\nPrincess: My kingdom needs you!\n\n[[He falls through.]]\nKid: AAAAAA\n\n[[We see him on horseback, helmeted wielding a sword. There's a castle on the horizon and two moons in the sky.]]\n\n[[Kid, with helmet and sword, stands before King, Princess, and another warrior. Princess is holding out a ring.]]\nKing: You've saved our kingdom and found your self-confidence. Now it's time to return home. Goodbye, young hero!\nPrincess: Take this ring to remember us!\n\n[[Kid stands alone, holding the ring.]]\nKid: Well, I guess I spend the rest of my life pretending that didn't happen or knowing that everyone I love suspects I'm crazy.\nKid: This'll be a fun 70 years.\n\n{{Title text: I was going to be a scientist, but that seems silly now. Magical worlds exist. I've learned a huge truth about our place in the universe. I'm supposed to care about college? I mean, FUCK.}}","alt":"I was going to be a scientist, but that seems silly now. Magical worlds exist. I've learned a huge truth about our place in the universe. I'm supposed to care about college? I mean, FUCK.","img":"https://imgs.xkcd.com/comics/childrens_fantasy.png","title":"Children's Fantasy","day":"25"},{"month":"1","num":694,"link":"","year":"2010","news":"","safe_title":"Retro Virus","transcript":"[[Dude is using a computer.]]\nDude: Argh, this is frustrating.\nFriend (off-panel): What?\n\nDude: This windows box has a virus and I can't get regedit to--\nFriend (off-panel): Haha, cleaning viruses? Man, what a blast from the past!\n\nFriend: Check it out! Dude's cleaning win32 viruses! Remember that?\nGirl (off-panel): It's like we're back in 2003!\nDude (small): Hey, XP's still the most--\n\nFriend: Did you get the virus from Kazaa?\nGirl (with laptop): Guess what I just read on Howard Dean's Friendster!?\nDude (head in hands): Guys ...\n\n{{Title text: He says this is the year of Linux on the desktop! The world of Windows will fade any moment now!}}","alt":"He says this is the year of Linux on the desktop! The world of Windows will fade any moment now!","img":"https://imgs.xkcd.com/comics/retro_virus.png","title":"Retro Virus","day":"27"},{"month":"1","num":695,"link":"","year":"2010","news":"","safe_title":"Spirit","transcript":"Day 1 of 90\n[[The Spirit rover is on the surface of Mars.]]\nSpirit (thinking): 89 days to go!\n\nDay 88 of 90\nSpirit (thinking): Two days until I go home!\n\nDay 91 of 90\nSpirit (thinking): ?\n\nDay 103 of 90\nSpirit (thinking): Maybe I didn't do a good enough job.\n\nDay 127 of 90\nSpirit (thinking): Maybe if I do a good enough job, they'll let me come home.\n\nDay 857 of 90\nSpirit (thinking): I thought I analyzed that rock really well.\nSpirit (thinking): It's okay, I'll do the next one better.\n\nDay 1293 of 90\nSpirit (thinking): Sandstorm. Power dying.\nSpirit (thinking): But a good rover would keep going. A good rover like they wanted.\n\nDay 1944 of 90\nSpirit (thinking): Oh no.\n<<whirrrr>>\nSpirit (thinking): I'm stuck.\n<<whirrrr>\n\nSpirit (thinking): Did I do a good job?\nSpirit (thinking): Do I get to come home?\nSpirit (thinking): Guys?\n\n[[Spirit rests in the middle of a vast Martian landscape.]]\n\n{{Title text: On January 26th, 2213 days into its mission, NASA declared Spirit a 'stationary research station', expected to operational for several more months until the dust buildup on its solar panels forces a final shutdown.}}","alt":"On January 26th, 2274 Mars days into the mission, NASA declared Spirit a 'stationary research station', expected to stay operational for several more months until the dust buildup on its solar panels forces a final shutdown.","img":"https://imgs.xkcd.com/comics/spirit.png","title":"Spirit","day":"29"},{"month":"2","num":696,"link":"","year":"2010","news":"","safe_title":"Strip Games","transcript":"Frequency of Strip Versions of Various Games\n\nn = google hits for \"strip <game name>\" \n google hits for \"<game name>\"\n(at the time of this writing)\n\nFrequent\n(n > 1%)\n- Poker\n- Spin the Bottle\n- Beer Pong\n- Never Have I Ever\n- Truth or Dare\n\nRare\n(1% >= n > 0.01%)\n- Chess\n- Blackjack\n- Tennis\n- Settlers of Catan\n- Pictionary\n\nExtremely Rare\n(0.01% >= n > 0)\n- Cricket\n- Magic: the Gathering\n- Stickball\n- Agricola\n- Jumanji\n\nNonexistent\n(n = 0)\n- Poohsticks\n- Podracing\n- Iterated Prisoner's Dilemma\n- Chess by Mail\n- Conway's Game of Life\n\n{{Title text: HOW ABOUT A NICE GAME OF STRIP GLOBAL THERMONUCLEAR WAR?}}","alt":"HOW ABOUT A NICE GAME OF STRIP GLOBAL THERMONUCLEAR WAR?","img":"https://imgs.xkcd.com/comics/strip_games.png","title":"Strip Games","day":"1"},{"month":"2","num":697,"link":"","year":"2010","news":"","safe_title":"Tensile vs. Shear Strength","transcript":"[[A banner flutters in the breeze, evidently attached to the elevator it mentions in its text. It reads \"SPACE ELEVATOR\" \"GRAND OPENING\"]]\n[[A space elevator occupies the height of the frame, consisting of a bass, a ribbon extending out into space, and an elevator unit with standard elevator features such as sliding doors and up\ndown buttons.]]\n((The following lines appear split across the elevator itself, the rhyming portions of the text separated from the others.))\nAFTER COUNTLESS    ENGINEERS\nSPEND TRILLIONS OVER    FIFTY YEARS,\nA MODERN BABEL    DISAPPEARS\nBECAUSE SOME FUCK BROUGHT    PRUNING SHEARS\n[[Five individuals stand at the base of the elevator: a brunette woman, a man, a blond woman who has recently opened a bottle of champagne, an alarmed man, and Hat Guy, who has smuggled the aforementioned shears into the ceremony and unceremoniously turned it into a ribbon cutting.]]  \n<<SNIP>>\n\n{{Title text: Although really, the damage was done when the party planners took the hole punch to the elevator ribbon to hang up the sign.}}","alt":"Although really, the damage was done when the party planners took the hole punch to the elevator ribbon to hang up the sign.","img":"https://imgs.xkcd.com/comics/tensile_vs_shear_strength.png","title":"Tensile vs. Shear Strength","day":"3"},{"month":"2","num":698,"link":"","year":"2010","news":"","safe_title":"You Hang Up First","transcript":"[[Man is sitting on a bed, on the phone.]]\nMan: You hang up first.\n\n[[Women is lying on a bed, on the phone.]]\nWoman: No, *you* hang up first.\n\nMan: No, *you* hang up first.\n\nWoman: No, *you* fucking hang up first!\n\nMan: You hang up first, or we're OVER!\n\nWoman: Then I guess we're fucking OVER!\n\nMan: FINE!\n\nWoman: ...\n\nMan: ...\n\nWoman: *You* move on and find somebody else first.\n\n{{Title text: No, YOU stumble past a series of post-breakup hookups in a daze as you slowly realize what you've lost and how unlikely you are ever to get it back first.}}","alt":"No, YOU stumble past a series of post-breakup hookups in a daze as you slowly realize what you've lost and how unlikely you are ever to get it back first.","img":"https://imgs.xkcd.com/comics/you_hang_up_first.png","title":"You Hang Up First","day":"5"},{"month":"2","num":699,"link":"","year":"2010","news":"","safe_title":"Trimester","transcript":"[[A man in a lab coat is talking to a woman who's sitting on an examining table.]]\nMan: Well, until the second trimester, the baby hasn't decided which opening it will exit through.\nWoman: *What?*\nMan: We'll hope for one of the lower ones, so it won't be fighting gravity.\n\nDid you know you can just BUY lab coats?\n\n{{Title text: Also, it's not like anyone actually calls up the Nobel committee to double-check things.}}","alt":"Also, it's not like anyone actually calls up the Nobel committee to double-check things.","img":"https://imgs.xkcd.com/comics/trimester.png","title":"Trimester","day":"8"},{"month":"2","num":700,"link":"","year":"2010","news":"","safe_title":"Complexion","transcript":"I get frustrated trying to judge whether acne creams are having any effect. In the spirit of a controlled trial, I used one on just half my face for a few weeks.\n[[A graph shows pimples vs. time, with two lines--one remains one steady, and one is declining.]]\n\nIt was cool seeing the effects so clearly, so I got some friends to try different treatments in an impromptu study.\n[[The narrator looks in a mirror, sees a half-pimpled face, and applies a treatment.]]\n\n[[The narrator is talking to a blonde and brunette friend, each with some pimples also.]]\nNarrator: Okay, you try the saucylic acid first.\nBlonde: Wait, we should randomize the trials. Got a coin?\n\nNarrator: Okay, call it. Heads, she gets the--\n(Off-panel): YOU!\n\n[[Batman runs into frame and punches the narrator. The coin goes flying.]]\n\n{{Title text: Why do all my attempts at science end with me being punched by Batman?  (P.S. benzoyl peroxide soap works great.)}}","alt":"Why do all my attempts at science end with me being punched by Batman?  (P.S. benzoyl peroxide soap works great.)","img":"https://imgs.xkcd.com/comics/complexion.png","title":"Complexion","day":"10"},{"month":"2","num":701,"link":"","year":"2010","news":"","safe_title":"Science Valentine","transcript":"I wanted to make you a science valentine\nwith charts and graphs of my feelings for you\n[[A graph shows romance and happiness. Romance cuts off, indicating a breakup before the meeting of the narrator and his current SO, and happiness dips accordingly. A line indicates where the couple first met; romance is jagged thereafter, initially upwards but later down. Happiness climbs slightly more steadily and then dips again. More lines indicate a period of dating and then one of engagement.]]\nand the happiness you've brought me.\n\nBut the more I analyzed\n[[The narrator works at a computer]]\nr_0 =  0.20\nr_1 = -0.61\nr_2 = -0.83\nthe harder it became to defend my hypothesis.\n\nIn science, you can't publish results you know are wrong\nand you can't withhold them because they're not the ones you wanted.\n\nSo I was left with a question: do I make graphs because they're cute and funny,\n[[The narrator sits, looking at a sheet of paper.]]\nor am I a *scientist*?\n\nEnclosed are my results.\nI hope you can find somebody else\n[[A jagged, declining graph is superimposed over a red heart.]]\nto be your valentine.\n\n{{Title text: You don't use science to show that you're right, you use science to become right.}}","alt":"You don't use science to show that you're right, you use science to become right.","img":"https://imgs.xkcd.com/comics/science_valentine.png","title":"Science Valentine","day":"12"},{"month":"2","num":702,"link":"","year":"2010","news":"","safe_title":"Snow Tracking","transcript":"BACKYARD SNOW TRACKING GUIDE\n\n((Each panel contains an overhead view of tracks through the snow, with a caption indicating the apparent source))\n\n[[Standard paw prints through the snow]]\nCAT\n\n[[Large split-toe tracks and smaller rodent tracks]]\nMOOSE AND SQUIRREL\n\n[[Cat prints, but with more space between the pairs of prints]]\nLONGCAT\n\n[[Two similar careening tire tracks]]\nMOUSE RIDING BICYCLE\n\n[[Longer rodent tracks, with a large melted ring surrounding a point in the middle of the frame.]]\nRABBIT STOPPING TO USE HAIR DRYER\n\n[[No visible tracks]]\nLEGOLAS\n\n[[Single deep holes with cratering]]\nBOBCAT ON POGO STICK\n\n[[Round prints that suddenly turn to the right halfway into frame]]\nKNIGHT\n\n[[Human footprints up to a square melting pattern, turning into animal prints]]\nKID WITH TRANSMOGRIFIER\n\n[[Human footprints up to a rectangular melted area, which are then doubled to another rectangular area, which are then doubled again up to another rectangular area, which are then doubled...]]\nKID WITH DUPLICATOR\n\n[[Right curve on a road, with tire tracks careening out of frame]]\nOut of Frame Garden Owner: MY VEGETABLE GARDEN!\n\n[[A series of spiraling and outwardly traveling lines extend from a point in the middle of the frame.]]\nHIGGS BOSON\n\n{{Title text: I suppose that's more accurately a hare dryer.}}","alt":"I suppose that's more accurately a hare dryer.","img":"https://imgs.xkcd.com/comics/snow_tracking.png","title":"Snow Tracking","day":"15"},{"month":"2","num":703,"link":"","year":"2010","news":"","safe_title":"Honor Societies","transcript":"[[A student sits at a desk, while a teacher or counselor out of frame advises]]\nStudent: Wait. I should join this honor society to show colleges I'm honorable, and I'm honorable because I'm in an honor society?\nTeacher: Basically, yes.\n\n[[Tighter shot of student]]\nStudent: Sounds like I could save time by joining the Tautology Club directly.\nTeacher: That's not a real club.\nStudent: Then I'm starting it.\n\nTAUTOLOGY CLUB\n[[Seven individuals appear: a blonde girl, a man, a shorter male with glasses that bears a striking resemblance to Jason Fox, a taller man with a buzz cut, a brunette woman with curly hair in a ponytail, a brunette woman with straight hair, and finally our student, standing on a box.]]\nBlonde Girl: So how'd you learn about us?\nMan: From your Facebook group, \"If 1,000,000 People Join This Group, It Will Have 1,000,000 People In It.\"\nStudent: LISTEN UP! The first rule of Tautology Club is the first rule of Tautology Club.\n\n{{Title text: Hey, why do YOU get to be the president of Tautology Clu-- wait, I can guess.}}","alt":"Hey, why do YOU get to be the president of Tautology Clu-- wait, I can guess.","img":"https://imgs.xkcd.com/comics/honor_societies.png","title":"Honor Societies","day":"17"},{"month":"2","num":704,"link":"","year":"2010","news":"","safe_title":"Principle of Explosion","transcript":"[[Two men appear, conversing with one another]]\nFirst Man: If you assume contradictory axioms, you can derive anything. It's called the Principle of Explosion.\nSecond Man: ANYTHING? Lemme try.\n\n[[The second man writes on a piece of paper on a counter.]]\n\n[[The two men appear again, the second man holding his paper and a mobile phone.]]\nSecond Man: Hey, you're right! I started with PP and derived your mom's phone number!\nFirst Man: That's not how that works.\n\n[[The first man holds the piece of paper, while the second man is now talking on the mobile phone.]]\nSecond Man: Mrs. Lenhart?\nFirst Man: Wait, this IS her number! How--\nSecond Man: Hi, I'm a friend of--why, yes, I AM free tonight!\nFirst Man: MOM!\nSecond Man: No, box wine sounds lovely!\n\n{{Title text: You want me to pick up waffle cones? Oh, right, for the wine. One sec, let me just derive your son's credit card number and I'll be on my way.}}","alt":"You want me to pick up waffle cones? Oh, right, for the wine. One sec, let me just derive your son's credit card number and I'll be on my way.","img":"https://imgs.xkcd.com/comics/principle_of_explosion.png","title":"Principle of Explosion","day":"19"}]
