[{"month":"2","num":705,"link":"","year":"2010","news":"","safe_title":"Devotion to Duty","transcript":"[[A terrorist is holding a gun and talking on a cell phone to the boss.]]\nTerrorist: We took the hostages, secured the building, and cut the communication lines like you said.\nBoss: Excellent.\n\nTerrorist: But then this guy climbed up the ventilation ducts and walked across broken glass, killing anyone we sent to stop him.\nBoss: And he rescued the hostages?\n\nTerrorist: No, he ignored them. He just reconnected the cables we cut, muttering something about \"uptime.\"\nBoss: Shit, we're dealing with a sysadmin.\n\n{{Title text: The weird sense of duty really good sysadmins have can border on the sociopathic, but it's nice to know that it stands between the forces of darkness and your cat blog's servers.}}","alt":"The weird sense of duty really good sysadmins have can border on the sociopathic, but it's nice to know that it stands between the forces of darkness and your cat blog's servers.","img":"https://imgs.xkcd.com/comics/devotion_to_duty.png","title":"Devotion to Duty","day":"22"},{"month":"2","num":706,"link":"","year":"2010","news":"","safe_title":"Freedom","transcript":"[[Two men face each other, conversing.]]\nFirst Man: Sometimes I'm shocked to realize how many options I have.\nSecond Man: Oh?\n\n[[First Man shakes his fist.]]\nFirst Man: Like, at any moment in any conversation, I could just punch the person I was talking to, and all these potentially life-changing events would unfold.\n\n[[The two men converse.]]\nFirst Man: It's only my mental rules that stop me from punching you, or stripping naked, or getting on a plane to Fiji. Sure, rules have reasons. But shouldn't you exercise that freedom at least once before you did?\n\n<<WHAM>>\n\n[[First man is knocked down on the ground, dazed and bruised.]]\nFirst Man: Okay, I should have seen that coming.\nSecond Man: But you \ncouldn't\n! That's the beauty!\n\n{{Title text: Sometimes I'm terrified to realize how many options other people have.}}","alt":"Sometimes I'm terrified to realize how many options other people have.","img":"https://imgs.xkcd.com/comics/freedom.png","title":"Freedom","day":"24"},{"month":"2","num":707,"link":"","year":"2010","news":"","safe_title":"Joshing","transcript":"[[Two men converse.]]\nFirst Man: So, is the new project going forward?\nSecond Man: I could tell you, but then I'd have to kill you!\n\n[[The men laugh cautiously.]]\n\n[[The men resume conversation.]]\nSecond Man: I mean, kill you even sooner.\n\n{{Title text: You'll be moved up from 49 of ~7 billion to 31 of ~7 billion.}}","alt":"You'll be moved up from 49 of ~7 billion to 31 of ~7 billion.","img":"https://imgs.xkcd.com/comics/joshing.png","title":"Joshing","day":"26"},{"month":"3","num":708,"link":"","year":"2010","news":"","safe_title":"Sex Dice","transcript":"[[A man and a woman kneel on a bed, the man is shaking a cup of dice.]]\nMan: All right, baby. Get ready for...\n<<Shake shake shake roll>>\n\n((Between the first two panels.))\n[[Two dice have been rolled, the first has five dots, the second says \"BREASTS\".]]\n\n[[The man and woman, stare at the dice.]]\nMan: I really need to organize the game cupboard.\nWoman: Wait, so where's the other sex die?\n\n[[Two men and two women are sitting on the floor around a game.]]\nMan #1: I... \nfondle\n the castle guard? That doesn't seem right.\nWoman #1: It did 6 damage, though.\n\n{{Title text: You roll for initiative, and ... [roll] ... wow, do you ever take it.}}","alt":"You roll for initiative, and ... [roll] ... wow, do you ever take it.","img":"https://imgs.xkcd.com/comics/sex_dice.png","title":"Sex Dice","day":"1"},{"month":"3","num":709,"link":"","year":"2010","news":"","safe_title":"I Am","transcript":"[[The Burning Bush of Exodus fame speaks to Moses, who is shielding himself with his arm, as if a great gust of wind is overtaking him.]]\nBush: I AM THAT I AM, THE *LORD* YOUR GOD AND THE GOD OF YOUR FATHERS, OF ABRAHAM, OF ISAAC, AND OF JACOB.\n\n[[A droid comes into frame, Moses looks down at it.]]\nBush: AND THIS IS MY COUNTERPART, R2-D2.\n<<BLEEP BLOOP>>\n\n{{Title text: Great, LO-M. Do you speak Bocce? I'm supposed to find one that speaks Bocce.}}","alt":"Great, LO-M. Do you speak Bocce? I'm supposed to find one that speaks Bocce.","img":"https://imgs.xkcd.com/comics/i_am.png","title":"I Am","day":"3"},{"month":"3","num":710,"link":"","year":"2010","news":"","safe_title":"Collatz Conjecture","transcript":"[[A person sits in a chair at a desk, papers piled on top, writing furiously. Depicted above are apparently the writing, a series of nodes in various Collatz sequences (starting with 7, 21, 24, 29, 106, 176 and 256), all eventually leading back to 1.]]\nThe Collatz Conjecture states that if you pick an number, and if it's even divide it by two and if it's odd multiply it by three and add one, and you repeat this procedure long enough, eventually your friends will stop calling to see if you want to hang out.\n\n{{Title text: The Strong Collatz Conjecture states that this holds for any set of obsessively-hand-applied rules.}}","alt":"The Strong Collatz Conjecture states that this holds for any set of obsessively-hand-applied rules.","img":"https://imgs.xkcd.com/comics/collatz_conjecture.png","title":"Collatz Conjecture","day":"5"},{"month":"3","num":711,"link":"","year":"2010","news":"","safe_title":"Seismograph","transcript":"[[A man is standing over another man, who is strapped into a chair with wires attached to his head and arms. The wires lead to a large lie detector on a stand next to him, which has jagged lines drawn across it.]]\nStanding man: IS THERE AN EARTHQUAKE HAPPENING?!\nSitting man: No!\n<<SCRITCH SCRITCH>>\n\nPro Tip: In a pinch, a lie detector can double as a seismograph. \n\n{{Title text: The reverse only works if the subject has a nervous twitch.}}","alt":"The reverse only works if the subject has a nervous twitch.","img":"https://imgs.xkcd.com/comics/seismograph.png","title":"Seismograph","day":"8"},{"month":"3","num":712,"link":"","year":"2010","news":"","safe_title":"Single Ladies","transcript":"[[Sauron is sitting at a bar with a drink, beret guy is his bartender, wiping a glass.]]\nBackground music: All the single ladies, all the single ladies...\nBeret guy: Hey, Sauron. Why so glum? \nSauron: Gil-Galad saw through me and threw me out of Undon. Galadriel, too. I'll never rule \nanyone\n at this rate.\n\n[[Close up on Sauron, waist up.]]\nBackground music: All the single ladies, all the single ladies...\nSauron: Eru created such beautiful creatures -- elves and men and dwarves -- and all I've got are these stupid Orcs.\n\n[[Full body view of Sauron on barstool, arms raised.]]\nBackground music: 'Cause if you liked it then you should have put a ring on it...\nSauron: I mean, I--\n\n[[Same view, arms lowered as realization dawns on him.]]\nBackground music: 'Cause if you liked it then you should have put a ring on it...\n\n{{Title text: Using a ring to bind someone you covet into your dark and twisted world? Wow, just got the subtext there. Also, the apparently eager Beyoncé would've made one badass Nazgûl.}}","alt":"Using a ring to bind someone you covet into your dark and twisted world? Wow, just got the subtext there. Also, the apparently eager Beyoncé would've made one badass Nazgȗl.","img":"https://imgs.xkcd.com/comics/single_ladies.png","title":"Single Ladies","day":"10"},{"month":"3","num":713,"link":"","year":"2010","news":"","safe_title":"GeoIP","transcript":"[[External view of a satellite orbiting Earth. Dialog comes from within.]]\nPerson 1: Yes!\nPerson 2: What?\nPerson 1: I got our downlink into a GeoIP database.\n\n[[Internal view of the satellite, a man and a woman are floating about, the man is at a computer mounted to the wall.]]\nWoman: Why?\nMan: To mess with our advertisers. Check it out.\n\n[[An ad reads \"Meet local girls in Low Earth Orbit tonight!\" and has two photos of girls in sexy poses, one captioned \"Tanya, 18\" and the other \"Amber, 19\". Below them is a button that reads \"CHAT LIVE\".]]\n\n{{Title text: 'Meet hot young singles in your mom's basement today'? Man, screw you, GeoIP.}}","alt":"'Meet hot young singles in your mom's basement today'? Man, screw you, GeoIP.","img":"https://imgs.xkcd.com/comics/geoip.png","title":"GeoIP","day":"12"},{"month":"3","num":714,"link":"","year":"2010","news":"","safe_title":"Porn For Women","transcript":"[[A woman sits at a desk, typing on a computer with a fairly large flat-panel display.]]\nWoman: To the authors of \nPorn for Women\n: Your book features pictures of hot, clothed guys cooking, doing laundry and vacuuming.\n\n[[The woman continues typing.]]\nWoman: The idea seems to be that my deepest fantasies, like the rest of my life, likely revolve around housework.\n\n[[The woman continues typing.]]\nWoman: So I wanted to write in to clarify:  in my porn,\n\n[[The woman leans forward in her chair.]]\nWoman: People \nfuck\n.\n\n{{Title text: Yes, there are a lot of longing looks across the bridge of Galactica first, but that's beside the point!}}","alt":"Yes, there are a lot of longing looks across the bridge of Galactica first, but that's beside the point!","img":"https://imgs.xkcd.com/comics/porn_for_women.png","title":"Porn For Women","day":"15"},{"month":"3","num":715,"link":"","year":"2010","news":"","safe_title":"Numbers","transcript":"Google Result for Various Phrases:\n{{Each panel is a scatterplot of the described X against the number of Google hits, with trend lines. The scales vary.}}\n\n<X> Bottles of Beer on the Wall\n[[There are peaks at 1, 49, 73, and 99. A dip in the middle is marked \"They lose steam at 66.\" After 99 is a steep dropoff. The largest peak is around 100,000 hits.]]\n\nI've Had <X> Boy\nGirlfriends\n[[Both lines descend at roughly the same rate from 1 to 10, although the boyfriend graph is smoother; the girlfriend graph has a small peak at 4 and a small dip at 6. The peaks are between 100,000 and 1,000,000 hits.]]\n\nI'm in <X>st\nnd\nrd\nth Grade\n[[The curve is a bell peaking at 7th grade and about 500,000 hits. A second line labeled \"Including Junior, Senior, etc.\" follows the bell curve until the peak, then dips only slightly for 10th grade and resumes climbing.]]\n\nI Have a\nan <X>-Inch Penis\n[[The line ascends shallowly from 100,000 hits for 3 inches to a peak of 180,000 for 9 inches, then descends steeply to 20,000 for 13 inches.]]\n\nI'm a\nan <X>-Cup\n[[A has a few hundred thousand hits; the graph dips to a few thousand for C, peaks again around 100,000 for E, and then tails off.]]\n\nI'm <X> and Have Never Had a Boyfriend\n[[The graph is mostly a simple bell, starting and ending around 300,000 hits for 13 or 21, but there is a sharp peak of 700,000 at 18 (well above the trend line).]]\n\nDrink <X> Glasses of Water a Day\n[[There are barely any hits below 4 or above 12; between the two it rises steeply to about 1,000 hits, with a steep, narrow peak of 10,000 at 8.]]\n\nThere Are <X> Lights\n[[The graph descends smoothly from several hundred thousand hits for 1 to about 10,000 for 10, except for a peak of about 1,000,000 for 4.]]\n\nI Got <X> Problems\n[[The plot is extremely jagged, with the largest peak of 10,000,000 hits at 99, another of 10,000 at 96, and 100 and 88.]]\n\nMy IQ Is <X>\n[[A smooth curve starts and ends at a few thousand hits for around 85 and around 170, with the peak at several tens of thousands for 140, but there are several prominent outliers: 100, 110, 133, and 142 are all around 100,000 hits, and 147 is around 1,000,000.]]\n\n{{Title text: The typical internet user (who wants to share) has an IQ of 147 and a 9-inch penis. Well, better than the reverse, I guess.}}","alt":"The typical internet user (who wants to share) has an IQ of 147 and a 9-inch penis. Well, better than the reverse, I guess.","img":"https://imgs.xkcd.com/comics/numbers.png","title":"Numbers","day":"17"},{"month":"3","num":716,"link":"","year":"2010","news":"","safe_title":"Time Machine","transcript":"[[Rob is working at a workbench. Future-Rob appears out of nowhere with a baseball bat.]]\nFuture-Rob: Hi, Rob.\nRob: Whoa, you're me!\n\nFuture-Rob: You're about to have an idea for a time machine.\nRob: I am?\n\n[[Future-Rob hits Rob over the head with the baseball bat.]]\n<<WHAM>>\n\n[[A friend approaches Future-Rob working at the workbench. The baseball bat is stashed behind it.]]\nFriend: Hey, Rob. What's up?\nFuture-Rob: Nothing.\nThis happens somewhere roughly once a month.\n\n{{Title text: We never see any time travelers because they all discover it's a huge mistake. This is also why your friend at the lab suddenly looked about a year older recently.}}","alt":"We never see any time travelers because they all discover it's a huge mistake. This is also why your friend at the lab suddenly looked about a year older recently.","img":"https://imgs.xkcd.com/comics/time_machine.png","title":"Time Machine","day":"19"},{"month":"3","num":717,"link":"","year":"2010","news":"","safe_title":"Furtive","transcript":"[[A man in a trench coat and hat stands mid-frame.]]\n\n[[The man turns his head, looking to his right.]]\n\n[[The man stands alone in a wide expanse.]]\n\n[[The man finally speaks.]]\nMan: Go go gadget two lesbians doing it.\n\n{{Title text: ... go go gadget video camera.  Go go gadget cup.}}","alt":"... go go gadget video camera.  Go go gadget cup.","img":"https://imgs.xkcd.com/comics/furtive.png","title":"Furtive","day":"22"},{"month":"3","num":718,"link":"","year":"2010","news":"","safe_title":"The Flake Equation","transcript":"((Panel consists of a large equation with call-out text indicating what each variable indicates))\nP = Wp x (Cr + Mi) x Tk x F0 + F1 x Dt X Au  100,000\nWp (7,000,000,000) World Population\nCr (1\n10 000) Fraction of people who imagine an alien encounter because they're crazy or want to feel special\nMi (1\n10 000) Fraction of people who misinterpret a physical or physiological experience as an alien sighting\nTk (1\n10) Probability that they'll tell someone\nF0 (10) Average number of people they tell\nF1 (10) Average number of people each friend tells this \"firsthand\" account\nDt (9\n10) Probability that any details not fitting the narrative will be revised or forgotten in retelling\nAu (1\n100) Fraction of people with the means and motivation to share the story with a wider audience (blogs, forums, reporters)\n\nEven with conservative guesses for the values of the variables, this suggests there must be a \nhuge\n number of credible-sounding alien sightings out there, available to anyone who wants to believe!\n\n\n{{Title text: Statistics suggest that there should be tons of alien encounter stories, and in pracitce there are tons of alien encounter stories. This is known as Fermi's Lack-of-a-Paradox.}}","alt":"Statistics suggest that there should be tons of alien encounter stories, and in practice there are tons of alien encounter stories. This is known as Fermi's Lack-of-a-Paradox.","img":"https://imgs.xkcd.com/comics/the_flake_equation.png","title":"The Flake Equation","day":"24"},{"month":"3","num":719,"link":"","year":"2010","news":"","safe_title":"Brain Worms","transcript":"[[A woman sits at a computer desk, and a man stands near her holding a book.]]\nMan: Weird--this parasitic worm infects the brain, damaging the areas responsible for spatial reasoning in dreams. Signs of infection include dreams about not fitting in your car comfortably, driving from the backseat, or veering all over the road.\nWoman: (thinking) Oh God.\n\nMy Hobby: Taking advantage of the fact that some specific dreams are weirdly common, but not everyone who has them realizes this.\n\n{{Title text: Hey, it says here that if you dream about your teeth falling out, it means they're spreading.}}","alt":"Hey, it says here that if you dream about your teeth falling out, it means they're spreading.","img":"https://imgs.xkcd.com/comics/brain_worms.png","title":"Brain Worms","day":"26"},{"month":"3","num":720,"link":"","year":"2010","news":"","safe_title":"Recipes","transcript":"[[Three people, one woman and two men, sit along a table with dishes and drinks in front of them. A fourth man is walking in, a plate with food on it in one hand, a laptop in the other.]]\n\nWoman: I've got... Cheerios with a shot of vermouth.\nMan #1: At least it's better than the quail eggs in whipped cream from last time.\nMan #2: Are these Skittles \ndeep-fried?\n\nMan #3: C'mon guys, be patient. In a few hundred more meals, the genetic algorithm should catch up to existing recipes and start to optimize.\n\n{{Title text: To be fair, the brazed and confused newt on a bed of crushed Doritos turned out to be delicious.}}","alt":"To be fair, the braised and confused newt on a bed of crushed Doritos turned out to be delicious.","img":"https://imgs.xkcd.com/comics/recipes.png","title":"Recipes","day":"29"},{"month":"3","num":721,"link":"","year":"2010","news":"","safe_title":"Flatland","transcript":"[[Person encounters a square on the ground.]]\nPerson: Hey, A. Square. How's Flatland?\nA. Square: Still flat. What's up?\nPerson: I just spent an hour playing a demo of this 4D game called Miegakure.\n\n[[A character in Miegakure jumps around the 4D landscape.]]\nTrying to jump from block to block in four dimensions hurt my brain.\n\nPerson: So I apologize for giving you a hard time when you were slow to understand 3D space. I sympathize now.\nA. Square: It's okay.\n\nPerson: Also, I apologize for drawing arms, legs, and eyes on you to make you look like Spongebob. That was out of line.\nA. Square: Yes, it was.\n\n{{Title text: Also, I apologize for the time I climbed down into your world and everyone freaked out about the lesbian orgy overseen by a priest.}}","alt":"Also, I apologize for the time I climbed down into your world and everyone freaked out about the lesbian orgy overseen by a priest.","img":"https://imgs.xkcd.com/comics/flatland.png","title":"Flatland","day":"31"},{"month":"4","num":722,"link":"","year":"2010","news":"","safe_title":"Computer Problems","transcript":"[[A man and a woman are looking at his computer, on the desk.]]\nMan: You know this metal rectangle full of little lights?\nWoman: Yeah.\n\nMan: I spend most of my life pressing buttons to make the pattern of lights change however i want.\nWoman: Sounds good.\n\nMan: But today, the pattern of lights is ALL WRONG!\nWoman: Oh god! Try pressing more buttons!\nMan: IT'S NOT HELPING!\n\n{{Title text: This is how I explain computer problems to my cat. My cat usually seems happier than me.}}","alt":"This is how I explain computer problems to my cat. My cat usually seems happier than me.","img":"https://imgs.xkcd.com/comics/computer_problems.png","title":"Computer Problems","day":"2"},{"month":"4","num":723,"link":"","year":"2010","news":"","safe_title":"Seismic Waves","transcript":"When an earthquake hits, people flood the internet with posts about it--some within 20 or 30 seconds.\n[[A room with a desk, chair, and computer are shaking. The person in it is on his phone, using Twitter.]]\nRobM163  Huge earthquake here!\n\nDamaging seismic waves travel at 3-5km\ns. Fiber signals move at ~200,000kh\ns.\n(minus network lag)\n\nThis means when the seismic waves are about 100km out, they begin to be overtaken by the waves of posts ABOUT them.\n[[There is a geographical border on a map; the front edge of the wave of the quake is shown, with the front edge of the wave of tweets surpassing it.]]\n\nPeople outside this radius may get woord of the quake via Twitter, IRC, or SMS BEFORE the shaking hits.\n[[A man and woman are standing, holding cell phones. The woman is looking at hers.]]\nWoman: Whoa! Earthquake!\n\nSadly, a Twitterer's first instinct is not to find shelter.\nMan and Woman (on phones): RT @RobM163  Huge earthquake here!\n\n{{Title text: The USGS operates a really neat email\nSMS earthquake notification service (earthquake.usgs.gov\nens\n) that allows fine-grained control of notifications.}}","alt":"The USGS operates a really neat email/SMS earthquake notification service (earthquake.usgs.gov/ens/) that allows fine-grained control of notifications.","img":"https://imgs.xkcd.com/comics/seismic_waves.png","title":"Seismic Waves","day":"5"},{"month":"4","num":724,"link":"","year":"2010","news":"","safe_title":"Hell","transcript":"[[A basic Tetris screen is depicted, with a next piece indicator, score and top score, and level listed as 01. The bottom of the pit is curved into a semicircle. A square and L piece are sitting crookedly in the pit; an S piece is falling.]]\nHell\n\n{{Title text: There's also a Katamari level where everything is just slightly bigger than you, and a Mario level with a star just out of reach.}}","alt":"There's also a Katamari level where everything is just slightly bigger than you, and a Mario level with a star just out of reach.","img":"https://imgs.xkcd.com/comics/hell.png","title":"Hell","day":"7"},{"month":"4","num":725,"link":"","year":"2010","news":"","safe_title":"Literally","transcript":"[[A person is talking to a friend.]]\nPerson: I was literally glued to my seat through the entire--\nOff-Panel: HAH!\nOff-Panel: YOU MEAN \"FIGURATIVELY\"!\n\n[[The off-panel voice came from a scary guy with wild hair and a big beard.]]\nPerson: Who are you?\nScary Guy: Eighteen years I've watched you!\nScary Guy: Waiting!\n\nEver since that day in seventh grade when you humiliated me.\n[[We see the scene from seventh grade. Younger, normal-looking scary guy is standing with a girl; the younger version of the person he's addressing is standing with a friend.]]\nYoung Scary Guy: I told him and he literally EXPLODED!\nYoung Person: Uh, unless he physically BURST, you mean \"figuratively.\"\nFriend: Hah.\nRemember?\n\nScary Guy: I knew one day you'd slip, and I vowed I'd be there to see you fall. HOW DOES IT FEEL?\nPerson: You are literally the craziest person I've ever met.\nScary Guy: You did it again!\nPerson: No, I didn't.\n\n{{Title text: The chemistry experiment had me figuratively -- and then shortly thereafter literally -- glued to my seat.}}","alt":"The chemistry experiment had me figuratively -- and then shortly thereafter literally -- glued to my seat.","img":"https://imgs.xkcd.com/comics/literally.png","title":"Literally","day":"9"},{"month":"4","num":726,"link":"","year":"2010","news":"","safe_title":"Seat Selection","transcript":"[[A seat selection diagram from an airport checkin kiosk is shown.]]\nSelect desired seat by clicking on the above chart.\n\n[[A woman in a scarf with some suitcases is standing in an airport, contemplating the kiosk.]]\n\n[[The cursor indicates the cockpit of the plane.]]\n<<click>>\n\n[[The woman is in the cockpit of the plane, holding the yoke, with the pilot looking horrified behind her.]]\nWoman: WOOOOOOO\n\n{{Title text: Don't click on the wing.}}","alt":"Don't click on the wing.","img":"https://imgs.xkcd.com/comics/seat_selection.png","title":"Seat Selection","day":"12"},{"month":"4","num":727,"link":"","year":"2010","news":"","safe_title":"Trade Expert","transcript":"[[Anchorman sitting at newsdesk.]]\nAnchor: (to camera) And for more on the summit, we turn to trade expert Dr. Steven Berlee. Steven?\n\n[[Dr. Steven Berlee is sitting to the right of Anchor at newsdesk.]]\nDSB: I'm not actually a doctor or a trade expert. I'm just a programmer who lies to get on news shows.\n\n[[Close-up on DSB.]]\nAnchor: (off camera) What? Why?\nDSB: To share a message with newscasters.\n\n[[Pull back to shot of both men.]]\nAnchor: Which is?\nDSB: Every time you say \"backslash\" as part of a web address on air, I die a little.\n\n{{Title text: I mean, it's been almost twenty years. Now, it's possible you're simply embedding Windows directory paths in your URIs, but in that case you need more than just a short lecture.}}","alt":"I mean, it's been almost twenty years. Now, it's possible you're simply embedding Windows directory paths in your URIs, but in that case you need more than just a short lecture.","img":"https://imgs.xkcd.com/comics/trade_expert.png","title":"Trade Expert","day":"14"},{"month":"4","num":728,"link":"","year":"2010","news":"","safe_title":"iPad","transcript":"[[A man is sitting in an armchair, playing with an iPad. A woman is looking over his shoulder.]]\nMan: Navigating Google Maps on the iPad is fun. It feels so futuristic.\nMan: Swoosh! Zoom!\n\nWoman: There are, right now, monkeys controlling robotic arms via neural implants.\n\nWoman: A huge and alien future is barreling toward us. And I can't WAIT.\n\nWoman: But no, your iPad is cool, too.\nMan: Stop spoiling my future with your slightly more distant one.\n\n{{Title text: Maybe we're all gonna die, but we're gonna die in *really cool ways*.}}","alt":"Maybe we're all gonna die, but we're gonna die in *really cool ways*.","img":"https://imgs.xkcd.com/comics/ipad.png","title":"iPad","day":"16"},{"month":"4","num":729,"link":"","year":"2010","news":"","safe_title":"Laser Pointer","transcript":"[[A human points a laser pointer at the floor. A black cat crouches, staring at the red dot.]]\n\n[[The cat pounces.]]\n\n[[The cat lands with its paw on the dot, claws out.]]\n\n[[The cat tugs on the dot.]]\n<<tug tug>>\n\n[[The human looks at and tries to use the laser pointer, which is no longer emitting a beam.]]\nHuman: ?? <<click click>>\n[[The cat nibbles on the red laser dot.]]\nCat: <<lick? nom nom>>\n\n[[The cat arches, emitting red shock lines.]]\n\n[[The cat shoots lasers out of its eyes at the human, who is covered in a bright red glow.]]\n<<FWOOSH>>\nHuman: AUGH!\n((The right side of the panel is the end of a thought bubble ...))\n\n[[The black cat, sleeping, has dreamed the entire strip.]]\n\n{{Title text: It's a lasing cat-vity!}}","alt":"It's a lasing cat-vity!","img":"https://imgs.xkcd.com/comics/laser_pointer.png","title":"Laser Pointer","day":"19"},{"month":"4","num":730,"link":"","year":"2010","news":"","safe_title":"Circuit Diagram","transcript":"{{Title text: I just caught myself idly trying to work out what that resistor mass would actually be, and realized I had self-nerd-sniped.}}\n\n((A large and complicated circuit diagram.))\n\n[[In the upper left corner there is a map scale, labeled with 1 mi (1 km).\n\nUnderneath the scale is an antenna symbol that leads down to a blender, an Arduino; labeled with \"Arduino, just for blog cred\"; and a chip; \"Most expensive chip available\".\n\nTo the right of the antenna there is the symbol for an inductor that has it's lower terminal going into a the left terminal of pattern that looks like a highway cloverleaf.  The upper terminal leads to a line that is going to the upper terminal of that cloverleaf and to a battery symbol (with the + and - symbols on the wrong ends) with a value of â2V.  The right terminal of the cloverleaf is going into a resistor symbol label \"120Î© or to taste\".  Connected to the other terminals of the resistor and battery is a switch that is labeled \"glue open\".  The bottom of the two lines has a transistor with two emitters, one P and one N, and no collector.  The P-type emitter is connected to the top line and a jar of scarab beetles.  Above the beetles is a resistor labeled \"brown blue orange\". To the right is an unlabeled resistor with a center tap going into a capacitor, with a ground on the other end.  Above the capacitor is a diode, and below an inductor.  To the right is another inductor.  The two inductors and ground are all covered by a \"solder blob\".  The rightmost component is a \"666 timer\" that has pin 5 going into a question mark.\n\nBack to the left side, below and to the left of the cloverleaf is a compass rose.  The bottom terminal of the cloverleaf is connected to a battery, labeled 50V, with grounds on both sides.  To the right of the battery is a long horizontal wire that is labeled \"pull this wire really tight.\"  That wire is hooked up to a vertical wire that connects to the N-type emitter of the transistor above it.  To the right is an AC source that is labeled 240V, shorted out, with a label on the short \"omit this if you're a wimp.\"  To the right of that is an inductor that is labeled with \"11kg\", a batman symbol, and a squirrel.\n\nBack to the left end of the diagram, where the blender is, there is a wire that is labeled as a distance 3\n8\" from the wire with the 50V battery.  To the right there is a frowny face, then a vertical wire with a 90 degree bend labeled \"caution â±\".  That leads into a balloon.  Under the balloon is an inductor symbol with a line on the bottom edge labeled as \"warm front\".\n\nUnderneath the blender and to the right of the Arduino is a resistor labeled \"ë\".  To the right is an electric eel, a capacitor, an unlabeled resistor, and a gob of hot glue attached to a chip with an inverter hooked to an XOR gate, both with feedback into each other.  Under the electric eel is a neck strap.  To the right of the XOR gate and inverter is a bridge rectifier labeled as \"Moral rectifier\"  to the right again is a bottle of magic smoke, under that a fishing bobber and then a broken wire labeled with a question mark. \n\nUnder the most expensive chip available there is a vertical wire labeled with \"electrons single file\".  To the right is a switch labeled \"hire someone to open and close switch real fast.\"  To the right of that is a contact labeled \"touche tongue here\".  Below that is a resistor labeled \"5Î© (decoy)\" with only one terminal connected.  To the right of the contact is a methyl group attchaed to a wire.  To the right of the methyl group is a complex mesh of 1Î© resistors labeled with \"oh, so you think you're such a whiz at EE201?\"\n\nConnected to the wire labeled \"electrons single file\" is a wire bent in a U shape with an upside-down ground on the end.  To the right is a flux capacitor with the bottom wire labeled I-95.  To the right of that is a wire labeled yarn, then an arena with two diodes going in and one leaving.  The right diode has a ground on its anode labeled \"bury deep, but not too deep.\"  To the right of that is a motor labeled vibrator, resistor with a value of Ï, and a 500V AC source.\n\nUnder the flux capacitor is a wire that leads out of frame with a label \"â to center of sun\".  To the right is a 55 MPH speed limit sign, then an SR latch (flip-flop) labeled \"may use an actual sandal instead\".  Connected to the Q of the SR latch is a holding pen and to the inverting Q output is a wire in a knot, a resistor labeled \"8mm\", a resistor symbol labeled \"not a resistor; wire just does this\", and a motor symbol labeled \"to scale\".\n\nUnder the wire that leads off to the center of the sun is a tangled mess of wires connected and jumping over each other, then a photo diode labeled \"tear collector\".  Under the tear collector is a wire in the shape of a ECG.  To the right is a light bulb, a capacitor-looking symbol labeled 3 liters, a resistor labeled yes, an unlabeled inductor, a resistor with a question mark as a label.  To the right of all that is an inductor labeled \"take off shirt while wiring this part.  Ooh, yeah, I like that.\"  Finally, in the lower right hand corner is a ground symbol immersed in a beaker of holy water.]]","alt":"I just caught myself idly trying to work out what that resistor mass would actually be, and realized I had self-nerd-sniped.","img":"https://imgs.xkcd.com/comics/circuit_diagram.png","title":"Circuit Diagram","day":"21"},{"month":"4","num":731,"link":"","year":"2010","news":"","safe_title":"Desert Island","transcript":"[[A man sits writing in a diary on a desert island, only the sandy tip of which with a palm tree on it stands above the water. Beneath the surface is a kelp forest, some sharks, a stingray, a shipwreck, a submarine, several large jellyfish, a giant squid fighting a sperm whale, a crashed plane, some coral formations, a thermal vent emitting a plume of smoke surrounded by several annelids, and a snail.]]\nMan: Day 44: Still stranded, with nothing but flat empty water as far as the eye can see.\n\n{{Title text: Telescopes and bathyscapes and sonar probes of Scottish lakes, Tacoma Narrows bridge collapse explained with abstract phase-space maps, some x-ray slides, a music score, Minard's Napoleonic war: the most exciting new frontier is charting what's already here.}}","alt":"Telescopes and bathyscaphes and sonar probes of Scottish lakes, Tacoma Narrows bridge collapse explained with abstract phase-space maps, some x-ray slides, a music score, Minard's Napoleonic war: the most exciting new frontier is charting what's already here.","img":"https://imgs.xkcd.com/comics/desert_island.png","title":"Desert Island","day":"23"},{"month":"4","num":732,"link":"","year":"2010","news":"","safe_title":"HDTV","transcript":"[[One person is pointing to a huge flatscreen HDTV on the wall. The other is holding a cell phone.]]\nHDTV Owner: Check out my new HDTV--a beautiful, high-def 1080p.\nFriend: Wow, that's over TWICE the horizontal resolution of my cell phone.\nFriend: In fact, it almost beats the LCD monitor I got in 2004.\n\nIt baffles me that people find HDTV impressive.\n\n{{Title text: We're also stuck with blurry, juddery, slow-panning 24fps movies forever because (thanks to 60fps home video) people associate high framerates with camcorders and cheap sitcoms, and thus think good framerates look 'fake'.}}","alt":"We're also stuck with blurry, juddery, slow-panning 24fps movies forever because (thanks to 60fps home video) people associate high framerates with camcorders and cheap sitcoms, and thus think good framerates look 'fake'.","img":"https://imgs.xkcd.com/comics/hdtv.png","title":"HDTV","day":"26"},{"month":"4","num":733,"link":"","year":"2010","news":"","safe_title":"Eagle","transcript":"[[A researcher is looking up into a tree, holding a clipboard in one hand and a radio in the other.]]\nResearcher: The eagle has left the nest.\nOff-Panel: *KHHHKHT* Roger that. Alert the agents.  *KHKKHHKT*\nResearcher: Will you stop that?\n\nMy hobby: Following field biologists around and interpreting everything they say as code phrases.\n\n{{Title text: In the off-seasons, I hire an animal trainer to help confront secret agents with situations which they are unable to report by radio.}}","alt":"In the off-seasons, I hire an animal trainer to help confront secret agents with situations which they are unable to report by radio.","img":"https://imgs.xkcd.com/comics/eagle.png","title":"Eagle","day":"28"},{"month":"4","num":734,"link":"","year":"2010","news":"","safe_title":"Outbreak","transcript":"The outbreak started with Patient Zero ...\n[[Two scientists, a man and a woman, stand outside a lab. A zombie is visible through the window.]]\nMan: He was exposed to toxin X-7--now he's a bloodthirsty monster!\nWoman: Has he been in isolation?\nZombie: Braaains!\n\nMan: Yes, but I can't hold this door for long!\nWoman: Hang on, I've got a gun in my truck.\n[[She runs off.]]\nZombie (through door): <<wham>>\n\n[[The man opens the door as the woman shoots through it.]]\n<<BLAM>>\n\nAnd ended with Patient Zero five minutes later.\nMan: So, I never got your name. I'm Ryan.\nWoman: Laura.\nThe remaining 90 minutes of the movie will be a romantic comedy.\n\n{{Title text: Let's get dinner after we promptly destroy all the X-7 in we've manufactured.}}","alt":"Let's get dinner after we promptly destroy all the X-7 we've manufactured.","img":"https://imgs.xkcd.com/comics/outbreak.png","title":"Outbreak","day":"30"},{"month":"5","num":735,"link":"","year":"2010","news":"","safe_title":"Floor","transcript":"[[Three kids are in a living room. Furniture and other things are knocked over, broken, or tilted. The first kid is holding a handle of a plunger with cables goin offscreen.]]\nFirst Kid: I've dynamited a trench through the kitchen to divert flow!\n<<BOOM>>\n[[The second kid is aiming a hose at the floor.]]\nSecond Kid: More hoses! We need to cool and solidify the surface layer!\n<<FWOOSH>>\n[[The third kid is standing on a chair, using a cell phone or radio.]]\nThird Kid: Where are the damn helicopters?\nLike many kids, we sometimes pretended the floor was lava.\n\n{{Title text: We once got grounded when we convinced the FAA to block flights through our county because of ash clouds.}}","alt":"We once got grounded when we convinced the FAA to block flights through our county because of ash clouds.","img":"https://imgs.xkcd.com/comics/floor.png","title":"Floor","day":"3"},{"month":"5","num":736,"link":"","year":"2010","news":"","safe_title":"Cemetery","transcript":"[[A person is in a cemetery, near a gravestone. Other people stand around staring.]]\nPerson: Frankly, you deserve this. You KNEW I wanted a sans-serif font, and you IGNOERD me.\nPerson: So really, this is YOUR fault.\nI've discovered the worst place to wander while arguing on a hands-free headset.\n\n{{Title text: Three headstones down, I got a call from my mom and it went from bad to worse.}}","alt":"Three headstones down, I got a call from my mom and it went from bad to worse.","img":"https://imgs.xkcd.com/comics/cemetery.png","title":"Cemetery","day":"5"},{"month":"5","num":737,"link":"","year":"2010","news":"","safe_title":"Yogurt","transcript":"[[A person is holding a cup at arm's length.  Waves of stink are rising from it.]]\nPerson 1: Oh God, how old is this yogurt in your fridge?\n[[Someone speaks from off-panel.]]\nPerson 2: What's hte expiration date?\n\n[[The first person holds up the cup to look at the bottom.]]\nPerson 1: May 12th, but there's no year.\n[[From off-panel again.]]\nIt's May 7th.  So it's fine.\n\n[[Now the second person is on panel, and the first speaks from off-panel.  The second person is sitting down working on a laptop.]]\nPerson 1:I'm not sure.  When it was packaged, was civilization using the Gregorian or Julian calendar?\nPerson 2: Okay, I'll throw it out.\nPerson 1: No, it might still be good!\n\n{{Title text: I am firmly of the opinion that if something doesn't have a year on it, every time the expiration date rolls around it is good again for the two weeks preceeding that date.}}","alt":"I am firmly of the opinion that if something doesn't have a year on it, every time the expiration date rolls around it is good again for the two weeks preceding that date.","img":"https://imgs.xkcd.com/comics/yogurt.png","title":"Yogurt","day":"7"},{"month":"5","num":738,"link":"","year":"2010","news":"","safe_title":"Incision","transcript":"[[Two doctors wearing surgical masks are standing over a prone patient.  One of them is poking the patient's chest.]]\nDoctor: I'm making the incision above the left - \n<< BZZZZT! >>\nDoctor: Augh!\nOctober 8th, 2004:\nA child swallows an 'operation' buzzer, leading to the single most difficult surgery ever performed.\n\n{{Title text: At one point, by force of childhood habit, the doctor accidentally removed three or four organs.}}","alt":"At one point, by force of childhood habit, the doctor accidentally removed three or four organs.","img":"https://imgs.xkcd.com/comics/incision.png","title":"Incision","day":"10"},{"month":"5","num":739,"link":"","year":"2010","news":"At Wikipedia's request, I release this comic<br />under a <a href=\"https://creativecommons.org/licenses/by-sa/3.0/us/\">cc-by-sa</a> license.","safe_title":"Malamanteau","transcript":"((The strip is set up as the top of a Wikipedia page.))\n((The Wikipedia logo.))\nWikipedia\nThe free encyclopedia\n((Side navigation options.))\nNavigation\n- Main Page\n- Contents\n- Featured Content\n- Current Events\n((Wikipedia header options.))\nArticle  Discussion  Edit this page  History\n((The article itself.))\nMalamanteau\nFrom Wikipedia, the free encyclopedia\nA malamanteau is a neologism for a portmanteau created by incorrectly combining a malapropism with a neologism.  It is itself a portmanteau of ((... the article cuts off.))\n((Below the panel.))\nEver notice how Wikipedia has a few words it *really* likes?\n\n{{Title text: The article has twenty-three citations, one of which is an obscure manuscript from the 1490's and the other twenty-two are arguments on LanguageLog.}}","alt":"The article has twenty-three citations, one of which is an obscure manuscript from the 1490's and the other twenty-two are arguments on LanguageLog.","img":"https://imgs.xkcd.com/comics/malamanteau.png","title":"Malamanteau","day":"12"},{"month":"5","num":740,"link":"","year":"2010","news":"","safe_title":"The Tell-Tale Beat","transcript":"((The three panels show portions of a single scene. Although the characters are still stick figures, the artwork style is heavily crosshatched and shaded.))\n[[In the first panel there is a desk with monitor on it, and a painting of a woman above that.  Next to it is a bookshelf.]]\nEver since I murdered Daft Punk\n\n[[There is a fireplace, with no fire.  A rug lies before it.  At the left end of the mantelpiece are two bottles, one tall, one round.  Another photograph of a woman is in a frame at the right end.  The bookshelf continues from the previous panel.]]\nAnd hid their bodies beneath the floorboards,\nI've been haunted\n\n[[The narrator is clutching his head and leaning forward.  A grandfather clock is behind him, next to a doorway.  Above the doorway is a pallid bust of Pallas.]]\nBy this *pounding*.\n((White text on black.))\nUnn-Tss\nUnn-Tss\nUnn-Tss\n\n{{Title text: You fancy me mad. Could a madman have outsmarted the greatest electronica\ntechno artists of our era? Next to fall will be Roderick Usher's house\ntrance band.}}","alt":"You fancy me mad. Could a madman have outsmarted the greatest electronica/techno artists of our era? Next to fall will be Roderick Usher's house/trance band.","img":"https://imgs.xkcd.com/comics/the_tell_tale_beat.png","title":"The Tell-Tale Beat","day":"14"},{"month":"5","num":741,"link":"","year":"2010","news":"","safe_title":"Blogging","transcript":"[[A man stands on a stage before a large audience, holding a pointer and using it to highlight something on a screen behind him. He interacts with a member of the audience after making a point.]]\nPresenter: The key to making a successful blog is building a relationship with your readers.\nAudience Member: I thought it was \"make your updates good so people will want to read them.\"\nPresenter: We'll discuss content generation in part three.\nAudience Member: Awesome! I _LOVE_ content.\n\n{{Title text: I'm looking to virally monetize your eyeballs by selling them for transplants.}}","alt":"I'm looking to virally monetize your eyeballs by selling them for transplants.","img":"https://imgs.xkcd.com/comics/blogging.png","title":"Blogging","day":"17"},{"month":"5","num":742,"link":"","year":"2010","news":"","safe_title":"Campfire","transcript":"[[An adult stands in front of a campfire with three children listening intently. The adult holds a flashlight under his chin to create a menacing visage.]]\nAdult: But when she traced the killer's IP address... It was in the 192.168\n16 block!\nChildren, together: GASP!\n\n{{Title text: 100 years later, this story remains terrifying--not because it's the local network block, but because the killer is still on IPv4.}}","alt":"100 years later, this story remains terrifying--not because it's the local network block, but because the killer is still on IPv4.","img":"https://imgs.xkcd.com/comics/campfire.png","title":"Campfire","day":"19"},{"month":"5","num":743,"link":"","year":"2010","news":"","safe_title":"Infrastructures","transcript":"2003:\n[[A man approaches a bearded fellow.]]\nMan: Did you get my essay?\nBearded Fellow: Yeah, it was good! But it was a .doc; You should really use a more open--\nMan: Give it a \nrest\n already. Maybe we just want to live our lives and use software that \nworks\n, not get wrapped up in your stupid nerd turf wars.\n\nBearded Fellow: I just want people to care about the infrastructures we're building and who--\nMan: No, you just want to feel smugly superior. You have no sense of perspective and are probably autistic.\n\n2010:\nMan: Oh my God! We handed control of our social world to Facebook and they're \nDOING EVIL STUFF!\n\nBearded Fellow: Do you see this?\n\n[[Inset, the bearded fellow rubs his index and middle fingers against his thumb.]]\nBearded Fellow: \nIt's the world's tiniest open-source violin.\n\n\n{{Title text: The heartfelt tune it plays is CC licensed, and you can get it from my seed on JoinDiaspora.net whenever that project gets going.}}","alt":"The heartfelt tune it plays is CC licensed, and you can get it from my seed on JoinDiaspora.com whenever that project gets going.","img":"https://imgs.xkcd.com/comics/infrastructures.png","title":"Infrastructures","day":"21"},{"month":"5","num":744,"link":"","year":"2010","news":"","safe_title":"Walkthrough","transcript":"[[A man sits at a computer. His friend enters the room.]]\nMan at computer: How did the date go?\nFriend: I wanted to be prepared, so I looked up a sex walkthrough video.\n\n[[The two men sit silently contemplating the words of the previous moment.]]\n\nMan at computer: ...and?\nFriend: It turns out it was a speed run.\nMan at computer: Ouch.\n\n{{Title text: There's nothing hotter than porn dubbed over with a poorly-mic'd teenager's voice explaining each step in a droning monotone. 'okay, we're almost at the spawn point ... separate the labia, but watch out, there are more inside them ...\"}}","alt":"There's nothing hotter than porn dubbed over with a poorly-mic'd teenager's voice explaining each step in a droning monotone. 'okay, we're almost at the spawn point ... separate the labia, but watch out, there are more inside them ...\"","img":"https://imgs.xkcd.com/comics/walkthrough.png","title":"Walkthrough","day":"24"},{"month":"5","num":745,"link":"","year":"2010","news":"","safe_title":"Dyslexics","transcript":"[[A t-shirt is shown with the text \"DYSLEXICS OF THE WORLD, UNITE!\" screen-printed on it.]]\nThe dyslexic support group ran into difficulties when they tried to make a joke fundraiser t-shirt.\n\n{{Title text: And of course I had to redo this like three times because I kept writing 'UNTIE'; I kept doing 'doing 'doing it wrong' wrong' wrong.}}","alt":"And of course I had to redo this like three times because I kept writing 'UNTIE'; I kept doing 'doing 'doing it wrong' wrong' wrong.","img":"https://imgs.xkcd.com/comics/dyslexics.png","title":"Dyslexics","day":"26"},{"month":"5","num":746,"link":"","year":"2010","news":"","safe_title":"Birth","transcript":"[[A woman is giving birth. A doctor stands near the end of the table.]]\nDoctor: Okay, the head is starting to crown.\nDoctor: Push!\n\nDoctor: Wait, that's... that's a tube.\n\nDoctor: It looks like the barrel of a...\n<<CLICK>>\n\n[[A voice, that of the baby, comes from the woman's vagina.]]\nBaby: Nobody move--this is a stick-up!\nDoctor: Oh, God! Stop pushing, Megan!\nDoctor: Can you... pull?\n\n{{Title text: All those GTA marathons during the pregnancy were a bad idea.}}","alt":"All those GTA marathons during the pregnancy were a bad idea.","img":"https://imgs.xkcd.com/comics/birth.png","title":"Birth","day":"28"},{"month":"5","num":747,"link":"","year":"2010","news":"","safe_title":"Geeks and Nerds","transcript":"[[There is a two-circle Venn diagram; the left circle is labeled \"Geeks,\" the right \"Nerds.\" The intersection is labeled \"People with strong opinions on the distinction between geeks and nerds.\"]]\n\n{{Title text: The definitions I grew up with were that a geek is someone unusually into something (so you could have computer geeks, baseball geeks, theater geeks, etc) and nerds are (often awkward) science, math, or computer geeks. But definitions vary.}}","alt":"The definitions I grew up with were that a geek is someone unusually into something (so you could have computer geeks, baseball geeks, theater geeks, etc) and nerds are (often awkward) science, math, or computer geeks. But definitions vary.","img":"https://imgs.xkcd.com/comics/geeks_and_nerds.png","title":"Geeks and Nerds","day":"31"},{"month":"6","num":748,"link":"","year":"2010","news":"","safe_title":"Worst-Case Scenario","transcript":"[[Two reporters, a man and a woman, point microphones toward a scientist.]]\nFemale reporter: Dr. Scientist! The \"Top Kill\" has failed! What's the worse-case scenario for the gulf?\nDr. Scientist: The worst-case scenario is what's happening now.\n\nReporter, out of frame: Yes, but is there any way it could get worse?\nDr. Scientist: Sure, but there are real disasters happening now, and you're substituting speculation and voyeurism for the investigative journalism we--\nReporter: Screw this! Let's ask Michael Bay.\n\n[[The reporters, now joined by a camerawoman, approach Michael Bay with their microphones.]]\nMichael Bay: The worst case? A hurricane tracks into the gulf, whipping the surface of the spill into a frothy mix of oil and air.\n\n[[An alligator-filled conflagration atop a massive ocean wave approaches land.]]\nMichael Bay, narrating: As the storm surges through the bayous, sparking power lines ignite the fuel\nair mixture into a roiling, alligator-filled wall of flame.\n\n[[A map of the gulf coast of Louisiana and southwest Mississippi is depicted with the current routes of the Mississippi and Atchafalaya Rivers highlighted. An arrow indicating a new primary flow of the Mississippi's waters into the Atchafalaya points toward southern Louisiana.]]\nMichael Bay, narrating: Plowing northward, the fire hurricane destroys the Old River Control Structure in Concordia, rerouting the Mississippi westward and sweeping Morgan City and the heart of cajun country out to sea.\n\nMichael Bay: James Carville emerges from the conflagration riding a burning alligator...\nReporter, out of frame: Will this affect the midterm elections?\nMichael Bay: \nMassively.\n\n\n{{Title text: To get serious analyses of hurricanes and oil slicks, see Jeff Masters' blog. To get serious discussions of worst-case scenario thinking, see Bruce Schneier's blog. To get enough Vitamin D, don't read any blogs and go outside instead.}}","alt":"To get serious analyses of hurricanes and oil slicks, see Jeff Masters' blog. To get serious discussions of worst-case scenario thinking, see Bruce Schneier's blog. To get enough Vitamin D, don't read any blogs and go outside instead.","img":"https://imgs.xkcd.com/comics/worst_case_scenario.png","title":"Worst-Case Scenario","day":"2"},{"month":"6","num":749,"link":"","year":"2010","news":"","safe_title":"Study","transcript":"[[A posted flier with tear-off strips at the bottom reads: \"Volunteers Needed for a scientific study investigating whether people can distinguish between scientific studies and kidney-harvesting scams. (Healthy Type-O Adults Only) TAKE ONE\"  Five of the strips are torn off.]]\n\n{{Title text: Volunteers needed for a study on transmission of urushiol from digital contact with thin strips of fibrous cellulose pulp.}}","alt":"Volunteers needed for a study on transmission of urushiol from digital contact with thin strips of fibrous cellulose pulp.","img":"https://imgs.xkcd.com/comics/study.png","title":"Study","day":"4"},{"month":"6","num":750,"link":"","year":"2010","news":"","safe_title":"Book Burning","transcript":"[[A man holds a book aloft, displaying it to his two acquaintances.]]\nMan: This book is full of heresy!\nAcquaintance: Let's hold a book burning!\n\n[[They confer more, then one acquaintance runs off.]]\nMan: I only have one copy.\nAcquaintance #1: I guess we could buy more.\nAcquaintance #2: I'll look online.\n\n[[A screenshot from an online retailer's page displays pricing for the hardcover ($17.99) and Kindle ($9.99) editions of the mentioned book.]]\n\n[[The front page of a newspaper, titled \"News\", is shown above the fold. The first article's headline reads \"Eight dead from toxic fume inhalation\" and a picture is shown depicting three bodies strewn around a massive plume of tar-black smoke.]]\n\n{{Title text: Of course, since their cautionary tale was reported in a print newspaper, no one read it.}}","alt":"Of course, since their cautionary tale was reported in a print newspaper, no one read it.","img":"https://imgs.xkcd.com/comics/book_burning.png","title":"Book Burning","day":"7"},{"month":"6","num":751,"link":"","year":"2010","news":"","safe_title":"Swimsuit Issue","transcript":"[[A young boy holds a magazine. His father comes running into the room.]]\nBoy: What's this?\nFather: Oh! That's daddy's \nSports Illustrated\n swimsuit issue! It's not appropriate for--\nBoy: Wow! They look just like the ladies who get double-penetrated in the popup ads! But with clothes on! Gosh!\n\n{{Title text: Parents: talk to your kids about popup blockers. Also, at some point, sex. But crucial fundamentals first!}}","alt":"Parents: talk to your kids about popup blockers. Also, at some point, sex. But crucial fundamentals first!","img":"https://imgs.xkcd.com/comics/swimsuit_issue.png","title":"Swimsuit Issue","day":"9"},{"month":"6","num":752,"link":"","year":"2010","news":"","safe_title":"Phobia","transcript":"[[A blonde woman and a brunette woman observe a snake on the ground.]]\nBlonde: Whoa, a snake!\nBrunette: Cool!\nBlonde: I'm afraid of snakes.\n\n[[The brunette looks pensive.]]\nBrunette: I'm afraid of saying \"Everything's complicated right now, but maybe next year\" until there are no more years left.\n\n[[The blonde considers her response.]]\n\n[[The brunette cuts her off mid-sentence.]]\nBlonde: Do you--\nBrunette: I want to be a storm chaser.\n\n[[A tornado reaches from the black storm clouds to the earth, kicking up a sizable cloud of debris at its base. The blonde woman is at the wheel of a car, the brunette hanging out the window and holding a camera.]]\n\n{{Title text: Oh God, the tornado picked up snakes!}}","alt":"Oh God, the tornado picked up snakes!","img":"https://imgs.xkcd.com/comics/phobia.png","title":"Phobia","day":"11"},{"month":"6","num":753,"link":"","year":"2010","news":"","safe_title":"Southern Half","transcript":"The great battlefield for the defense and expansion of freedom today is the whole southern half of the globe -- Asia, Latin America, Africa, and the Middle East.\n-John F. Kennedy, 1961 speech to Congress.\n\n[[An ovoid world map, with Latin America colored in red, Africa in yellow, the Middle East in green, and Asia in Blue. There is an arrow pointing to the top of the map marked 'northern half', and another arrow pointing to the bottom half marked 'southern half.' The majority of these places are actually in the northern half.]]\n\nOkay, so I'm half a century late on this, but it's been bugging me: did JFK \nown\n a globe?\n\n{{Title text: Also, if you read his speech at Rice, all his arguments for going to the moon work equally well as arguments for blowing up the moon, sending cloned dinosaurs into space, or constructing a towering penis-shaped obelisk on Mars.}}","alt":"Also, if you read his speech at Rice, all his arguments for going to the moon work equally well as arguments for blowing up the moon, sending cloned dinosaurs into space, or constructing a towering penis-shaped obelisk on Mars.","img":"https://imgs.xkcd.com/comics/southern_half.png","title":"Southern Half","day":"14"},{"month":"6","num":754,"link":"","year":"2010","news":"","safe_title":"Dependencies","transcript":"((A portion of a page from an imaginary course catalog.)\n\n[[A table with four columns labeled Department, Course, Description, and Prereqs. Under 'Department' it reads, \"computer science\". Under 'course' it reads, \"CPSC 432\". Under 'Description' it reads, \"Intermediate compiler design, with a focus on dependency resolution.\" Under 'Prereqs' it reads, \"CPSC 432\". \n\n{{Title text: The prereqs for CPSC 357, the class on package management, are CPCS 432, CPSC 357, and glibc2.5 or later.}}","alt":"The prereqs for CPSC 357, the class on package management, are CPSC 432, CPSC 357, and glibc2.5 or later.","img":"https://imgs.xkcd.com/comics/dependencies.png","title":"Dependencies","day":"16"},{"month":"6","num":755,"link":"","year":"2010","news":"","safe_title":"Interdisciplinary","transcript":"[[2 men and 1 woman stand in the foreground, while in the background, a woman stands on a platform and releases a pendulum hanging from the ceiling toward a man who is running away.]]\n\nMan #2: This is an interdisciplinary program in which Physics students try to hit Psychology students with pedulums. \nWoman: Promising!\nBackground man: AAAAAAA!\n\nMy professors had an ongoing competition to get the weirdest thing taken seriously under the label \"interdisciplinary program.\"\n\n{{Title text: Replace the pendulums with history students and you'll qualify for a grant!}}","alt":"Replace the pendulums with history students and you'll qualify for a grant!","img":"https://imgs.xkcd.com/comics/interdisciplinary.png","title":"Interdisciplinary","day":"18"},{"month":"6","num":756,"link":"","year":"2010","news":"","safe_title":"Public Opinion","transcript":"[[A news anchor reads from a paper. There is a picture on the left side of screen of a man speaking at a podium. In the bottom right-hand corner, a logo reads 'News24'.]]\n\nNews anchor: A leading politician today charged that the media, rather than informing people, now merely report on public ignorance. Do our viewers agree? Let's hear from some voices on the street...\n\n{{Title text: News networks giving a greater voice to viewers because the social web is so popular are like a chef on the Titanic who, seeing the looming iceberg and fleeing customers, figures ice is the future and starts making snow cones.}}","alt":"News networks giving a greater voice to viewers because the social web is so popular are like a chef on the Titanic who, seeing the looming iceberg and fleeing customers, figures ice is the future and starts making snow cones.","img":"https://imgs.xkcd.com/comics/public_opinion.png","title":"Public Opinion","day":"21"},{"month":"6","num":757,"link":"","year":"2010","news":"","safe_title":"Toot","transcript":"[[A man is talking to Hatman.]]\nMan: I don't mean to toot my own horn, but I \nwas\n first in my class at Caltech. \n\n[[The man falls backward as Hatman sounds an air horn in his face.]]\nHatman: Really? I don't mean to toot my own horn, but\n<<BRAAAAAAP!>>\n\n[[A picture of an air horn.]]\nAir horns: worth carrying around your entire life for those few perfect moments.\n\n{{Title text: This is also one of only five identified situations in which a vuvuzela is actually appropriate.}}","alt":"This is also one of only five identified situations in which a vuvuzela is actually appropriate.","img":"https://imgs.xkcd.com/comics/toot.png","title":"Toot","day":"23"},{"month":"6","num":758,"link":"","year":"2010","news":"","safe_title":"Raptor Fences","transcript":"[[A man checks a computer terminal, another man is running off in the opposite direction.]]\n\nMan 1: The raptor fences are down. They're loose.\nMan 2: I'll get a broom and dustpan.\n\nCaption: Jurassic Park got a lot less scary when the researchers discovered they could ativate the gene for extreme dwarfism.\n\n{{Title text: If at least one person has a nightmare about being swarmed by hundreds of mouse-sized dromaeosaurids, my work will have been done.}}\n","alt":"If at least one person has a nightmare about being swarmed by hundreds of mouse-sized dromaeosaurids, my work will have been done.","img":"https://imgs.xkcd.com/comics/raptor_fences.png","title":"Raptor Fences","day":"25"},{"month":"6","num":759,"link":"","year":"2010","news":"","safe_title":"3x9","transcript":"[[A problem is given on an arithmetic test: \"4) 3x9=?\". In handwriting, the student's work follows. The student has accurately reformatted the question as 3 times the square root of 81, which visually resembles the long division problem of 3 divided into 81, and then solved the latter to get 27--the correct answer to both.]]\n\n{{Title text: Handy exam trick: when you know the answer but not the correct derivation, derive blindly forward from the givens and backward from the answer, and join the chains once the equations start looking similar. Sometimes the graders don't notice the seam.}}","alt":"Handy exam trick: when you know the answer but not the correct derivation, derive blindly forward from the givens and backward from the answer, and join the chains once the equations start looking similar. Sometimes the graders don't notice the seam.","img":"https://imgs.xkcd.com/comics/3x9.png","title":"3x9","day":"28"},{"month":"6","num":760,"link":"","year":"2010","news":"","safe_title":"Moria","transcript":"[[A far shot of Gandalf the Grey and the four hobbits standing in a dark, underground city.]]\nGandalf: Behold, Khazad-Dum; the \nDwarrowdelf\n; the mines of Moria -- once the greatest and mightiest city of the dwarves.\n\n[[Full body shot of Gandalf.]]\nGandalf: But the dwarves delved too greedily. \n\n[[Close-up on Gandalf.]]\nGandalf: \nAnd too deep.\n\n\n[[Full shot of the hobbits and Gandalf.]]\nHobbit: ...and awoke a terror of shadow and flame?\nGandalf: No. They couldn't get out.\n\n{{Title text: Someone should really bring them a ladder and remind them to build the Endless Stair *first* next time.}}","alt":"Someone should really bring them a ladder and remind them to build the Endless Stair *first* next time.","img":"https://imgs.xkcd.com/comics/moria.png","title":"Moria","day":"30"},{"month":"7","num":761,"link":"","year":"2010","news":"","safe_title":"DFS","transcript":"[[A man with wet hair and a towel around his waist thinks with his hand to his chin.]]\nMan: (What situations might I prepare for? 1) medical emergency, 2) dancing, 3) food too expensive...)\n\n[[Close-up on man's face.]]\nMan: (Okay, what kind of emergencies can happen? 1)A) snakebite, B) lightning strike, C) fall from chair...)\n\n[[Still thinking...]]\nMan: (Hmm. Which snakes are dangerous? Let's see... 1)A)a) Corn Snake? b) Garter Snake? c) Copperhead?)\n\n[[Sits down in a chair with a laptop, still wearing towel.]]\nMan: (The research comparing snake venoms is scattered and inconsistent. I'll make a spreadsheet to organize it.)\n\n((Bottom panel is larger than top four, and aligned to right.))\n[[A woman meets the man on his front stoop. She is carrying a purse, and looks down at his towel. The man holds his arms in the air triumphantly.]]\nWoman: I'm here to pick you up. You're not dressed?\nMan: By LDsub50, the Inland Taipan has the deadliest venom of ANY snake! \n\nCaption: I really need to stop using depth-first searches.\n\n{{Title text: A breadth-first search makes a lot of sense for dating in general, actually; it suggests dating a bunch of people casually before getting serious, rather than having a series five-year relationships one after the other.}}","alt":"A breadth-first search makes a lot of sense for dating in general, actually; it suggests dating a bunch of people casually before getting serious, rather than having a series of five-year relationships one after the other.","img":"https://imgs.xkcd.com/comics/dfs.png","title":"DFS","day":"2"},{"month":"7","num":762,"link":"","year":"2010","news":"","safe_title":"Analogies","transcript":"[[Two men sit in front of the TV, one on the couch, the other on the floor. A woman stands by the TV set.]]\nWoman: While I'm up, does anyone want a sandwich?\nMan 1: Is \"sandwich\" a metaphor?\n\nWoman: No, I'm bad at metaphors. But I could try a simile.\nMan 1: I guess that's \nlike\n a metaphor. Sure.\n\n[[As the woman starts to walk away, the men continue to speak.]]\nMan 2: Well, \"a simile is like a metaphor\" is a simile.\nMan 1: Is that simile itself a metaphor for something?\nMan 2: Maybe it's a metaphor for analogy.\n\n[[The two men are still sitting in the same place while the woman is out of the panel.]]\nMan 1: Similes \nare\n metaphors in that they're both analogies.\nWoman: Analogies are like sandwiches in that I'm making one now.\n\n{{Title text: I just call all of them 'synecdoche'.}}","alt":"I just call all of them 'synecdoche'.","img":"https://imgs.xkcd.com/comics/analogies.png","title":"Analogies","day":"5"},{"month":"7","num":763,"link":"","year":"2010","news":"","safe_title":"Workaround","transcript":"[[A man stands at a computer terminal, while another man behind him stands with his head in his hands.]]\n\nMan 1: See, I've got a really good system: if I want to send a YouTube video to someone, I go to File -> Save, then import the saved page into Word. Then I go to \"Share This Document\" and under \"recipient\" I put the email of this video extraction service...\n\nCaption: I'll often encourage relatives to try to solve computer problems themselves by trial and error. However, I've learned an important lesson: if they say they've solved their problem, \nnever\n ask how.\n\n{{Title text: I once worked on a friend's dad's computer. He had the hard drive divided into eight partitions, C: through H:, with a 'Documents' directory tree on each one. Each new file appeared to be saved to a partition at random. I knew enough not to ask.}}","alt":"I once worked on a friend's dad's computer. He had the hard drive divided into six partitions, C: through J:, with a 'Documents' directory tree on each one. Each new file appeared to be saved to a partition at random. I knew enough not to ask.","img":"https://imgs.xkcd.com/comics/workaround.png","title":"Workaround","day":"7"},{"month":"7","num":764,"link":"","year":"2010","news":"","safe_title":"One Two","transcript":"[[A television set with The Count from 'Sesame Street'.]]\n\nThe Count: One! Ah ah ah... Two! Ah ah ah... ...Many! ah ah ah...\n\nCaption: Primitive cultures develop Sesame Street.\n\n{{Title text: Cue letters from anthropology majors complaining that this view of numerolinguistic development perpetuates a widespread myth. They get to write letters like that because when you're not getting a real science degree you have a lot of free time.}}","alt":"Cue letters from anthropology majors complaining that this view of numerolinguistic development perpetuates a widespread myth. They get to write letters like that because when you're not getting a real science degree you have a lot of free time. Zing!","img":"https://imgs.xkcd.com/comics/one_two.png","title":"One Two","day":"9"},{"month":"7","num":765,"link":"","year":"2010","news":"","safe_title":"Dilution","transcript":"[[A man stands at a desk with a beaker in one hand and a turkey baster in the other. A woman lies in a bed in the same room.]]\n\nMan: Okay, this time I've diluted the semen 30x.\nWoman: We'll be \nsure\n to get pregnant now!\n\n{{Title text: Dear editors of Homeopathy Monthly: I have two small corrections for your July issue.  One, it's spelled \"echinacea\", and two, homeopathic medicines are no better than placebos and your entire magazine is a sham.}}","alt":"Dear editors of Homeopathy Monthly: I have two small corrections for your July issue.  One, it's spelled \"echinacea\", and two, homeopathic medicines are no better than placebos and your entire magazine is a sham.","img":"https://imgs.xkcd.com/comics/dilution.png","title":"Dilution","day":"12"},{"month":"7","num":766,"link":"","year":"2010","news":"","safe_title":"Green Flash","transcript":"[[Hatman and Stickman are standing on the beach, watching the sun set. Hatman is holding something, perhaps a cosh, in his left hand.]]\n\nHatman: Did you know that if you stare at the sun just as it sets, you can see a green flash? \n(smaller)And feel a sharp blow to the head, and hear the faint hum of me driving away in your new Tesla Roadster?\n\n{{Title text: The exact cause of the phenomenon is unknown, but it's thought to be linked to atmospheric refraction and you getting a really cool car.}}","alt":"The exact cause of the phenomenon is unknown, but it's thought to be linked to atmospheric refraction and you getting a really cool car.","img":"https://imgs.xkcd.com/comics/green_flash.png","title":"Green Flash","day":"14"},{"month":"7","num":767,"link":"","year":"2010","news":"","safe_title":"Temper","transcript":"[[A black frame with the text [NO VIDEO] in the center, speech is in bubbles.]]\n\nVoice: Sometimes, when we disagree, I feel frustrated. But I never forget how lucky I am to have you in my family. Always remember how special you are.\n\nCaption: 1981: An audio recorder on the set catches Fred Rogers fighting with his wife.\n\n{{Title text: Mr. Rogers projected an air of genuine, unwavering, almost saintly pure-hearted decency. But when you look deeper, at the person behind the image ... that's exactly what you find there, too. He's exactly what he appears to be.}}","alt":"Mr. Rogers projected an air of genuine, unwavering, almost saintly pure-hearted decency. But when you look deeper, at the person behind the image ... that's exactly what you find there, too. He's exactly what he appears to be.","img":"https://imgs.xkcd.com/comics/temper.png","title":"Temper","day":"16"},{"month":"7","num":768,"link":"","year":"2010","news":"","safe_title":"1996","transcript":"[[A man is going through a cardboard box marked \"MISC\", and finds a catalog. A woman looks on.]]\nMan: Check it out -- old \nComputer Shoppers\n! Wow -- in 1996, $3,000 would get you a 100 MHz Pentium system with a parallel port, \ntwo\n serial ports, a 2MB video card, and \"MS-Windows\"\nWoman: \nNice!\n\n\n[[The two are face-to-face, and they each have a separate copy of Computer Shopper.]]\nWoman: And $299 would get you a Palm Pilot 100- -- 16MHz, 128Kb storage, and a memo pad, calendar, and state-of-the-art address book that can store over 100 names!\nMan: Oooh!\n\n[[The man continues to read from his.]]\nMan: And $110 would get you a bulky TI graphing calculator with around 10MHz CPU, 24Kb RAM, and a 96x64-pixel B\nW display!\nWoman: Times sure have... ...have... uh.\n\n[[They both put down their catalogs.]]\nMan: Okay, what the hell, T.I.?\nWoman: Maybe they cost so much now because there's only one engineer left who remembers how to make displays \nthat\n crappy.\n\n{{Title text: College Board issues aside, I have fond memories oi TI-BASIC, writing in it a 3D graphing engine and a stock market analyzer. With enough patience, I could make anything ... but friends. (Although with my chatterbot experiments, I certainly tried.)}}","alt":"College Board issues aside, I have fond memories of TI-BASIC, writing in it a 3D graphing engine and a stock market analyzer. With enough patience, I could make anything ... but friends. (Although with my chatterbot experiments, I certainly tried.)","img":"https://imgs.xkcd.com/comics/1996.png","title":"1996","day":"19"},{"month":"7","num":769,"link":"","year":"2010","news":"","safe_title":"War","transcript":"[[A soldier is on the ground behind a low wall, writing a letter.]]\n\nMy Dearest Cordelia,\n\nIt has been far too long since I last gazed upon your lithe and supple body through my telescopic sights, and I fear you may have found a superior vantage poin--\n\n<<BLAM!>> <<BLAM!>> <<BLAM!>>\n\n--a splendid effort, my love, but your shots find only a decoy, and reveal your position atop the maintenance shed.\n\nI pray this missive and my grenades find you well.\n\nWar is hell.\n\n{{Title text: They offered to make me a green beret, but I liked my regular one. Although it gets kind of squashed under my helmet.}}","alt":"They offered to make me a green beret, but I liked my regular one. Although it gets kind of squashed under my helmet.","img":"https://imgs.xkcd.com/comics/war.png","title":"War","day":"21"},{"month":"7","num":770,"link":"","year":"2010","news":"","safe_title":"All the Girls","transcript":"[[Guy and girl are standing together.]]\n\nGuy: I'm so lucky to have you.\n\nGuy: I love you most out of all the girls in all the world\n\n[[They embrace.]]\nGuy: who love me back.\n\n{{Title text: You know that I'll never leave you. Not as long as she's with someone.}}","alt":"You know that I'll never leave you. Not as long as she's with someone.","img":"https://imgs.xkcd.com/comics/all_the_girls.png","title":"All the Girls","day":"23"},{"month":"7","num":771,"link":"","year":"2010","news":"","safe_title":"Period Speech","transcript":"[[A sword-wielding actor on a stage addresses three others; one has a spear, another a handgun and a knife, and the third a laptop.]]\nActor: Forsooth, do you grok my jive, me hearties?\nActors: Ten-four!\nA few centuries from now, all the English of the past 400 years will sound equally old-timey and interchangeable.\n\n{{Title text: The same people who spend their weekends at the Blogger Reenactment Festivals will whine about the anachronisms in historical movies, but no one else will care.}}","alt":"The same people who spend their weekends at the Blogger Reenactment Festivals will whine about the anachronisms in historical movies, but no one else will care.","img":"https://imgs.xkcd.com/comics/period_speech.png","title":"Period Speech","day":"26"},{"month":"7","num":772,"link":"","year":"2010","news":"","safe_title":"Frogger","transcript":"[[Frogger is standing by the side of the road, looking out into traffic, which includes several semis and a couple sedans.]]\n\n[[Frogger hops out in front of a semi.]]\n<<hop>>\n\n[[The semi swerves into the next lane, in front of one of the sedans.]]\n\n[[They collide, the sedan crumpling into the cab of the truck.]]\n<<BOOM>>\n\n[[Smoke pours from the two wrecked vehicles. Frogger hops back to the side of the road.]]\n<<hop>>\nBystander (off-panel): Oh god!\nOther Bystander (off-panel): Someone call 911!\nAnother Bystander (off-panel): Mom!\n\n{{Title text: I understand you and your team worked hard on this, but when we said to make it more realistic, we meant the graphics.}}","alt":"I understand you and your team worked hard on this, but when we said to make it more realistic, we meant the graphics.","img":"https://imgs.xkcd.com/comics/frogger.png","title":"Frogger","day":"28"},{"month":"7","num":773,"link":"","year":"2010","news":"","safe_title":"University Website","transcript":"[[A venn diagram. The left circle is labeled \"things on the front page of a university website\" and contains \"campus photo slideshow,\" \"alumni in the news,\" \"promotions for campus events,\" \"press releases,\" \"statement of the school's philosophy,\" \"letter from the president,\" and \"virtual tour.\" The right circle is labeled \"things people go to the site looking for\" and contains \"list of faculty phone numbers and emails,\" \"campus address,\" \"application forms,\" \"academic calendar,\" \"campus police phone number,\" \"department\ncourse lists,\" \"parking information,\" and \"usable campus map.\" The only item in the overlapping section is \"full name of school.\"]]\n{{Title text: People go to the website because they can't wait for the next alumni magazine, right? What do you mean, you want a campus map? One of our students made one as a CS class project back in '01!  You can click to zoom and everything!}}","alt":"People go to the website because they can't wait for the next alumni magazine, right? What do you mean, you want a campus map? One of our students made one as a CS class project back in '01!  You can click to zoom and everything!","img":"https://imgs.xkcd.com/comics/university_website.png","title":"University Website","day":"30"},{"month":"8","num":774,"link":"","year":"2010","news":"","safe_title":"Atheists","transcript":"Guy: Personally, I find atheists just as annoying as fundamentalist Christians.\nGirl: Well, the important thing is that you've found a way to feel superior to both.\n\n{{Title text: 'But you're using that same tactic to try to feel superior to me, too!' 'Sorry, that accusation expires after one use per conversation.'}}","alt":"'But you're using that same tactic to try to feel superior to me, too!' 'Sorry, that accusation expires after one use per conversation.'","img":"https://imgs.xkcd.com/comics/atheists.png","title":"Atheists","day":"2"},{"month":"8","num":775,"link":"","year":"2010","news":"","safe_title":"Savannah Ancestry","transcript":"[[A man and woman are at a blackboard with equations and graphs on it.]]\nMan: Look, I'm doing my best, but the fact is your savannah ancestors just didn't prepare you for doing abstract math.\nWoman: See, that's just the kind of bullshit sexism that discredits evo-psych. Your \"evolutionary histories\" always seem tuned to produce 1950's gender roles.\nMan: Evolutionary? What? I meant Savannah, Georgia.\nWoman: ... Hey! Let's leave my mom out of this.\n\n{{Title text: She's a perfectly nice lady from a beautiful city, and there's no reason to be mean just because she thinks a quarterback is a river in Egypt.}}","alt":"She's a perfectly nice lady from a beautiful city, and there's no reason to be mean just because she thinks a quarterback is a river in Egypt.","img":"https://imgs.xkcd.com/comics/savannah_ancestry.png","title":"Savannah Ancestry","day":"4"},{"month":"8","num":776,"link":"","year":"2010","news":"","safe_title":"Still No Sleep","transcript":"[[Woozy person walks and speaks.]]\nPerson: The sleep deprivation madness worsens.\n\n[[Person examines hands.]]\nPerson: Things seem unreal. Am I even awake? Maybe I'm dreaming.\n\n[[Person approaches a tree with a squirrel on it.]]\nPerson: I'm pretty sure I'm hallucinating this tree.\n\nPerson: But what if I'm hallucinating that I'm hallucinating, and I'm actually totally sane?\nSquirrel: Listen.\nSquirrel: I wouldn't worry about that.\n\n{{Title text: I'm not listening to you.  I mean, what does a SQUIRREL know about mental health?}}","alt":"I'm not listening to you.  I mean, what does a SQUIRREL know about mental health?","img":"https://imgs.xkcd.com/comics/still_no_sleep.png","title":"Still No Sleep","day":"6"},{"month":"8","num":777,"link":"","year":"2010","news":"","safe_title":"Pore Strips","transcript":"[[A box of pore strips, marked \"deep cleaning.\"]]\n\n[[Person examinnes the box.]]\n\n[[Person applies strip to face.]]\n\n[[Person pulls on strip.]]\n\n[[Person pulls skull out of head with pore strip.]]\n\n{{Title text: I'm sure they're a harmful tool of the cosmetics-industrial complex and all, but my goodness do those strips ever work to pull gunk out of your pores. I was shocked, disgusted, and vaguely fascinated by the result.}}","alt":"I'm sure they're a harmful tool of the cosmetics-industrial complex and all, but my goodness do those strips ever work to pull gunk out of your pores. I was shocked, disgusted, and vaguely fascinated by the result.","img":"https://imgs.xkcd.com/comics/pore_strips.png","title":"Pore Strips","day":"9"},{"month":"8","num":778,"link":"","year":"2010","news":"","safe_title":"Scheduling","transcript":"[[Pizza guy enters through door; maid is dusting.]]\nPizza Guy: Pizza delivery! Did someone order a hot sausag--\nMaid: Mon dieu! Monsieur is home early--\nBoth: Wait, who are you?\n\nPizza guy: Wait, this is the Jones', right? Their daughter was supposed to be having a party!\nMaid: No, I thought Mr. Jones was coming home early.\n\n[[Pizza guy is off-panel left as plumber enters from the right.]]\nPizza guy: But I thought--\nPlumber: Howdy, Mrs. Jones. I hear you need some plumbi--\nPlumber: Who are you?\n\n[[The pizza guy looks in a cabinet; the others are off-panel right.]]\nMaid: Sorry, big mixup.\nPizza guy: Hey, check out out--the Joneses have Agricola!\nPlumber: I love that game!\n\n[[Mr. Jones and Miss Jones arrive home. Pizza guy, maid, and plumber are sitting on the floor playing Agricola.]]\nMr. Jones: What in the name of ...\nPizza guy: Dammit, I wanted that grain.\nMaid: Hush, you have starting player.\n\n{{Title text: 'How about a little ... *family growth*?'  'Dude, that's not until round two.'}}","alt":"'How about a little ... *family growth*?'  'Dude, that's not until round two.'","img":"https://imgs.xkcd.com/comics/scheduling.png","title":"Scheduling","day":"11"},{"month":"8","num":779,"link":"","year":"2010","news":"","safe_title":"Anxiety","transcript":"[[There is an airport security checkpoint where a queue of ten passengers is waiting to go through a backscatter x-ray scanner. Near the back of the line, Hat Guy is standing next to a stand which says \"Viagra \n $20\". One passenger next to him is drinking a glass of water; another is contemplating the sign.]]\nSecurity Guard (thinking): Oh god.\n\n{{Title text: Don't need any, thanks. I have a backscattering fetish.}}","alt":"Don't need any, thanks. I have a backscattering fetish.","img":"https://imgs.xkcd.com/comics/anxiety.png","title":"Anxiety","day":"13"},{"month":"8","num":780,"link":"","year":"2010","news":"","safe_title":"Sample","transcript":"HOW TO BECOME THE MOST HATED BAND IN THE WORLD:\nRecord an album that's nothing but brilliant, catchy instant classics guaranteed popularity and airtime,\n[[A man driving in a car, hands off the wheel in sudden surprise and confusion.]]\n<<music: So far from hooome but I can't sto-HONK>>\nMan: AUGH! WHAT?\nWith a sample of a car horn, cell phone, or alarm clock inserted randomly in each song.\n{{Title text: There are two or three songs out there with beeps in the chorus that sound exactly like the clock radio alarm I had in high school, and hearing it makes me think my life since junior year has been a dream I'm about to wake up from.}}","alt":"There are two or three songs out there with beeps in the chorus that sound exactly like the clock radio alarm I had in high school, and hearing it makes me think my life since junior year has been a dream I'm about to wake up from.","img":"https://imgs.xkcd.com/comics/sample.png","title":"Sample","day":"16"},{"month":"8","num":781,"link":"","year":"2010","news":"","safe_title":"Ahead Stop","transcript":"[[Words are painted in white on a black road.]]\nBACKWARD.\nI READ\nTHINK\nENGINEERS\nHIGHWAY\n\n{{Title text: They actually started the reversed-text practice in 1973 -- not for ease-of-reading reasons, but because too many people were driving backward down the highway blasting the Star Wars opening theme.}}","alt":"They actually started the reversed-text practice in 1977 -- not for ease-of-reading reasons, but because too many people were driving backward down the highway blasting the Star Wars opening theme.","img":"https://imgs.xkcd.com/comics/ahead_stop.png","title":"Ahead Stop","day":"18"},{"month":"8","num":782,"link":"","year":"2010","news":"","safe_title":"Desecration","transcript":"[[A woman runs up to a man.]]\nWoman: Rob! Rob!\nMan: You look terrified! What's wrong?\nWoman: We've made a huge mistake!\n\n[[The woman and man stand facing each other.]]\nWoman: Remember last week when we dug up all those Indian bones and made puppets out of them?\nMan: Sure...\n\n[[The woman holds her arms out for emphasis, the man puts his hands to his face in horror.]]\nWoman: It turns out they were buried over an \nancient Indian burial ground!\n\nMan: \nOh my God!\n\n\n{{Title text: It gets worse! You know that wizened old monk with the gypsy wife whose voodoo shop we smash up every every day after school?}}","alt":"It gets worse! You know that wizened old monk with the gypsy wife whose voodoo shop we smash up every day after school?","img":"https://imgs.xkcd.com/comics/desecration.png","title":"Desecration","day":"20"},{"month":"8","num":783,"link":"","year":"2010","news":"","safe_title":"I Don't Want Directions","transcript":"[[Full body shot of man on phone.]]\nMan: Looking forward to seeing your new place! What's the address? -- Mm hmm. Yes, I'm taking 495. But I have a GPS, so I really just need the street address.\n\n[[Close up.]]\nMan: ...then south on 18, okay, but I have a GPS, so if you just want to skip to the street address, I can...\n\n[[Full body shot, facing other direction.]]\nMan: Thanks, I'm glad to know Highland Road comes a mile after the big intersection, but I keep saying I \nhave a GPS,\n can you tell me the street address? ... Technically that's just more information on how to get to your place, not the address itself. If you could--\n\n[[Close up again, man writing on pad.]]\nMan: ...I appreciate that you want to help, but I'm \nignoring\n you and just waiting for the... Listen, I just remembered I need to mail you a letter. What's your address? -- Mhm... okay... Great, Thanks! I'll see you in an hour!\n\n{{Title text: Yes, I understand that the turn is half a mile past the big field, but my GPS knows that, too.  This would be easier if you weren't about to ask me to repeat it all back to you.}}","alt":"Yes, I understand that the turn is half a mile past the big field, but my GPS knows that, too.  This would be easier if you weren't about to ask me to repeat it all back to you.","img":"https://imgs.xkcd.com/comics/i_dont_want_directions.png","title":"I Don't Want Directions","day":"23"},{"month":"8","num":784,"link":"","year":"2010","news":"","safe_title":"Falling Asleep","transcript":"[[A man gets into bed.]]\nIt's so much easier\nfalling asleep\n\n[[A woman is lying in bed, gripping her pillow.]]\nWith you beside me--\n\n[[The man is lying on his back in bed.]]\nAll the incentive I need\n\n[[Full shot of the bed, the woman is on the left, gripping the pillow, the man is as far to the right as possible, nearly falling off, facing away from her.]]\nTo leave the world behind.\n\n{{Title text: Sweet unintersecting dreams!}}","alt":"Sweet unintersecting dreams!","img":"https://imgs.xkcd.com/comics/falling_asleep.png","title":"Falling Asleep","day":"25"},{"month":"8","num":785,"link":"","year":"2010","news":"","safe_title":"Open Mic Night","transcript":"[[Woman on stage, holding microphone, hip-hop stance.]]\nWoman: Yo, I'm M.C. Aphasia and I'm here to say that, I... uh... um... hi?\n\n[[Hat man on stage, holding microphone.]]\nHat man: So I... oh? Does she? Well, when \nyo\n mama sits around the house, she finds herself wishing she'd finished her degree instead of having kids right away, maybe started that business. Then she might have created something she's \nproud\n of.\n\n[[Man on stage, holding microphone, fist pumping toward audience.]]\nMan: Yo, I'm M.C. Quine and I'm here to say, \"Yo, I'm M.C. Quine and I'm here to say!\"\n\n[[Beret man on stage, holding microphone.]]\nBeret man: Ever notice how men go to the restroom alone, while women go in hordes ten thousand strong, clad all in sable armor and bristling with swords and spears?\nAudience member: Those are orcs.\nBeret man: Oh.\n\n\n{{Title text: Ever notice how the more successful observational comics become, the more their jokes focus on flying and hotels?}}","alt":"Ever notice how the more successful observational comics become, the more their jokes focus on flying and hotels?","img":"https://imgs.xkcd.com/comics/open_mic_night.png","title":"Open Mic Night","day":"27"},{"month":"8","num":786,"link":"","year":"2010","news":"","safe_title":"Exoplanets","transcript":"[[Beret man runs into the room, someone is in bed under the covers.]]\nBeret man: Wake up! --- Wake up!\nBed man: What is it?\n\n[[Beret man stands talking to person still hiding under covers.]]\nBeret man: We're alive during the time when they're first discovering other planetary systems! They're finding them as fast as they can build new instruments to look for them!\n\n[[Dramatic shot of just Beret man.]]\nBeret man: And if one of Earth's cultures advances its space program enough to start enriching uranium on asteroids, we'll lose the main barrier to restarting Project Orion and building nuke-riding City-ships!\n\n[[Beret man bends down to eye level with person in bed, who is peaking his face out from the covers.]]\nBeret man: The only known technology capable of fast interstellar travel could be operational within just a few generations, and we're discovering all these destinations to pick from! -- Come \non!\n\nBed man: Can I hit \"snooze\"?\nBeret man: Okay, but \njust once!\n\n\n{{Title text: I'm just worried that we'll all leave and you won't get to come along!}}","alt":"I'm just worried that we'll all leave and you won't get to come along!","img":"https://imgs.xkcd.com/comics/exoplanets_2010.png","title":"Exoplanets","day":"30"},{"month":"9","num":787,"link":"","year":"2010","news":"","safe_title":"Orbiter","transcript":"[[A man sits at a control screen, wearing a headset.]]\nMan: Okay, people. The orbiter is passing south of Iceland. The next scheduled check-in will be at 32.0°N 35.5°E, over the Palestinian territories.\nVoice off-screen #1: You mean over the State of Palestine?\nVoice off-screen #2: You mean over \nIsrael\n?\n\n[[The man looks up and says nothing.]]\n\n[[The man looks back down at his screen.]]\nMan: I've rescheduled the check-in for 35.2°N 96.6°W, over Oklahoma.\nVoice off-screen #2: You mean occupied North Texas?\nMan: Dammit, Frank.\n\n{{Title text: Normally, the Shuttle can't quite safely reach the orbital inclination required to pass over both those points from a Canaveral launch, but this is an alternate history in which either it launches from Vandenburg or everyone hates the Outer Banks.}}","alt":"Normally, the Shuttle can't quite safely reach the orbital inclination required to pass over both those points from a Canaveral launch, but this is an alternate history in which either it launches from Vandenberg or everyone hates the Outer Banks.","img":"https://imgs.xkcd.com/comics/orbiter.png","title":"Orbiter","day":"1"},{"month":"9","num":788,"link":"","year":"2010","news":"","safe_title":"The Carriage","transcript":"[[The Grim Reaper driving a horse-drawn carriage.]]\nBecause I could not stop for death\nHe kindly stopped for me\n\n[[A woman wearing her hair in a bun grabs Death by the arm and pulls him off the carriage. There is a Y-button symbol in the lower left corner.]]\nThe carriage held but just oursel--\nDeath: Hey!\n<<GRAB>>\n\n[[The woman takes off in the carriage, leaving Death in her dust, on the ground.]]\nWoman: Hyah!\n\n[[The Grand Theft Auto logo is shown, with the stamp \"Emily Dickinson Edition\" underneath. There is a picture of stick-Emily, arms crossed, and a scythe next to her.]]\n\n{{Title text: I learned from Achewood that since this poem is in ballad meter, it can be sung to the tune of Gilligan's Island.  Since then, try as I might, I haven't ONCE been able to read it normally.}}","alt":"I learned from Achewood that since this poem is in ballad meter, it can be sung to the tune of Gilligan's Island.  Since then, try as I might, I haven't ONCE been able to read it normally.","img":"https://imgs.xkcd.com/comics/the_carriage.png","title":"The Carriage","day":"3"},{"month":"9","num":789,"link":"","year":"2010","news":"","safe_title":"Showdown","transcript":"[[Two cowboys face off silently in the desert, the blazing sun beating down.]]\n\n[[They exchange steely glares, hands poised to reach their guns, as a tumbleweed rolls into frame.]]\n<<TUMBLE>>\n\n[[Close-up on the tumbleweed. It draws two guns.]]\n<<CLICK CLICK>>\n\n[[The tumbleweed shoots both cowboys simultaneously, and they fall backwards.]]\n<<BLAM BLAM>>\n\n{{Title text: The tumbleweed then tried to roll off into the sunset, but due to the Old West's placement north of the subtropical ridge, the prevailing winds were in the wrong direction.}}","alt":"The tumbleweed then tried to roll off into the sunset, but due to the Old West's placement north of the subtropical ridge, the prevailing winds were in the wrong direction.","img":"https://imgs.xkcd.com/comics/showdown.png","title":"Showdown","day":"6"},{"month":"9","num":790,"link":"","year":"2010","news":"","safe_title":"Control","transcript":"A man looks down at his arm calmly, while next to him a woman is violently flailing around in terror. In the foreground, two scientists, one holding a clipboard, look on in puzzlement.\n\nMan: My rash seems to have shrunk by about 20% today.\nWoman: OH GOD SPIDERS\nScientists: ???\n\n{{Title text: Which, at one point, led to a study showing that LSD produces no more hallucinations than a placebo.}}","alt":"Which, at one point, led to a study showing that LSD produces no more hallucinations than a placebo.","img":"https://imgs.xkcd.com/comics/control.png","title":"Control","day":"8"},{"month":"9","num":791,"link":"","year":"2010","news":"","safe_title":"Leaving","transcript":"[[A man looks down at a puddle on the floor and speaks to someone out-of-panel.]]\nMan: Hey, while you're out, can you pick up some spray cleaner that works on cat vomit?\nVoice: Can do! -- Bye!\n\n[[Man extends his arm and faces the leaving person.]]\nMan: ...Wait!\nVoice: Yes?\nMan: Uh. ...You are in my heart always.\nVoice: ...?\n\nSometimes, when people leave, I'm seized by a sudden fear that they'll die while they're out, and I'll never forget the last thing I said to them.\n\n{{Title text: What'll I say -- \"I was staring at some cat vomit when I got the news?\"}}","alt":"What'll I say -- \"I was staring at some cat vomit when I got the news?\"","img":"https://imgs.xkcd.com/comics/leaving.png","title":"Leaving","day":"10"},{"month":"9","num":792,"link":"","year":"2010","news":"","safe_title":"Password Reuse","transcript":"[[A man is sitting facing a computer, Hat man is standing behind him.]]\nHat man: Password entropy is rarely relevant. The real modern danger is password reuse. \nMan: How so? \n(Computer: Password too weak.)\n\n[[Close up on just Hat man.]]\nHat man: Set up a web service to do something simple, like image hosting or tweet syndication, so a few million people set up free accounts.\n\n[[The man has now turned his chair around to face Hat man.]]\nHat man: Bam, you've got a few million emails, default usernames, and passwords.\n\n[[Just Hat man.]]\nHat man: Tons of people use one password, strong or not, for most accounts.\n\nUse the list and some proxies to try automated logins to the 20 or 30 most popular sites, plus banks and payola and such.\n[[A piece of paper containing a list with three columns, titled 'Email', 'User', and 'Pass'. An arrow branching out from the paper to the words 'Banks', 'Facebook', 'Gmail', 'Paypal', and 'Twitter'.\n\n[[Hat man is still standing facing the man in the chair, who now puts his hand to his chin.]]\nHat man: You've now got a few hundred thousand real identities on a few dozen services, and nobody suspects a thing.\nMan: And then what?\n\n[[The same as previous panel, further back.]]\nHat man: Well, that's where I got suck.\nMan: You DID this?\nHat man: Why did you \nthink\n I hosted so many unprofitable web services?\n\n[[Close-up on Hat man.]]\nHat man: I could probably net a lot of money, one way or another, if I did things carefully. But research shows more money doesn't make people happier, once they make enough to avoid day-to-day financial stress.\n\n[[Another close-up, facing opposite direction.]]\nHat man: I could mess with people endlessly, but I do that already. I could get a political or religious idea out to most of the world, but since March of 1997 I don't really believe in anything.\n\n[[Hat man facing man in chair again.]]\nHat man: So, here I sit, a puppetmaster who wants nothing from his puppets. -- It's the same problem Google has.\nMan: Oh?\n\n((This panel is indented.))\nGoogle\n[[A man stands, his chair behind him, leaning his hands on the edge of a boardroom table with the Google logo on it. Behind it sit a woman with a bun and glasses and another man.]]\nMan: Okay, everyone, we control the world's information. Now it's time to turn evil. What's the plan?\nWoman: Make boatloads of money?\n\n[[The man stands with his hand on his head.]]\nMan: We already do!\nVoice off-screen: Set up a companywide CoD4: Modern Warfare tournament each week?\nMan: \nThat's not evil!\n\nVoice: Ooh, dibs on the lobby TV!\nMan: Okay, we \nsuck\n at this.\n\n{{Title text: It'll be hilarious the first few times this happens.}}","alt":"It'll be hilarious the first few times this happens.","img":"https://imgs.xkcd.com/comics/password_reuse.png","title":"Password Reuse","day":"13"},{"month":"9","num":793,"link":"","year":"2010","news":"","safe_title":"Physicists","transcript":"A man stands at a blackboard covered in equations and diagrams, an open laptop and scattered paper at his feet. His fists are balled in anger and there is a little angry squiggle over his head. A second man stands behind him, arms out in a shrug.\n((Words in <> are gray.))\nSecond man: You're trying to predict the behavior of <complicated system>? Just model it as a <simple object>, and then add some secondary terms to account for <complications I just thought of>. -- Easy, right? -- So, why does <your field> need a whole journal, anyway?\nLiberal-arts majors may be annoying sometimes, but there's \nnothing\n more obnoxious than a physicist first encountering a new subject.\n\n{{Title text: If you need some help with the math, let me know, but that should be enough to get you started! Huh? No, I don't need to read your thesis, I can imagine roughly what it says.}}","alt":"If you need some help with the math, let me know, but that should be enough to get you started! Huh? No, I don't need to read your thesis, I can imagine roughly what it says.","img":"https://imgs.xkcd.com/comics/physicists.png","title":"Physicists","day":"15"},{"month":"9","num":794,"link":"","year":"2010","news":"","safe_title":"Inside Joke","transcript":"[[Two men with beards stand at a crude wooden counter, one is wearing a turban. Behind the man without a turban is a woman kneeling on the ground and putting something into a box.]]\nTurban man: Nine silvers for a ham? That's too much!\nNo-turban: Too much? There's a monk out back \nwith a ladder!\n\n(Ha ha ha ha ha ha ha ha...)\nThere's no reason to think that people throughout history didn't have just as many inside jokes and catchphrases as any modern group of high-schoolers.\n\n{{Title text: I've looked through a few annotated versions of classic books, and it's shocking how much of what's in there is basically pop-culture references totally lost on us now.}}","alt":"I've looked through a few annotated versions of classic books, and it's shocking how much of what's in there is basically pop-culture references totally lost on us now.","img":"https://imgs.xkcd.com/comics/inside_joke.png","title":"Inside Joke","day":"17"},{"month":"9","num":795,"link":"","year":"2010","news":"","safe_title":"Conditional Risk","transcript":"[[Lightning strikes the ground, illuminating trees with a bright white light.  Two people are standing near it.  One has a walking stick.]]\n<<CRACK>>\n<<BOOM>>\nFirst person: Whoa! We should get inside!\nSecond person: It's okay! Lightning only kills about 45 Americans a year, so the chances of dying are only one in 7,000,000.  Let's go on!\n\nThe annual death rate among people who know that statistic is one in six.\n\n{{Title text: 'Dude, wait -- I'm not American! So my risk is basically zero!'}}","alt":"'Dude, wait -- I'm not American! So my risk is basically zero!'","img":"https://imgs.xkcd.com/comics/conditional_risk.png","title":"Conditional Risk","day":"20"},{"month":"9","num":796,"link":"","year":"2010","news":"","safe_title":"Bad Ex","transcript":"[[Two people are walking.  The first is wearing a white hat.]]\nSecond person: It just blows my mind. She seemed so genuine. I had no idea she was such a serial liar.\nSecond person: I just wish I had our six months back.\n\n[[The view focuses on the second person.]]\nSecond person: Her exes say the same thing happened to them.\nSecond person: Maybe what we need is a terrible-ex tracking and notification service.\n\n\n[[The second person turns, thoughtfully.]]\nFirst person: But after all the problems with sex offender registries, who would agree to run it?\nSecond person: Maybe one of the state governments more willing to experiment could try it out...\n\nSoon...\n[[Two people are sitting at a table, on which sit wine glasses and plates.  One has glasses and a goatee, and the other has long hair.  A person approaches them carrying a clipboard and a license.]]\nLicense person: Excuse me, ma'am.\nLong hair person: Yes?\nLicense person: This man is known to the state of California to be a total douchebag.\n\n{{Title text: Since the goatee, glasses, and Seltzer & Friedberg DVD collection didn't tip you off, there will be a $20 negligence charge for this service.}}","alt":"Since the goatee, glasses, and Seltzer & Friedberg DVD collection didn't tip you off, there will be a $20 negligence charge for this service.","img":"https://imgs.xkcd.com/comics/bad_ex.png","title":"Bad Ex","day":"22"},{"month":"9","num":797,"link":"","year":"2010","news":"","safe_title":"debian-main","transcript":"<<AAAAAAAA>>\n[[A swarm of insects cover a computer and a person.  The person is leaning back on their chair, flailing to get away.]]\n\nMy package made it into Debian-main because it looked innocuous enough; no one noticed \"locusts\" in the dependency list.\n\n{{Title text: dpkg: error processing package (--purge): subprocess pre-removal script returned error exit 163: OH_GOD_THEYRE_INSIDE_MY_CLOTHES}}","alt":"dpkg: error processing package (--purge): subprocess pre-removal script returned error exit 163: OH_GOD_THEYRE_INSIDE_MY_CLOTHES","img":"https://imgs.xkcd.com/comics/debian_main.png","title":"debian-main","day":"24"},{"month":"9","num":798,"link":"","year":"2010","news":"","safe_title":"Adjectives","transcript":"Frequency with which various adjectives are intensified with obscenities (based on Google hits)\n((The legend above the plot reads:))\nRed marker: \"fucking ____\"\nBlue marker: \"____ as shit\"\n((Mathematical formula for scale next to the legend:))\nScale: ln(hits for intensified phrase \n hits for adjective alone)\n((The plot itself lists a series of adjectives in approximately descending order.  Each has a red and a blue marker corresponding to the scale described.))\n((Horizontal axis starts with none, then has a vertical dashed line, then 'rarely' at -17, increasing to 'often' at -5.))\n((Each adjective is listed with approximate red and blue values, in that order.))\nAnnoying -5 -5\nPissed -5 -6\nStupid -5 -8\nBored -6 -6\nSexy -5.5 -6.5\nAdorable -6.5 -9.5\nDisgusting -6.5 -12.5\nCalm -7 -10\nDelicious -8 -13\nObscene -6 -14 \nProsaic -10 -13.5\nBemused -8.5 -14\nApropos -10.5 -16\nAmbivalent -12 -17\nImproper -12.5 -18\nEvanescent -14 -14.5\nPiquant -9.5 never\nJejune -9 never\nKafkaesque -10 never\nStochastic -14 never\nFungible -12 never\nPeristeronic never never (\"Of or pertaining to pigeons\")\n[[there are two small scenes in the bottom right of the plot.  The first shows a pair of women holding wine glasses.]]\nSecond woman: Yes, the Cabernet is piquant as \nshit\n this time of year.\n[[The second shows a person sitting at a computer desk.]]\nPerson: Whoa, these commodities are fucking \nfungible\n!\n\n{{Title text: 'Fucking ineffable' sounds like someone remembering how to do self-censorship halfway through a phrase.}}","alt":"'Fucking ineffable' sounds like someone remembering how to do self-censorship halfway through a phrase.","img":"https://imgs.xkcd.com/comics/adjectives.png","title":"Adjectives","day":"27"},{"month":"9","num":799,"link":"","year":"2010","news":"","safe_title":"Stephen Hawking","transcript":"[[Stephen Hawking is facing a pair of people.  His voice appears in a square machine readable font.]]\nStephen Hawking: I thought maybe later we should go see a movie.\n\n[[The two people are running.]]\n\n[[The front page of a newspaper appears instead of a third panel.]]\n((Name of the paper.)) The Times\n((Main headline.)) Physicist Stephen Hawking Suggests We See More Films\n[[A picture of Stephen Hawking is in the center of the page.]]\n((Picture's caption.)) Smartest Man Alive\n((Secondary headline.)) What Does He Know That We Don't?\n((Large quote in article body.)) Is this a warning?\n\n[[Stephen Hawking is sitting alone, looking depressed.]]\n\n{{Title text: 'Guys?  The Town is supposed to be good, and I thou--' 'PHYSICIST STEPHEN HAWKING DECLARES NEW FILM BEST IN ALL SPACE AND TIME' 'No, I just heard that--' 'SHOULD SCIENCE PLAY A ROLE IN JUDGING BEN AFFLECK?' 'I don't think--' 'WHAT ABOUT MATT DAMON?'}}","alt":"'Guys?  The Town is supposed to be good, and I thou--' 'PHYSICIST STEPHEN HAWKING DECLARES NEW FILM BEST IN ALL SPACE AND TIME' 'No, I just heard that--' 'SHOULD SCIENCE PLAY A ROLE IN JUDGING BEN AFFLECK?' 'I don't think--' 'WHAT ABOUT MATT DAMON?'","img":"https://imgs.xkcd.com/comics/stephen_hawking.png","title":"Stephen Hawking","day":"29"},{"month":"10","num":800,"link":"","year":"2010","news":"","safe_title":"Beautiful Dream","transcript":"[[A person with disheveled hair stretches their arms.  A sunburst indicating sleepiness is above their head.]]\n<<YAWN>>\nPerson: I just woke up [...]\n\n[[The person continues speaking from off panel, to a second person who's sitting at a table with a laptop and cup.  They've leaned their elbow on the chair, turning to face the first person.]]\nPerson: From the most \nbeautiful\n dream.\nSecond person: Which was?\n\nPerson: All the girls who read and follow \nThe Rules\n and all the guys who swear by the techniques in \nThe Game\n paired off with each other and left the rest of us alone forever.\nSecond person: \nMmmmmm...\n\n\n{{Title text: Lucky. In MY dream, all the people who grew up loving The Giving Tree paired up with all the students who had weird dreams after reading The Metamorphosis. That one was more confusing.}}","alt":"Lucky. In MY dream, all the people who grew up loving The Giving Tree paired up with all the students who had weird dreams after reading The Metamorphosis. That one was more confusing.","img":"https://imgs.xkcd.com/comics/beautiful_dream.png","title":"Beautiful Dream","day":"1"}]
