[{"month":"10","num":800,"link":"","year":"2010","news":"","safe_title":"Beautiful Dream","transcript":"[[A person with disheveled hair stretches their arms.  A sunburst indicating sleepiness is above their head.]]\n<<YAWN>>\nPerson: I just woke up [...]\n\n[[The person continues speaking from off panel, to a second person who's sitting at a table with a laptop and cup.  They've leaned their elbow on the chair, turning to face the first person.]]\nPerson: From the most \nbeautiful\n dream.\nSecond person: Which was?\n\nPerson: All the girls who read and follow \nThe Rules\n and all the guys who swear by the techniques in \nThe Game\n paired off with each other and left the rest of us alone forever.\nSecond person: \nMmmmmm...\n\n\n{{Title text: Lucky. In MY dream, all the people who grew up loving The Giving Tree paired up with all the students who had weird dreams after reading The Metamorphosis. That one was more confusing.}}","alt":"Lucky. In MY dream, all the people who grew up loving The Giving Tree paired up with all the students who had weird dreams after reading The Metamorphosis. That one was more confusing.","img":"https://imgs.xkcd.com/comics/beautiful_dream.png","title":"Beautiful Dream","day":"1"},{"month":"10","num":801,"link":"","year":"2010","news":"","safe_title":"Golden Hammer","transcript":"[[A man with a black hat is going through a door, a bottle in his hand.  A voice speaks to him from off panel.]]\nPerson: Seriously?  This thing runs \nJava\n?  It's single-purpose hardware!\n\n[[The person is sitting at a computer, holding some device which is wired to a box, and pointing at the screen.]]\nPerson: I bet they actually hired someone to spend six months porting this JVM so they could write their 20 lines of code in a familiar setting.\n\n[[The man with a black hat has a pair of bolt cutters in the hand that had been obscured in the first panel.]]\nBlack hat guy: Well, you know what they say -- when all you have is a pair of bolt cutters and a bottle of vodka, everything looks like the lock on the door of Wolf Blitzer's boathouse.\nPerson: I'm glad \nyou\n had a nice night.\n\n{{Title text: Took me five tries to find the right one, but I managed to salvage our night out--if not the boat--in the end.}}","alt":"Took me five tries to find the right one, but I managed to salvage our night out--if not the boat--in the end.","img":"https://imgs.xkcd.com/comics/golden_hammer.png","title":"Golden Hammer","day":"4"},{"month":"10","num":802,"link":"https://xkcd.com/802_large/","year":"2010","news":"Full view <a href=\"https://xkcd.com/802_large/\">here</a>, poster <a href=\"https://store.xkcd.com/products/online-communities-poster\">here</a>. Note: while I was working on this,<br />Ethan Bloch posted <a href=\"http://www.flowtown.com/blog/the-2010-social-networking-map\">his own update</a> of <a href=\"https://xkcd.com/256/\">my 2007 map</a>. Check it out, too!","safe_title":"Online Communities 2","transcript":"[[A giant, untranscribable map of the internet. Apologies from the transcriber, who did her best to include as much as she could without going nuts.]]\n\n((Label in the center of main map.))\nUpdated Map of Online Communities\nSize on map represents volume of Daily Social activity (posts, chat, etc). Based on data gathered over the \nSpring and Summer of 2010\n\n[[Two insets on the upper left-hand corner shows that this map is a tiny portion of the huge continent of Spoken Language, encompassing portions of the Internet, Email, and Cell Phones (SMS).]]\n\n[[The largest landmass on the map by far, which takes up nearly the entire northern half of the map is \"Facebook\" -- with large states in the southeast of the country labeled 'Farmville' and 'Happy Farm'. There is a much smaller state to the west of these called 'Farm Town'. To the north of these states is a large swath of unremarkable land entitled 'Northern Wasteland of Unread Updates.' This is directly north of the large Dopamine Sea.\n\nA peninsula on the southwest, just below the Plains of Awkwardly Public Family Interactions, houses many tiny states, such as MySpace, Orkut, LinkedIn, Bebo, & Hi5. It is bordered on the south by Buzzword Bay, which contains several islands of varying sizes. Among these are YouTube and Twitter (the largest), which are separated by the Social Media Consultant Channel. To the southeast of Twitter, across the Sea of Protocol Confusion, is another, equally large island. Most of it is Skype, with the north having two largish states called AIM and Windows Live Messenger. On the southwest part of the island are two smaller states called GG and Yahoo Messenger.\n\nThe Island of Skype is extremely close to, but separated by the Great Firewall (a dashed line), the large landmass of QQ. It's north shore is the Gulf of China and Grass Mud Horse Bay. Outside of these bays, over the Great Firewall are two islands called Craigslist and 2Channel.\n\nIn the Dopamine Sea, off the southern shores of Farmvile and Happy Farm, is MMO Isle. Its largest state is WoW, with Runescape, Lineage, Maple Story, Habbo, and the Mountains of Steam among its notable landmarks. To the southeast of the island is the Gulf of Lag, in which sits the CDC Games island, with Eve Online.\n\nTo the east of Twitter is Troll Bay, with such islands as Reddit and Reddit, Digg, Stumbleupon, Delicio.us, and Wikipedia Talk Pages. To their south are the IRC isles, of which one is the tiny island of #xkcd.\n\nEast of these islands, and north of Skype island, is the Sea of Memes. In this sea, to the north of Craigslist and 2Channel, is an archipelago of tiny islands. There is an inset, labeled 'Forums.' (See below.)\n\nTo the southwest if Twitter island, in the Sea of Opinions, are the blog islands. These lie south of the islands in Buzzword Bay, as well. The northernmost islands in this group are centered around the Bay of Drama, on which can be found Diary Blogs, Gossip Blogs, and Livejournal. Gossip Blogs share an island with Political, Music, and Tech Blogs. To the north of this island is a smaller island called Photo Blogs. South of Diary Blogs, and off the southwest coast of Music blogs is a smaller island called Fandom Blogs. South of Tech Blogs, off of which sprouts the small peninsula of Business Blogs, is the Spamblog Straits. On the other side of the straits is a large island made up of Miscellaneous Blogs, with two states demarcated as Religious Blogs and Blog Blogs. Southwest of the Blog Islands is the Sea of Zero (0) Comments.]]\n\n[[An inset of a group of islands in the sea of memes located on the lower right corner of the map, labeled 'Forums'. The largest by far is 4chan and \nb\n. Also found here are D2JSP, JLA Frums, Fan Forum, Something Awful, and many smaller ones, too numerous to list here.]]\n\n[[The northeastern third of Gossip\nPolitical\nTech Blogs island is another inset labeled 'Blogosphere (Core)'. This can be found on the lower left corner of the map. Two peninsulas in Political Blogs bookend the Bay of Flame -- these are Liberal Blogs and Conservative Blogs. Between them lie several tiny islands such as Politics Daily, CNN Politcal Ticker, and Mediaite. Off the coast of Liberal Blogs lies the island of NYTimes, off the coast of Conservative Blogs is Libertarian Isle. Between the two lies The Talk. The northern peninsula of Tech Blogs contains places such as Gizmodo, Engadget, Joystiq, and Kotaku.]] \n\n((Text found between the two insets, which are directly below the main map.))\nABOUT THIS MAP\nCommunities rise and fall, and total membership numbers are no longer a good measure of a community's current size and health. This updated map uses size to represent total social activity in a community -- that is, how much talking, playing sharing, or other socializing happens there. This meant some paring of apples and oranges, but I did my best and tried to be consistent.\n\nEstimates are based on the numbers I could find, but involved a great deal of guesswork, statistical inference, random sampling, nonrandom sampling, a 20,000-cell spreadsheet, emailing, cajoling, tea-leafing reading, goat sacrifices, and gut instinct (i.e. making things up).\n\nSources of data include Google and Bing, Wiipedia, Alexa, Big-Boards.com, StumbleUpon, Wordpress, Akismet, every website statistics page I could find, press releases, news articles, and individual site employees. Thanks in particular to folks at Last.fm, LiveJournal, Reddit, and the New York Times, as well as sysadmins at a number of sites who shared statistics on condition of anonymity.\n\n{{Title text: Best trivia I learned while working on this: 'Man, Farmville is so huge! Do you realize it's the second-biggest browser-based social-networking-centered farming game in the WORLD?' Then you wait for the listener to do a double-take.}}","alt":"Best trivia I learned while working on this: 'Man, Farmville is so huge! Do you realize it's the second-biggest browser-based social-networking-centered farming game in the WORLD?' Then you wait for the listener to do a double-take.","img":"https://imgs.xkcd.com/comics/online_communities_2.png","title":"Online Communities 2","day":"6"},{"month":"10","num":803,"link":"","year":"2010","news":"","safe_title":"Airfoil","transcript":"Handling a student who challenges your expertise with an insightful question:\n[[There's a picture of the cross section of an airfoil, with an arrow above and below, pointing from right to left.  Layered on top of these arrows, pointing up and down at the cross section, are a larger arrow below and a smaller arrow above.]]\n((This panel just contains text, and has a speech curlique hanging towards the person in the next panel.))\nTeacher: So, kids, the air above the wing travels a longer distance, so it has to go faster to keep up.  Faster air exerts less pressure, so the wing is lifted upward.\n\nStudent: But then why can planes fly upside down?\n\n((The teacher is standing, pondering the question.  Three arrows point out of this panel, leading to each of the next three panels which are arranged vertically.))\n\n((This is a label at the top of the panel, not a character speaking.))\nRight: \n((This is the character speaking.))\nTeacher: Wow, good question!  Maybe this picture is simplified -- or wrong!  We should learn more.\n\nWrong:\nTeacher: It's... complicated.\nTeacher: And we need to move on.\n\nVery wrong:\nTeacher: Santa Claus is your parents.\n\n{{Title text: This is a fun explanation to prepare your kids for; it's common and totally wrong. Good lines include 'why does the air have to travel on both sides at the same time?' and 'I saw the Wright brothers plane and those wings were curved the same on the top and bottom!'}}","alt":"This is a fun explanation to prepare your kids for; it's common and totally wrong. Good lines include 'why does the air have to travel on both sides at the same time?' and 'I saw the Wright brothers plane and those wings were curved the same on the top and bottom!'","img":"https://imgs.xkcd.com/comics/airfoil.png","title":"Airfoil","day":"8"},{"month":"10","num":804,"link":"","year":"2010","news":"","safe_title":"Pumpkin Carving","transcript":"[[Beret guy stands next to a pumpkin with a picture of a pumpkin carved into it]]\nInterlocutor: So what did you-\nBeretGuy: I carved a pumpkin!\nInterlocutor: ...\n\n[[Black hat guy stands next to a pumpkin and a box labeled \"Nitro-glycerin. Do not shake.\"]]\nInterlocutor: Taking on teen vandals, I see.\nHatGuy: Heavens, No. My pumpkin simply has chest pains. In fact, I'll leave a note \nwarning\n them not to smash it.\n[[Long-haired stick figure stands next to a jack-o'lantern]]\nHairFigure: My pumpkin's name is Harold. He just realized that all the time he used to spend daydreaming, he now spends worrying. He'll try to distract himself later with holiday traditions, but it won't work.\n[[Generic stick figure stands next to two pumpkins and a knife]]\nStickFigure: I carved and carved, and the next thing I knew I had \ntwo\n pumpkins.\nInterlocutor: I \ntold\n you not to take the axiom of choice.\n\n{{Title text: The Banach-Tarski theorem was actually first developed by King Solomon, but his gruesome attempts to apply it set back set theory for centuries.}}","alt":"The Banach-Tarski theorem was actually first developed by King Solomon, but his gruesome attempts to apply it set back set theory for centuries.","img":"https://imgs.xkcd.com/comics/pumpkin_carving.png","title":"Pumpkin Carving","day":"11"},{"month":"10","num":805,"link":"","year":"2010","news":"","safe_title":"Paradise City","transcript":"[[A stick figure sits on a box playing a guitar and singing]]\n\nSinger: Take me down to the paradise city where the grass is green and the girls are pretty.\n\nSinger: Take me down to the paradise village where the grass is green and the cute girls pillage.\n\nSinger: Take me down to the fire-charred counties where the law's restored by Canadian mounties.\n\nSinger: Take me down to Orwellian regions where they retrain girls using cortical lesions\n\nSinger: Take me down to the paradise borough where the grass is labeled 'cause the girls are thorough. Ohh, won't you please take me hooome...\n\n{{Title text: Take me down to the paradise municipality \n where the grass is mauve and the girls aren't fromthisreality.}}","alt":"Take me down to the paradise municipality / where the grass is mauve and the girls aren't fromthisreality.","img":"https://imgs.xkcd.com/comics/paradise_city.png","title":"Paradise City","day":"13"},{"month":"10","num":806,"link":"","year":"2010","news":"","safe_title":"Tech Support","transcript":"[[Person is on the phone, and holding up some networking hardware.]]\nPerson: ... restart my computer? I know you have a script to follow, but the uplink light on the modem is going off every few hours. The problem is between your office and the modem.\n\nPerson: My computer has nothing to do with ... okay, whatever, I \"restarted my computer.\"\nPerson: It's still down, and even if it comes back, it's going to die again in a few hours, because your--\n\nPerson: I don't HAVE a start menu. This is a Haiku install, but that's not import--\nPerson: Haiku? It's an experimental OS that I ... oh, never mind.\n\nPerson: I'm sorry, but this won't get fixed until I talk to an engineer. Can you look around for someone wearing cargo pants, maybe a subway map on their wall?\n\n[[The tech support person on the other end is wearing a headset, and looks around.]]\nTech: There's a chick two phones over with a stuffed penguin doll and a poster of some bearded dudes with swords.\nPerson: Perfect. Can you put her on?\nTech: Sure.\n\n[[Person is now talking to the engineer.]]\nPerson: Hey, so sorry to bother you, but my connection--\nEngineer: Yeah, I see it. Lingering problems from a server move.\n<<type type>>\nEngineer: Should be fixed now.\nPerson: Thank you SO MUCH.\n\nEngineer: No problem. Hey, in the future, if you're on any tech support call, you can say the code word \"shibboleet\" at any point and you'll be automatically transferred to someone who knows a minimum of two programming languages.\n\nPerson: Seriously?\nEngineer: Yup. It's a backdoor put in by the geeks who built these phone support systems back in the 1990's.\nEngineer: Don't tell anyone.\n\nPerson: Oh my god, this is the greatest--\n[[Person wakes up.]]\nPerson: Wha--\nPerson: ... DAMMIT.\n\n{{Title text: I recently had someone ask me to go get a computer and turn it on so I could restart it. He refused to move further in the script until I said I had done that.}}","alt":"I recently had someone ask me to go get a computer and turn it on so I could restart it. He refused to move further in the script until I said I had done that.","img":"https://imgs.xkcd.com/comics/tech_support.png","title":"Tech Support","day":"15"},{"month":"10","num":807,"link":"","year":"2010","news":"","safe_title":"Connected","transcript":"[[A girl sits on a rock and a boy sits on the grass]]\nGirl: Seriously? I like that song too! I bet no two people in the history of the world have ever been so connected!\nCaption: I'm not sure why we romanticize \"young love\".\n\n{{Title text: Or love in general, for that matter. It just leads to the idea that either your love is pure, perfect, and eternal, and you are storybook-compatible in every way with no problems, or you're LYING when you say 'I love you'.}}","alt":"Or love in general, for that matter. It just leads to the idea that either your love is pure, perfect, and eternal, and you are storybook-compatible in every way with no problems, or you're LYING when you say 'I love you'.","img":"https://imgs.xkcd.com/comics/connected.png","title":"Connected","day":"18"},{"month":"10","num":808,"link":"","year":"2010","news":"","safe_title":"The Economic Argument","transcript":"{{A table is labeled with three columns: \"Crazy phenomenon,\" \"If it worked, people would be using it to make a killing in...\" and \"Are they?\"}}\n\nRemote Viewing, Dowsing - Oil Prospecting -\nAuras, Homeopathy, Remote Prayer - Health Care Cost Reduction -\nAstrology, Tarot - Financial\nBusiness Planning -\nCrystal Energy - Regular Energy -\nCurses, Hexes - The Military -\nRelativity - GPS Devices - X\nQuantum Electrodynamics - Semiconductor Circuit Design - X\n\nEventually, arguing that these things work means arguing that modern capitalism isn't THAT ruthlessly profit-focused.\n\n{{Title text: Not to be confused with 'making money selling this stuff to OTHER people who think it works', which corporate accountants and actuaries have zero problems with.}}","alt":"Not to be confused with 'making money selling this stuff to OTHER people who think it works', which corporate accountants and actuaries have zero problems with.","img":"https://imgs.xkcd.com/comics/the_economic_argument.png","title":"The Economic Argument","day":"20"},{"month":"10","num":809,"link":"","year":"2010","news":"","safe_title":"Los Alamos","transcript":"[[Three stick figures stand in front of a few graphs and scientific looking pictures. One of them has hair.]]\nLos Alamos, 1945...\nMiddle Figure: We have a decision. If we've done our math right, this test will unleash heaven's fire and make us as gods.\n\nMiddle figure: But it's possible we made a mistake, and the heat will ignite the atmosphere, destroying the planet in a cleansing conflagration.\n\nLeft figure: Wow. Um. Question: Just to double-check - although I'm 99% sure -\n\nLeft figure: Is it \"Soh cah toa\" or \"coh sah toa\"?\n\nMiddle figure: Oh, for the love of... can someone redo Steve's work?\n\nRight figure: I don't want to do the test anymore.\n\n{{Title text: The test didn't (spoiler alert) destroy the world, but the fact that they were even doing those calculations makes theirs the coolest jobs ever.}}","alt":"The test didn't (spoiler alert) destroy the world, but the fact that they were even doing those calculations makes theirs the coolest jobs ever.","img":"https://imgs.xkcd.com/comics/los_alamos.png","title":"Los Alamos","day":"22"},{"month":"10","num":810,"link":"","year":"2010","news":"","safe_title":"Constructive","transcript":"[[A man is talking to a woman]]\nMan: Spammers are breaking traditional captchas with AI, so I've built a new system. It asks users to rate a slate of comments as \"Constructive\" or \"Not constructive\".\n[[Close up of man]]\nMan: Then it has them reply with comments of their own, which are later rated by other users.\n[[Woman standing next to man again]]\nWoman: But what will you do when spammers train their bots to make automated constructive and helpful comments?\n[[Close up of man again]]\nMan: Mission. Fucking. Accomplished.\n\n{{Title text: And what about all the people who won't be able to join the community because they're terrible at making helpful and constructive co-- ... oh.}}","alt":"And what about all the people who won't be able to join the community because they're terrible at making helpful and constructive co-- ... oh.","img":"https://imgs.xkcd.com/comics/constructive.png","title":"Constructive","day":"25"},{"month":"10","num":811,"link":"","year":"2010","news":"","safe_title":"Starlight","transcript":"[[Girl and beret guy stand under the stars]]\nGirl: The starlight falls on our eyes after a journey across trillions of miles - dying here at last, so far from home, all so we can see some pretty dots.\n[[Beret guy think for a moment, then runs away, comes back with a mirror, and holds it up towards the stars]]\n\n{{Title text: Don't worry! From the light's point of view, home and your eye are in the same place, and the journey takes no time at all! Relativity saves the day again.}}","alt":"Don't worry! From the light's point of view, home and your eye are in the same place, and the journey takes no time at all! Relativity saves the day again.","img":"https://imgs.xkcd.com/comics/starlight.png","title":"Starlight","day":"27"},{"month":"10","num":812,"link":"","year":"2010","news":"","safe_title":"Glass","transcript":"[[Woman is singing, man is staring at a flass of water on a table.]]\nWoman: EEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE... Anything break?\nMan: No, but the water in the glass turned to wine.\n[[Man picks up glass]]\nWoman: Weird.\nMan: No, wait. This is blood.\nWoman: Okay, Physics, quit fucking with us.\nPhysics: You stop looking for the higgs boson and we'll talk.\n\n{{Title text: I read in this one article that the breaking of electroweak symmetry is the reason we have SOULS. This guy with a degree said so!}}","alt":"I read in this one article that the breaking of electroweak symmetry is the reason we have SOULS. This guy with a degree said so!","img":"https://imgs.xkcd.com/comics/glass.png","title":"Glass","day":"29"},{"month":"11","num":813,"link":"","year":"2010","news":"","safe_title":"One-Liners","transcript":"Probability of phrases becoming action movie one liners:\n((Panels are arranged from More Likely on the left to Less likely on the right))\n[[A woman points a gun down at a man who is on the floor, his gun just out of reach]]\nWoman: You're going down the memory hole now, asshole.\n[[Man on ground points gun up at blade-armed man standing next to a board with science on it]]\nMan with gun: Hey! You forgot to carry the two.\n[[Woman on desk points sword at man standing on floor]]\nWoman: Looks like the fed just lowered the interest rate.\n[[Man with gun looks down at woman slumped on floor]]\nMan: Guess you should've scrolled all the way to the bottom before clicking \"agree\".\n[[Woman holds pistol to the back of the head of another woman holding a rifle]]\nWoman with pistol: Bangarang, motherfucker.\n\n{{Title text: 'Upgrade to the latest version of Adobe Flash player to view THIS content, bitch.' ::triggers detonator::}}","alt":"'Upgrade to the latest version of Adobe Flash player to view THIS content, bitch.' ::triggers detonator::","img":"https://imgs.xkcd.com/comics/one_liners.png","title":"One-Liners","day":"1"},{"month":"11","num":814,"link":"","year":"2010","news":"","safe_title":"Diode","transcript":"[[Man is talking to woman. Woman holds up a diode.]]\nMan: We need to talk.\nWoman: Okay, but first hold the end of this diode.\n[[They hold the diode]]\nMan: You hurt my feelings yesterday.\nWoman: You embarassedme with my family last weekend.\n[[They are still holding the diode between them]]\nMan: I'm sorry.\n\n{{Title text: And the worst part is you won't apologize.}}","alt":"And the worst part is you won't apologize.","img":"https://imgs.xkcd.com/comics/diode.png","title":"Diode","day":"3"},{"month":"11","num":815,"link":"","year":"2010","news":"","safe_title":"Mu","transcript":"[[A man spins in circles on a chair next to a desk. A graph of productivity vs Coefficient of friction of desk chair shows a curve that drops off very quickly as the coefficient of friction approaches zero, with the productivity becoming negative at low values. It plateaus in the middle of the graph, and then begins to drop less steeply as coefficient of friction increases above the optimal point.]]\nMan in chair: Wheeeeeeeee\n\n{{Title text: As the CoKF approaches 0, productivity goes negative as you pull OTHER people into chair-spinning contests.}}","alt":"As the CoKF approaches 0, productivity goes negative as you pull OTHER people into chair-spinning contests.","img":"https://imgs.xkcd.com/comics/mu.png","title":"Mu","day":"5"},{"month":"11","num":816,"link":"","year":"2010","news":"","safe_title":"Applied Math","transcript":"[[A woman is standing at a whiteboard considering a logical proof.]]\nWoman #1: Wow. I can't find fault with your proof.\n\n[[The woman is still looking at the white board, the frame expands to show a second woman walking away, rubbing her hands together in an evil manner.]]\nWoman #1: You've show the inconsistency -- and thus the invalidity -- of basic logic itself.\nWoman #2: Excellent, on to step two.\n\n[[The second woman sits down at a desk and begins to write.]]\nDear Dr. Knuth,\n\n[[She continues to write.]]\nI am writing to collect from you the $3,372,564.45 I am owed for discovering 1,317,408 errors in \nThe Art of Computer Programming...\n\n\n{{Title text: Dear Reader: Enclosed is a check for ninety-eight cents. Using your work, I have proven that this equals the amount you requested.}}","alt":"Dear Reader: Enclosed is a check for ninety-eight cents. Using your work, I have proven that this equals the amount you requested.","img":"https://imgs.xkcd.com/comics/applied_math.png","title":"Applied Math","day":"8"},{"month":"11","num":817,"link":"","year":"2010","news":"","safe_title":"Mutual","transcript":"[[A man and a woman are inside each others' thought bubbles.]]\n\n{{Title text: A universe that needed someone to observe it in order to collapse it into existence would be a pretty sorry universe indeed.}}","alt":"A universe that needed someone to observe it in order to collapse it into existence would be a pretty sorry universe indeed.","img":"https://imgs.xkcd.com/comics/mutual.png","title":"Mutual","day":"10"},{"month":"11","num":818,"link":"","year":"2010","news":"","safe_title":"Illness","transcript":"Randall: Hey, everyone--\nRandall: As I mentioned on the blag, I'm going through a rough time right now. I'm dealing with a serious family illness and it's become pretty overwhelming.\nRandall: We're still getting a handle on everything, and I appreciate your patience while we figure it all out.\nRandall: Thank you to everyone who wrote in with kind wishes and words of support. They've been passed on and meant a lot.\nRandall: I like drawing, and might find time for it in the coming weeks, but I'm not going to push myself to stick to a schedule.\nRandall: However, between my stacks of notebooks, scanner, and supportive sysadmin, I should at least have something interesting to share with yyou in this space each M\nW\nF.\nRandall: <3\n\n{{Title text: <3 If there's anything you can do, I'll let you know. For the moment, any simple distracting online games sent to sick@xkcd.com would not be unappreciated.}}","alt":"<3 If there's anything you can do, I'll let you know. For the moment, any simple distracting online games sent to sick@xkcd.com will not go unappreciated [EDIT: Holy crap 2,700 games before noon. I love you guys; thank you. They will be passed along and played by us all.]","img":"https://imgs.xkcd.com/comics/illness.png","title":"Illness","day":"12"},{"month":"11","num":819,"link":"","year":"2010","news":"","safe_title":"Five-Minute Comics: Part 1","transcript":"Because of a family illness, instead of regular comics, this week I'll be sharing some strips that I drew as part of a game I played with friends. Each comic had to be written and drawn in five minutes. -- Randall\n\n----Comic #1----\n[[A man and a woman stand facing each other.]]\nMan: Jupiter will make its closest approach to Earth in decades.\n\n[[The man points behind the woman, and the woman turns around.]]\nMan: In fact, here it comes now!\n\n[[Jupiter, about the size of the characters' heads, hovers into the frame at about head-height.]]\nJupiter: Hey, guys.\n\n[[Jupiter continues to hover through the frame as the characters watch it go.]]\nJupiter: Anyone need a gravitational slingshot?\nWoman: No, I'm good.\nJupiter: Aight.\n\n----Comic #2----\n[[A man sits on a box, playing a guitar.]]\nMan: ...Now I don't blame him 'cause he ran and hid, -- but the meanest thing that he ever did -- was before he left, he went and named me \"Trig.\"\n\n----Comic #3----\n[[A man looks down a well.]]\nMan: Oh God, a little girl is trapped down this well!\n\n[[The man runs off screen.]]\n\n[[He returns, leading a pony.]]\nMan: It's okay, we got you that pony you always wanted!\n\n[[He tries to cram the pony down the well with the aid of a large stick.]]\nMan: Get... in... there... -- Ugh!\n\n----Comic #4----\n[[A man and a woman stand in a server room.]]\nMan: I like to get back to nature by coming out here to the server room. -- The warmth, the whirr of the drives, the drone of the fans, the howl of the wolves...\nWoman: Wolves?\nMan: Yeah, we started a reintroduction program.\n\n----Comic #5----\n[[A man stands by himself in the frame.]]\nMan: Yo momma's so masculine that she... oh, wait, that's your dad. -- Is your mom the lady over by the door? Aww, she looks nice!\n\n----Comic #6----\n[[A man runs toward another man who is wearing a powdered wig, holding a gun in one hand, and a flute in the other. Behind him, someone is chasing him on a motorcycle.]]\nMan: Bach, activate the magic flute and teleport us home! Wagner's right behind me on his Ring Cycle!\n\n----Comic #7----\nHotness Ratings:\n[[A close up of a woman with wavy hair.]]\nIncredily made-up girl on magazine cover.\n((Inset of a man: \"Meh.\"\n\n[[An average girl.]]\nGirl in your bio class.\n((Inset of man: \"Two stars.\"))\n\n[[Girl with mussed hair in over-sized men's shirt.]]\nGirl in your bio class wearing one of your shirts.\nGirl: Want some breakfast?\n((Inset man: \"Four stars.\"\n\n[[Girl with another sort of shirt speaking to an older lady.]]\nGirl in your bio class wearing one of your mom's shirts.\nGirl: Thanks for the great night.\n((Inset man: \"Wat!\"))\n\n[[Creepy-looking girl.]]\nGirl in your bio class wearing your mom's skin like a suit.\nGirl: Give Mommy a hug!\n((Inset man, screaming: \"AAAAAAAA\"))\n\n{{Title text: The wolves thin the RAID arrays, removing the slowest and weakest disks to keep the average seek speed high.}}","alt":"The wolves thin the RAID arrays, removing the slowest and weakest disks to keep the average seek speed high.","img":"https://imgs.xkcd.com/comics/five_minute_comics_part_1.png","title":"Five-Minute Comics: Part 1","day":"15"},{"month":"11","num":820,"link":"","year":"2010","news":"","safe_title":"Five-Minute Comics: Part 2","transcript":"Because of a family illness, instead of regular comics, this week I'll be sharing some strips that I drew as part of a game I played with friends.  Each comic had to be written and drawn in five minutes.\n\n    -- Randall\n\n((A series of comics are arrayed haphazardly.  They will be tackled top to bottom, left to right, approximately.  Strips will be separated by two new lines.))\n\n[[A ninja is hiding under a diving board as a man runs along it.]]\n\n[[The man jumps on the end of the board and hits the ninja in the head, knocking him into the pool.]]\n\n[[The ninja floats in the water.  A bullet passes through the man's head.]]\n<<thwipp>>\n\n[[The man is lying bleeding on the diving board, the ninja is still unconscious on the pool.]]\n\n[[A sniper is at the top of a hill.  The sign in front of the hill says \"Grassy Knoll\".]]\n\n[[Someone is pointing at the diagram of the previous panel.]]\nOff-panel voice: Wait, so \nwhat\n does this have to do with 9\n11, again?\nPerson: I \nsaid\n I'm \ngetting\n there!\n\n\n[[A man is studying a woman.]]\nMan: You look different.\n\nMan: You have this... _glow_ about you.\n\n[[They stare in silence.]]\n\n[[A baby falls out of the woman.]]\n<<plop>>\n\n\nWoman: Cogito ergo cogito.\nOff-panel voice: Playing it safe, huh?\n\n\n[[Two ghosts are standing in front of a woman at a door, each carrying a bag.  They are children dressed up.]]\nChildren: Trick or treat!\n\n[[The woman doesn't move.]]\n\nChild: Um hi.  Why are you just standing there?\nOther Child: Candy?\n\n[[Another silent panel as the children stare up at the woman.]]\n\n[[The second child looks in their bag.]]\nOther Child: Oh God, my bag of candy.\n\nOther Child: It's filling with blood.\nChild: We should go.\n\n\n[[A jet is flying across the panel.]]\nPilot: Bail out! Bail out! Bail out!\n\n[[The pilot and copilot have buckets, and are bailing water out of the cockpit.]]\n\n\nThe following is a dramatization of real events.\n\n[[A person is at a counter, with several jars.]]\nPerson: AAAAAAAAAAAAA I'm making a sandwich! AAAAAAAAAA!\n\n\n[[Two people are carrying lightsabers and wearing robes.]]\nPerson: Oh God.  My eyes won't focus right! And your robe looks... really dirty!\n\nMy blacklightsaber was not a success.\n\n\n[[A person is standing.]]\nPerson: Ladies and gentlemen of the jury.\nOff-screen voice: It seems we happen to be all ladies, actually.\nPerson: ... in that case, this defense is going to appear _extremely_ ill-advised.\n\n\n[[Darth Vader is sitting between two people, at a table.]]\nPerson: Your sad devotion to that ancient religion hasn't hleped you conjur up the stolen data tapes, or given you --\nDarth Vader: \nHey.\n  Wicca is a legitimate belief system!\n\n[[Darth Vader is drawing a pentagram on the table.]]\nPerson: What are you --\nDarth Vader: Putting a _hex_ on your family.\n\n{{Title text: Dear Wiccan readers: I understand modern Wiccans are not usually all about the curses and hexes. But Darth Vader was recently converted from Episcopalianism and he's still figuring it all out.}}","alt":"Dear Wiccan readers: I understand modern Wiccans are not usually all about the curses and hexes. But Darth Vader was recently converted from Episcopalianism and he's still figuring it all out.","img":"https://imgs.xkcd.com/comics/five_minute_comics_part_2.png","title":"Five-Minute Comics: Part 2","day":"17"},{"month":"11","num":821,"link":"","year":"2010","news":"","safe_title":"Five-Minute Comics: Part 3","transcript":"Because of a family illness, instead of regular comics, this week I'll be sharing some strips that I drew as part of a game I played with friends.  Each comic had to be written and drawn in five minutes.\n\n    -- Randall\n\n(( The individual comics are arranged haphazardly.  Once again they will be separated by double newlines, while panels will be separated by single newlines.))\n\nPearl Harbor. November 7th, 1941.\n[[There is a beach, with some ships floating in a crescent shaped harbor.]]\n\n[[The same bay, again.]]\n\n[[The boats continue to move about the harbor.]]\n\n[[The boats do their thing.  A title explains.]]\n(We're going to be here a while, since the attack wasn't until December.)\n\n\n[[A man is sittin gon a bus, a woman in front of him.]]\nI know it's natural and all, but I really wish women on the bus wouldn't try to breastfeed me.\nWoman: C'mon, have some milk. Right here.\nMe: I'm \nreading.\n\n\n\ns\nI think that\nI saw a study once that said that\ng\nInstant persuasiveness multiplier!\n\n\n[[A newspaper front page.  Billy Joel is between two policemen.]]\nTimes\nBilly Joel Arrested for Arson\n\n\n[[One person has a cord leaving their mouth, the other is holding a handset on the end of it to their ear.]]\nHandset: Hee hee hee... *giggle*\nI hear that if you drink coke and eat pop rocks, you vomit up a corded telepohen handset on which you hear creepy little girls giggling.\n\n\n[[Three soldiers are holding a large integral sign, while a fourth points a gun at the Little Rock High School.]]\n1957: Eisenhower orders the military to integrate Little Rock High School.\n\n\n[[A smartphone is vibrating across a table, towards a person.]]\nThe smartphones got \ntoo\n smart... and developed a taste... for BLOOD!\nFortunately, the only way they could move was by turning on their vibrate while on a sloped table.\n\n\n[[A person is reading to their child.]]\nPerson: And the wolf went to see the 38th little pig, who had built his house out of strontium.\nPerson: And the wolf was all, \"Ok, what is \nwith\n this shit?\"\nThe 119 Little Pigs\n\n\n[[Someone is holding up a gun.]]\nPerson: Fastest gun in the west!\n\n[[The gun is galloping across the desert.]]\n<<gallop>> <<gallop>>\n\n[[There is a podium, with a gun in each position.]]\nWinner!\n\n\n[[A picture of a centrifuge dominates the panel.]]\nCentrifuges:\nThey're what separate the men from the boys.\n\n\n[[A computer monitor is plugged in, and cables run into a closet.]]\nLucy: Time passes differenly in Narnia, so by putting the CPU and storage for my machine there, I was able to run through the Folding@Home and Seti@Home databases in about an hour.\nPeter: There are _so_ many problems with that.\n\n\n[[Someone is talking to Alice.]]\nPerson: One of these days, Alice... Wham, zoom, sploosh, fwoom, splash, gurlle, wheeeee, fwoosh, aren't waterslides fun?!\n\n{{Title text: Resulting in The Little Rock 9x + C.}}","alt":"Resulting in The Little Rock 9x + C.","img":"https://imgs.xkcd.com/comics/five_minute_comics_part_3.png","title":"Five-Minute Comics: Part 3","day":"19"},{"month":"11","num":822,"link":"","year":"2010","news":"Guest week! Today's comic is contributed by <a href=\"https://questionablecontent.net\">Jeph Jacques</a>.<br />Five guest comics this week! XKCD should be back to normal after that.","safe_title":"Guest Week: Jeph Jacques (Questionable Content)","transcript":"((This comic was written by Jeph Jacques, and follows the vertical panel style typical of Questionable Content.  The art is more in the xkcd style, with stick figures.))\n[[A girl is sitting on a bench, reading a book.  There is a tree.  Far away, a guy has a backpack on.]]\nGuy's thought bubble: There she is. The most beautiful girl you've ever seen.\n\n[[The focus is on the girl on the bench.]]\nGuy's thought bubble: Every day you take this route to class, she's sitting on that bench, reading.\n\n[[It goes even closer to her face.]]\nGuy's thought bubble: You'd introduce yourself, but you wouldn't know what to say. Besides, she's way out of your league.\n\n[[Back to the full panel.]]\nGuy's thought bubble: What chance could an average guy like you have with such a radiant -\nGirl's thought bubble: Hey.\n\n[[The girl looks up at her thought bubble with a question over her head.]]\nGuy's thought bubble: E-Excuse me?\nGirl's thought bubble: I said hey.  You come by here a lot.\n\n[[The girl looks over at the guy, who is scratching his head at his thought bubble.]]\nGuy's thought bubble: Oh, uh, yeah.  On the way to class.\nGirl's thought bubble: Wanna skip class and go get a coffee?\n\n[[The guy is pondering what's happening.]]\nGuy's thought bubble: Sure, I'd - I'd like that a lot.\nGirl's thought bubble: Great, let's ditch these losers.\nGirl: Hey!\n\n[[The thought bubbles are behind the guy now, moving away.]]\nGuy's thought bubble: Man, I gotta tell you, I'm SICK of being that guy's internal monologue! So whiny!\nGirl's thought bubble: Seriously! I swear, he and Little Miss Daddy Issues over there were _made_ for each other.\n\n[[The two look at each other silently.]]\n\n{{Title text: }}","alt":"Guest comic by Jeph Jacques of Questionable Content, whose internal monologue hasn't been speaking to him for the past three years.","img":"https://imgs.xkcd.com/comics/guest_week_jeph_jacques_questionable_content.png","title":"Guest Week: Jeph Jacques (Questionable Content)","day":"22"},{"month":"11","num":823,"link":"","year":"2010","news":"Guest week! Today's comic is contributed by <a href=\"http://www.buttercupfestival.com\">David Troupes</a>.<br />Five guest comics this week! XKCD should be back to normal after that.","safe_title":"Guest Week: David Troupes (Buttercup Festival)","transcript":"[[Two people are leaning against each other, sitting on top of the moon.  Trees are visible towards the bottom of the panel.]]\n\n[[The scene broadens.]]\nWoman: I've never been so happy.  I --\nMan: Hold on -- that guy used to dump my notebooks in high school.  Give me a moment.  Try to keep the moon steady.\n\n[[A rock hits someone on the ground on the back of the head.]]\n\n[[The person clutches the back of their head.]]\n\n[[The moon, again.]]\nGuy: I've never been so happy.\n\n{{Title text: Guest comic by David Troupes of Buttercup Festival, who is living in that lovely tree outside your window.}}","alt":"Guest comic by David Troupes of Buttercup Festival, who is living in that lovely tree outside your window.","img":"https://imgs.xkcd.com/comics/guest_week_david_troupes_buttercup_festival.png","title":"Guest Week: David Troupes (Buttercup Festival)","day":"23"},{"month":"11","num":824,"link":"","year":"2010","news":"Guest week! Today's comic is contributed by <a href=\"https://foxtrot.com\">Bill Amend</a>.<br />Five guest comics this week! XKCD should be back to normal after that.","safe_title":"Guest Week: Bill Amend (FoxTrot)","transcript":"[[Jason from FoxTrot is sitting at an artist's desk with a pencil, holding a phone.]]\nJason: Hi, Mr. Munroe? I have a great idea! Let me draw some strips for you!\nMr. Munroe, through the telephone:  Fat chance, kid.\n\nJason: Sudo let me draw some strips for you.\n\n((There follow three strips.  These will be separated by double new lines.))\n\n[[A man and woman are looking at each other.]]\nMan: I find you more attractive than usual.\nWoman: You do? Is it my new haircut?\n\nMan: Actually, I think it's all the weight you've been putting on.  Your gravitational pull is pretty severe.\n\n[[The man is now alone in the panel.]]\nMan: Just sayin!\n\n\n[[Two people are in a living room.  The woman is looking through a chest of drawers.]]\nAt home with the Heisenbergs.\nMrs. Heisenberg: I can't find my car keys.\nMr. Heisenberg: You probably know too much about their momentum.\n\n\n[[A man is standing on a stage, holding up a hammer.  A crowd is in front of the stage.]]\nWhy mathematicians should run for Congress\n\nMan: All those in favor of the bill say \"aye.\"\nAudience member #1: Aye.\nAudience member #2: Aye.\nAudience member #3: {{Square root symbol}} -1.\n\n{{Title text: Guest comic by Bill Amend of FoxTrot, an inspiration to all us nerdy-physics-majors-turned-cartoonists, of which there are an oddly large number.}}","alt":"Guest comic by Bill Amend of FoxTrot, an inspiration to all us nerdy-physics-majors-turned-cartoonists, of which there are an oddly large number.","img":"https://imgs.xkcd.com/comics/guest_week_bill_amend_foxtrot.png","title":"Guest Week: Bill Amend (FoxTrot)","day":"24"},{"month":"11","num":825,"link":"","year":"2010","news":"Guest week! Today's comic is contributed by <a href=\"https://overcompensating.com\">Jeffrey Rowland</a>.<br />Five guest comics this week! XKCD should be back to normal after that.","safe_title":"Guest Week: Jeffrey Rowland (Overcompensating)","transcript":"[[Jeffrey Rowland and Randall are sitting together, with a globe between them.  Mr. Rowland has a drink with a small umbrella over it.]]\nJeffrey Rowland: But enough of my theories about Thanksgiving.  The \nreal\n reason we're here is to discuss my hypothesis that dark matter \nitself\n is what consciousness is made of...\n\n[[The frame focuses on Jeffrey Rowland.]]\nJeffrey Rowland: Unobservable to anything that is itself conscious in much the same way the mail-man won't deliver your mail if you are watching the mail-box\n\n[[Mr. Rowland raises his drink.]]\nJeffrey Rowland: Which brings us to my theory about ghosts --\nRandall Munroe: Wait did you just say Thanksgiving was invented by the \nTurkey Voluntary Extinction Movement?\n\n\n{{Title text: Guest comic by Jeffrey Rowland of Overcompensating\nWigu.  Jeffrey is famous as the picture on the Wikipedia article on 'Necrosis'.}}","alt":"Guest comic by Jeffrey Rowland of Overcompensating/Wigu.  Jeffrey is famous as the picture on the Wikipedia article on 'Necrosis'.","img":"https://imgs.xkcd.com/comics/guest_week_jeffrey_rowland_overcompensating.png","title":"Guest Week: Jeffrey Rowland (Overcompensating)","day":"25"},{"month":"11","num":826,"link":"","year":"2010","news":"Guest week! Today's comic is contributed by <a href=\"https://www.smbc-comics.com/\">Zach Weiner</a>.<br />Five guest comics this week! XKCD should be back to normal after that.","safe_title":"Guest Week: Zach Weiner (SMBC)","transcript":"((This comic was drawn by Zach Weiner of Saturday Morning Breakfast Cereal.  It's a floor plan of a museum with five main halls. Each hall contains several exhibits. If you click on an exhibit's spot on the map, a comic pops up showing a view of the exhibit.  The museum map is full of tiny stick figures, many of them characters from xkcd.))\n\n[[Explanatory Text:]]\nIn the spirit of xkcd I present a proposal for a new Smithsonian museum:\nThe Smithsonian Museum Of Dad-Trolling\nAn entire building dedicated to deceiving children for amusement\n\n(Click to view exhibits!)\n\n[[The top left room is 'The Hall of Misunderstood Science'.  It contains six exhibits.]]\n\n[[Exhibit: A giant basilisk looms over children.]]\nExhibit label: BASILISKS: Real, deadly, under your bed.\n\n[[Exhibit: Four magnets hang from a square arch.  A child is touching two of them together.]]\nText on the arch: Magnets only leap at each other when they're teenagers. Later, they lose interest.\n\n[[Exhibit: A child on his dad's shoulders looks up at a looming statue of Jesus behind a lectern.  There are flakes falling from Jesus onto them both.]]\nExhibit label: Snow is Jesus' dandruff. His scalp gets dry when it's cold.\n\n[[Exhibit: A child lies asleep, while hands and a scary face reach up around the bed toward him.]]\nExhibit label: Sleep: Now you're vulnerable to the boogie man!\n\n[[Exhibit: An ice block sits on a stand in front of pictures of a wolf and rhinoceros looking frightened.]]\nExhibit label: Freezing water: Expands to frighten predators.\n\n[[Exhibit: An insect on a stick is orbited by a small sphere.]]\nExhibit label: Anti-matter: Matter that is more than 50% ants.\n\n[[Exhibit: A DNA strand with the letters T, A, C, and G hanging around it.]]\nExhibit label: DNA only has four letters because the alphabet was smaller back then.\nDad, to child: Told you so.\n\n[[Exhibit: A bunch of molecules hang from the ceiling.]]\nExhibit label: Molecules? In my day, we only had atoms!\n\n[[The top right room is 'Regrettable Pranks: An Interactive Experience'.  There are four exhibits.]]\n\n[[Exhibit: Five balloons float tethered to a table.  A child is holding a sixth balloon.  The Dad looks alarmed.]]\nSign on exhibit: If this helium makes your voice go higher, it's because you're ten seconds from exploding.\n\n[[Exhibit: An alien face is shown above an outline of several hands next to a ruler. A child holds his hand up to it.]]\nSign on exhibit: Measure your middle finger. If it's longer than the others, you're an alien halfbreed.\n\n[[Exhibit: Three cups are on a table.  A child is walking away with a fourth cup, the dad's arm around the child's shoulder.]]\nExhibit label: Has anyone seen my rabbit brain? It looks like a cherry, and I dropped it in a Jello cup.\n\n[[Exhibit: A monstrous set of jaws open upward around a bed.]]\nSign on exhibit: Make your bed or monsters will know a kid lives there.\n\n[[The center right room is 'Concessions'.  There are three booths.]]\n\n[[Booth: A concession stand is labeled 'KFP', and displays a KFC-style bucket.  A dad and child are eating.]]\nDad: The \"P\" is for \"phoenix\".\n\n[[Booth: A concession stand.]]\nSign on stand: Ground beef: Beef we found on the ground.\nDad, to child: Told you.\n\n[[Booth: A stand shaped like a giant eye.]]\nBooth label: EYES CREAM\nSubtitle: How did you think it was spelled?\nSign on booth: Now with more of the goo in your eyes. Same as every other creamery.\n\n[[The lower left room is 'Conservatory of Poorly Remembered History'. There are five exhibits.]]\n\n[[Exhibit: A man is riding a dragon.]]\nExhibit label: Genghis Khan: victory through dragons.\n\n[[Exhibit: A criminal in front of some windows.]]\nExhibit label: The Crimean War: The first war against crime.\n\n[[Exhibit: A castle with flags hanging on it.]]\nExhibit label: The Renaissance\nSubtitle: Long story short, the wizards were in control.\n\n[[Exhibit:A man in Jedi-style robes with a fake beard.]]\nExhibit label: Star Wars is a documentary. No, seriously.\nDad, to children: Kids, this man is a veteran.\n\n[[The lower right room is 'Rotunda of Uncomfortable Topics'.  There are five exhibits.]]\n\n[[Exhibit: A wrestling ring, with a man and woman mostly obscured by the exhibit label.]]\nExhibit label: Naked wrestling: perfectly normal. NEVER DO IT.\n\n[[Exhibit: a figure sits at a booth in front of a bowl of food.  The dad is holding a bottle.]]\nExhibit label: Alcohol is poison. I drink to save you from it.\nDad: You're welcome.\n\n[[Exhibit: A large bird.]]\nExhibit label: Mommies get big tummies before babies come because the stork likes chubby girls.\n\n[[Exhibit: A rocket ship.]]\nSign on exhibit: Grandma's not dead. She just returned to saturn. For REVENGE.\n\n[[In the areas outside the rooms, there are two more exhibits and restrooms, all clickable.]]\n\n[[Exhibit: A dinosaur skeleton.]]\nExhibit label: That's right. Dinosaurs were made entirely of BONES.\nDad, to kid: If you think about it, it makes sense.\n\n[[Exhibit: A large image hangs on the wall. It is a dense squiggly jumble of lines.]]\nDad, to kids: You gotta squint juuust right.\nSign on exhibit: Magic eye trick that doesn't actually work.\n\n[[Restrooms: There are three doors, each with a sign.]]\nFirst door (male logo): Men & Boys\nSecond door (female logo): Women & Girls\nThird door (unrecognizable logo): Korgmen & Spangs\n\n{{Title text: Guest comic by Zach Weiner of Saturday Morning Breakfast Cereal. When I was stressed out, Zach gave me a talk that was really encouraging and somehow involved nanobots.}}","alt":"Guest comic by Zach Weiner of Saturday Morning Breakfast Cereal. When I was stressed out, Zach gave me a talk that was really encouraging and somehow involved nanobots.","img":"https://imgs.xkcd.com/comics/guest_week_zach_weiner_smbc.png","title":"Guest Week: Zach Weiner (SMBC)","extra_parts":{"pre":"\n<script language=\"JavaScript\" type=\"text/javascript\"> \nif (!com) var com={};\nif (!com.smbcgc) com.smbcgc={};\ncom.smbcgc = {\n  mouseDownIsBad: false,\n  getBlock: function(name) {\n    if (document.getElementById) {\n      return document.getElementById(name);\n    } else if (document.all) {\n      return document.all[name];\n    } else if (document.layers) {\n      return document.layers[name];\n    }\n  },\n \n  getStyle: function(name) {\n    return com.smbcgc.getBlock(name).style;  \n  },\n \n  showBlock: function(name) {\n    com.smbcgc.getStyle(name).display=\"\";\n  },\n \n  hideBlock: function(name) {\n    com.smbcgc.getStyle(name).display=\"none\";\n  },\n \n  captureMousePosition: function(event) {\n    mouseThing = event.touches ? event.touches[0] : event\n    if (mouseThing.pageX || mouseThing.pageY) {\n      posx = mouseThing.pageX;\n      posy = mouseThing.pageY;\n    } else if (mouseThing.clientX || mouseThing.clientY) {\n      posx = mouseThing.clientX + document.body.scrollLeft + document.documentElement.scrollLeft;\n      posy = mouseThing.clientY + document.body.scrollTop + document.documentElement.scrollTop;\n    } else {\n      posx = 0;\n      posy = 0;\n    }\n    return [posx, posy];\n  },\n \n  onSMBCMapClick: function(event,name,isMouseDown) {\n    if(isMouseDown && (event.touches || com.smbcgc.mouseDownIsBad)) { return; }\n    if(event.touches) { com.smbcgc.mouseDownIsBad = true; }\n \n    pos = com.smbcgc.captureMousePosition(event);\n    var posx = pos[0];\n    var posy = pos[1];\n \n    com.smbcgc.getBlock(\"popupDiv\").innerHTML = \"<img src='//imgs.xkcd.com/comics/guest_comic_week_zach_weiner_smbc_\"+name+\".png'>\";\n \n    var tx = posx-80;\n    var ty = posy-100;\n    tx = tx<0?0:tx;\n    ty = ty<0?0:ty;\n    com.smbcgc.getStyle(\"popupDiv\").left = tx+\"px\";\n    com.smbcgc.getStyle(\"popupDiv\").top  = ty+\"px\";\n    com.smbcgc.showBlock(\"popupDiv\");\n  }\n};\n</script> \n \n<div id=popupDiv style='position:absolute; z-index:10; display:none' onMouseDown='com.smbcgc.hideBlock(\"popupDiv\")'></div>\n","headerextra":"","post":"\n<MAP NAME=\"xkcdtemp_Map\"> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"728,1138, 709,1137, 705,1102, 710,1085, 731,1084\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"1\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"1\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"211,1320, 345,1319, 344,1246, 204,1250\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"2\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"2\",true)'/> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"272,985, 280,956, 333,955, 333,1201, 269,1205, 269,1171, 279,1151, 278,1102, 267,1089, 267,1064, 275,1055\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"3\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"3\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"378,1157, 406,1136, 446,1129, 487,1135, 520,1154, 523,1172, 506,1199, 485,1208, 445,1219, 421,1212, 388,1201, 373,1171\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"4\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"4\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"520,1082, 527,1054, 524,1024, 485,999, 459,974, 465,967, 444,957, 431,925, 400,924, 398,969, 424,1030, 464,1067\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"5\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"5\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"665,975, 633,967, 606,974, 577,994, 570,1020, 568,1049, 578,1066, 587,1072, 626,1049, 657,1009\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"6\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"6\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"570,816, 560,837, 560,870, 581,889, 603,896, 639,898, 647,897, 652,880, 644,865, 616,837, 588,824\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"7\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"7\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"441,875, 463,915, 519,885, 529,850, 500,827, 446,845\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"8\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"8\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"8,1101, 67,1101, 110,1144, 136,1156, 208,1153, 209,1205, 186,1205, 169,1241, 114,1237, 7,1214\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"9\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"9\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"9,984, 36,984, 44,1000, 44,1069, 9,1068\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"10\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"10\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"119,859, 117,900, 40,969, 7,968, 7,863\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"11\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"11\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"153,859, 153,899, 164,909, 226,909, 238,897, 236,854\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"12\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"12\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"536,735, 565,735, 578,720, 602,722, 617,738, 640,737, 642,779, 536,779\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"13\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"13\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"685,583, 676,601, 679,779, 728,779, 726,583\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"14\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"14\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"530,588, 533,627, 543,639, 614,639, 628,627, 625,583\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"15\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"15\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"525,425, 636,424, 638,527, 526,529\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"16\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"16\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"668,415, 726,412, 728,518, 672,525\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"17\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"17\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"625,225, 729,221, 726,301, 689,298, 628,286\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"18\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"18\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"419,343, 499,340, 498,289, 563,291, 564,226, 416,224\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"19\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"19\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"203,614, 202,521, 210,503, 319,500, 319,618\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"20\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"20\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"130,705, 256,705, 259,776, 131,775\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"21\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"21\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"12,699, 44,700, 52,714, 55,729, 65,734, 87,737, 97,754, 94,777, 10,778\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"22\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"22\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"10,569, 78,566, 88,585, 86,662, 13,663\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"23\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"23\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"10,477, 76,475, 87,489, 84,546, 11,547\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"24\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"24\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"10,319, 96,321, 104,342, 105,455, 12,456\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"25\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"25\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"289,303, 310,304, 318,312, 316,357, 314,367, 297,372, 280,365, 272,343, 272,315\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"26\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"26\",true)' /> \n<AREA SHAPE=\"poly\" ALT=\"\" COORDS=\"11,223, 260,226, 260,241, 227,273, 161,297, 87,303, 8,300\" HREF=\"javascript:void(0)\" onTouchStart='com.smbcgc.onSMBCMapClick(event,\"27\",false)' onMouseDown='com.smbcgc.onSMBCMapClick(event,\"27\",true)' /> \n</MAP>","imgAttr":"USEMAP=\"#xkcdtemp_Map\""},"day":"26"},{"month":"11","num":827,"link":"","year":"2010","news":"","safe_title":"My Business Idea","transcript":"[[A man is sitting at his desk, pointing at his laptop.]]\nMan: Dude! I had this idea like five years ago, and some company just got rich doing it! -- I want my cut.\n\n[[The man starts typing.]]\nPerson off-screen: That's not how it works.\nMan: Sure it is. I'm applying for my share now.\nPerson: Wait, what?\n\n[[A browser window with the title 'Department of Ideas'. It has a series of text boxes:\nDate you had the idea:\n\"Like five years ago.\"\nProof you had it:\n\"I told my friend Mike -- you can ask him! I was all \"you know what would make a great business idea? and he...\"\nTheir profit so far:\n$20,000,000\nShare you deserve (be fair!): ((drop-down))\n 25%\n*30%*\n 35%\nMailing address:\n\"137 Ash Tree Ln\"\n\n[[Man still at the laptop, above him is a SUBMIT button, and it shows a pointing hand cursor.]]\nCLICK\n\n((Last panel set slightly lower than the rest.))\n[[The man is in front of an open box, with cash in his hand. A FedEx delivery guy is on the other side of the box with his little electronic signing thing.]]\n\n{{Title text: We didn't believe you at first, but we asked like three people who were at that party. They not only corroborated your story, but even said you totally mentioned wanting to start a company someday. Sorry! If this isn't enough money, let us know.}}","alt":"We didn't believe you at first, but we asked like three people who were at that party. They not only corroborated your story, but even said you totally mentioned wanting to start a company someday. Sorry! If this isn't enough money, let us know.","img":"https://imgs.xkcd.com/comics/my_business_idea.png","title":"My Business Idea","day":"29"},{"month":"12","num":828,"link":"","year":"2010","news":"","safe_title":"Positive Attitude","transcript":"[[A man sits hunched with his knees drawn up to him on a hospital bed, hooked up to an IV. A friend stands by.]]\nMan: I'm sick and I'm scared.\nFriend: Well, remember - having a good attitude is the most important thing. Think positively and you'll get better.\n\n[[Darkness surrounds the man on the bed. The friend is off-screen.]]\nMan: So if I'm sad or afraid or feel like crap sometimes, then...\nFriend: ...then if you don't recover, it will be \nyour fault.\n\n\n[[The man on the bed clutches his hands to his face and leans back.]]\nMan: Well that makes me feel even worse.\nFriend: See? You're doing this to yourself.\nMan: No!\nFriend: Stop it!\nMan: Argh!\n\n[[Close up on the man, holding up his hand, pointing to himself.]]\nMan: Okay, you know what? Screw this. My attitude isn't my problem. -- My \ndisease\n is my problem, and I'm treating it. -- I'm going to be glum and depressed and pessimistic some days, and I'm going to \nget better anyway.\n\n\n[[The man sits on the edge of the bed, his friend still standing in front of him.]]\nMan: Wait, that ended up sounding optimistic.\nFriend: I guess you suck at pessimism.\nMan: Maybe I'll be better at it tomorrow.\n\n{{Title text: Having a positive attitude is almost tautologically good for your mental health, and extreme stress can hurt your immune system, but that doesn't mean you should feel like shit for feeling like shit.}}","alt":"Having a positive attitude is almost tautologically good for your mental health, and extreme stress can hurt your immune system, but that doesn't mean you should feel like shit for feeling like shit.","img":"https://imgs.xkcd.com/comics/positive_attitude.png","title":"Positive Attitude","day":"1"},{"month":"12","num":829,"link":"","year":"2010","news":"","safe_title":"Arsenic-Based Life","transcript":"[[Three people, two women and a man, stand looking at a laptop screen, which is sitting on a desk. The woman with a ponytail is pointing at the screen.]]\nPonytail girl: Our arsenic-based DNA discovery is cool, but these reporters are expecting life on Titan! Our press conference will be such a letdown!\n\n[[Ponytail girl turns around to face the other girl.]]\nPonytail: Okay, we need to make it more exciting for them. How do you make an event entertaining? \nGirl #2: Dunno, I suck at parties. Music, I guess?\n\n[[Ponytail girl turns back around and leans over to start typing on the computer, while the other two look on. The other girl puts her hand to her chin.]]\nPonytail: WikiHow says you can \"serve cocktails and hors d'oerves that fit the theme of your event.\"\nGirl #2: Easy enough!\n\n[[Ponytail girl stands at a podium on a stage, the man stands amongst the audience with a tray. All the audience members are either dead or dying, having fallen onto the floor or slumped over in their seats.]]\n\n{{Title text: According to a new paper published in the journal Science, reporters are unable to thrive in an arsenic-rich environment.}}","alt":"According to a new paper published in the journal Science, reporters are unable to thrive in an arsenic-rich environment.","img":"https://imgs.xkcd.com/comics/arsenic_based_life.png","title":"Arsenic-Based Life","day":"3"},{"month":"12","num":830,"link":"","year":"2010","news":"","safe_title":"Genetic Analysis","transcript":"[[A man stands next to a woman holding a clipboard, she gestures to a comfy-looking chair.]]\nMan: Did my genetic tests come back?\nWoman: Yeah. Sit down.\nMan: Is it bad news? What are my risk factors?\n\n[[The man is now sitting in the chair awaiting her answer. The woman looks down at the clipboard.]]\nWoman: We can't be sure about this, but we've analyzed genes on several of your chromosomes and it's ard to avoid the conclusion:\n\n[[The woman puts down the clipboard and looks at the man as she delivers her news. The man puts his hands to his face in dismay.]]\nWoman: At some point, your parents had sex.\nMan: Oh God!\nWoman: Stay calm! It's possible it was just once!\nMan: I... I need to be alone.\n\n{{Title text: There's still a chance you were conceived via IVF. But we've checked your mom's college yearbook photos, and whether or not she and your father had sex, it's clear that ... listen, I know this is hard for you.}}","alt":"There's still a chance you were conceived via IVF. But we've checked your mom's college yearbook photos, and whether or not she and your father had sex, it's clear that ... listen, I know this is hard for you.","img":"https://imgs.xkcd.com/comics/genetic_analysis.png","title":"Genetic Analysis","day":"6"},{"month":"12","num":831,"link":"","year":"2010","news":"","safe_title":"Weather Radar","transcript":"[[A black dot on a weather radar screen.]]\nDot: Sigh.  Just a few clouds.\n\n[[The clouds develop into orange, to the left of the dot.]]\nDot: Whoa! Huge storm out of nowhere!\n\n[[The orange becomes red, and the storm moves towards the dot.]]\nDot: It's \ngrowing\n! And headed right for me! \nAwesome!\n\n\n[[The storm splits in half.]]\nDot: Hey! What's it...\n\n[[The two halves of the storm pass by the dot.\nDot: Dammit!  \nAgain?!\n\n\n{{Title text: Ever notice how there aren't as many thunderstorms now as there were when you were a kid?  Much like 'the shuffle on my MP3 player has a bias', this is occasionally true but universally believed. Brains are so interesting!}}","alt":"Ever notice how there aren't as many thunderstorms now as there were when you were a kid?  Much like 'the shuffle on my MP3 player has a bias', this is occasionally true but universally believed. Brains are so interesting!","img":"https://imgs.xkcd.com/comics/weather_radar.png","title":"Weather Radar","day":"8"},{"month":"12","num":832,"link":"https://xkcd.com/832_large/","year":"2010","news":"","safe_title":"Tic-Tac-Toe","transcript":"((The comic comprises two large square maps, each divided into nine sections, some of which are further subdivided in the same way.  The subdivisions continue down for up to five levels, and the lower map has more tiny diagrams than the upper. The smallest divisions at every scale are completed tic-tac-toe games.))\n\n[[Explanatory text:]]\nComplete map of optimal Tic-Tac-Toe moves\n\nYour move is given by the position of the largest red symbol on the grid. When your opponent picks a move, zoom in on the region of the grid where they went. Repeat.\n\nMap for X:\n((The first square map))\n\nMap for Y:\n((The second square map))\n\n{{Title text: The only winning move is to play, perfectly, waiting for your opponent to make a mistake.}}","alt":"The only winning move is to play, perfectly, waiting for your opponent to make a mistake.","img":"https://imgs.xkcd.com/comics/tic_tac_toe.png","title":"Tic-Tac-Toe","day":"10"},{"month":"12","num":833,"link":"","year":"2010","news":"","safe_title":"Convincing","transcript":"[[A man and a woman are talking.  The woman has a board.]]\nMan: I think we should give it another shot.\nWoman: We should break up, and I can prove it.\n\n[[The second panel is the graph.  A series of points moves steadily downward.]]\nOur Relationship.\n\n[[The man looks at the graph.]]\nMan: Huh.\n\nMan: Maybe you're right.\nWoman: I knew data would convince you.\nMan: No, I just think I can do better than someone who doesn't label her axes.\n\n{{Title text: And if you labeled your axes, I could tell you exactly how MUCH better.}}","alt":"And if you labeled your axes, I could tell you exactly how MUCH better.","img":"https://imgs.xkcd.com/comics/convincing.png","title":"Convincing","day":"13"},{"month":"12","num":834,"link":"","year":"2010","news":"","safe_title":"Wikileaks","transcript":"[[A black formal suit with no head is talking.]]\nSuit: We are Anonymous. We are legion We are no one and everyone.\nAnd we are here to fight for WikiLeaks.\n\n((The panel is presented a the front page of WikiLeaks, in a browser.))\nNew Leak:\nNames, addresses, IPs, and phone numbers of everyone in Anonymous.\nDownload Now\n\nSuit: ... Dammit, Julian.\n\n{{Title text: STUDENTS ARE CALLING PRESIDENT JOHNSON EN MASSE TO PROTEST THE BOMBING AND IT'S JAMMED THE WHITE HOUSE SWITCHBOARD. COULD THEY COLLAPSE OUR CRITICAL PHONE SYSTEMS? HAS THE FIRST TELEPHONE WAR BEGUN? STAY TUNED FOR MORE ON THIS DANGEROUS NEW TECHNOLOGY.}}","alt":"STUDENTS ARE CALLING PRESIDENT JOHNSON EN MASSE TO PROTEST THE BOMBING AND IT'S JAMMED THE WHITE HOUSE SWITCHBOARD. COULD THEY COLLAPSE OUR CRITICAL PHONE SYSTEMS? HAS THE FIRST TELEPHONE WAR BEGUN? STAY TUNED FOR MORE ON THIS DANGEROUS NEW TECHNOLOGY.","img":"https://imgs.xkcd.com/comics/wikileaks.png","title":"Wikileaks","day":"15"},{"month":"12","num":835,"link":"","year":"2010","news":"","safe_title":"Tree","transcript":"[[There is a binary Christmas tree, with each node a ball, and lights strung between parent and child nodes.  Beneath it is a heap of presents - sorted with the largest on top, smaller presents connected to it with string.  Next to the tree are a kid and his or her parents.]]\nBilly: It's a Christmas tree with a heap of presents underneath!\nMother: ... We're not inviting you home next year.\n\n{{Title text: Not only is that terrible in general, but you just KNOW Billy's going to open the root present first, and then everyone will have to wait while the heap is rebuilt.}}","alt":"Not only is that terrible in general, but you just KNOW Billy's going to open the root present first, and then everyone will have to wait while the heap is rebuilt.","img":"https://imgs.xkcd.com/comics/tree.png","title":"Tree","day":"17"},{"month":"12","num":836,"link":"","year":"2010","news":"","safe_title":"Sickness","transcript":"((The three panels are arranged diagonally, upper left to bottom right.))\n[[Two people are walking past a tree.  One has a hat.]]\nHat person: So, has this sickness opened you up to looking for answers beyond science?\nPerson: ... no, not really.\n\n[[The person turns to face the one with the hat.]]\nPerson: We've groped for comfort before the slings and arrows of fortune for millenia, and I begrudge nobody their sources of solace.  \nBut Science provides \ntools\n.\n$100 billion a year in scientific studies and medical R&D has bought us some pretty damn powerful slings and arrows of our own.\nThis world is amazing, and I'm going to live to experience more of it thanks to people who refused to gracefully accept the ineffability of reality.\nI find my courage where I can, but I take my weapons from science.\n\nPerson: Because they \nwork\n, bitches.\n\n{{Title text: At least, with p<0.05 confidence.}}\n","alt":"At least, with p<0.05 confidence.","img":"https://imgs.xkcd.com/comics/sickness.png","title":"Sickness","day":"20"},{"month":"12","num":837,"link":"","year":"2010","news":"","safe_title":"Coupon Code","transcript":"[[The panel shows an online shopping form.]]\nShipping: $14.08\nTotal:    $80.02\nIf you have a coupon code, enter it here:\n[[An empty form.]]\nCheck out\n\nA person is looking at their computer.\n\n[[The empty form is now filled in - the rest of the panel shows the same page.]]\nForm: In 1987 you quietly took something from the house of a dying woman. You thought nobody knew -- you were wrong.\n\n[[The person is sitting at their computer.]]\n<<Click>>\n\n[[The form is updated.]]\nShipping:   $14.08\nTotal:      $80.02\n----------------\nDiscount\nApplied:   -$80.02\nFinal price: $0.00\nThank you\n- Your order has been placed -\n\n{{Title text: This also guarantees he won't be one of the ones to get a bobcat.}}","alt":"This also guarantees he won't be one of the ones to get a bobcat.","img":"https://imgs.xkcd.com/comics/coupon_code.png","title":"Coupon Code","day":"22"},{"month":"12","num":838,"link":"","year":"2010","news":"","safe_title":"Incident","transcript":"[[Someone is sitting at a computer.  The computer's prompt is shown.]]\nrobm@homebox~$ sudo su\nPassword:\nrobm is not in the sudoers file. This incident will be reported.\nrobm@homebox~$ \n\n[[A second person approaches.]]\nPerson: Hey -- who does sudo report these \"incidents\" \nto\n?\nSecond person: You know, I've never checked.\n\n[[Santa Claus is sitting at a desk supported by candy canes, with a red monitor.  On the wall are two lists labeled 'naughty' and 'nice'.  He is adding a name to the 'naughty' list.]]\n\n{{Title text: He sees you when you're sleeping, he knows when you're awake, he's copied on \nvar\nspool\nmail\nroot, so be good for goodness' sake.}}","alt":"He sees you when you're sleeping, he knows when you're awake, he's copied on /var/spool/mail/root, so be good for goodness' sake.","img":"https://imgs.xkcd.com/comics/incident.png","title":"Incident","day":"24"},{"month":"12","num":839,"link":"","year":"2010","news":"","safe_title":"Explorers","transcript":"[[A black bishop, Ba3, and a white knight, Nc3, are on a three by three chessboard.  Both are on white squares.  There is a heap of supplies at b2, also a white square.  The chessboard is mounted on rockets and appears to be flying through the air.]]\nBa3: Mission Control, come in.  This is Ba3 on the capsule calling Ke5 on the home board.  We're on track and approaching the Coast of Catan.  Our ETA is --\nNc3: Control, this is Nc3. Bishop put all our food in the center so I can't get it. I demand --\nBa3: Control, knight will get his food back when he stops hopping around bragging about how comfy the black squares are.  I swear to God, I'm \nthis\n close to capturing him and completing the mission alone.\n{{Title text: We're going to have to work together to get over our hangups if we're going to learn to move on Catan's hexagonal grid. It's bad enough that we lost our crew of pawns when we passed within firing range of Battleship.}}","alt":"We're going to have to work together to get over our hangups if we're going to learn to move on Catan's hexagonal grid. It's bad enough that we lost our crew of pawns when we passed within firing range of Battleship.","img":"https://imgs.xkcd.com/comics/explorers.png","title":"Explorers","day":"27"},{"month":"12","num":840,"link":"","year":"2010","news":"","safe_title":"Serious","transcript":"[[Someone is standing next to a table.  There is a can on the table.]]\n\n[[The label on the can reads, \"Serious Putty\".]]\n\n[[The person is looking at the table again.]]\n\n[[They reach out to touch the can.  The can speaks.]]\nCan: Don't touch me.\n\n{{Title text: Not to be confused with Serious PuTTY, the Windows terminal client where everything is in Impact.}}","alt":"Not to be confused with Serious PuTTY, the Windows terminal client where everything is in Impact.","img":"https://imgs.xkcd.com/comics/serious.png","title":"Serious","day":"29"},{"month":"12","num":841,"link":"","year":"2010","news":"","safe_title":"Audiophiles","transcript":"[[Two people are talking by telephone.  The first two panels are split diagonally.  The first person is at a store, and the second is consulting with them.]]\n[[The first person has a small box.]]\nPerson: Do we have an RCA-to-3.5mm female-female plug? I'm getting some speakers for the new xBox, since the monitor doesn't have any.\n\nSecond Person: Are they crappy laptop speakers?\n\n[[The person is moving away from a sale rack.  It says \"Sale!!\" several times.]]\nPerson: Does it matter? I just want to hear if I'm getting shot at, not saor eery detail of a beautiful musical soundscape.\nSecond Person: You've never \nheard\n a beautiful musical soundscape. You listen to 96kbps flv rips from YouTube.\n\nPerson: Whatever.  I'm just going to get these $20 speakers.  Five watts will be plenty.  \nSecond Person: Five watts for a living room sound system?  Is that a joke?\n\nPerson: No, this is a joke: How many audiophiles does it take to change a lightbulb?\nSecond Person: How many?\nPerson: I'll tell you later - you wouldn't appreciate the punchline over this 12kbps cell phone codec.\n<<click>>\n\n{{Title text: For years, I took the wrong lesson from that Monster Cable experiment and only listened to my music through alligator-clipped coat hangers.}}","alt":"For years, I took the wrong lesson from that Monster Cable experiment and only listened to my music through alligator-clipped coat hangers.","img":"https://imgs.xkcd.com/comics/audiophiles.png","title":"Audiophiles","day":"31"},{"month":"1","num":842,"link":"","year":"2011","news":"","safe_title":"Mark","transcript":"[[An adult and a child are talking.]]\nChild: What's that on your arm?\nAdult: The mark of a secret society.\n\nChild: If it's secret, why tell me --\nAdult: Because I know nothing.  I can't betray them because I don't know who they \nare.\n  I was chosen by an agent 20 years ago.  That was my first and last direct contact.  It's safer that way.\n\nNarration: Six years later I found a piece of paper in the street with an address on it.  The next day I found a can of kerosene in my garage that I'm sure I never bought.\n[[The panel represents these actions by highlighting the mentioned objects in a world of gray.]]\n\nNarration: I didn't know whose house it was.  I just knew that I'd been given my orders.  And I carried them out.\n[[A dark figure is silhouetted against a flame.]]\n\nAdult: I don't know who or what we're fighting.  \nAdult: Maybe we're the bad guys.  \nAdult: It doesn't matter to me.\n\nAdult: It's enough to know that there are forces working beneath the chaos of life, and I'm a \npart\n of them.\n\nAdult: That whatever this \"pen fifteen\" club is,  \nAdult: I'm \nin\n it.\n\n{{Title text: I'm a solipsistic conspiracy theorist. I'm sure I must be up to something, and I will not stop until I find out what.}}","alt":"I'm a solipsistic conspiracy theorist. I'm sure I must be up to something, and I will not stop until I find out what.","img":"https://imgs.xkcd.com/comics/mark.png","title":"Mark","day":"3"},{"month":"1","num":843,"link":"","year":"2011","news":"","safe_title":"Misconceptions","transcript":"[[A teacher is standing in front of a board, holding a laptop computer and elocuting.]] \nTeacher: Okay, middle school students, it's the first Tuesday in February.\nTeacher: This means that by law and custom, we must spend the morning reading through the Wikipedia article \nList of Common Misconceptions\n, so you can spend the rest of your lives being a little less wrong.\nTeacher: The guests at every party you'll ever attend thank us in advance.\n\n{{Title text: 'Grandpa, what was it like in the Before time?' 'It was hell. People went around saying glass was a slow-flowing liquid. You folks these days don't know how good you have it.'}}","alt":"'Grandpa, what was it like in the Before time?' 'It was hell. People went around saying glass was a slow-flowing liquid. You folks these days don't know how good you have it.'","img":"https://imgs.xkcd.com/comics/misconceptions.png","title":"Misconceptions","day":"5"},{"month":"1","num":844,"link":"","year":"2011","news":"","safe_title":"Good Code","transcript":"((The comic is a flowchart.  In order to explain this in text, follow the line numbers.  Options follow on new lines without numbers.))\nHow to write good code.\n((10.)) Start Project. ((Go to 20.))\n\n((20.)) Do things right or do them fast? \nFast ((Go to 30.))  \nRight ((Go to 40.))\n\n((30.)) Code fast. ((Go to 35.))\n\n((35.)) Does it work yet? \nNo ((Go to 30.))  \nAlmost, but it's become a mass of kludges and spaghetti code. ((Go to 50.))\n\n((40.)) Code well. ((Go to 45.))\n\n((45.)) Are you done yet?\nNo. ((Go to 40.))\nNo, and the requirements have changed. ((Go to 50.))\n\n((50.)) Throw it all out and start over. ((Go to 10.))\n\n((60.)) ? ((Go to 70.))\n\n((70.)) Good code.\n\n {{Title text: You can either hang out in the Android Loop or the HURD loop.}}","alt":"You can either hang out in the Android Loop or the HURD loop.","img":"https://imgs.xkcd.com/comics/good_code.png","title":"Good Code","day":"7"},{"month":"1","num":845,"link":"","year":"2011","news":"","safe_title":"Modern History","transcript":"[[Two soldiers are talking.  Behind them, rubble burns and smokes.]]\nFirst soldier: Will you \nplease\n stop imitating everything I do?\n<<blam blam>>\nSecond soldier: Will you \nplease\n stop...\n<<kaboom>>\nMy hobby: Real-time war reenactment\n\n{{Title text: During the week, I research my character by living in his house and raising his children.}}","alt":"During the week, I research my character by living in his house and raising his children.","img":"https://imgs.xkcd.com/comics/modern_history.png","title":"Modern History","day":"10"},{"month":"1","num":846,"link":"","year":"2011","news":"","safe_title":"Dental Nerve","transcript":"Woman: Dear Ke$ha,\n\nWoman: It's hard to describe the pain of a deeply infected dental nerve.\n\n(continuing) To get an idea, put your hands in a bowl full of ice cubes. Hold them there for 90 seconds. [[Panel shows speaker with her hands in a bowl of ice.]]\n\nNow imagine that pain in your jaw, every minute of every hour, bright and searing, washing out everything. You can't party all night. You can barely stand up. There's only the pain.\n\nWoman: So, some friendly advice: When you wake up in the morning, before you brush your teeth with a bottle of Jack,\n\nWoman: Brush them with actual toothpaste.\n\n{{Title text: WAKE up in the MORning and my BREATH ain't PREtty \n and noBODY'S gonna KISS me if my MOUTH smells SHItty \n so I ALways brush my TEETH before I START on the JACK \n sure, my DRINKing's out of HAND, but I'm conTROLLing my PLAQUE.}}","alt":"WAKE up in the MORning and my BREATH ain't PREtty / and noBODY'S gonna KISS me if my MOUTH smells SHItty / so I ALways brush my TEETH before I START on the JACK / sure, my DRINKing's out of HAND, but I'm conTROLLing my PLAQUE.","img":"https://imgs.xkcd.com/comics/dental_nerve.png","title":"Dental Nerve","day":"12"},{"month":"1","num":847,"link":"","year":"2011","news":"","safe_title":"Stingray Nebula","transcript":"[[Two white figures are silhouetted against a dark sky.  They're sitting on top of a grassy hill.]]\nPerson: I know things are tough right now.  When I was going through some difficult times as a kid, I would go up on the roof and look through my telescope.\n\nPerson: One day I found a tiny star in Ara that seemed friendly.\nPerson: There were millions like it, but I decided that this one was mine.\n\nPerson: When things got bad, I'd go find that star, and think of my favorite Tolkien quote.  It's from Sam's time in Mordor.\n\n((The next panel is diagonally downward to the right of the previous.  The upper left corner overlaps.))\n[[A star is above the highest peak in a chain of mountains.]]\n\"There, peeping among the cloud-wrack above a dark tor high up in the mountains, Sam saw a white star twinkle for a while.  The beauty of it smote his heart, as he looked up out of the forsaken land, and hope returned to him.  For like a shaft, clear and cold, the thought pierced him that in the end the shadow was only a small and passing thing: There was light and high beauty forever beyond its reach.\"\n- The Return of the King\n\nCompanion: That's comforting!\nPerson: It was rather undercut in 1987, when the light from my star's explosion reached Earth.  The debris forms the Stingray Nebula.\n\nCompanion: There's probably a lesson there.\nPerson: \"Never trust an unstable asymptotic giant branch star.  Stick with main sequences and dwarfs.\"\nCompanion: I'll, uh, keep that in mind.\n\n{{Title text: Erendil will patrol the walls of night only until the sun reaches red giant stage, engulfing the Morning Star on his brow. Light and high beauty are passing things as well.}}","alt":"Erendil will patrol the walls of night only until the sun reaches red giant stage, engulfing the Morning Star on his brow. Light and high beauty are passing things as well.","img":"https://imgs.xkcd.com/comics/stingray_nebula.png","title":"Stingray Nebula","day":"14"},{"month":"1","num":848,"link":"","year":"2011","news":"","safe_title":"3D","transcript":"[[People are lined up to see a movie.]]\nPremiering Tonight:\nString Theory:\nAn expose\nPresented In\n3D!\n\n[[The people are in a dark theater, fiddling with their glasses.]]\n<<???>>\n\n[[The people approach black hat guy, who's sitting at a desk.]]\nPerson #1: Your movie was a ripoff.\nPerson #2: It wasn't 3D at all!\nBlack hat guy: Was too.\nBlack hat guy: It's just that the third dimension is tightly rolled up and too small to observe at normal energies.\n\n{{Title text: The LINACs in the glasses frames can barely manage one MeV. You should've gone to the screening at CERN.}}","alt":"The LINACs in the glasses frames can barely manage one MeV. You should've gone to the screening at CERN.","img":"https://imgs.xkcd.com/comics/3d.png","title":"3D","day":"17"},{"month":"1","num":849,"link":"","year":"2011","news":"","safe_title":"Complex Conjugate","transcript":"[[A teacher is standing at a whiteboard covered in equations.]]\nTeacher: Okay, anyone who's feeling like they can't handle the physics here should probably just leave now.\n\nTeacher: Because I'm multiplying the wavefunction by its complex conjugate.\nTeacher: That's right.\n\n[[Dramatic zoom.  It appears the teacher is writing on the side of the panel.]]\nTeacher: Shit just got \nreal\n.\n\n{{Title text: Fun fact: if you say this every time a professor does something to a complex-number equation that drops the imaginary part, they'll eventually move the class to another room and tell everyone else except you.}}","alt":"Fun fact: if you say this every time a professor does something to a complex-number equation that drops the imaginary part, they'll eventually move the class to another room and tell everyone else except you.","img":"https://imgs.xkcd.com/comics/complex_conjugate.png","title":"Complex Conjugate","day":"19"},{"month":"1","num":850,"link":"https://xkcd.com/850_large/","year":"2011","news":"","safe_title":"World According to Americans","transcript":"The World\nAccording to a group of\nAmericans\nWho turned out to be unexpectedly good at geography, derailing our attempt to illustrate their country's attitude toward the rest of the world.\n\n((One big panel, a map of the world.  Fairly accurate.  Annotated in several different scripts of handwriting.  These are transcribed in approximately left to right, top to bottom order.  Some are written paired and appear as such.))\n Hey so what projection should we use?\n I'll aim for \"Robinson.\"\n\nAlaska\n\nCanada\n\nHudson Bay\n\nQubec\n\nGreenland (still too big!)\n Yeah but the Peters map is awful\n\nUnited States\n\n Did you know Maine is actually the US state closest to Africa?\n\nBaja California (Mexico)\n\nMexico\n\nGulf of Mexico\n\nCuba\n\nHispanola\n\nBermuda (British!)\n\nCentral America\n\nJamaica\n\n Do we have to label all the Virgin Islands?\n\nPanama Canal\n\n French, and I think Dutch and English\n\nBrazil (Portuguese - speaking)\n\n Rest of South America (Spanish-speaking)\n\nTierra del Fuego\n\n\nIceland\n\nBritish Isles\n\nIreland\n\nGibraltar\n\nWestern Europe\n\nScandinavia\n\nEastern Europe\n\nBlack Sea\n\nMiddle East\n\n\nMorocco\n\nAlgeria\n\nSahara Desert\n\nWest Africa\n\nSudan\n\n So this is one of those things where you point out our ignorance and stereotypes?\n Yeah - I mean I freely admit I don't know the African map very well, which speaks volumes in itself.\n\nRainforest\n\nDRC\n\nLake Victoria\n\nSomalia\n\nAngola\n\nMozambique\n\nSouth Africa\n\nCape Horn\n\nMadagascar\n\n\nRussia\n\nKamchatka Peninsula but I admit I only know this one from Risk\n\nAral Sea (Gone)\n\nVarious former Soviet States\n\nMongolia\n\nAfghanistan & Pakistan\n\nIndia\n\n Mostly Muslim\n\n Mostly Hindu\n\nSri Lanka\n\nTibet (informal)\n\nChina\n\nSoutheast Asia\n\nKoreas\n\nJapan, duh.\n\nTaiwan (actually called \"The Republic of China\" - it's complicated\n\nPhillipines\n\nMalaysia\n\n Boxing Day Quake\n Wait, \"Boxing day\"? There's no way you're American.\n I read BBC News, OK?\n\nIndonesia\n\nSulawesi\n\nPaupa New Guinea\n\nAustralia\n\nTasmania\n\nNew Zealand\n\n Shall we include Antarctica?\n Let's not - these guys are looking impatient.\n\n{{Title text: It's not our fault we caught a group on their way home from a geography bee. And they taught us that Uzbekistan is one of the world's two doubly-landlocked countries!}}","alt":"It's not our fault we caught a group on their way home from a geography bee. And they taught us that Uzbekistan is one of the world's two doubly-landlocked countries!","img":"https://imgs.xkcd.com/comics/world_according_to_americans.png","title":"World According to Americans","day":"21"},{"month":"1","num":851,"link":"https://xkcd.com/851_make_it_better/","year":"2011","news":"I can't <em>believe</em> I forgot Hey Jude.<br />I don't get do-overs, but I couldn't resist making <a href=\"https://xkcd.com/851_make_it_better/\">a fixed version</a>.","safe_title":"Na","transcript":"{{A flowchart.}}\nNa->Na->Na->Na->Na->Na->Na->Na (branches to ->Hey->Hey->Goodbye and ->Batman!) ->Na->Na (branches to Katamari Damacy!) ->Na (arrow labeled \"Land of 1,000 Dances) loops around to the last Na again)\n\n{{Title text: I hear that there are actual lyrics later on in Land of 1,000 Dances, but other than the occasional 'I said,' I've never listened long enough to hear any of them.}}","alt":"I hear that there are actual lyrics later on in Land of 1,000 Dances, but other than the occasional 'I said,' I've never listened long enough to hear any of them.","img":"https://imgs.xkcd.com/comics/na.png","title":"Na","day":"24"},{"month":"1","num":852,"link":"","year":"2011","news":"","safe_title":"Local g","transcript":"He: Did you know that because of centrifugal* force and the shape of the Earth, \"gravity\" can vary by nearly half a percent between major cities?\n*Yes, centrifugal. xkcd.com\n123\n\nHe: That's not a lot, but it could affect, say, pole vaulting. In a 5m jump, it could make a difference of 2cm.\n\nShe: Huh, interesting.\nHe: I'm going to write an article reevaluating vaulting records to take this into account.\n\nThree days later:\nShe: Good job. There's an angry mob of athletes outside.\n\n[[He looks off the balcony. The mob of athletes is out of frame.]]\nAthlete: That record was mine!\nAthlete: How dare you cast doubt on our honor?\nAthlete: Have you no respect?!\nAthlete: Make him pay!\nHe: Hey, the math doesn't lie. Suck it, jocks.\n\nShe: Dude, don't provoke them.\nHe: Whatever. The building's locked. Let 'em vent for a--\n<<crash>>\nOff-panel Athlete: GET HIM!\n\nHe: Crap!\nHe: How did the pole vaulters get up to our balcony?\n\nShe: ...\n\n[[Beat frame]]\n\nShe: That might be the stupidest question I've ever heard.\nHe: Right.\n\n{{Title text: In Rio de Janeiro in 2016, the same jump will get an athlete 0.25% higher (>1cm) than in London four years prior.}}","alt":"In Rio de Janeiro in 2016, the same jump will get an athlete 0.25% higher (>1cm) than in London four years prior.","img":"https://imgs.xkcd.com/comics/local_g.png","title":"Local g","day":"26"},{"month":"1","num":853,"link":"","year":"2011","news":"","safe_title":"Consecutive Vowels","transcript":"He: I was running a factor analysis on this huge database, and check out what it found:\n[[He holds up the chart.]]\n\n[[It's a graph plotting \"sexual arousal\" against \"consecutive vowels.\" The trendline is a smooth exponential curve.]]\n\nShe: Huh? This chart makes no sense. What--\nHe: \"Queueing\"\n\n[[She grabs him.]]\nShe: FUCK ME NOW.\n\n{{Title text: But the windows! What if there's a voyuer watchi-- wait, now I'm turned on too.}}","alt":"But the windows! What if there's a voyeur watchi-- wait, now I'm turned on too.","img":"https://imgs.xkcd.com/comics/consecutive_vowels.png","title":"Consecutive Vowels","day":"28"},{"month":"1","num":854,"link":"","year":"2011","news":"","safe_title":"Learning to Cook","transcript":"{{A flowchart.}}\n\nI should cook more! -> Buy ingredients -> Put some in a pan -> Cook -> Does it taste good? -> (arrows marked \"Kinda\" and \"No\" both lead to) Put leftovers in fridge -> (hours pass) -> Order pizza -> (days pass) -> Throw away leftovers -> (weeks pass) -> Throw away remaining ingredients as they go bad -> (months pass) -> (arrow leads back to beginning)\n\n{{Title text: And yet I never stop thinking, 'sure, these ingredients cost more than a restaurant meal, but think how many meals I'll get out of them! Especially since each one will have leftovers!'}}","alt":"And yet I never stop thinking, 'sure, these ingredients cost more than a restaurant meal, but think how many meals I'll get out of them! Especially since each one will have leftovers!'","img":"https://imgs.xkcd.com/comics/learning_to_cook.png","title":"Learning to Cook","day":"31"},{"month":"2","num":855,"link":"","year":"2011","news":"","safe_title":"1999","transcript":"[[Inverted intro panel]] \nIt's easy to forget, as we heap awards on The Social Network,\nThat before there was Facebook, MySpace, or even Friendster...\nOne website dreamed bigger than them all.\n\n[[Two guys talking]]\nGuy #1: People like doing stuff, so why not build a website that offers that?\nGuy #2: Offers what? What would I do there?\nGuy #1: Anything!  The only limit is yourself!\n\n[[Guy runs in.  Two guys are by a computer, one sitting at it wearing headphones.]]\nGuy running in: Hey, we need more--\nStanding guy: Don't--he's wired in.\nGuy at computer: THE INFINITE IS POSSIBLE.\nStanding guy: Or baked. It's hard to tell.\n\n[[Two guys are sitting at a restaurant booth.]]\nGuy #1: It's time to monetize. We could make millions!\nGuy #2: No way. A million dollars isn't cool. You know what's cool?\nGuy #1: A billio--\nGuy #2: CIRCLES.\n\n[[View from booth of a guy leaving, turning back to say something.]]\nGuy: Heya tip: Drop the dot.  Just \"Zombocom\". It's cleaner.\n\n{{Title text: 'Whoa, twenty-two in two hours!' 'Your site got twenty-two hundred hits in two hours?' 'No. Twenty-two. But still, that's like half the people on the internet!'}}","alt":"'Whoa, twenty-two in two hours!' 'Your site got twenty-two hundred hits in two hours?' 'No. Twenty-two. But still, that's like half the people on the internet!'","img":"https://imgs.xkcd.com/comics/1999.png","title":"1999","day":"2"},{"month":"2","num":856,"link":"","year":"2011","news":"","safe_title":"Trochee Fixation","transcript":"Girl: Robot ninja! Pirate doctor laser monkey! Narwhal zombie badger hobo bacon kitty captain penguin raptor jesus!\n\nScientist (to guy): We'd been seeing this brain damage for years, but only recently did our linguists identify the pattern behind it.\n\nScientist: The patients fixate on animals and types of people whose names are trochees (two syllables, with the accent on the first).\n\nThe malfunction causes a rush of dopamine whenever these trocheese are heard or spoken.\n[[Chart shows \"internet\" and \"brain,\" with arrows marked \"trochees\" traveling both ways between them. An arrow marked \"dopamine\" loops from the brain back to the brain.]]\n\nThe warning signs appear in childhood:\n[[Child sits in front of TV.]]\nChild: Yeah! Mighty teenage morphin' ninja power mutant turtle rangers!\nSocial reinforcement focuses the fixation on a few dozen words.\nGuy (off-panel): Is there a cure?\n\n[[Girl is reclining under a big machine pointed at her face.]]\nScientist: We're about to try a radical trocheeotomy.\nGuy: Rip out her vocal chords? I'm in favor.\nScientist: No, we're modifying her vocabulary* to erase the words she's fixated on.\n*Digitoneurolinguistic hacking! It's totally real! Ask Neal Stephenson.\n\nScientist: Either the gap will be filled by normal words, or she'll just generate a new set of trochees.\nScientist: Here goes.\n[[She pulls the lever on a large panel.]]\n<<kachunk bzzzZZZZZZ>>\n\n[[Girl is waking up.]]\nGirl: ... GzZhRmPh ...\nGirl ... banjo turtle!\nGirl: Jetpack ferret pizza lawyer! Dentist hamster wombat plumber turkey jester hindu cowboy hooker bobcat scrapple!\nScientist (off-panel): Sigh.\nScientist: Time for plan B.\nScientist: Someone get a brick.\n\n{{Title text: If you Huffman-coded all the 'random' things everyone on the internet has said over the years, you'd wind up with, like, 30 or 40 bytes *tops*.}}","alt":"If you Huffman-coded all the 'random' things everyone on the internet has said over the years, you'd wind up with, like, 30 or 40 bytes *tops*.","img":"https://imgs.xkcd.com/comics/trochee_fixation.png","title":"Trochee Fixation","day":"4"},{"month":"2","num":857,"link":"","year":"2011","news":"","safe_title":"Archimedes","transcript":"Guy: In the words of Archimedes,\n\nGuy: Give me a long enough lever and a place to rest it,\n\n[[Guy pulls out a gun.]]\nGuy: Or I will kill one hostage every hour.\n\n{{Title text: Give a man a fish, or he will destroy the only existing vial of antidote.}}","alt":"Give a man a fish, or he will destroy the only existing vial of antidote.","img":"https://imgs.xkcd.com/comics/archimedes.png","title":"Archimedes","day":"7"},{"month":"2","num":858,"link":"","year":"2011","news":"","safe_title":"Milk","transcript":"[[Couple sitting opposed, woman on couch reading book and man on a chair with a laptop]]\n\nWoman: The fact that I have breasts doesn't mean you could milk me now. I'd have to be lactating.\n\n[[a beat passes]]\n\nMan (thinking): Oh my god. She's psychic!\n\n{{Title text: It's not hard when you have the same thought like 40 or 50 percent of the time.}}","alt":"It's not hard when you have the same thought like 40 or 50 percent of the time.","img":"https://imgs.xkcd.com/comics/milk.png","title":"Milk","day":"9"},{"month":"2","num":859,"link":"","year":"2011","news":"","safe_title":"(","transcript":"(An unmatched left parenthesis creates an unresolved tension that will stay with you all day.\n\n{{Title text: Brains aside, I wonder how many poorly-written xkcd.com-parsing scripts will break on this title (or \\;;\"''{<<[' this mouseover text.\"}}","alt":"Brains aside, I wonder how many poorly-written xkcd.com-parsing scripts will break on this title (or ;;\"''{<<[' this mouseover text.\"","img":"https://imgs.xkcd.com/comics/(.png","title":"(","day":"11"},{"month":"2","num":860,"link":"","year":"2011","news":"","safe_title":"Never Do This","transcript":"[[Guy brings in a pocket microscope]]\nGuy: Check it out - a pocket microscope!\nGirl: Ooh! Let's look at stuff!\n\n[[Guy holds a pencil; girl peers at a quarter through the microscope]]\nGuy: The tip of this pencil is neat!\nGirl: This quarter is really scratched.\n\nGuy: Let's look at the skin under our fingernails!\n\nMinutes later...\n[[Guy and girl curl up in a pit of despair]]\nGuy and girl: oh god oh god\n\n{{Title text: I call Rule 34 on The Secret House.}}","alt":"I call Rule 34 on The Secret House.","img":"https://imgs.xkcd.com/comics/never_do_this.png","title":"Never Do This","day":"14"},{"month":"2","num":861,"link":"","year":"2011","news":"","safe_title":"Wisdom Teeth","transcript":"Guy, on phone: Hey! Know how you've been bugging me to play Minecraft for the past year? I'm game.\nGirl, on phone: But you said you didn't want to \"get hooked and spend days on end moving virtual cubes around while sitting motionless.\" What changed?\n\nGuy, on phone: I'm having my wisdom teeth out, and I'll be useless and doped up on painkillers for the next few days, so that actually sounds like the perfect distraction.\nGirl, on phone: Oh. I'll set you up on our server!\n\n72 hours later...\n[[Girl sitting at computer.]]\nGirl, on phone: Hey -- starting to feel better? Enjoying the game? Let's see what you've... What the hell? Where IS everything?\n\n[[View of a Minecraft screen showing a vast empty expanse of land.]]\nGirl, offscreen: ... You made the entire continent perfectly flat?\nGuy, offscreen: And sorted it into layers.\nGirl, offscreen: ...\nGuy, offscreen: I feel good about things. This is a good game.\n\n[[Guy sitting on the floor at his laptop, bleeding from the mouth, surrounded by bloody wadded-up tissues and holding a bottle of medication.]]\nGirl, on phone: ... What exactly is in the painkillers they gave you?\nGuy, woozy: I can't read the label because I'm a hologram.\n\n{{Title text: I heard the general anesthesia drugs can cause amnesia, so when I woke up mid-extraction I started taking notes on my hand so I'd remember things later. I managed 'AWAKE BUT EVERYTHING OK' before the dental assistant managed to find and confiscate all my pens.}}","alt":"I heard the general anesthesia drugs can cause amnesia, so when I woke up mid-extraction I started taking notes on my hand so I'd remember things later. I managed 'AWAKE BUT EVERYTHING OK' before the dental assistant managed to find and confiscate all my pens.","img":"https://imgs.xkcd.com/comics/wisdom_teeth.png","title":"Wisdom Teeth","day":"16"},{"month":"2","num":862,"link":"","year":"2011","news":"","safe_title":"Let Go","transcript":"[[reddit page]]\nLuke (thinking): I shouldn't be looking at Reddit. Why can't I stop?\n\n[[CNN page]]\nLuke (thinking): Refreshing CNN again. Do news stories so affect my life that I benefit from checking them more than once a day?\n\n[[shutdown screen]]\nLuke (thinking): I should at least check Faceb... no.  Screw it.  I can't do my job when I'm distracting myself every five minutes like this.\n\n[[two people before a battlefield screen]]\nGuy: His computer's off.  Luke - You've switched off your targeting computer. What's wrong?\nLuke: Nothing. I'm all right.\n\n{{Title text: After years of trying various methods, I broke this habit by pitting my impatience against my laziness. I decoupled the action and the neurological reward by setting up a simple 30-second delay I had to wait through, in which I couldn't do anything else, before any new page or chat client would load (and only allowed one to run at once). The urge to check all those sites magically vanished--and my 'productive' computer use was unaffected.}}","alt":"After years of trying various methods, I broke this habit by pitting my impatience against my laziness. I decoupled the action and the neurological reward by setting up a simple 30-second delay I had to wait through, in which I couldn't do anything else, before any new page or chat client would load (and only allowed one to run at once). The urge to check all those sites magically vanished--and my 'productive' computer use was unaffected.","img":"https://imgs.xkcd.com/comics/let_go.png","title":"Let Go","day":"18"},{"month":"2","num":863,"link":"","year":"2011","news":"","safe_title":"Major in the Universe","transcript":"[[Student before a professor]]\nStudent: How can I pick a major? I'm interested in everything! Can't I major in \"the universe\"?\n\nProfessor: Okay. First, I'll need papers on every European trade summit that did not result in an agreement. Then, spend a year memorizing every microprocessor instruction set ever used in a production chip.\n\n[[Student scratches head]]\n\nStudent:What I meat was I just want to read Malcolm Gladwell books and drink.\nProfessor: We all do, sweetie.\n\n{{Title text: I hear Steven Levitt is writing a book analyzing A.J. Jacobs' quest to spend a year reading everything Malcolm Gladwell ever wrote. The audiobook will be narrated by Robert Krulwich of Radiolab.}}","alt":"I hear Steven Levitt is writing a book analyzing A.J. Jacobs' quest to spend a year reading everything Malcolm Gladwell ever wrote. The audiobook will be narrated by Robert Krulwich of Radiolab.","img":"https://imgs.xkcd.com/comics/major_in_the_universe.png","title":"Major in the Universe","day":"21"},{"month":"2","num":864,"link":"","year":"2011","news":"","safe_title":"Flying Cars","transcript":"Person (on phone): It's 2011. I want my flying car.\nFriend (from phone): Dude.\n\nFriend: You're complaining to me using a phone on which you buy and read books,\n\nFriend: and which you were using to play a 3D shooter until I interrupted you with what would be a video call if I were wearing a shirt.\n\nPerson: Can't I have a flying car, too?\nFriend (from phone): You'd crash it while texting and playing Angry Birds.\n\n{{Title text: It's hard to fit in the backseat of my flying car with my android Realdoll when we're both wearing jetpacks.}}","alt":"It's hard to fit in the backseat of my flying car with my android Realdoll when we're both wearing jetpacks.","img":"https://imgs.xkcd.com/comics/flying_cars.png","title":"Flying Cars","day":"23"},{"month":"2","num":865,"link":"","year":"2011","news":"xkcd.com now has IPv6 connectivity. If <a href=\"https://test-ipv6.com/\">you</a> can't reach it, you or your<br />ISP have <a href=\"https://en.wikipedia.org/wiki/IPv6_brokenness_and_DNS_whitelisting\">misconfigured equipment</a>. Sadly, I now have no way to tell you.","safe_title":"Nanobots","transcript":"[[Scientist and commander are on a space station.]]\nScientist: Commander! Come quick!\nScientist: It's the nanobots--they've STOPPED!\n\nScientist: They devoured 40% of the Earth, and then just ... quit! They're just sitting there!\nScientist: Why?!\n\nCommander: It's a mystery. ... unless ... What's the volume of each nanobot?\nScientist: A few cubic microns. Why?\nCommander: I think the year 1998 just bought us some time.\n\n[[Earth's surface, covered in mountains of nanobots.]]\nIn the swarm:\nNanobot: What do you mean, \"Run out of addresses?\"\nOther Nanobot: Look, we should've migrated away from IPv6 AGES ago ...\n\n{{Title text: I think the ITEF hit the right balance with the 128 bits thing. We can fit MAC addresses in a \n64 subnet, and the nanobots will only be able to devour half the planet.}}","alt":"I think the IETF hit the right balance with the 128 bits thing. We can fit MAC addresses in a /64 subnet, and the nanobots will only be able to devour half the planet.","img":"https://imgs.xkcd.com/comics/nanobots.png","title":"Nanobots","day":"25"},{"month":"2","num":866,"link":"","year":"2011","news":"","safe_title":"Compass and Straightedge","transcript":"I learned in high school what geometers discovered long ago:\n[[Geometer, holding a compass and straightedge, looks sad.]]\nUsing only a compass and straightedge, it's impossible to construct friends.\n\n{{Title text: The Greeks long suspected this, but it wasn't until April 12th of 1882 that Ferdinand von Lindemann conclusively proved it when he constructed himself the most awesome birthday party possible and nobody showed up.}}","alt":"The Greeks long suspected this, but it wasn't until April 12th of 1882 that Ferdinand von Lindemann conclusively proved it when he constructed himself the most awesome birthday party possible and nobody showed up.","img":"https://imgs.xkcd.com/comics/compass_and_straightedge.png","title":"Compass and Straightedge","day":"28"},{"month":"3","num":867,"link":"","year":"2011","news":"","safe_title":"Herpetology","transcript":"Ornithology conference:\n[[graph showing a large tree split between amphibians and reptiles]]\nOrnithologist: As you can see, herpetology is a silly field; reptiles are actually more closely related to birds and mammals than to amphibians.It should really be broken up, with lizards folded into ornithology.\n\nHerpetology conference:\n[[graph showing a large tree split between nice people and ornithologists]]\nHerpetologist: As you can see, ornithologists are actually assholes.\n\n{{Title text: Birds are Aves, which is part of the clade Theropoda, which is in Saurischia, which is in Dinosauria. Those birds outside our windows are dinosaurs. We can clear out the rest of our brains because we now have the best fact.}}","alt":"Birds are Aves, which is part of the clade Theropoda, which is in Saurischia, which is in Dinosauria. Those birds outside our windows are dinosaurs. We can clear out the rest of our brains because we now have the best fact.","img":"https://imgs.xkcd.com/comics/herpetology.png","title":"Herpetology","day":"2"},{"month":"3","num":868,"link":"","year":"2011","news":"","safe_title":"Nolan Chart","transcript":"[[diamond-shaped four-panel diagram]]\n[[top panel labeled \"internet libertarians]]\n[[left panel labeled \"Democrats, Republicans\"]]\n[[bottom panel labeled \"other\"]]\n[[right panel labeled \"baseball fans\"]]\n[[axis increasing in the upper-left direction labeled \"political opinions\"]]\n[[axis increasing in the upper-right direction labeled \"love of diamond-shaped diagrams\"]]\n\n{{Title text: Also in the right quadrant are NFPA-compliant chemical manufacturers and Sir Charles Wheatstone. Sharing the top with the internet libertarians are Nate Silver and several politically-active kite designers.}}","alt":"Also in the right quadrant are NFPA-compliant chemical manufacturers and Sir Charles Wheatstone. Sharing the top with the internet libertarians are Nate Silver and several politically-active kite designers.","img":"https://imgs.xkcd.com/comics/nolan_chart.png","title":"Nolan Chart","day":"4"},{"month":"3","num":869,"link":"","year":"2011","news":"","safe_title":"Server Attention Span","transcript":"[[single blade in a server rack]]\nServer: Hi! I'm a server! Who are you?\n\n[[mobile device with a web browser]]\nBrowser: I'm a browser. I'd like to see this article.\n\nServer:Oh boy! I can help! Let me get it for- ..whoa! You're a *smartphone* browser? \n\nBrowser: Yeah.\nServer: Cooool! Hey, I've got this new mobile version of my site! Check it out! Isn't it pretty?\n\nBrowser: Sure, but this is just your mobile site's main page. Where's the article I wanted?\n\nServer: What article?\nBrowser: The one I-\nServer: Who are you?\nBrowser: I-\nServer: Hi! I'm a server!\n\n{{Title text: They have to keep the adjacent rack units empty. Otherwise, half the entries in their \nvar\nlog\nsyslog are just 'SERVER BELOW TRYING TO START CONVERSATION *AGAIN*.' and 'WISH THEY'D STOP GIVING HIM SO MUCH COFFEE IT SPLATTERS EVERYWHERE.'}}","alt":"They have to keep the adjacent rack units empty. Otherwise, half the entries in their /var/log/syslog are just 'SERVER BELOW TRYING TO START CONVERSATION *AGAIN*.' and 'WISH THEY'D STOP GIVING HIM SO MUCH COFFEE IT SPLATTERS EVERYWHERE.'","img":"https://imgs.xkcd.com/comics/server_attention_span.png","title":"Server Attention Span","day":"7"},{"month":"3","num":870,"link":"","year":"2011","news":"Note: This comic's filename was originally 'advertising.png'. If you<br />couldn't see it, that was just your AdBlock zealously protecting you.","safe_title":"Advertising","transcript":"Mathematically Annoying Advertising:\n\n[[A  B = {x:x  15 or x > 15 } =  ]]\n[[line graph representing the above equation]]\nWhen discussing real numbers, it is impossible to get more vague than \"up to 15% or more\".\n\n[[\"FREE*\" in large text, with substantial illegible fine print]]\nIf someone has paid $x to have the word \"free\" typeset for you and N other people to read, their expected value for the money that will move from you to them is at least $(x\n(N+1))\n\n[[graph representing inverse relationship between \"amount you spend\" on the y axis and \"amount you save\" on the x axis]]\nIt would be difficult for the phrase \"the more you spend the more you save\" to be more wrong.\n\n{{Title text: I remember the exact moment in my childhood when I realized, while reading a flyer, that nobody would ever spend money solely to tell me they wanted to give me something for nothing. It's a much more vivid memory than the (related) parental Santa talk.}}","alt":"I remember the exact moment in my childhood when I realized, while reading a flyer, that nobody would ever spend money solely to tell me they wanted to give me something for nothing. It's a much more vivid memory than the (related) parental Santa talk.","img":"https://imgs.xkcd.com/comics/mathematically_annoying.png","title":"Advertising","day":"9"},{"month":"3","num":871,"link":"https://www.nothingbutnets.net/","year":"2011","news":"","safe_title":"Charity","transcript":"Gamer: I'm going to buy this $10 game I want, and I'm donating $10 for malaria eradication.\n\nFriend: If you actually cared, you'd skip the game and donate all $20.\nFriend: What's more important? Games, or mosquito nets and medicine for kids?\n\nLater:\nGamer: I think I'm going to buy these two $10 games I want.\nOther Friend: Cool; which ones?\n\n{{Title text: I usually respond to someone else doing something good by figuring out a reason that they're not really as good as they seem. But I've been realizing lately that there's an easier way to handle these situations, and it involves zero internet arguments.}}","alt":"I usually respond to someone else doing something good by figuring out a reason that they're not really as good as they seem. But I've been realizing lately that there's an easier way to handle these situations, and it involves zero internet arguments.","img":"https://imgs.xkcd.com/comics/charity.png","title":"Charity","day":"11"},{"month":"3","num":872,"link":"","year":"2011","news":"","safe_title":"Fairy Tales","transcript":"[[Woman is sitting in an armchair, reading a book.]]\nWoman: Are there eigenvectors in Cinderella?\nMan: ... no?\nWoman: The prince didn't use them to match the shoe to its owner?\nMan: What are you TALKING about?\nWoman: Dammit.\n\n[[Flashback. Girl is in bed, mom is sitting on the edge of the bed reading.]]\nMy mom is one of those people who falls asleep while reading, but keeps talking. She's a math professor, so she'd start rambling about her work.\nMom: But while the ant gathered food ...\nMom: ... zzzz ...\nMom: ... the grasshopper contracted to a point on a manifold that was NOT a 3-sphere ...\nI'm still not sure which versions are real.\n\n[[Present.]]\nMan: You didn't notice the drastic subject changes?\nWoman: Well, sometimes her versions were better. We loved Inductive White and the (N-1) Dwarfs.\nWoman: I guess the LIM x->inf (x) little pigs did get a bit weird toward the end ...\n\n{{Title text: Goldilocks' discovery of Newton's method for approximation required surprisingly few changes.}}","alt":"Goldilocks' discovery of Newton's method for approximation required surprisingly few changes.","img":"https://imgs.xkcd.com/comics/fairy_tales.png","title":"Fairy Tales","day":"14"},{"month":"3","num":873,"link":"","year":"2011","news":"","safe_title":"FPS Mod","transcript":"[[Person is playing a video game.]]\n<<BLAM>>\nGame: He once built a treehouse.\n<<BLAM>>\nGame: She has 110 unread emails that she was hoping to get to tonight.\n<<BLAM BLAM>>\nGame: He was the only one who took care of the plants back at base.\nNo one liked my FPS mod that gives you three-second snippets from the bios of people you shoot.\n\n{{Title text: Wait, that second one is a woman?  ... wait, if that bothers me, then why doesn't ... man, this game is no fun anymore.}}","alt":"Wait, that second one is a woman?  ... wait, if that bothers me, then why doesn't ... man, this game is no fun anymore.","img":"https://imgs.xkcd.com/comics/fps_mod.png","title":"FPS Mod","day":"16"},{"month":"3","num":874,"link":"","year":"2011","news":"","safe_title":"Time Management","transcript":"[[Person sits at a desk with a computer. There's a schedule on the wall next to it. Person is typing.]]\nThe key to leading a productive life is time management.\n<<type type>>\n\nChoose goals, build a schedule, and have the WILLPOWER to follow it--\nor be LEFT BEHIND by those of us who DO.\n<<type type type>>\n\n[[We see the schedule in closeup.]]\nSCHEDULE\n7:00am Wake up\n7:15am-8:00am Post on productivity blogs about my schedule\n8:00am-whenever Fuck around\n\n{{Title text: I never trust anyone who's more excited about success than about doing the thing they want to be successful at.}}","alt":"I never trust anyone who's more excited about success than about doing the thing they want to be successful at.","img":"https://imgs.xkcd.com/comics/time_management.png","title":"Time Management","day":"18"},{"month":"3","num":875,"link":"","year":"2011","news":"","safe_title":"2009 Called","transcript":"[[Man is at computer. Woman is standing behind him, looking at clothes on the floor.]]\nWoman: Is this a three wolf moon shirt?\nWoman: Dude, 2009 called, and they--\nMan: OH MY GOD!\n\nMan: DID YOU WARN THEM?\nMan: ABOUT HAITI AND JAPAN?\nWoman: What? No, I--\nMan: You ASSHOLE!\n\n{{Title text: 2017 called, but I couldn't understand what they were saying over all the screams.}}","alt":"2017 called, but I couldn't understand what they were saying over all the screams.","img":"https://imgs.xkcd.com/comics/2009_called.png","title":"2009 Called","day":"21"},{"month":"3","num":876,"link":"","year":"2011","news":"","safe_title":"Trapped","transcript":"[[Person is on the phone.]]\nPerson: Hello? 911? I'm trapped!\nPerson: It's dark and I can't see anything except these two distorted splotches of light!\nPerson: Help!\n\n[[The 911 operator is in an office, wearing a headset.]]\nOperator: Splotches of light? Your ... eyeballs?\nPerson (over phone): I think that's what they are! There's meat everywhere!\n\nOperator: ... so you're a brain.\nPerson (over phone): Yes!\nOperator: Yeah, we all are. You're not trapped. Use your body to walk around and experience reality.\n\nPerson: But everything's just signals in my sensory cortices! How can I be sure they correspond to an external world?!\nOperator (over phone): I'm sorry, but we can't send a search-and-rescue team into Plato's cave.\n\n{{Title text: Socrates could've saved himself a lot of trouble if he'd just brought a flashlight, tranquilizer gun, and a bunch of rescue harnesses.}}","alt":"Socrates could've saved himself a lot of trouble if he'd just brought a flashlight, tranquilizer gun, and a bunch of rescue harnesses.","img":"https://imgs.xkcd.com/comics/trapped.png","title":"Trapped","day":"23"},{"month":"3","num":877,"link":"","year":"2011","news":"","safe_title":"Beauty","transcript":"[[Two humans are discussing science.  They are interrupted by an off-panel shout.]]\nHuman: The problem with scientists is that you take the wonder and beauty out of everything by trying to analyze it.\nShout: Dude!\n\n[[A Scientist runs across the panel, carrying a microscope and a slime mold.]]\nScientist: My plasmoidal slime molds have heightened pigment production! Check out that yellow color! That actually makes them zinc-resistatn. Amazing, huh?\n\n[[The slime mold is proferred to the same human who was speaking earlier.  The close up hides the Scientist's face.]]\nHuman: It looks like dog barf.\nScientist: Hah, yeah! F. Septica is nicknamed \"dog vomit slime mold.\"  Cool, huh?  Check out my slides!\n\n[[The scientist has set down the microscope on the floor of the panel, and the slime mold is jiggling.]]\nHuman: Okay, never mind: What's wrong with scientists is that you \ndo\n see wonder and beauty in everything.\nHuman: Oh God, it's \nmoving!\n\nScientist: It wants to hug you! So cute!\n\n{{Title text: The best hugs are probably from hagfish, which can extrude microscopic filaments that convert a huge volume of water around them to slime in seconds. Instant cozy blanket!}}","alt":"The best hugs are probably from hagfish, which can extrude microscopic filaments that convert a huge volume of water around them to slime in seconds. Instant cozy blanket!","img":"https://imgs.xkcd.com/comics/beauty.png","title":"Beauty","day":"25"},{"month":"3","num":878,"link":"","year":"2011","news":"","safe_title":"Model Rail","transcript":"[[Two characters are standing in a basement, the support beams bare.]]\nEnthusiast: I want to build a perfect HO-scale (~1\n87) model train layout of my town.\nRealist: In your basement?  Bad idea.  Never make a layout of the area you're in.\n\nEnthusiast: Why not?\nRealist: Because it'd include a little 10\" replica of your house.\n\nEnthusiast: So? That'd be cool! I'd make tiny replicas of my rooms, my furniture--\nRealist: --And your train layout?\n\n((Break free of the traditional panel system.  The following appear in magnification circles, going beyond an original large diagram.  Each is labeled with a length scale arrow.))\n[[The characters are looking at an HO-scale model railroad, with prominent mountains and a town nestled in the valley.]]\n<-- 18m -->\n\n[[Zoomed in on the first model house.]]\n<-- 21cm -->\n\n[[Zoomed in on the second house.  There is a gnat sitting on the model.]]\n<-- 2.4mm -->\n\n[[Zoomed in on the third house.  A strand of spiderweb crosses the model, labeled.]]\nSpider web\n<-- 28m -->\n\n[[Zoomed in on the fourth house.  A cold virus is sitting on the model, which is distinctly composed of tiny dots.]]\nCold virus.\n<-- 320nm -->\n\n[[Zoomed in on the fifth house.  The entire diorama is composed of large spheres.  It appears Dalton's billiard ball model is correct in the comic universe.]]\n<-- 37 -->\n\n((A final comment, and normal panels resume.))\nThe Matryoshka Limit: It is impossible to nest more than six HO layouts.\n\n[[The two are standing together once again.]]\nEnthusiast: My God.\nRealist: Yeah. It's the second rule of model train layouts: No nesting.\n\nEnthusiast: ... what's the first rule?\nRealist: \"Do \nnot\n talk about model train layouts.\"  That rule was actually voted in by our friends and families.\nEnthusiast: Philistines.\n\n{{Title text: I don't know what's more telling--the number of pages in the Wikipedia talk page argument over whether the 1\n87.0857143 scale is called \"HO\" or \"H0\", or the fact that within minutes of first hearing of it I had developed an extremely strong opinion on the issue.}}","alt":"I don't know what's more telling--the number of pages in the Wikipedia talk page argument over whether the 1/87.0857143 scale is called \"HO\" or \"H0\", or the fact that within minutes of first hearing of it I had developed an extremely strong opinion on the issue.","img":"https://imgs.xkcd.com/comics/model_rail.png","title":"Model Rail","day":"28"},{"month":"3","num":879,"link":"","year":"2011","news":"","safe_title":"Lamp","transcript":"[[A person stumbles on a lamp, lying on the ground.]]\n\n[[The person picks it up.]]\n<<Rub rub>>\n\n[[The lamp sprays fluids.]]\n<<Splort>>\n\n[[The person holds the lamp at arm's length, a puddle of fluid on the ground.]]\n\n{{Title text: 'That was definitely not in my top three wishes.' 'Who said anything about YOUR wishes?'}}","alt":"'That was definitely not in my top three wishes.' 'Who said anything about YOUR wishes?'","img":"https://imgs.xkcd.com/comics/lamp.png","title":"Lamp","day":"30"},{"month":"4","num":880,"link":"","year":"2011","news":"","safe_title":"Headache","transcript":"[[One person has a bike, and is wearing a helmet.  The other is at a computer.]]\nBiker: Wanna go for a bike ride?\nOther: Nah, I hate 3D stuff. It gives me a headache.\nWhen you think about it, this excuse can get you out of almost anything.\n\n{{Title text: I'm only willing to visit placid lakes, salt flats, and painting exhibits until the world's 3D technology improves.}}","alt":"I'm only willing to visit placid lakes, salt flats, and painting exhibits until the world's 3D technology improves.","img":"https://imgs.xkcd.com/comics/headache.png","title":"Headache","day":"1"},{"month":"4","num":881,"link":"","year":"2011","news":"","safe_title":"Probability","transcript":"[[A plot of years vs. percent, with a solid and a dashed line.  The solid line starts at 100%, and drops constantly.  The dashed line starts around 85%, rises to 95% after 5 years, then drops.]]\n\n[[A simple table.]]\n5 years 81%\n10 years 77%\n\n[[Two people are sitting on a bench, next to an IV drip hanging from a rack.  One is holding a paper.]]\nPerson: You know, probability used to be my favorite branch of math\nPerson: Because it had so many real-life applications.\n\n[[They embrace, faces together.]]\n\n{{Title text: My normal approach is useless here, too.}}","alt":"My normal approach is useless here, too.","img":"https://imgs.xkcd.com/comics/probability.png","title":"Probability","day":"4"},{"month":"4","num":882,"link":"","year":"2011","news":"","safe_title":"Significant","transcript":"[[Person with a pony tail runs up to another person, who subsequently points off-panel where there are presumably scientists.]]\nPonytail: Jelly beans cause acne!\nAnother: Scientists! Investigate!\nScientists: But we're playing Minecraft!\nScientists: ... Fine.\n\n[[Two scientists.  One has safety goggles, the other has a sheet of notes.]]\nGoggles: We found no link between jelly beans and acne (p > 0.05).\n\n[[Back to the original two.]]\nAnother: That settles that.\nPonytail: I hear it's only a certain color that causes it.\nAnother: Scientists!\nScientists:  But Miiiinecraft!\n\n[[20 near identical small panels follow, 4 rows 5 columns.]]\nGoggles: We found no link between purple jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between brown jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between pink jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between blue jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between teal jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between salmon jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between red jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between turquoise jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between magenta jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between yellow jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between grey jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between tan jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between cyan jelly beans and acne (p > 0.05).\n\nGoggles: We found a link between green jelly beans and acne (p < 0.05).\nOff-panel: WHOA!\n\nGoggles: We found no link between yellow jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between beige jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between lilac jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between black jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between peach jelly beans and acne (p > 0.05).\n\nGoggles: We found no link between orange jelly beans and acne (p > 0.05).\n\n[[Newspaper front page.]]\nNEWS\nGreen Jelly Beans Linked To Acne!\n95% Confidence\n[[There is a picture of 3 green jelly beans.]]\nOnly 5% chance of coincidence!\n  Scientists...\n\n{{Title text: 'So, uh, we did the green study again and got no link. It was probably a--' 'RESEARCH CONFLICTED ON GREEN JELLY BEAN\nACNE LINK; MORE STUDY RECOMMENDED!'}}","alt":"'So, uh, we did the green study again and got no link. It was probably a--' 'RESEARCH CONFLICTED ON GREEN JELLY BEAN/ACNE LINK; MORE STUDY RECOMMENDED!'","img":"https://imgs.xkcd.com/comics/significant.png","title":"Significant","day":"6"},{"month":"4","num":883,"link":"","year":"2011","news":"","safe_title":"Pain Rating","transcript":"[[A doctor is carrying a clipboard and consulting with a patient, who's sitting on a high medical table.]]\nDoctor: Any pain?\nPatient: My arm really hurts.\n\n[[The patient's friend is standing behind the doctor, as the panel widens.]]\nDoctor: How would you rate the pain, from one to ten, where ten is the worst pain you can imagine?\n\n[[The patient sits on the table.]]\nPatient: The worst pain I can imagine?\n\n[[The patient ponders this, raising a thoughtful hand to their jaw.]]\n\n[[The patient appears to be shocked.]]\n\n[[The patient is huddled up on the table.]]\nPatient: One.\nDoctor: ... What the hell is wrong with his imagination?\nPatient's Friend: It's not a normal place.\n\n{{Title text: If it were a two or above I wouldn't be able to answer because it would mean a pause in the screaming.}}","alt":"If it were a two or above I wouldn't be able to answer because it would mean a pause in the screaming.","img":"https://imgs.xkcd.com/comics/pain_rating.png","title":"Pain Rating","day":"8"},{"month":"4","num":884,"link":"","year":"2011","news":"","safe_title":"Rogers St.","transcript":"[[Someone with curly hair is standing in front of a sign labeled 'Auditions'.  A judge of some sort speaks from off-panel.]]\nJudge: \nSeriously?\n\nJudge: Sorry, no, that's a huge mood killer.\nJudge: \nNext!\n\nBefore I have a kid, I'm moving to Rogers Street in Cambridge, MA, and then getting a cat named \"Mister\"\nJust to guarantee the kid will never go into porn.\n\n{{Title text: 'We can also use middle names in place of first pet's names, but yours is something incomprehensible about dropping tables.'}}","alt":"'We can also use middle names in place of first pet's names, but yours is something incomprehensible about dropping tables.'","img":"https://imgs.xkcd.com/comics/rogers_st.png","title":"Rogers St.","day":"11"},{"month":"4","num":885,"link":"","year":"2011","news":"","safe_title":"Recycling","transcript":"[[A person is picking through various items of trash or recycling on a conveyor belt.  A juice bottle, emty cardboard box, opened tin can, bottlecap, crumpled and flat sheets of paper, a soda or pop can, and miscellaneous junk are visible.]]\nPerson: This guy tears the labels off his cans, so he clearly understands they're going to be sorted somewhere - \nPerson: Yet in the same batch he includes a bottle with like an ounce of congealed juice in it.\nPerson: What an asshole.\nI worry a lot about what the people at the recycling center think of me.\n\n{{Title text: And given how much of my stuff they go through, they definitely know where I live.}}","alt":"And given how much of my stuff they go through, they definitely know where I live.","img":"https://imgs.xkcd.com/comics/recycling.png","title":"Recycling","day":"13"},{"month":"4","num":886,"link":"","year":"2011","news":"","safe_title":"Craigslist Apartments","transcript":"((The comic is a single panel, presented as an apartment search.))\n[[Title bar.]]\nAll apartments\nSearch for: [_______] in: All apartments   ( ) Title only (*) Entire post   Search\nRent: [Min] [Max] 0+ BR  [ ] Cats  [ ] Dogs     [ ] Has image\n[[Date bar]]\nFri Apr 15\n[[Begin the apartment listings.]]\n$1600 \n 2BR ~~~ Hardwood floors, utilities included. Cats ok, limit one per square foot.\n$1100 \n **** GREAT DEAL SQUARE HOUSE DOOR IN FRONT!!! ****\n$2300 \n 3BR !!!!!!!! Elegant apartment permanently lit by strobe light!!!! No floor.\n$1100 \n **** GREAT DEAL SQUARE HOUSE DOOR IN FRONT!!! ****\n$980 \n 1BR New \"hammock\"-style dwelling. Water and heat free from same dispenser. Viking landlord.\n$1550 \n 2BR (one inside the other). Has running water, in a sense.  Free heat in short, intense bursts.  Klein stairs.\n$1100 \n **** GREAT DEAL SQUARE HOUSE DOOR IN FRONT!!! ****\n$1100 \n **** GREAT DEAL SQUARE HOUSE DOOR IN FRONT!!! ****\n$3200 \n 1BR W\ntrimmed carpet and pert fixtures. Previous tenants clean. Call now, want you  inside. $120\nnight (no animals)\n$2100 \n 3BR on scenic Ash Tree Lane. Builder unknown; house has always existed. Walls shift; center of house may contain minotaur.\n$1100 \n **** GREAT DEAL SQUARE HOUSE DOOR IN FRONT!!! ****\n$600 \n 5BR Three floors w\n pool, rooftop garden, beautiful glass facade, no catch, 5-min drive to historic Pripyat\n$7100 \n 60BR Sleek modern w\nextreme running water. Previous tenants may resist entry. Contains all new wiring and is a submarine.\n$1616 \n 3BR + 2Bath, tub full of blood. Closet full of board games which play themselves. Pets ok but won't survive long.\n\n{{Title text: $1600 \n 1386153BR 3BATH, MODERN SLIDING DOORS, GUEST ROOMS, GARBAGE DISPOSAL. FREE MANDATORY PARKING (ENFORCED). CONVENIENT TO ALDERAAN.}}","alt":"$1600 / 1386153BR 3BATH, MODERN SLIDING DOORS, GUEST ROOMS, GARBAGE DISPOSAL. FREE MANDATORY PARKING (ENFORCED). CONVENIENT TO ALDERAAN.","img":"https://imgs.xkcd.com/comics/craigslist_apartments.png","title":"Craigslist Apartments","day":"15"},{"month":"4","num":887,"link":"","year":"2011","news":"","safe_title":"Future Timeline","transcript":"The Future\nAccording to Google Search results\nEvents for each year determined by the first page of Google Search results for the phrases:\n\"by <year>\"\n\"in year\"\n\"by the year <year>\"\n\"in the year <year>\"\n\"will * by the year <year>\"\n\"will * in the year <year>\"\n\"in <year>, * will\"\n\"by <year>, * will\"\n\n((The remainder of the comic is a vertical timeline.  Each year is linked to several facts.))\n2012\nWorld population reaches 7 billion\nFlying cars reach market\nCanada cuts greenhouse emissions to 6% below 1990 levels as per Kyoto\nApocalypse occurs\n\n2013\nNational debt paid off through President Clinton's plan\nMicrochipping of all Americans begins\nHomelessness ended in Massachusetts\nHealth Care reform law repealed\n\n2014\nUS leaves Afghanistan\nGNU\nLinux becomes dominant OS\n\n2015\nNew Horizons reaches Pluto\nHealth Care law causes hyperinflation\n192 UN Member Nations achieve Millennium Development Goals:\n- Extreme poverty and hunger eradicated\n- Universal primary education implemented\n- Women empowered, gender equality reached\n- Environmental stability ensured\n\n2016\nBaby boomers begin turning 65\nAndroid takes 38% of the Smartphone market\nAndroid takes 45% of the Smartphone market\nWindows Phone overtakes iOS in Smartphones\n\n2017\nChina completes unmanned lunar sample-return mission\nSocial Security stops running surplus\nUS Budget balanced\nNewspapers become obsolete and die out\nCosmetic surgery doubles\n\n2018\nSocial security stops running surplus\nJesus returns to Earth\n\n2019\nSocial security stops running surplus\nEvery baby has genes mapped at birth\n\n2020\nSolar power becomes cheaper than fossil fuels\nKeyboards and mice become obsolete\nNew Tappan Zee Bridge constructed\n\n2021\nUS debt reaches 97% of GDP\nUS unemployment falls to 2.8%\nRestored caliphate unifies Middle East\nLake Mead evaporates\n\n2022\nKilimanjaro snow-free\nHTML 5 finished\nNewspapers become obsolete and die out\n\n2023\nJesus returns to Earth (again)\nUS debt passes 100% of GDP\nAll unprotected ancient forests gone from Pacific Northwest\n\n2024\nAtlantis begins to reappear\nOrangutans extinct in wild\nChina lands men and women on Moon\nNASA sets up permanent Moon Base\nFemale professionals pass males in pay\n\n2025\nWorld population reaches 8 billion\nTwo billion people face water shortages\n62 MPG cars introduced\nUS power fades\n\n2026\nAtlantis emerges completely\nRock bands die out\nUS debt paid off\nCar accidents cease\nWest coast falls into ocean\n\n2027\nJapan introduces new fastest Maglev train\nLyndon Larouche-planned Mars colony established\nSocial security stops running surplus\n\n2028\nTobacco outlawed\n40% of coral reefs gone\nUS debt paid off\nSocial Security stops running surplus\n\n2029\nSocial Security trust fund exhausted\nComputers pass the Turing test\nAging reversed\nWikipedia reaches 30 million articles\n\n2030\nHalf of Amazon rain forest lost to logging\nCancer deaths double from 2008 levels\nArctic ice-free in summer\n\n2031\nComputers controlled by thought\nRealtors replaced by technology\nSocial Security trust fund exhausted\n\n2032\n\"Big One\" hits San Francisco\nUS elects first married lesbian president\nEntire world converted to Christianity\n\n2033\nKilimanjaro ice disappears\nIndia becomes superpower\nEurope reaches Mars\n\n2034\nUS diabetes cases double, treatment costs triple\nUS builds autonomous robot army\n\n2035\n80% of America's energy comes from renewable sources\nHimalayan glaciers down 80% in size\nArctic Sea lane opens\n\n2036\n80% of US has access to high-speed rail\nAsteroid Apophis misses\nhits Earth\n\n2037\nArctic ice-free in September\nSocial Security trust fund exhausted\n\n2038\n32-bit timestamps roll over, causing Y2K-level chaos\n\"Big One\" hits California\n\n2039\nUS population hits 400 million\nSevere heat waves become commonplace\nScientology becomes majority religion in US\n\n2040\nArctic summers ice-free\nNanotechnology makes humans immortal\n\n2041\nSocial Security trust fund exhausted\n\n2042\n\n2043\nWorld population passes 9 billion\n\n2044\nMankind genetically engineered to be happy\nChildhood obesity reaches 100%\n\n2045\nHumans and machines merge\n\n2046\nWorld's natural resources depleted\n\n2047\nWorld ruled by banks and corporations\nTobacco industry fails\nUS begins using autonomous attack drones\n\n2048\nSalt-water fish extinct from overfishing\nUnisex bathing suits cover body from shoulder to ankle\nEntire US population overweight\n\n2049\n$1,000 computer exceeds computational ability of humanity\nSingularity occurs\nFishing industry collapses\n\n2050\n80% of Earth's population lives in urban centers\nChina controls space\nSex with robots possible\nCars banned from European cities\nOne million species extinct from climate change\n\n2051\nAtmosphere escapes into space\n\n2052\nMedicare, Medicaid, and Social Security spending exceed total US revenue\n\n2053\nUS budget balanced\nMajority of Americans in prison\nCars driven by dogs\n\n2054\nHunger becomes unimaginable global problem\n\n2055\nAtmospheric CO2 doubled\nOil runs out\nCopper, tin, lead, gold, and nickel are all exhausted\n\n2056\nRFID-tagged driverless cars\nRobots given same rights as humans\n\n2057\n150 Japanese settlers on Mars\nColorado River runs dry\n\n2058\nSmoking ends in New Zealand\n\n2059\nHumans have domesticated robots\n\n2060\nHuman race lives in peace\nExtreme droughts across much of Earth\nGlobal temperature rise reaches 4C\nOil runs out again\n\n2061\nHalley's Comet returns\n\n2062\nUganda hosts World Cup\nThe Jetsons\n\n2063\nFirst human clones reach adulthood\nPopulation of Moon reaches 100,000\nPopulation of Mars reaches 10,000\nSpacecraft exceed speed of light\n\n2064\nClean Air Act finishes reducing haze in national parks to natural levels\n\n2065\nLast coral reefs die out\nChernobyl cleanup completed\n\n2066\nCyprus achieves its goal\n\n2067\nAmericans live in domed cities and watch 3D TV\nRedheads go extinct\n\n2068\nOzone hole over Antarctic finishes recovering\nLord Jesus rules Earth from throne in Jerusalem\nEntire world population gay due to chemicals in the water\n\n2069\nPublic masturbation legalized\n\n2070\nWorld population peaks\nCity-scale flooding disasters\n60% of world's energy comes from renewable sources\n\n2071\nEurope's temperatures rise by 3C\nWorld summer temperatures rise by 5C\n\n2072\nUS retirement age set to 75\n\n2073\nOceans do not rise one foot\n\n2074\nNumber of 100-year-olds reaches one million\nSupertyphoons hit Japan\n\n2075\nUS retirement age set to 69\n\n2076\nAverage scientific paper has more than 24 authors\nSocial Security trust fund exhausted\n\n2077\n\n2078\nNewspapers become obsolete and die out\n\n2079\nUS debt reaches 716% of GDP\nLodgepole Pines disappear from Northwest\nFloods commonplace\nReligion marginalized\n\n2080\nFederal spending reaches 70% of GDP\nUK population doubles\n\n2081\n\n2082\nWorld population declines to one billion\n\n2083\n\n2084\nRobot policemen introduced\n\n2085\nUS deficit reaches 62% of GDP\n\n2086\n\n2087\n\n2088\nJapan becomes all-robot country\n\n2089\nWorld halts fossil fuel use\n\n2090\nGlobal warming hits 7C\nGlobal warming hits 4C\n\n2091\n\n2092\n\n2093\n\n2094\n\n2095\n\n2096\n\n2097\n\n2098\n\n2099\n\n2100\nGlobal warming around 5-7C\nSea levels have risen by a meter or more\nJoshua Trees nearly extinct\nEarth's climate resembles that of the Cretaceous\nGermany tropical\nEmperor Penguins extinct\nArctic permafrost thaws\nRising seas flood coastal cities\nRain forests mostly gone due to climatic shifts\nAll coral reefs gone\nGillette introduces 14-bladed razor\n\n2101\nWAR WAS BEGINNING\n\n{{Title text: Not shown: the approximately 30,000 identical, vaguely hysterical articles titled \"WHITE PEOPLE IN [THE US\nBRITAIN] TO BECOME MINORITY BY [YEAR]!\", which came up for basically any year I put in.}}","alt":"Not shown: the approximately 30,000 identical, vaguely hysterical articles titled \"WHITE PEOPLE IN [THE US/BRITAIN] TO BECOME MINORITY BY [YEAR]!\", which came up for basically any year I put in.","img":"https://imgs.xkcd.com/comics/future_timeline.png","title":"Future Timeline","day":"18"},{"month":"4","num":888,"link":"","year":"2011","news":"","safe_title":"Heaven","transcript":"[[The display is a tetris game.  A large oddly shaped piece is falling towards the board.  The piece fits into the gaps exactly to complete multiple rows at once.  The next piece is simply a very long brick.]]\nTop 0002187\nScore 0002186\nLevel 5\n((The above are within the game; the next line is outside the game.))\nHeaven\n\n{{Title text: If you've never had sex, this is what it feels like. Complete with the brief feeling of satisfaction, followed by ennui, followed by getting bored and trying to make it happen again.}}","alt":"If you've never had sex, this is what it feels like. Complete with the brief feeling of satisfaction, followed by ennui, followed by getting bored and trying to make it happen again.","img":"https://imgs.xkcd.com/comics/heaven.png","title":"Heaven","day":"20"},{"month":"4","num":889,"link":"","year":"2011","news":"","safe_title":"Turtles","transcript":"[[There is a turtle.]]\nOff-panel: Oh, crap, I deleted the file!\n\n[[There is a turtle.]]\nTurtle (thinking): I am a turtle.\n\n[[There is a turtle.]]\nOff-panel: No, wait, there it is.\n\n[[There is a turtle.]]\nTurtle (thinking): I am a turtle.\n\n[[There is a turtle.]]\n50 Years Later:\nTurtle (thinking): I am a turtle.\n\nTurtles have it figured out, man.\n\n{{Title text: You're a turtle!}}","alt":"You're a turtle!","img":"https://imgs.xkcd.com/comics/turtles.png","title":"Turtles","day":"22"},{"month":"4","num":890,"link":"","year":"2011","news":"","safe_title":"Etymology","transcript":"[[Obi-Wan Kenobi, Luke Skywalker, Han Solo, and Chewbacca are sitting in Chalmun's Spaceport Cantina, a wretched hive of scum and villainy]]\nHan Solo: Han Solo. I'm captain of the Millenium Falcon\n\nLuke Skywalker: What's that?\n\nHan: It's the ship that made the Kessel Run in less than 12 Parsecs!\n\nLuke: No, what's a falcon?\n\nHan: ...\n\n{{Title text: For some reason, my childhood suspension of disbelief had no problem with the fact that this ancient galaxy is full of humans, but was derailed by language. There's no Asia OR Europe there, so where'd they get all the Indo-European roots?}}","alt":"For some reason, my childhood suspension of disbelief had no problem with the fact that this ancient galaxy is full of humans, but was derailed by language. There's no Asia OR Europe there, so where'd they get all the Indo-European roots?","img":"https://imgs.xkcd.com/comics/etymology.png","title":"Etymology","day":"25"},{"month":"4","num":891,"link":"","year":"2011","news":"","safe_title":"Movie Ages","transcript":"The 2011 Guide to Making People Feel Old\n-Using Movie Release Dates-\n[[A chart with 2 columns. First column is labeled 'Their Age,' and is numbered 1 through 35 & 'over 35.' The second column is labeled 'You Say' and is divided into four sub-columns. The first sub-column reads '\"Did you realize that...' from 1-35, and the third sub-column says 'Came Out' from 1-35.]\nAge 16: Snakes on a plane ... Half a decade ago?\"\n17-19: Revenge of the Sith ... More than half a decade ago?\"\n20: Finding Nemo ... Eight years ago?\"\n21-22: Shrek ... Ten years ago?\"\n23-25: The Matrix ... Not the last decade, but the one before \nthat\n?\"\n26: Toy Story\" ... Over fifteen years ago?\"\n27: The Lion King ... Seventeen years ago?\"\n28: Jurassic Park ... Eighteen years ago?\"\n29: Terminator 2 ... Twenty years ago?\"\n30-32: Home Alone ... More than twenty years ago?\"\n33-35\" The Little Mermaid ... Closer to the moon landing than the present day?\nOver 35: \"Hey, did you see this chart? You match your age to movie -- oh, right, sorry, it only goes up to 35. I guess it's not really aimed at older people.\"\n\n{{Title text: If you're 15 or younger, then just remember that it's nevertheless probably too late to be a child prodigy.}}","alt":"If you're 15 or younger, then just remember that it's nevertheless probably too late to be a child prodigy.","img":"https://imgs.xkcd.com/comics/movie_ages.png","title":"Movie Ages","day":"27"},{"month":"4","num":892,"link":"","year":"2011","news":"","safe_title":"Null Hypothesis","transcript":"[[A student works at a desk.]]\n\nBystander: I can't believe schools are still teaching kids about the null hypothesis.\nBystander: I remember reading a big study that conclusively disproved it YEARS ago.\n\n{{Title text: Hell, my eighth grade science class managed to conclusively reject it just based on a classroom experiment. It's pretty sad to hear about million-dollar research teams who can't even manage that.}}\n","alt":"Hell, my eighth grade science class managed to conclusively reject it just based on a classroom experiment. It's pretty sad to hear about million-dollar research teams who can't even manage that.","img":"https://imgs.xkcd.com/comics/null_hypothesis.png","title":"Null Hypothesis","day":"29"},{"month":"5","num":893,"link":"","year":"2011","news":"","safe_title":"65 Years","transcript":"[[A graph titled 'Number of Living Humans Who Have Walked on Another World' -- its y-axis is numbered 5, 10, 15, it's x-axis increments every ten years from 1960-2040. The line of the graph has a bracket above it that says '65 Years', starting at 1969, ending in 2034. \n\nThe line starts at 1969 and increases steeply to 12 by 1972. It then plateaus until the early nineties declines gradually to 8 between 1991-1999, and then plateaus again.\n\nFrom 2020-2035, which is labeled 'Projected Actuarial Tables', the line branches into three and begins to decline more steeply to zero. The area between the first and second branch is shaded and labeled '5th percentile' and the area between the second and third branch is shaded and labeled '95th percentile.']] \n\n{{Title text: The universe is probably littered with the one-planet graves of cultures which made the sensible economic decision that there's no good reason to go into space--each discovered, studied, and remembered by the ones who made the irrational decision.}}","alt":"The universe is probably littered with the one-planet graves of cultures which made the sensible economic decision that there's no good reason to go into space--each discovered, studied, and remembered by the ones who made the irrational decision.","img":"https://imgs.xkcd.com/comics/65_years.png","title":"65 Years","day":"2"},{"month":"5","num":894,"link":"","year":"2011","news":"","safe_title":"Progeny","transcript":"[[A guy sits at a computer; a woman stands behind him.]]\n\nGuy: Wow -- researchers taught a computer to beat the world's best humans at yet ANOTHER task. Does our species have ANYTHING left to be proud of?\nWoman: Well, it sounds like we're pretty awesome at teaching.\nGuy: Huh? What good is THAT?\n\n{{Title text: I tell my children 'it's not whether you win or lose, it's how you play the game.' I'm trying to take the edge off their competitive drive to ensure that I can always beat them.}}","alt":"I tell my children 'it's not whether you win or lose, it's how you play the game.' I'm trying to take the edge off their competitive drive to ensure that I can always beat them.","img":"https://imgs.xkcd.com/comics/progeny.png","title":"Progeny","day":"4"},{"month":"5","num":895,"link":"","year":"2011","news":"","safe_title":"Teaching Physics","transcript":"Teacher: Understanding gravity: Space-time is like a rubber sheet. Massive objects distort the sheet, and--\nStudent: Wait.\n\nStudent: They distort it because they're pulled down by... what?\n\nTeacher: <<sigh>>\n\nTeacher: Space-time is like this set of equations, for which any analogy must be an approximation.\nStudent: BOOOOORING.\n\n{{Title text: Space-time is like some simple and familiar system which is both intuitively understandable and precisely analogous, and if I were Richard Feynman I'd be able to come up with it.}}","alt":"Space-time is like some simple and familiar system which is both intuitively understandable and precisely analogous, and if I were Richard Feynman I'd be able to come up with it.","img":"https://imgs.xkcd.com/comics/teaching_physics.png","title":"Teaching Physics","day":"6"},{"month":"5","num":896,"link":"","year":"2011","news":"Today's comic might be familiar to a few dozen of you. :)<br />P.S. <a href=\"https://blog.xkcd.com/2011/05/08/michael-bays-scenario/\">New blag post</a>!","safe_title":"Marie Curie","transcript":"Woman: My teacher always told me that if I applied myself, I could become the next Marie Curie.\nZombie Marie Curie: You know, I wish they'd get over me.\n\nWoman: Zombie Marie Curie!\n\nZombie Marie Curie: Not that I don't deserve it. These two Nobels ain't decorative. But I make a sorry role model if girls just see me over and over as the one token lady scientist.\n\nZombie Marie Curie: Lise Meitner figured out that nuclear fission was happening, while her colleague Otto was staring blankly at their data in confusion, and proved Enrico Fermi wrong in the process. Enrico and Otto both got Nobel Prizes. Lise got a National Women's Press Club award.\nZombie Marie Curie: They finally named an element after her, but not until 60 years later.\n\nZombie Marie Curie: Emmy Noether fought past her Victorian-era finishing-school upbringing, pursued mathematics by auditing classes, and, after finally getting a Ph.D, was permitted to teach only as an unpaid lecturer (often under male colleagues' names).\nWoman: Was she as good as them?\nZombie Marie Curie: She revolutionized abstract algebra, filled gaps in relativity, and found what some call the most beautiful, deepest result in theoretical physics.\nWoman: Oh.\n\nZombie Marie Curie: But you don't become great by trying to be great. You become great by wanting to do something, and then doing it so hard that you become great in the process.\n\nZombie Marie Curie: So don't try to be the next me, Noether, or Meitner. Just remember that if you want to do this stuff, you're not alone.\nWoman: Thanks.\nZombie Marie Curie: Also, avoid radium. Turns out it kills you.\nWoman: I'll try.\n\n{{Title text: Although not permanently.}}","alt":"Although not permanently.","img":"https://imgs.xkcd.com/comics/marie_curie.png","title":"Marie Curie","day":"9"},{"month":"5","num":897,"link":"","year":"2011","news":"","safe_title":"Elevator Inspection","transcript":"[[Three people in an elevator, one reading a posted sign.]]\nReading guy: It says here that the elevator inspection certificate is on file in the building office.\nMiddle guy: Whoa, cool! Let's go look at it!\nExcited girl: That sounds fun!\n\nIndustry tip: Building owners know this never happens. Those signs mark elevators which have never been inspected.\n\n{{Title text: Even governmental elevator inspectors get bored halfway through asking where the building office is.}}","alt":"Even governmental elevator inspectors get bored halfway through asking where the building office is.","img":"https://imgs.xkcd.com/comics/elevator_inspection.png","title":"Elevator Inspection","day":"11"},{"month":"5","num":898,"link":"","year":"2011","news":"","safe_title":"Chain of Command","transcript":"[[A flowchart shows the President at the top, with an arrow to the Secretary of Defense, and then fourteen arrows leading to a series of boxes labeled Unified Combat Commanders. On the side, a box with a dotted outline has a dotted arrow leading to the president. It's labeled \"Engineer Who Installed the Red Button.\"]]\nUS NUCLEAR CHAIN OF COMMAND\n\n{{Title text: Themistocles said his infant son ruled all Greece -- \"Athens rules all Greece; I control Athens; my wife controls me; and my infant son controls her.\" Thus, nowadays the world is controlled by whoever buys advertising time on Dora the Explorer.}}","alt":"Themistocles said his infant son ruled all Greece -- \"Athens rules all Greece; I control Athens; my wife controls me; and my infant son controls her.\" Thus, nowadays the world is controlled by whoever buys advertising time on Dora the Explorer.","img":"https://imgs.xkcd.com/comics/chain_of_command.png","title":"Chain of Command","day":"13"},{"month":"5","num":899,"link":"","year":"2011","news":"","safe_title":"Number Line","transcript":"{{Title text: The Wikipedia page \"List of Numbers\" opens with \"This list is incomplete; you can help by expanding it.\"}}\n\n(( number line ranging from -1 to 10 ))\n\n(( arrow pointing left, towards negative numbers )) Negative \"imitator\" numbers (do not use)\n\n(( line right before the number one )) 0.99... (acutally 0.0000000372 less than 1)\n\n(( line at the golden ratio ))  - Parthenon; sunflowers; golden ratio; wait, come back, I have facts!\n\n(( line at a region between two and 2.2 )) forbidden region\n\n(( line at Euler's number )) e\n\n(( line a bit before 3 )) 2.9299372 (e and  pi, observed)\n\n(( line at  )) \n\n(( line at 3.5 with a ribbon as the numeral )) Grid - accepted as canon by orthodox mathematicians \n\n(( line a bit after 4 )) site of battle of 4.108\n\n(( blob between 4.5 and 6.5 labeled unexplored ))\n\n(( line at seven )) Number indicating a factoid is made up (\"every 7 years...\", \"science says there are 7...\", etc)\n\n(( line at eight )) Largest even prime\n\n(( line at 8.75 )) If you encounter a number higher than this, you're not doing real math\n\n","alt":"The Wikipedia page \"List of Numbers\" opens with \"This list is incomplete; you can help by expanding it.\"","img":"https://imgs.xkcd.com/comics/number_line.png","title":"Number Line","day":"16"}]
