[{"month":"5","num":900,"link":"","year":"2011","news":"","safe_title":"Religions","transcript":"Woman: So are you worried about the rapture?\nMan: No, unless it figures out how to open doors.\nWoman: I said RAPTURE.\n\nMan: Oh. I'm not really into that. I'm the kind of Christian who only goes to church on Christmas and Easter, and then spends the other 363 days at the Mosque.\nWoman: ... I don't think that's a thing.\nMan: Our rabbi swears it's legit.\n\nMan: What religion are you?\nWoman: Experimentalist monotheism.\nMan: Which is?\nWoman: We believe there's one god, but we're trying to find the error bars on that number.\n\n{{Title text: But to us there is but one God, plus or minus one. --1 Corinthians 8:6±2.}}","alt":"But to us there is but one God, plus or minus one. --1 Corinthians 8:6±2.","img":"https://imgs.xkcd.com/comics/religions.png","title":"Religions","day":"18"},{"month":"5","num":901,"link":"","year":"2011","news":"","safe_title":"Temperature","transcript":"[[A close up of a man with a thermometer in his mouth.]]\n\n[[The thermometer beeps.]]\nThermometer: BEEP\n\n[[A full-body shot of the man looking down at the thermometer.]]\n\n[[A close-up of the thermometer's read-out.]]\nThermometer: PREGNANT\n\n{{Title text: And the baby has a fever.}}","alt":"And the baby has a fever.","img":"https://imgs.xkcd.com/comics/temperature.png","title":"Temperature","day":"20"},{"month":"5","num":902,"link":"","year":"2011","news":"","safe_title":"Darmok and Jalad","transcript":"[[Captain Dathon is seen on a communications screen]]\nAlien: Darmok and Jalad at Kalenda's!\n\n[[Jean-Luc Picard and Deanna Troi stand next to each other, looking off to the right.]]\nPicard: Their language must be based on folklore and metaphor! Computer! Search cultural archives for Darmok-Jalad-Kalenda!\n\n[[Picard and Troi listen to the response]]\nComputer (off-panel): In Tamarian legend, Darmok and Jalad got totally wasted and hooked up at a party at Kalenda's.\n\n[[Dathon is seen on the communications screen again, winking]]\n<<Wiiiiiink>>\n\n{{Title text: I wonder how often Patrick Stewart has Darmok flashbacks when talking to Star Trek fans.}}","alt":"I wonder how often Patrick Stewart has Darmok flashbacks when talking to Star Trek fans.","img":"https://imgs.xkcd.com/comics/darmok_and_jalad.png","title":"Darmok and Jalad","day":"23"},{"month":"5","num":903,"link":"","year":"2011","news":"","safe_title":"Extended Mind","transcript":"[[An IM window is open over a Chrome window with tabs for Spark Plug, Feeler Gauge, and Wikipedia.]]\nMessage with Mike1979\nMike1979: I replaced my spark plugs and now my car is running weird.\nMe: The spark gap might be off.\nMe: You can check with a feeler gauge.\nMike1979: What should the gap be?\nMe: Usually between 0.035\" and 0.070\".\nMe: But it depends on the engine.\n\n[[An IM window is open over a Chrome window with a single Wikipedia tab, marked ERROR. The page says: \"Wikipedia has a problem. Try waiting a few minutes and reloading (can't contact the database server: unknown error (10.0.0.242))]]\nMessage with Mike1979\nMike1979: I replaced my spark plugs and now my car is running weird.\nMe: What is a sparky plug??\nMe: Help\nMe: What is a car??\n\n{{Title text: Wikipedia trivia: if you take any article, click on the first link in the article text not in parentheses or italics, and then repeat, you will eventually end up at \"Philosophy\".}}","alt":"Wikipedia trivia: if you take any article, click on the first link in the article text not in parentheses or italics, and then repeat, you will eventually end up at \"Philosophy\".","img":"https://imgs.xkcd.com/comics/extended_mind.png","title":"Extended Mind","day":"25"},{"month":"5","num":904,"link":"","year":"2011","news":"","safe_title":"Sports","transcript":"[[Two commentators sit behind a desk.]]\nCommentator 1: A weighted random number generator just produced a new batch of numbers.\nCommentator 2: Let's use them to build narratives!\nALL SPORTS COMMENTARY\n\n{{Title text: Also, all financial analysis. And, more directly, D&D.}}","alt":"Also, all financial analysis. And, more directly, D&D.","img":"https://imgs.xkcd.com/comics/sports.png","title":"Sports","day":"27"},{"month":"5","num":905,"link":"","year":"2011","news":"","safe_title":"Homeownership","transcript":"[[Person is in an empty room, on the phone with a friend.]]\nPerson: I've always rented, so this blows my mind--this house is mine? I own a building?\nFriend: Yup!\n\nPerson: I could, like, decide to drill a hole in that wall there, and nobody could do anything about it!\nFriend: That's right!\n\n[[Person, off the phone, stands in silence.]]\n\n[[Person is standing next to a pile of rubble, on the phone with a friend.]]\nPerson: Can I come stay with you? My house has a ... problem.\nFriend: Let me guess: you drilled holes in it until it collapsed?\nPerson: I don't think I'm cut out for home ownership.\n\n{{Title text: New research shows over 60% of the financial collapse's toxic assets were created by power drills.}}","alt":"New research shows over 60% of the financial collapse's toxic assets were created by power drills.","img":"https://imgs.xkcd.com/comics/homeownership.png","title":"Homeownership","day":"30"},{"month":"6","num":906,"link":"","year":"2011","news":"","safe_title":"Advertising Discovery","transcript":"Advertising discovery:\n[[Person sits at computer, reading an ad on the screen. The bracketed superscripts are blue.]]\nAd: Turgidax(R) triples[2] your penis size overnight,[2][5] improving both your sexual attractiveness[2][7] and your cardiovascular health.[7][8][9]\nPerson (thinking): Sounds legit.\nWikipedia has trained us to believe anything followed by little blue numbers in brackets.\n\n{{Title text: When advertisers figure this out, our only weapon will be blue sharpies and \"[disputed]\".}}","alt":"When advertisers figure this out, our only weapon will be blue sharpies and \"[disputed]\".","img":"https://imgs.xkcd.com/comics/citations.png","title":"Advertising Discovery","day":"1"},{"month":"6","num":907,"link":"","year":"2011","news":"","safe_title":"Ages","transcript":"[[A number line labeled \"age\". The start point is 0, with points labeled 10, 20, 30, 40, 50, 60, and 70, and the line continues past the width of the panel. There are interstitial, non-labeled points. Above the line are labeled brackets. They are (approximated):\n0-3: [Non-sentient]\n4-12: \"Everything is exciting!\"\n13-17: \"Everything sucks!\"\n18-22: \"Woooo college! Wooooo-\" [vomit]\n23-30: \"Relationships are \nhard!\n\n31-42: \"So are careers!\"\n43-54: \"No daughter of \nmine\n is going out dressed like that!\"\n55-75+: [More sex than anyone is comfortable admitting] ]]\n\n{{Title text: Every age: \"I'm glad I'm not the clueless person I was five years ago, but now I don't want to get any older.\"}}","alt":"Every age: \"I'm glad I'm not the clueless person I was five years ago, but now I don't want to get any older.\"","img":"https://imgs.xkcd.com/comics/ages.png","title":"Ages","day":"3"},{"month":"6","num":908,"link":"","year":"2011","news":"","safe_title":"The Cloud","transcript":"[[A man finds a computer tower with a wire leading away from it.]]\nMan: What's this?\nOff-screen: The Cloud.\n\n[[The man looks behind him. The wire leads to an outlet in the wall next to where the Hat Man sits at a desk with a computer. Another wire leads from that outlet to the Hat Man's computer.]]\nMan: Huh? I always thought \"The Cloud\" was a huge, amorphous network of servers somewhere.\nHat Man: Yeah, but everyone buys server time from everyone else. In the end, they're all getting it here.\n\n[[A close-up of Hat Man.]]\nMan (off-screen): How? You're on a \ncable\n modem.\nHat Man: There's a lot of caching.\n\n[[A close-up of the man, looking down at the tower at his feet.]]\nMan: Should the cord be stretched across the room like this?\nHat Man (off-screen): Of course. It has to reach the server, and the server is over there.\n\n[[The man turns back to the Hat Man, still sitting at the computer.]]\nMan: What if someone trips on it?\nHat Man: Who would want to do that? It sounds unpleasant.\nMan: Uh. Sometimes people do stuff by accident.\nHat Man: I don't think I know anybody like that.\n\n{{Title text: There's planned downtime every night when we turn on the Roomba and it runs over the cord.}}","alt":"There's planned downtime every night when we turn on the Roomba and it runs over the cord.","img":"https://imgs.xkcd.com/comics/the_cloud.png","title":"The Cloud","day":"6"},{"month":"6","num":909,"link":"","year":"2011","news":"","safe_title":"Worst-Case Shopping","transcript":"[[A man is diving in very deep, dark blue water. He shines a flashlight at the sea floor.]]\nMan: (thinks) Eight meters. There's the wreckage... Yes! I see the key!\n\n[[As he swims further toward it, his flashlight starts to cut out.]]\nMan: (thinks) Gotta grab it, surface, get in to the radio shed, and warn the President! Just a few more...\nFlashlight: BZZT FIZZ\n\n((This panel has no border like the others, and is divided in half diagonally by a thought bubble.))\n[[The left half of it is a dark blue thought bubble with the diver inside it. On the right hand side are packaged flashlights hanging on a shelf. The one called Hi-Brite is $24.95 and is labeled 'water resistant to 10 meters.' The one called 'FenStar G6' is $49.95 and says 'water resistant to 40 meters.']]\nMan: (thinks) Oh no.\n\n[[Two men stand in front of a flashlight display in a store. One looks down at the packages with his hand on his chin in thought. The thought bubble from the previous panel leads from his head. The other man stands behind him.]]\nMan #1: ...maybe I should spring for the deeper water resistance.\nMan #2: Why on earth would you care about that?\nMan #1: Look, you never know.\n\n{{Title text: Wait a minute. If I'm escaping from a submarine at 50 meters, then I'll *definitely* need a flashlight to find air pockets for gradual decompression on the way up. Time to start shopping professional dive lights.}}","alt":"Wait a minute. If I'm escaping from a submarine at 50 meters, then I'll *definitely* need a flashlight to find air pockets for gradual decompression on the way up. Time to start shopping professional dive lights.","img":"https://imgs.xkcd.com/comics/worst_case_shopping.png","title":"Worst-Case Shopping","day":"8"},{"month":"6","num":910,"link":"","year":"2011","news":"","safe_title":"Permanence","transcript":"((A large panel the combined width of the four panels below it.))\n[[A blue Linux terminal installer screen with a grey box that is labeled \"[!]CONFIGURE THE NETWORK\" in red. Below, in black, it reads \"Please enter the hostname for the system.\" Below is an empty blue entry box with a cursor and dashed underscore, and below this it says \"<GO BACK>\".]]\n\n[[A man sits at his computer, a woman stands behind him.]]\nWoman: You've been staring at that screen a while.\nMan: Picking a good server name is important.\n\n[[The woman stares at him.]]\n\n[[She continues to stare.]]\n\n[[The man pushes his chair back, puts one elbow on the back of the chair and points with his other hand at the screen.]]\nWoman: And yet you settled on \"Caroline\" for our daughter in like 15 seconds.\nMan: But this is a \nserver!\n -- Besides, I had to- you were trying to name her \"epidural.\" \nWoman: Those \nwere\n good drugs.\n\n{{Title text: This hostname is going in dozens of remote config files. Changing a kid's name is comparatively easy!}}","alt":"This hostname is going in dozens of remote config files. Changing a kid's name is comparatively easy!","img":"https://imgs.xkcd.com/comics/permanence.png","title":"Permanence","day":"10"},{"month":"6","num":911,"link":"","year":"2011","news":"","safe_title":"Magic School Bus","transcript":"[[A girl sits at a desk in a classroom, and the teacher stands before her. The teacher has a blue dress and blonde hair piled on her head in a bun. The girl raises her hand, the teacher raises both arms above her head, a pointer in one hand.]]\nGirl: Ms. Frizzle, how do batteries work?\nMs. Frizzle: To the bus!\n\n[[Ms. Frizzle and the children are shown getting onto the bus.]]\n\n((This panel is larger than the other three, and is set behind them.))\n[[The bus, with Ms. Frizzle at the helm and a child's face in every window, soars through a rainbow void filled with a giant amoeba, a rocket, a big gear, a planet with rings, and a Feynman diagram.]]\n\n[[The bus is parked, and the occupants have gotten out. The children stand around Ms. Frizzle, and she stands at a desk with a computer on it, typing.]]\nComputer: WIKIPEDIA -- BATTERIES\n\n{{Title text: At my OLD school, we used Microsoft Encarta 2005.}}","alt":"At my OLD school, we used Microsoft Encarta 2005.","img":"https://imgs.xkcd.com/comics/magic_school_bus.png","title":"Magic School Bus","day":"13"},{"month":"6","num":912,"link":"","year":"2011","news":"","safe_title":"Manual Override","transcript":"[[A plane is in a nosedive with smoke pouring from one wing. Text comes from someone reading in the cockpit.]]\n\"This is the emergency override system, which can be used to regain control of the aircraft.\nComplete instructions for activating this system are available as a GNU info page.\"\n\n{{Title text: I think you mean 'GNU Info Override'.}}","alt":"I think you mean 'GNU Info Override'.","img":"https://imgs.xkcd.com/comics/manual_override.png","title":"Manual Override","day":"15"},{"month":"6","num":913,"link":"","year":"2011","news":"","safe_title":"Core","transcript":"[[A cutaway diagram of the Earth, with colored layers including a labeled outer core and inner core.]]\n\n[[A closeup of the stylized outer core, labeled \"Turbulent molten metals at 30 million PSI\" with turbulence lines, and of the inner core, labeled \"moon-sized iron sphere.\"]]\n\n[[Person reading a book pulls legs up tight under office chair, peering downwards.]]\n\nI freak out about fifteen minutes into reading anything about the Earth's core when I suddenly realize it's RIGHT UNDER ME.\n\n{{Title text: If you're a geologist or geophysicist and you don't introduce yourself by saying your name, then gesturing downward and saying \"... and I study that\", I don't know what you're doing with your life.}}","alt":"If you're a geologist or geophysicist and you don't introduce yourself by saying your name, then gesturing downward and saying \"... and I study that\", I don't know what you're doing with your life.","img":"https://imgs.xkcd.com/comics/core.png","title":"Core","day":"17"},{"month":"6","num":914,"link":"","year":"2011","news":"","safe_title":"Ice","transcript":"[[Beret Guy and a friend are setting up a party, with a snack table and a big banner reading \"PARTY!\"]]\nFriend: Everything's ready ...\nFriend: Except we're out of ice.\nBeret Guy: I'll get some!\n\n[[Beret Guy is walking down the street past a building marked Save Mart, with a bag of ice over his shoulder. Someone standing on the sidewalk calls to him.]]\nPerson: Hey sexy. Where're you headed with all that ice?\nBeret Guy: A party!\nPerson: There's a BETTER party up at my place.\nBeret Guy: But I--\nPerson: C'mon, one drink.\n\nThe next morning ...\n[[Beret Guy rubs eyes groggily.]]\nBeret Guy: ... ugh ... where am I?\nBeret Guy: I was supposed to--\nBeret Guy: --where's all my ice!?\n\n[[Beret Guy looks down to find himself in a bathtub full of kidneys.]]\nBeret Guy: AAAAAAAAAAAAAAAAAAAAAAAA\n\n{{Title text: On the plus side, she wrote 'Welcome to the AAA Club!' in lipstick on the bathroom mirror, and left me a membership\nroadside assistance card on the counter.}}","alt":"On the plus side, she wrote 'Welcome to the AAA Club!' in lipstick on the bathroom mirror, and left me a membership/roadside assistance card on the counter.","img":"https://imgs.xkcd.com/comics/ice.png","title":"Ice","day":"20"},{"month":"6","num":915,"link":"","year":"2011","news":"","safe_title":"Connoisseur","transcript":"[[A man in a white hat is standing with another man. They each hold a wine glass in one hand, in the man in the hat is holding a bottle of wine in the other. He looks at the label.]]\nHat man: How do you stand this cheap wine?\nMan #2: Wine all tastes the same to me.\n\n[[Close-up of Hat Man.]]\nHat man: You've just never had \ngood\n wine. If you paid more attention, you'd realize there's a whole world here.\n\n[[Close-up on the other man, who spreads his arms, sloshing his wine slightly.]]\nMan #2: But that's true of \nanything!\n Wine, house music, fonts, ants, Wikipedia signatures, Canadian surrealist porn- spend enough time with any of them and you'll become a snobby connoisseur.]]\n\n((This panel has no border and is next to but aligned further down than the first three panels.))\n[[The full frame of the two characters again. Hat man now has the bottle at his side.]]\nHat man: But some things do have more depth than others.\nMan #2: If you locked people in a box for a year with 500 still frames of Joe Biden eating a sandwich, by the end they'd be adamant that some were great and some were terrible.\nHat man: You're exaggerating.\nMan #2: Oh yeah?\n\n((This panel is below the others, and is indented about a third of the way to the right. It is wide.))\nA YEAR LATER\n[[A box. Voices emanate from inside.]]\nVoice #1: Sure, most closed-mouth frames are boring, but in #415, the way the man's jaw frames the mayo on his hand is pure perfection, and--\nVoice #2: What a surprise- \nyou\n praising a mayo frame. Listening to you, I'd think there was nothing else in The Sandwich. -- Frankly, the light hitting J.B.'s collar through the lettuce would put #242 in my top ten even if he had \nno\n may on his hand at \nall\n.\n\n{{Title text: Our brains have just one scale, and we resize our experiences to fit.}}","alt":"Our brains have just one scale, and we resize our experiences to fit.","img":"https://imgs.xkcd.com/comics/connoisseur.png","title":"Connoisseur","day":"22"},{"month":"6","num":916,"link":"","year":"2011","news":"","safe_title":"Unpickable","transcript":"HackerShield geek-proof safe system:\n[[Two boxes sit side by side. One is a safe with a lock marked \"Unpickable.\" It is labeled: (1) 24-pin dual-tumbler radial-hybrid lock (rendered unopenable by a fused 17th pin). The other is a shoebox. It is labeled: (2) Shoebox containing your valuables.]]\n\n{{Title text: The safe is empty except for an unsolved 5x5 Rubik's cube.}}","alt":"The safe is empty except for an unsolved 5x5 Rubik's cube.","img":"https://imgs.xkcd.com/comics/unpickable.png","title":"Unpickable","day":"24"},{"month":"6","num":917,"link":"","year":"2011","news":"","safe_title":"Hofstadter","transcript":"[[A man sits at a desk, working on a laptop. A woman approaches the desk and picks up a tiny book.]]\nWoman: What's this? \nMan: Douglas Hofstadter's six-word autobiography. After all those 700-page tomes, I guess he wanted to try for brevity.\nWoman: Huh. Let's see...\n\n[[Close up of woman, reading the tiny book.]]\nBook: I'm So Meta, Even This Acronym\n\n[[Full shot of man and woman again. The woman looks down at the tiny book in her hand.]]\nWoman: ...whoa.\nMan: I think he nailed it.\n\n{{Title text: \"This is the reference implementation of the self-referential joke.\"}}","alt":"\"This is the reference implementation of the self-referential joke.\"","img":"https://imgs.xkcd.com/comics/hofstadter.png","title":"Hofstadter","day":"27"},{"month":"6","num":918,"link":"","year":"2011","news":"","safe_title":"Google+","transcript":"Girl: You should join Google!+\nBoy: What is it?\nGirl: Not Facebook!\nBoy: What's it like?\nGirl: Facebook!\n\n[Boy considers.]\n\nBoy: Oh, what the hell.\nBoy: I guess that's all I really wanted.\n<<click>>\n\n{{Title text: On one hand, you'll never be able to convince your parents to switch. On the other hand, you'll never be able to convince your parents to switch!}}","alt":"On one hand, you'll never be able to convince your parents to switch. On the other hand, you'll never be able to convince your parents to switch!","img":"https://imgs.xkcd.com/comics/googleplus.png","title":"Google+","day":"29"},{"month":"7","num":919,"link":"","year":"2011","news":"","safe_title":"Tween Bromance","transcript":"{{Title text: Verbiage. Va-jay-jay. Irregardless.}}\n\n\n((All of person 1's lines are overlaid over the entire comic; the panels listed are merely the ones directly under each sentence fragment.)) \n[[Person one is standing smugly behind person two, who is seated in front of a computer and typing]] \nPerson 1: BY MY GUESSTIMATE,\n\nPerson 1: MY FRENEMY YIFFED SO HARD\n\nPerson 1: HER MOIST TAINT MADE\n[[Person 2's eye twitches]]\n\nPerson 1: HER PANTIES PREGGERS!\nPerson 2: STOP IT STOP IT!\n[[Person two covers ears]]","alt":"Verbiage. Va-jay-jay. Irregardless.","img":"https://imgs.xkcd.com/comics/tween_bromance.png","title":"Tween Bromance","day":"1"},{"month":"7","num":920,"link":"","year":"2011","news":"Oops! It seems I <a href=\"https://blog.xkcd.com/2011/07/04/oops/\">wasn't the first one</a> to do this joke.","safe_title":"YouTube Parties","transcript":"[[One person is standing by a laptop, showing a video to a group with drinks.]]\nThe problem with YouTube parties:\nPerson (thinking): This video is blowing their MINDS.\nGroup (thinking): Oh man, I know what video we should watch once this is over.\n\n{{Title text: This reminds me of that video where ... no? How have you not seen that? Oh man, let me find it. No, it's ok, we can go back to your video later.}}","alt":"This reminds me of that video where ... no? How have you not seen that? Oh man, let me find it. No, it's ok, we can go back to your video later.","img":"https://imgs.xkcd.com/comics/youtube_parties.png","title":"YouTube Parties","day":"4"},{"month":"7","num":921,"link":"","year":"2011","news":"","safe_title":"Delivery Notification","transcript":"[[The first panel is a UPS InfoNotice(r).  Most of the text on it is just scribbles, though the company logo and header is clear.]]\n\n[[A person opens their door to see the InfoNotice(r).  From off panel, a second person reacts.]]\nPerson:  \nWhat!\n  I've been here all day!\nOff-panel person 2: Huh?\nPerson: They have my laptop.\n\n[[Now both people are visible.  The first is making an expansive gesture of annoyance.]]\nPerson 2: So get it tomorrow.\nPerson: I fly out in the morning and they don't open till noon!\nPerson 2: Sucks.\n\n[[The first person is at a laptop.  The second is once again off-panel.]]\nPerson: It's \nright there\n.  I can see the UPS building on the map.\nOff-panel person 2: Ok...\n\n[[Dramatic zoom to the person's upper torso and face, along with clenched fist.]]\nPerson: My laptop is there.  It's \nmine\n.\nPerson: I'm going to get it.\n\n[[Even more dramatic zoom!  The person's featureless face fills the panel.]]\nOff-panel person 2: They won't let you.\nPerson: Who are they to keep from me what is mine?\nOff-panel person 2: Dude, they --\n\n[[The person spins, raising a finger, most likely to indicate some sort of quest at hand.]]\nPerson: A quest is at hand!\nOff-panel person 2: Security's gonna throw you out.\nPerson: I fear neither death nor pain.  But I will not go unarmed.\n\n((Three inset panels overlap, in a montage format.  The person narrates.))\n[[Elves in long robes stand around a table, on which lies a broken sword.]]\nNarrating person: Light the beacons and send word to the Elves.  They must reforge the sword of my fathers.\n\n[[An Elf beats the sword together on an anvil.]]\n\n[[An Elf rides a horse, silhouetted by the full moon.]]\nNarrating person: Ere dawn, I will go forth to the Sorting Depot.\n\n((The montage ends and normal panels resume.))\n[[The Elf knocks at the door, sword in scabbard held under arm.]]\n<<Knock knock knock knock>>\n\n[[The person opens the door, to find a second InfoNotice(r) stuck on top of the first.  The Elf is gone.]]\n\n{{Title text: You can arrange a pickup of your sword in Rivendell between the hours of noon and 7:00 PM.}}","alt":"You can arrange a pickup of your sword in Rivendell between the hours of noon and 7:00 PM.","img":"https://imgs.xkcd.com/comics/delivery_notification.png","title":"Delivery Notification","day":"6"},{"month":"7","num":922,"link":"","year":"2011","news":"","safe_title":"Fight Club","transcript":"Friend: But Fight Club isn't really about fighting. It's about the way society--\nPerson: Nope, don't wanna hear it.\nFriend: But it says consumers are--\nPerson: This conversation is over.\n\nThe first rule of talking to me about movies is do NOT talk about Fight Club.\n\n{{Title text: I'm not saying it's all bad, but that movie has not aged as well as my teenage self in 2000 was confident it would.}}","alt":"I'm not saying it's all bad, but that movie has not aged as well as my teenage self in 2000 was confident it would.","img":"https://imgs.xkcd.com/comics/fight_club.png","title":"Fight Club","day":"8"},{"month":"7","num":923,"link":"","year":"2011","news":"","safe_title":"Strunk and White","transcript":"{{Title text: The best thing about Strunk\nWhite fanfiction is that it's virtually guaranteed to be well written.}}\n\n[[3 dignified-looking editors of Strunk & White's \"The Elements of Style\" before a desk with a computer. One is seated and types the following:]]\n\nDear Internet,\n\n    We, the current editors of Strunk & White's \"The Elements of Style\", must -with great reluctance- clarify a point of orthography:\n\n    \"Strunk & White\" should be used for the style manual and \"Strunk\nWhite\" for the erotic fan fiction pairing.","alt":"The best thing about Strunk/White fanfiction is that it's virtually guaranteed to be well written.","img":"https://imgs.xkcd.com/comics/strunk_and_white.png","title":"Strunk and White","day":"11"},{"month":"7","num":924,"link":"","year":"2011","news":"","safe_title":"3D Printer","transcript":"{{Title text: I just can't wait for the Better Homes and Gardens list of helpful tips for household reuse of sixteen-inch acrylonitrile-butadiene-styrene phalluses.}}\n\n[[Two people before a 3D printer, one with a wrench]]\nPerson 1: 3D printers are getting incredible.\nPerson 2: I think we're not far from widespread deployment.\n\nPerson 2: And you know what that means.\n\nPerson 1: Spam containing actual enlarged penises?\nPerson 2: I give it a week.","alt":"I just can't wait for the Better Homes and Gardens list of helpful tips for household reuse of sixteen-inch acrylonitrile-butadiene-styrene phalluses.","img":"https://imgs.xkcd.com/comics/3d_printer.png","title":"3D Printer","day":"13"},{"month":"7","num":925,"link":"","year":"2011","news":"","safe_title":"Cell Phones","transcript":"[[A person is holding a cellphone.  The black hat guy is sitting at a desk with a laptop.]]\nPerson: Another huge study found no evidence that cell phones cause cancer.  What was the W.H.O. thinking?\nBlack Hat Guy: I think they just got it backward.\n\n[[The black hat guy swivels in his chair, holding the laptop by the upper edge of the screen.]]\nPerson: Huh?\nBlack Hat Guy: Well, take a look.\n\n[[There is a plot of total cancer incidence and cell phone users.  Cancer rises from 1970 to 1990, then stays relatively steady.  Cell phone use rises from 1980 to the present.]]\n\nPerson: You're not... There are \nso\n many problems with that.\nBlack Hat Guy: Just to be safe, until I see more data I'm going to assume cancer causes cell phones.\n\n{{Title text: He holds the laptop like that on purpose, to make you cringe.}}","alt":"He holds the laptop like that on purpose, to make you cringe.","img":"https://imgs.xkcd.com/comics/cell_phones.png","title":"Cell Phones","day":"15"},{"month":"7","num":926,"link":"","year":"2011","news":"","safe_title":"Time Vulture","transcript":"[[A bird with apparently fractal wings hovers above a dude, standing with a friend.]]\nFriend: Dude, you've got a Time Vulture.\nDude: Holy crap! What is it?\n\nFriend: They're predators that use aging to kill prey.\nDude: Huh? What do you mean?\n\n[[The panel zooms in on the Friend's face.  Dude comments from off-panel.]]\nFriend: They live for millenia and use little energy. They can slow down their internal clocks so time speeds past. To hunt, they lock on to some prey, and when it stops moving, they eat it.\nDude (off-panel): But what if the prey doesn't die?\n\nFriend: I don't think you quite understand.\nDude: I mean, \nI'm\n not about to die...\nFriend: From the vulture's viewpoint, everyone says that moments before they do.\n\n{{Title text: In a way, all vultures are Time Vultures; some just have more patience than others.}}","alt":"In a way, all vultures are Time Vultures; some just have more patience than others.","img":"https://imgs.xkcd.com/comics/time_vulture.png","title":"Time Vulture","day":"18"},{"month":"7","num":927,"link":"","year":"2011","news":"","safe_title":"Standards","transcript":"HOW STANDARDS PROLIFERATE\n(See: A\nC chargers, character encodings, instant messaging, etc.)\n\nSITUATION:\nThere are 14 competing standards.\n\nGeek: 14?! Ridiculous! We need to develop one universal standard that covers everyone's use cases.\nFellow Geek: Yeah!\n\nSoon:\nSITUATION:\nThere are 15 competing standards.\n\n{{Title text: Fortunately, the charging one has been solved now that we've all standardized on mini-USB. Or is it micro-USB? Shit.}}","alt":"Fortunately, the charging one has been solved now that we've all standardized on mini-USB. Or is it micro-USB? Shit.","img":"https://imgs.xkcd.com/comics/standards.png","title":"Standards","day":"20"},{"month":"7","num":928,"link":"","year":"2011","news":"","safe_title":"Mimic Octopus","transcript":"Southeast Asian Sea Life\nIdentification Chart\n[[There are silhouettes of eight individual fish, a school of fish, a scuba diver, an anemone, a submarine, and an anchor, each labeled \"Mimic Octopus.\" There is also a silhouette of an octopus, labeled \"Two Mimic Octopuses.\"]]\n\n{{Title text: Even if the dictionaries are starting to give in, I refuse to accept 'octopi' as a word mainly because--I'm not making this up--there's a really satisfying climactic scene in the Orson Scott Card horror novel 'Lost Boys' which hinges on it being an incorrect pluralization.}}","alt":"Even if the dictionaries are starting to give in, I refuse to accept 'octopi' as a word mainly because--I'm not making this up--there's a really satisfying climactic scene in the Orson Scott Card horror novel 'Lost Boys' which hinges on it being an incorrect pluralization.","img":"https://imgs.xkcd.com/comics/mimic_octopus.png","title":"Mimic Octopus","day":"22"},{"month":"7","num":929,"link":"","year":"2011","news":"","safe_title":"Speculation","transcript":"[[Two people are playing basketball, and black hat guy is looking at a phone.]]\nPerson #1: Do you seriously think \neveryone\n will move to Plus? It was hard enough getting them on Facebook.\n[[Person #2 attempts to throw the basketball through the hoop, but it bounces off.]]\n\nPerson #2: Do they have to?\nPerson #2: My mom still uses AOL - it doesn't mean my social life has to happen there.\n[[Person #1 passes the basketball back to #2.]]\n\nPerson #2: Universal adoption isn't everything. I mean, IRC is still --\n[[Person #2 throws the basketball.]]\n\n[[An arrow pierces the ball.]]\n<<THUNK>>\n\n[[The black hat guy has a one handed crossbow, and is still looking at a phone.]]\nPerson #2: You're not really the \"catch\" type, are you?\nBlack Hat Guy: I am not.\n\n{{Title text: 'I was pretty good at skeet shooting, but was eventually kicked off the range for catching the clay pigeons in a net and dispatching them execution-style.'}}","alt":"'I was pretty good at skeet shooting, but was eventually kicked off the range for catching the clay pigeons in a net and dispatching them execution-style.'","img":"https://imgs.xkcd.com/comics/speculation.png","title":"Speculation","day":"25"},{"month":"7","num":930,"link":"https://xkcd.com/930/large/","year":"2011","news":"","safe_title":"Days of the Week","transcript":"((The whole comic is a single panel, with a circular diagram of the days of the week.))\nPolar graph of what stuff happens on which days, based on number of Google results for phrases like \"company meeting on <day>.\"\nThe relative frequency of <day> in <phrase> is shown by the distance from the center at which <phrase>'s line crosses <day>.\nEach curve is normalized to have the same number of total hits - they're not on the same scale.\n((Not easy to reproduce the actual plot, these are the phrases, in order of popularity on Wednesday.))\n1. <day> is ladies night\n2. announced <day>\n3. company meeting on <day> \n company meeting <day>\n4. due on <day>\n5. got laid <day>\n6. drunk on <day> \n so drunk <day>\n7. <day> is the big day\n8. Church <day>\n9. got my period <day>\n10. we broke up on <day>\n11. <day> sucked\n((Thursday, from most common to least common: 11, 2, 1, 3, 9, 4, 5, 7, 10, 6, 8))\n((Friday, from most common to least common: 10, 4, 6, 7, 5, 9, 11, 3, 2, 1, 8))\n((Saturday, ditto: 6, 7, 5, 11, 9, 10, 8, 3, 2, 1, 4))\n((Sunday, ditto: 8, 9, 7, 11, 10, 5, 6, 2, 3, 4, 1))\n((Monday, ditto: 4, 2, 9, 11, 3, 5, 10, 6, 7, 8, 1))\n((Tuesday, ditto: 3, 2, 4, 5, 1, 7, 9, 10, 11, 8, 6))\n\n{{Title text: Not pictured: the elongated Halley's-Comet-like orbit of every Rebecca Black lyric.}}","alt":"Not pictured: the elongated Halley's-Comet-like orbit of every Rebecca Black lyric.","img":"https://imgs.xkcd.com/comics/days_of_the_week.png","title":"Days of the Week","day":"27"},{"month":"7","num":931,"link":"","year":"2011","news":"<a href=\"https://blog.xkcd.com/2011/06/30/family-illness/\">Some context</a>.","safe_title":"Lanes","transcript":"((The panels are arranged top to bottom.  The first is set above a larger image.))\nPerson: So, are you guys out of the woods?\nSecond Person: We don't know.\nPerson: Well, did the treatment work?\nSecond Person: We don't know.\n\n[[The diagram shows a simple highway.  Starting at the bottom, with diagnosis for five lanes, the road travels through a cloud of treatment, after which two lanes disappear, and three continue.  Later on, there's another offramp labeled 'cancer \"comes back\"', which loops back into the treatment cloud.  Otherwise, the highway enters a later cloud called survive.]]\nI always assumed that when you got cancer, they gave you a prognosis, then treated you, and at the end of treatment either you beat it or you died.\nAnd I knew sometimes it \"recurred,\" which I assumed meant back to square one.\nBut that's turned out not to be quite right.\n\n[[Back to the two people.]]\nSecond Person: Once most cancers spread out into your body, they're incurable.\nSecond Person: If your 10-year prognosis is 60%, that means a 40% chance that some cancer will slip past the treatment and get out.\n\nSecond Person: So they kill all the cancer they can find, and then you're a \"survivor.\"  But your odds are still 60%.\n\n[[The frame zooms just to show the second person.]]\nSecond Person: They can't scan for individual cancer cells.  The only way to know if it worked is to wait for tumors to pop up elsewhere.\nSecond Person: If you go enough years without that happening then you were in the 60%.\n\n[[The frame shows both people again.]]\nSecond Person: And often the first sign is a cough or bone pain.\nSecond Person: So you spend the next five or ten years trying not to worry that every ache and pain is the answer to the question \"Do I make it?\"\n\n((There's an extra large panel, with a small one floating inside it.))\n[[The panel shows roughly fifty lanes emerging from the cloud of 'Treatment'.  Signs show 1 year, 2 years, 3 years, 4 years, 5 years, 6 years.  Lanes branch off and fade into darkness earlier on the right, with some lanes continuing off the top of the panel.]]\n\n((Inset panel.))\nPerson: Man.\nPerson: Fuck cancer.\nSecond Person: \nSeriously.\n\n\n{{Title text: Each quarter of the lanes from left to right correspond loosely to breast cancer stages one through four (at diagnosis).}}","alt":"Each quarter of the lanes from left to right correspond loosely to breast cancer stages one through four (at diagnosis).","img":"https://imgs.xkcd.com/comics/lanes.png","title":"Lanes","day":"29"},{"month":"8","num":932,"link":"","year":"2011","news":"","safe_title":"CIA","transcript":"[[A television is showing a news anchor.  The inset picture of the news shows Anonymous wearing a monocle and top hat.]]\nAnchor: Hackers briefly took down the website of the CIA yesterday...\n\n[[A person is watching television.]]\nWhat people hear:\nAnchor: Someone hacked into the computers of the \nCIA!!\n\n\n[[A computer expert is watching television.]]\nWhat computer experts hear:\nAnchor: Someone tore down a poster hung up by the \nCIA!!\n\n\n{{Title text: It was their main recruiting poster, hung up nearly ten feet up a wall! This means the hackers have LADDER technology! Are we headed for a future where everyone has to pay $50 for one of those locked plexiglass poster covers? More after the break ...}}","alt":"It was their main recruiting poster, hung nearly ten feet up a wall! This means the hackers have LADDER technology! Are we headed for a future where everyone has to pay $50 for one of those locked plexiglass poster covers? More after the break ...","img":"https://imgs.xkcd.com/comics/cia.png","title":"CIA","day":"1"},{"month":"8","num":933,"link":"","year":"2011","news":"","safe_title":"Tattoo","transcript":"[[There is one human in the panel.  The human points at their chest.]]\nHuman: I just have one tattoo - it's six dots on my chest, done by my oncologist.\n\nHuman: I need them for aligning the laser sights on a flesh-searing relativistic particle cannon,\n\nHuman: So it will only kill the parts of me\n\n[[Dramatic zoom, the panel background is black, with white text.]]\nHuman: That are holding me back.\n\n[[The panel is larger, revealing who they're talking to.]]\nHuman: But your barbed wire bicep tattoo is pretty hardcore, too!\nDejected: No, it's OK.  I'll just go put a shirt on.\n\n{{Title text: I calculate that the electrons in radiation therapy hit you at 99.8% of the speed of light, and the beam used in a 90-second gamma ray therapy session could, if fired with less precision, kill a horse (they did not let me test this).}}","alt":"I calculate that the electrons in radiation therapy hit you at 99.8% of the speed of light, and the beam used in a 90-second gamma ray therapy session could, if fired with less precision, kill a horse (they did not let me test this).","img":"https://imgs.xkcd.com/comics/tattoo.png","title":"Tattoo","day":"3"},{"month":"8","num":934,"link":"","year":"2011","news":"","safe_title":"Mac/PC","transcript":"[[Two adult humans stand facing out of the screen.]]\nMac: I'm a Mac\nPC: And I'm a PC.\nMac & PC, together: And since you do everything through a browser now, we're pretty indistinguishable.\n\n{{Title text: It's fun to watch browsers fumblingly recapitulate the history of window management. Someday we'll have xmonad as a Firefox extension.}}","alt":"It's fun to watch browsers fumblingly recapitulate the history of window management. Someday we'll have xmonad as a Firefox extension.","img":"https://imgs.xkcd.com/comics/mac_pc.png","title":"Mac/PC","day":"5"},{"month":"8","num":935,"link":"","year":"2011","news":"","safe_title":"Missed Connections","transcript":"((The page is set up like the missed connections area of Craigslist, with a list of messages from an individual to a person they weren't able to communicate with at the time.))\nPersonals > Missed Connections\n\nYou: Clinging to hood of your stolen wienermobile, trying to reach into engine to unstick throttle\nMe: Screaming, diving out of the way\n\nYou: Vaguely human silhouette\nMe: At bottom of wishing well with harpoon gun\n\nYou: Confused UDP packet\nMe: Cisco router in 45.170\n16 block\n\nYou: Baddest fuckin' Juggalo at Violent J's party\nMe: Nancy Pelosi (D-Ca)\n\nYou: Getting married to me\nMe: Also getting married, but distracted by my phone\n\nYou: Cute boy on corner of 4th & Main, 5'11, 169lbs, social security number 078-05-1120, pockets contained $2.09 in change, keys, and a condom. Retinal scan attached\nMe: Driving street view van\n\nYou: George Herman \"Babe\" Ruth\nMe: Fellow Time Lord. Saw your tardis on third moon of <<Sentence cuts off, partially obscured by bottom of panel>>\n\n{{Title text: The Street View van isn't going to find out anything Google won't already know from reading my email.}}","alt":"The Street View van isn't going to find out anything Google won't already know from reading my email.","img":"https://imgs.xkcd.com/comics/missed_connections.png","title":"Missed Connections","day":"8"},{"month":"8","num":936,"link":"","year":"2011","news":"","safe_title":"Password Strength","transcript":"((The comic illustrates the relative strength of passwords assuming basic knowledge of the system used to generate them. A set of boxes is used to indicate how many bits of entropy a section of the password provides. The comic is laid out with 6 panels arranged in a 3x2 grid. On each row, the first panel explains the breakdown of a password, the second panel shows how long it would take for a computer to guess, and the third panel provides an example scene showing someone trying to remember the password.))\n\n[[The password \"Tr0ub4dor&3\" is shown in the centre of the panel. A line from each annotation indicates the word section the comment applies to.]]\nUncommon (non-gibberish) base word [[Highlighting the base word - 16 bits of entropy.]]\nCaps? [[Highlighting the first letter - 1 bit of entropy.]]\nCommon Substitutions [[Highlighting the letters 'a' (substituted by '4') and both 'o's (the first of which is substituted by '0') - 3 bits of entropy.]]\nPunctuation [[Highlighting the symbol appended to the word - 4 bits of entropy.]]\nNumeral [[Highlighting the number appended to the word - 3 bits of entropy.]]\nOrder unknown [[Highlighting the appended characters - 1 bit of entropy.]]\n(You can add a few more bits to account for the fact that this is only one of a few common formats.)\n\n~28 bits of entropy\n2^28 = 3 days at 1000 guesses\nsec\n(Plausible attack on a weak remote web service. Yes, cracking a stolen hash is faster, but it's not what the average user should worry about.)\nDifficulty to guess: Easy.\n\n[[A person stands scratching their head trying to remember the password.]]\nPerson: Was it trombone? No, Troubador. And one of the Os was a zero?\nPerson: And there was some symbol...\nDifficulty to remember: Hard.\n\n[[The passphrase \"correct horse battery staple\" is shown in the centre of the panel.]]\nFour random common words {{Each word has 11 bits of entropy.}}\n\n~44 bits of entropy.\n2^44 = 550 years at 1000 guesses\nsec\nDifficulty to guess: Hard.\n\n[[A person is thinking, in their thought bubble a horse is standing to one side talking to an off-screen observer. An arrow points to a staple attached to the side of a battery.]]\nHorse: That's a battery staple.\nObserver: Correct!\nDifficulty to remember: You've already memorized it\n\n((The caption below the comic reads: Through 20 years of effort, we've successfully trained everyone to use passwords that are hard for humans to remember, but easy for computers to guess.))\n\n{{Title text: To anyone who understands information theory and security and is in an infuriating argument with someone who does not (possibly involving mixed case), I sincerely apologize.}}","alt":"To anyone who understands information theory and security and is in an infuriating argument with someone who does not (possibly involving mixed case), I sincerely apologize.","img":"https://imgs.xkcd.com/comics/password_strength.png","title":"Password Strength","day":"10"},{"month":"8","num":937,"link":"","year":"2011","news":"","safe_title":"TornadoGuard","transcript":"((The comic is a single panel which resembles a reviews page for a mobile phone application))\n\nApplication name: Tornado Guard\nAuthor: DroidCoder2187\nDescription: Plays a loud alert sound when there is a tornado warning for your area.\nRating: 4 out of 5 stars. (Based on 4 reviews)\nUser Reviews:\nReviewer 1: <<Rated 5 stars>> Good UI! Many alert choices.\nReviewer 2: <<Rated 5 stars>> Running great, no crashes\nReviewer 3: <<Rated 5 stars>> I like how you can set multiple locations\nReviewer 4: <<Rated 1 star>> App did not warn me about tornado.\n\n[[The caption below the comic reads: The problem with averaging star ratings]]\n\n{{Title text: The bug report was marked 'could not reproduce'.}}","alt":"The bug report was marked 'could not reproduce'.","img":"https://imgs.xkcd.com/comics/tornadoguard.png","title":"TornadoGuard","day":"12"},{"month":"8","num":938,"link":"","year":"2011","news":"","safe_title":"T-Cells","transcript":"[[Two people are standing facing each other, having a conversation. One is holding a laptop.]]\nPerson #1 (with laptop): What's the deal with this leukemia trial? {{Citation: Nejm, Aug 10, 2011}}\nPerson #2: Gotta wait and see.\nPerson #2: Helping the immune system attack tumors has been a longtime research target.\nPerson #2: Lots of promising leads. Often they don't pan out.\n\nPerson #1: What'd these guys do?\nPerson #2: They took some of the patient's T-cells and patched their genes so they'd attack the cancer. That hasn't been enough in the past but their patch also added code to get the T-cells to replicate wildly and persist in the body.\n\nPerson #1: Which worked, but created its own set of problems?\nPerson #2: How'd you guess? But I think the craziest part is the way they insert the patched genes.\nPerson #1: How?\nPerson #2: Well, think - What specializes in invading and modifying T-cells?\nPerson #1: Seriously?\nPerson #2: Yup. Must've been a fun conversation.\n\n[[The last panel is set in a doctors office. A patient is sitting on the observation bed talking to their doctor.]]\nPatient: Ok, so I have blood cells growing out of control, so you're going to give me different blood cells that *also* grow out of control?\nDoctor: Yes, but it's ok, because we've treated *this* blood with HIV!\nPatient: Are you sure you're a doctor?\nDoctor: Almost definitely.\n\n{{Title text: 'We're not sure how to wipe out the chimeral T-cells after they've destroyed the cancer. Though I do have this vial of smallpox ...'}}","alt":"'We're not sure how to wipe out the chimeral T-cells after they've destroyed the cancer. Though I do have this vial of smallpox ...'","img":"https://imgs.xkcd.com/comics/t_cells.png","title":"T-Cells","day":"15"},{"month":"8","num":939,"link":"","year":"2011","news":"","safe_title":"Arrow","transcript":"[[An archer stands with a bow and arrow drawn tightly, aiming off-screen.]]\n\n[[They fire the arrow, it disappears offscreen. The bowstring vibrates for effect.]]\n\n[[They stand holding the bow by their side, watching the arrow fly away.]]\n\n[[A boomerang flies on-screen, coming from the direction the arrow was fired. The archer reaches up to catch the boomerang.]]\n\n[[The archer is now holding the boomerang, staring at it with confusion.]]\n\n{{Title text: 'The Return of the Boomerang' would make a great movie title.}}","alt":"'The Return of the Boomerang' would make a great movie title.","img":"https://imgs.xkcd.com/comics/arrow.png","title":"Arrow","day":"17"},{"month":"8","num":940,"link":"","year":"2011","news":"","safe_title":"Oversight","transcript":"[[A couple has sex up against a wall.]]\n\n[[A couple has sex standing in an armchair.]]\n\n[[A couple has sex in a swing, swaying above a table with a flower vase on it.]]\n\n[[Screenshot of Fitocracy. In the text field marked \"log your workout for today,\" the user has filled in \"sex,\" and the site has returned the message \"activity not found.\"]]\n\n[[The couple is standing in front of the computer; one person is at the keyboard, the other standing back wearing a towel.]]\nAt Keyboard: Come on! That was like two hours of cardio!\nIn Towel: Hmm, let's see ... the part on the dresser was KIND of like skiiing ...\n\n{{Title text: I felt so clever when I found a way to game the Fitocracy system by incorporating a set of easy but high-scoring activities into my regular schedule. Took me a bit to realize I'd been tricked into setting up a daily exercise routine.}}","alt":"I felt so clever when I found a way to game the Fitocracy system by incorporating a set of easy but high-scoring activities into my regular schedule. Took me a bit to realize I'd been tricked into setting up a daily exercise routine.","img":"https://imgs.xkcd.com/comics/oversight.png","title":"Oversight","day":"19"},{"month":"8","num":941,"link":"","year":"2011","news":"","safe_title":"Depth Perception","transcript":"((The comic is narrated by an unspecified person. All dialog is shown in boxes overlaid on the comic panels.))\n\n[[The panel background looks like a cloudy sky, with the clouds all running together and appearing as a blue\ngrey smear.]]\nI've always had trouble with the size of clouds.\nI \nknow\n they're huge. I can see their shapes.\nBut I don't really see them as objects on the same scale as trees and buildings.\nThey're a backdrop.\n\n[[A person stands on a flat disk inside a hemispherical dome with the front half cut away. The dome is labelled \"Sky\", and the disk is labelled \"Ground\". The dome is about twice as tall as the person.]]\nStars are the same way.\n\nI know they're scattered through and endless ocean, but my gut insists they're a painting on a domed ceiling.\n\n((The next two lines of dialog are stretched over the following three panels.))\n[[A person stands on a curved surface, looking up.]]\nIf I try hard enough, I get a glimmer of depth, a dizzying sense of space,\n\n[[The perspective of the scene shifts, suddenly the surface the person was standing on is in the top left of the panel. The person is now looking down, leaning back, and waving their arms trying to regain balance.]]\nBut then everything snaps back.\n\n[[The perspective of the scene returns to normal, the person is now semi-crouched, staring at the ground with legs spaced apart to help them balance.]]\n\n[[An american football field is shown, with sections at the tips of the goal posts highlighted and shown as a zoomed view in an insert box. The goal posts each have a webcam mounted on top of them.]]\nSo one summer afternoon\nI set up two HD webcams hundreds of feet apart,\nPointed them at the sky,\n\n((The next two lines of dialog are stretched over two panels each.))\n[[The first panel shows a pair of glasses with the note \"Very strong reading glasses.\" and a smartphone with an attachment designed to clip onto the glasses. The smartphone screen is setup to display two images side by side such that one camera is visible in the left half of the screen, and the other camera is visible in the right half of the screen.]]\nAnd fed one stream to each of my eyes.\n\n[[The next panel shows the completed phone\nglasses assembly.]]\nThe parallax expanded my depth perception by a thousand times,\n\n[[The person stands wearing the phone\nglasses assembly, staring into the sky.]]\nAnd I stood in my living room\nAt the bottom of an abyss\n\n[[The person now stands on the shore of an unidentified coastline (possibly Boston?), a city is near their right foot and the tallest skyscraper appears ankle high. A mountain range is behind them that is also barely ankle high. The person is standing with their head well above cloud level as clouds swim around them.]]\nWatching mountains drift by.\n\n{{Title text: I've looked at clouds from both sides now.}}","alt":"I've looked at clouds from both sides now.","img":"https://imgs.xkcd.com/comics/depth_perception.png","title":"Depth Perception","day":"22"},{"month":"8","num":942,"link":"","year":"2011","news":"","safe_title":"Juggling","transcript":"[[The panel shows a close up of a person reading a book. The book is called \"How To Juggle\" and has a picture of a person juggling on the cover.]]\n\n[[The view now shows the entirety of the person. A book is splayed on the floor behind them, and they are holding some juggling balls.]]\n\n[[The person throws the juggling balls in the air.]]\n\n[[They lower their arms to prepare to catch the balls. The balls are still hovering in mid-air.]]\n\n[[The person now stands with their arms by their sides. The balls have not moved and are still suspended in mid-air.]]\n\n[[The person jumps, trying to grab the lowest ball. They can't reach.]]\n\n[[The person scratches their head and stares at the still floating juggling balls.]]\n\n[[They throw the book into a trash can.]]\n\n{{Title text: Later: 'Why is there a book hovering over the trash can?'}}","alt":"Later: 'Why is there a book hovering over the trash can?'","img":"https://imgs.xkcd.com/comics/juggling.png","title":"Juggling","day":"24"},{"month":"8","num":943,"link":"","year":"2011","news":"","safe_title":"Empirical","transcript":"[[Two people are standing together, one with long hair (presumably female) and one without visible hair (presumably male).]]\nWoman: Will you marry me?\n\n[[The male person throws his hands in the air excitedly.]]\nMan: Let's find out!\n\n[[The couple are now standing in front of an altar. A flower arch stretches over the couple and a person is standing behind the altar. The female person is wearing a knee length white dress and a veil. The male person is wearing a bow tie. They are holding hands.]]\n\n[[The couple stand together, still dressed from the wedding and still holding hands.]]\nMan: Apparently, yes!\n\n{{Title text: I'm as surprised as you!}}","alt":"I'm as surprised as you!","img":"https://imgs.xkcd.com/comics/empirical.png","title":"Empirical","day":"26"},{"month":"8","num":944,"link":"","year":"2011","news":"","safe_title":"Hurricane Names","transcript":"[[A weather reporter sits behind a desk with an image of the Gulf of Mexico and surrounding land masses displayed to his left. 9 hurricane symbols are scattered across the map, primarily over Cuba.]]\nReporter: After the latest wave of hurricanes, not only have we run through the years lit of 21 names, but we've also used up the backup list of Greek letters. All subsequent storms will be named using random dictionary words.\nReporter: The newly-formed system in the gulf has been designated \"Hurricane Eggbeater\", and we once again pray this is the final storm of this horrible, horrible season.\n\n{{Title text: After exhausting the OED, we started numbering them. When overlapping hurricanes formed at all points on the Earth's surface, and our scheme was foiled by Cantor diagonalization, we just decided to name them all \"Steve\". Your local forecast tomorrow is \"Steve\". Good luck.}}","alt":"After exhausting the OED, we started numbering them. When overlapping hurricanes formed at all points on the Earth's surface, and our scheme was foiled by Cantor diagonalization, we just decided to name them all \"Steve\". Your local forecast tomorrow is \"Steve\". Good luck.","img":"https://imgs.xkcd.com/comics/hurricane_names.png","title":"Hurricane Names","day":"29"},{"month":"8","num":945,"link":"","year":"2011","news":"","safe_title":"I'm Sorry","transcript":"[[Two people are standing next to each other having a conversation.]]\nPerson 1: My Mom's house burned down.\nPerson 2: Oh! I'm sorry!\nPerson 1: Why? It's not \nyour\n fault.\nPerson 2: It's nice of you to say that, but I know what I did.\n\nIt annoys me when people interpret an obviously sympathetic \"I'm sorry\" as an apology, so I've started responding by making it one.\n\n{{Title text: You know I've always hated her.}}","alt":"You know I've always hated her.","img":"https://imgs.xkcd.com/comics/im_sorry.png","title":"I'm Sorry","day":"31"},{"month":"9","num":946,"link":"","year":"2011","news":"","safe_title":"Family Decals","transcript":"[[Two cars are parked next to each other. The car on the left is an urban SUV and has stickers on the rear window representing a family. From left to right there is an adult male, adult female, female youth, male youth, and young child. The car on the right is a sporty hatch back, it has similar stickers on the rear window, with an adult male and adult female. Instead of the youth and child stickers there is instead a large pile of money.]]\n\n{{Title text: My decal set has no adults, just a sea of hundreds of the little girl figures closing in around a single cat.}}","alt":"My decal set has no adults, just a sea of hundreds of the little girl figures closing in around a single cat.","img":"https://imgs.xkcd.com/comics/family_decals.png","title":"Family Decals","day":"2"},{"month":"9","num":947,"link":"","year":"2011","news":"","safe_title":"Investing","transcript":"Person 1: Sure, 2% interest may not *seem* like a lot. But it's *compound*!\n\n[[Person 2 opens a computer and begins calculating]]\nPerson 1: If you invest $1,000 now, in just ten short years you'll have.. ..let's see..\n\nPerson 1: ..$1,279.\n\nPerson 1: Ok, so compound interest isn't some magical force.\nPerson 2: Yeah, I'm just gonna try to make more money.\n\n{{Title text: But Einstein said it was the most powerful force in the universe, and I take all my investment advice from flippant remarks by theoretical physicists making small talk at parties.}}\n","alt":"But Einstein said it was the most powerful force in the universe, and I take all my investment advice from flippant remarks by theoretical physicists making small talk at parties.","img":"https://imgs.xkcd.com/comics/investing.png","title":"Investing","day":"5"},{"month":"9","num":948,"link":"","year":"2011","news":"","safe_title":"AI","transcript":"[[A person with shoulder length hair sits on a wheeled computer chair at a desk. A laptop computer is on the desk playing some sort of media with audio. The person is facing away from the computer addressing someone off panel.]]\nPerson: Did you see the Cleverbot-Cleverbot chat?\nComputer: I am not a robot. I'm a unicorn.\n\n[[The first person has wheeled away from the desk and is now seating in front of the second person.]]\nPerson 2: Yeah. It's hilarious, but it's just clumsily sampling a huge database of lines people have typed. Chatterbots still have a long way to go.\n\n[[The panel shows a close-up of the first persons head and shoulders. They have a hand to their chin and appear to be contemplating the last remark.]]\nPerson 1: So... Computers have mastered playing chess and driving cars across the desert, but can't hold five minutes of normal conversation?\nPerson 2 (off-screen): Pretty much.\n\n[[The panel shows a wide view of both people again.]]\nPerson 1: Is it just me, or have we created a Burning Man attendee?\n\n{{Title text: And they both react poorly to showers.}}","alt":"And they both react poorly to showers.","img":"https://imgs.xkcd.com/comics/ai.png","title":"AI","day":"7"},{"month":"9","num":949,"link":"","year":"2011","news":"","safe_title":"File Transfer","transcript":"[[A person stands near a computer, talking on the phone to another person.]]\n\nPerson 1: You want your cousin to send you a file? easy. He can email it to- ... Oh, it's 25 MB? Hmm...\nPerson 1: Do either of you have an FTP server? No, right.\nPerson 1: If you had web hosting, you could upload it...\nPerson 1: Hm. We could try one of those MegaShareUpload stes, but they're flaky and full of delays and porn popups.\nPerson 1: How about AIM Direct Connect? Anyone still use that?\nPerson 1: Oh, wait, Dropbox! It's tis recent startup from a few years back that syncs folders between computers. You just need to make an account, install the-\nPerson 1: Oh, he just drove over to your house with a USB drive?\nPerson 1: Uh, cool, that works too.\nI like how we've had the internet for decades, yet \"sending files\" is something early adopters are still figuring out how to do.\n\n{{Title text: Every time you email a file to yourself so you can pull it up on your friend's laptop, Tim Berners-Lee sheds a single tear.}}","alt":"Every time you email a file to yourself so you can pull it up on your friend's laptop, Tim Berners-Lee sheds a single tear.","img":"https://imgs.xkcd.com/comics/file_transfer.png","title":"File Transfer","day":"9"},{"month":"9","num":950,"link":"","year":"2011","news":"","safe_title":"Mystery Solved","transcript":"[[A twin prop airplane flies high overhead.]]\nOff-screen person: What's that airplane?\n\n[[The plane lands, a pilot steps out and waves to the crowd.]]\nOff-screen person: Holy crap - Is that Amelia Earhart?\n\n[[The frame shows a close up of Amelia Earhart.]]\nAmelia: Hey everyone! My flight was a success!\nOff-screen person: But... Where were you?\n\n[[The frame shows a wide view of Amelia again, she stops waving.]]\nAmelia: I flew around the world!\nOff-screen person: But you disappeared in 1937!\n\nAmelia: Right, to fly around the world.\nOff-screen person: It's 2011!\nAmelia: The world is big. It's a long flight.\n\nOff-Screen person: But you...\nOff-Screen person: It's not...\nOff-Screen person: I-\nAmelia: Can I talk to someone smarter?\n\n{{Title text: The Roanoke Lost Colonists founded Roanoke, the Franklin Expedition reached the Pacific in 2009 when the Northwest Passage opened, and Jimmy Hoffa currently heads the Teamsters Union--he just started going by 'James'.}}","alt":"The Roanoke Lost Colonists founded Roanoke, the Franklin Expedition reached the Pacific in 2009 when the Northwest Passage opened, and Jimmy Hoffa currently heads the Teamsters Union--he just started going by 'James'.","img":"https://imgs.xkcd.com/comics/mystery_solved.png","title":"Mystery Solved","day":"12"},{"month":"9","num":951,"link":"","year":"2011","news":"","safe_title":"Working","transcript":"[[A person is standing next to a petrol bowser filling their vehicle with petrol. They are being addressed by a different person, who is pointing off-screen.]]\nPerson 2 (talking to 1): Why are you going here? Gas is ten cents a gallon cheaper at the station five minutes that way.\nPerson 1 (pumping gas): Because a penny saved is a penny earned\n\n((The caption below the panel reads: \"If you spend nine minutes of your time to save a dollar, you're working for less than minimum wage.\"))\n\n{{Title text: And if you drive a typical car more than a mile out of your way for each penny you save on the per-gallon price, it doesn't matter how worthless your time is to you--the gas to get you there and back costs more than you save.}}","alt":"And if you drive a typical car more than a mile out of your way for each penny you save on the per-gallon price, it doesn't matter how worthless your time is to you--the gas to get you there and back costs more than you save.","img":"https://imgs.xkcd.com/comics/working.png","title":"Working","day":"14"},{"month":"9","num":952,"link":"","year":"2011","news":"","safe_title":"Stud Finder","transcript":"[[The Hat man sit on a couch, reading a book. A person is approaching him from behind the couch holding a picture in a frame, a screwdriver, and some screws.]]\nPerson: Have you seen my stud finder? I've looked everywhere.\nHat man: It sounds like you may be interested in my new product, a--\nPerson: Shut up.\n\n{{Title text: According to every stud finder I've tried to use, my walls contain a rapidly shifting network of hundreds and hundreds of studs.}}","alt":"According to every stud finder I've tried to use, my walls contain a rapidly shifting network of hundreds and hundreds of studs.","img":"https://imgs.xkcd.com/comics/stud_finder.png","title":"Stud Finder","day":"16"},{"month":"9","num":953,"link":"","year":"2011","news":"","safe_title":"1 to 10","transcript":"[[Two people are talking.]]\nPerson 1: On a scale of 1 to 10, how likely is it that this question is using Binary?\nPerson 2: ...4?\nPerson 1: What's a 4?\n\n{{Title text: If you get an 11\n100 on a CS test, but you claim it should be counted as a 'C', they'll probably decide you deserve the upgrade.}}","alt":"If you get an 11/100 on a CS test, but you claim it should be counted as a 'C', they'll probably decide you deserve the upgrade.","img":"https://imgs.xkcd.com/comics/1_to_10.png","title":"1 to 10","day":"19"},{"month":"9","num":954,"link":"","year":"2011","news":"","safe_title":"Chin-Up Bar","transcript":"[[Hat man is standing on an escalator as it ascends. He is carrying a pole with what looks like a bracket on each end, resting on his shoulder. In front of him is a punk with spiked hair and a girl with her hair in a ponytail. Behind him is a featureless person and a man wearing glasses with a goatee standing next to someone with short hair.]]\n\n[[The view closes on hat man and the person behind him. In the background a girl can be seen standing on the descending escalator.]]\nPerson: This is a long escalator.\nHat man: 70 meters. Longest in the country.\n\n[[The view opens a bit wider. In the background the girl from the last panel has now passed the group and a few other people can be seen descending.]]\n\nPerson: Why're you carrying a chin-up bar?\nHat man: Why aren't you wearing a hat?\n\n[[The view opens up to show the same people in the first panel. They're near the top of the escalator now and the girl with the ponytail is beginning to step off.]]\nPerson: Seriously, why did you bring it?\nHat man: How should I know? I'm not a psychologist.\n\n[[As hat man steps off the escalator he turns and installs the chin-up bar such that it blocks people from leaving the escalator. The person talking to him turns to observe what hat man is doing.]]\n<<Twist>>\n<<Click click>>\n\n[[They get onto the descending escalator. The man with glasses and a goatee and his companion are blocked from leaving the escalator by the chin-up bar.]]\n\n((The next panel is the size of 6 regular panels combined.))\n[[The view shows an extended section of the escalator, the top right has become a pile of people all squished together and on top of each other. One person has grabbed another by the hair and is standing on a third person in an attempt to not fall. Someone is falling off the pile and another person is running down the escalator to avoid them. People closer to the bottom of the escalator are looking horrified at the scene ahead of them. In the background hat man and his companion are visible. Hat man is looking toward the bottom of the escalator, not caring or noticing the chaos unfolding. His companion looks back pensively.]]\n\n{{Title text: Those few who escaped found the emergency cutoff box disabled. The stampede lasted two hours and reached the bottom three times.}}","alt":"Those few who escaped found the emergency cutoff box disabled. The stampede lasted two hours and reached the bottom three times.","img":"https://imgs.xkcd.com/comics/chin_up_bar.png","title":"Chin-Up Bar","day":"21"},{"month":"9","num":955,"link":"","year":"2011","news":"","safe_title":"Neutrinos","transcript":"[[Two people are talking.]]\nPerson 1: Did you see the neutrino speed of light thing?\nPerson 2: Yup! Good news; I need the cash.\nPerson 1: Huh? Cash?\n\n((Text above half-sized panel.))\nYeah. When there's a news story about a study overturning all of physics, i used to urge caution, remind people that experts aren't all stupid, and end up in pointless arguments about Galileo.\n\n((Half-height panel.))\n[[Man sitting on chair, looking down at laptop in his lap. Books and things are on a desk in front of him.]]\nMan: No, this isn't \nabout\n whether relativity exists. If it didn't, your GPS wouldn't work. -- What do you mean, \"science thought police\"? Have you seen our budget? We couldn't \nbegin\n to afford our own thought police.\n\n[[Two talking people again.]]\nPerson 1: That sounds miserable and unfulfilling.\nPerson 2: Yup. So I gave up, and now I just find excited believers and bet them $200 each that the new result won't pan out.\n\n[[Same as last panel.]]\nPerson 1: That's mean.\nPerson 2: It provides a good income, and if I'm ever wrong, I'll be too excited about the new physics to notice the loss.\n\n{{Title text: I can't speak to the paper's scientific merits, but it's really cool how on page 10 you can see that their reference GPS beacon is sensitive enough to pick up continental drift under the detector (interrupted halfway through by an earthquake).}}","alt":"I can't speak to the paper's scientific merits, but it's really cool how on page 10 you can see that their reference GPS beacon is sensitive enough to pick up continential drift under the detector (interrupted halfway through by an earthquake).","img":"https://imgs.xkcd.com/comics/neutrinos.png","title":"Neutrinos","day":"23"},{"month":"9","num":956,"link":"","year":"2011","news":"","safe_title":"Sharing","transcript":"[[Two people hang out in front of a tree]]\nPerson 1: Whoa. What's this?\nPerson 2: What's what?\nPerson 1: This tree has a USB port.\n\nPerson 2: Try connecting to it, I guess\n[[Person 1 brings out a laptop and connects to it]]\nPerson 1: It's offering up a drive with one file on it.\n\nPerson 2: What's the file?\nPerson 1: An eBook.  \"Shel_Silverstein_-_The_Giving_Tree.azw\"\nPerson 2: Never heard of it. Let's take a look!\n\nLaptop: DRM Error: You have not purchased rights to view this title. Lending is not enabled.\n\nPerson 2: Huh. Oh well.\nPerson 1: Let's go see what Mike is up to.\n\n[[The tree is alone]]\n\n{{Title text: In the new edition of The Giving Tree, the tree uses social tools to share with its friend all the best places to buy things.}}\n","alt":"In the new edition of The Giving Tree, the tree uses social tools to share with its friend all the best places to buy things.","img":"https://imgs.xkcd.com/comics/sharing.png","title":"Sharing","day":"26"},{"month":"9","num":957,"link":"","year":"2011","news":"","safe_title":"Development","transcript":"[[News anchor at desk reporting]]\nReporter: Fear turned to confusion today as Hurricane Rina developed to Piaget stage 5, with sustained interests in objects and their properties.\n\n{{Title text: Funding was quickly restored to the NHC and the APA was taken back off hurricane forecast duty.}}","alt":"Funding was quickly restored to the NHC and the APA was taken back off hurricane forecast duty.","img":"https://imgs.xkcd.com/comics/development.png","title":"Development","day":"28"},{"month":"9","num":958,"link":"","year":"2011","news":"","safe_title":"Hotels","transcript":"[[Person 1 is sitting at a desk with a laptop, looking at a review website]]\nPerson 1: What's with this negative review? You *liked* that hotel.\nBlack Hat Man: I have a script that posts a bad review for every hotel I stay at. It reduces demand, which means more vacancies and lower prices next time.\n\nPerson 1: What if the place sucks?\nBlack Hat Man: I change the review to positive to steer other people over there.\n\nPerson 1: You punish companies you like!\nBlack Hat Man: The odds of *my* review putting a hotel out of business are negligible.\nPerson 1: If we all did that the system would collapse!\nBlack Hat Man: Doesn't affect my logic. Tragedy of the commons.\n\nPerson 1: That's not even the tragedy of the commons anymore.  That's the tragedy of you're a dick.\nBlack Hat Man: If you're quick with a knife, you'll find that the invisible hand is made of delicious invisible meat.\n\n{{Title text: 'Rating: 1\n5. Room filled to brim with semen, and when front desk clerk opened mouth to talk, bedbugs poured out.'}}","alt":"'Rating: 1/5. Room filled to brim with semen, and when front desk clerk opened mouth to talk, bedbugs poured out.'","img":"https://imgs.xkcd.com/comics/hotels.png","title":"Hotels","day":"30"},{"month":"10","num":959,"link":"","year":"2011","news":"","safe_title":"Caroling","transcript":"[[Three people stand together singing Christmas carols.]]\nCarolers (in unison): Good king Wenceslas looked out on the--\n\n[[Hat man leans out of an above ground window.]]\nHat man: King Wenceslas massacred my people.\n\n[[The carolers stand in silence.]]\n\n{{Title text: For a thousand generations we vowed never to forget how his soldiers feasted on our brother Stephen.}}","alt":"For a thousand generations we vowed never to forget how his soldiers feasted on our brother Stephen.","img":"https://imgs.xkcd.com/comics/caroling.png","title":"Caroling","day":"3"},{"month":"10","num":960,"link":"","year":"2011","news":"","safe_title":"Subliminal","transcript":"[[Two people are gathered around a computer. A person is seated interacting with the computer while another stands behind them with an arm resting on the back of the chair.]]\nPerson 1 (seated): What hidden arrow?\nPerson 2 (standing): I thought everyone knew about it. Pull up the FedEx logo.\n<<Click>>\n\n[[The second person is now pointing at the screen.]]\nPerson 1: Where is it?\nPerson 2: Right there. Look at the whitespace.\nPerson 1: I don't see it.\n\n[[The next panel shows a stylised view of the FedEx logo. The white space above the 'ed' in Fed is decorated to look like a tank turret with the barrel extending into the letter 'F'. Along the bottom of the letters a baseball player with the number 24 on his back is reaching out to catch a baseball. The baseball is forming the centre of the 'e' while the arm provides the break for the tail. The baseballers head marks the centre of the 'd' and the number 24 is coloured in blue to show the lower half of the stroke of the 'd'. Toward the right of the image the space between the 'E' and 'x' has been decorated to look like a Guy Fawkes mask, with ties wrapping around the 'x' and being drawn off-screen. A faint outline suggests the whitespace above the 'x' is a hat, with the brim extending into the upper part of the 'E'. Two speech bubbles are visible above the drawing, both spoken by off-screen characters.]]\nPerson 1 (off-screen): All I see if Guy Fawkes watching Willie Mays catch a fly ball while an armored assault vehicle rolls past.\nPerson 2 (off-screen): ...You either need more medication or less. Not sure which.\n\n{{Title text: Once you see it, you can't help seeing it every time. Until your body finishes metabolizing the mushrooms.}}","alt":"Once you see it, you can't help seeing it every time. Until your body finishes metabolizing the mushrooms.","img":"https://imgs.xkcd.com/comics/subliminal.png","title":"Subliminal","day":"5"},{"month":"10","num":961,"link":"","year":"2011","news":"","safe_title":"Eternal Flame","transcript":"[[Two people before a memorial with an eternally spinning wait cursor.  They contemplate silently on an influential life.  Goodbye, Steve.]]\n\n{{Title text: There's always the hope that if you sit and watch for long enough, the beachball will vanish and the thing it interrupted will return.}}","alt":"There's always the hope that if you sit and watch for long enough, the beachball will vanish and the thing it interrupted will return.","img":"https://imgs.xkcd.com/comics/eternal_flame.gif","title":"Eternal Flame","day":"6"},{"month":"10","num":962,"link":"","year":"2011","news":"","safe_title":"The Corliss Resolution","transcript":"The Fermi Paradox: Planets are so common that life should be too. So where is it?\n[[A person with an unusual suit runs.]]\n\nWell, now we know.  It's not that life inevitably destroys itself with war.\n[[The person keeps running.]]\n\nIt's just that it takes longer to develop space colonization.\n[[The person leaps off a cliff]]\nThan it does to invent an activity..\n\n..more fun than survival.\n[[Youtube video of the person, with the suit opening up into a wingsuit. As this is youtube, the comments have not been shown.  Two people are watching the video offpanel.]]\nPerson 1: Holy crap.\nPerson 2: I don't care how dangerous it is. I have to try it.\n\n{{Title text: And no avian society ever develops space travel because it's impossible to focus on calculus when you could be outside flying.}}","alt":"And no avian society ever develops space travel because it's impossible to focus on calculus when you could be outside flying.","img":"https://imgs.xkcd.com/comics/the_corliss_resolution.png","title":"The Corliss Resolution","day":"10"},{"month":"10","num":963,"link":"","year":"2011","news":"","safe_title":"X11","transcript":"[[The comic is a graph, with the x axis labelled \"Time since I last had to open Xorg.conf\" and the y axis labelled \"General satisfaction with how my life is going\". A curve starting at (0,0) snakes toward the upper right of the graph.]]\n\n{{Title text: Thomas Jefferson thought that every law and every constitution should be torn down and rewritten from scratch every nineteen years--which means X is overdue.}}","alt":"Thomas Jefferson thought that every law and every constitution should be torn down and rewritten from scratch every nineteen years--which means X is overdue.","img":"https://imgs.xkcd.com/comics/x11.png","title":"X11","day":"12"},{"month":"10","num":964,"link":"","year":"2011","news":"","safe_title":"Dorm Poster","transcript":"[[Person 1 finds dorm room]]\n\n[[View into the dorm room.  The left half is already occupied, and Person 2 has filled his side with the normal accoutrements of dorm life.  There is a Pink Floyd \"Dark Side of the Moon\" poster hanging on the far wall, offset and only on Person 2's side]]\n\n[[Person 1 has a bit of a ponder]]\n\n[[Person 1 leaves for a bit]]\n\n[[Person 1 returns with an item]]\n\n[[View into the dorm room.  Person 1 is moving in, and has placed a second Pink Floyd \"Dark Side of the Moon\" poster modified with a lens in the rainbow's path.  The poster is placed upside down on Person 1's side of the far wall to catch the rainbow, feed it back into the prism, and turn it back into a narrow stream of white light.]]\n\n{{Title text: I was going to record an album with that cover under the name \"PINK FTFY\", so it'd come after them on the store CD rack. But at this point music stores are just rooms where CDs are set out to age before they're thrown away, so probably nobody would see it.}}","alt":"I was going to record an album with that cover under the name \"PINK FTFY\", so it'd come after them on the store CD rack. But at this point music stores are just rooms where CDs are set out to age before they're thrown away, so probably nobody would see it.","img":"https://imgs.xkcd.com/comics/dorm_poster.png","title":"Dorm Poster","day":"14"},{"month":"10","num":965,"link":"","year":"2011","news":"","safe_title":"Elements","transcript":"[[Aang the Avatar and Dmitri Mendeleev stand in opposition to each other.  Aang wields all 4 classical elements: Water, Fire, Earth, and Air.]]\nAang: I'm the avatar, master of all 4 elements!\nMendeleev: Really? I'm Mendeleev, master of all 118+. \n<<swoosh>>\nMendeleev: That was polonium-bending.  You probably didn't feel anything, but the symptoms of radiation poisoning will set in shortly.\n\n{{Title text: Of all the nations, the armies of the ununoctium-benders are probably the least intimidating. The xenon-benders come close, but their flickery signs are at least effective for propaganda.}}","alt":"Of all the nations, the armies of the ununoctium-benders are probably the least intimidating. The xenon-benders come close, but their flickery signs are at least effective for propaganda.","img":"https://imgs.xkcd.com/comics/elements.png","title":"Elements","day":"17"},{"month":"10","num":966,"link":"","year":"2011","news":"","safe_title":"Jet Fuel","transcript":"[[Two people are having a conversation.]]\nPerson 1: 9\n11 was an inside job! Jet fuel can't burn hot enough to melt steel!\nPerson 2: Well, remember - jet fuel wasn't the only thing on those planes. They would've also carried tanks full of the mind-control agents airliners use to make chemtrails. Who \nknows\n what temperature that stuff burns at!\nPerson 1: Whoa. Good point!\n\n{{Title text: The 'controlled demolition' theory was concocted by the government to distract us. '9\n11 was an inside job' was an inside job!}}","alt":"The 'controlled demolition' theory was concocted by the government to distract us. '9/11 was an inside job' was an inside job!","img":"https://imgs.xkcd.com/comics/jet_fuel.png","title":"Jet Fuel","day":"19"},{"month":"10","num":967,"link":"","year":"2011","news":"","safe_title":"Prairie","transcript":"[[Two people stand in a field of wheat. The people are drawn in the typical black and white stick figure style, but the field is immensely detailed, with the grain coloured a rich amber and stroked such that individual stalks can be picked out, with a few dark bands providing contrast. In the distance a low mountain range is visible and in the sky a few scattered fluffy white clouds float low over the horizon.]]\nPerson 1: Well, when we observe them, they become amber \nparticles\n of grain.\n\n{{Title text: Colorado is working to develop coherent amber waves, which would allow them to finally destroy Kansas and Nebraska with a devastating but majestic grain laser.}}","alt":"Colorado is working to develop coherent amber waves, which would allow them to finally destroy Kansas and Nebraska with a devastating but majestic grain laser.","img":"https://imgs.xkcd.com/comics/prairie.png","title":"Prairie","day":"21"},{"month":"10","num":968,"link":"","year":"2011","news":"","safe_title":"Everything","transcript":"[[Person 1 drags a small wagon and a bag full of various items]]\nPerson 1: You are not the light of my life. Making you happy isn't my greatest dream.\n\n[[Person 1 places the items in an even bigger pile of even more random items]]\nPerson 1: Your smile is not all I live for. I've got my own stuff going on. But you're strange and fascinating and I've never met anyone like you.\n\n[[Person 1 stares in awe as Person 2 assembles the items into a gargantuan, intoxicatingly complex machine]]\nPerson 1: I want to give you everything just to see what you'd do with it.\n\n{{Title text: I wanna hold your hand so I don't fall out of your gyrocopter.}}","alt":"I wanna hold your hand so I don't fall out of your gyrocopter.","img":"https://imgs.xkcd.com/comics/everything.png","title":"Everything","day":"24"},{"month":"10","num":969,"link":"","year":"2011","news":"","safe_title":"Delta-P","transcript":"[[A wardrobe with an anchor attached to it falls into the ocean]]\n\nQ = A(2gd)^(1\n2)\n\nQ = flow rate\nA = area of opening\nd = ocean depth (2 km)\ng = Earth gravity\n\nFlow: ~400,000 liters\ns\nWater jet velocity: ~200 m\ns\n\nThe White Witch didn't know what hit her.\n\n{{Title text: If you fire a Portal gun through the door of the wardrobe, space and time knot together, which leads to a frustrated Aslan trying to impart Christian morality to the Space sphere.}}","alt":"If you fire a Portal gun through the door of the wardrobe, space and time knot together, which leads to a frustrated Aslan trying to impart Christian morality to the Space sphere.","img":"https://imgs.xkcd.com/comics/delta_p.png","title":"Delta-P","day":"26"},{"month":"10","num":970,"link":"","year":"2011","news":"","safe_title":"The Important Field","transcript":"[[A soldier wearing a olive drab green hat sits in front of a computer]]\nComputer: Welcome to the missile launch web interface!\n<<mouse click>>\n\nComputer: Enter the target's coordinates.\n<<type type>>\n\nEnter your email address for our records.\n<<type type>>\n\nEnter your email again, to ensure you typed it correctly.\n[[Green Hat Man sits there with an even blanker look on his face than normal]]\n\n{{Title text: I hear in some places, you need one form of ID to buy a gun, but two to pay for it by check. It's interesting who has what incentives to care about what mistakes.}}","alt":"I hear in some places, you need one form of ID to buy a gun, but two to pay for it by check. It's interesting who has what incentives to care about what mistakes.","img":"https://imgs.xkcd.com/comics/the_important_field.png","title":"The Important Field","day":"28"},{"month":"10","num":971,"link":"","year":"2011","news":"","safe_title":"Alternative Literature","transcript":"[[Person 1 and 2 stand in front of Person 2's bookcase.  Person 1 flips through a number of them]]\nPerson 1: All your books are full of blank pages.\nPerson 2: Not true. That one has some ink on page 78.\n[[Person 1 looks at page 78]]\nPerson 1: A smudge.\nPerson 2: So?\n\nPerson 1: There are no words. You're not reading. There's no *story* there.\nPerson 2: Maybe not for you. When I look at those books, I think about all *kinds* of stories.\n\nPerson 2: Reading is about more than what's on the page. Holding a book prompts my mind to enrich itself.  Frankly, I suspect the book isn't even necessary.\n\nPerson 2: The whole industry is evil. Greedy publishers and rich authors try to convince us our brains *need* their words. But I refuse to be a sucker.\nPerson 1: Who sold you all these blank books?\n\n{{Title text: I just noticed CVS has started stocking homeopathic pills on the same shelves with--and labeled similarly to--their actual medicine. Telling someone who trusts you that you're giving them medicine, when you know youâre not, because you want their money, isnât just lying--itâs like an example youâd make up if you had to illustrate for a child why lying is wrong.}}","alt":"I just noticed CVS has started stocking homeopathic pills on the same shelves with--and labeled similarly to--their actual medicine. Telling someone who trusts you that you're giving them medicine, when you know you’re not, because you want their money, isn’t just lying--it’s like an example you’d make up if you had to illustrate for a child why lying is wrong.","img":"https://imgs.xkcd.com/comics/alternative_literature.png","title":"Alternative Literature","day":"31"},{"month":"11","num":972,"link":"","year":"2011","news":"","safe_title":"November","transcript":"[[Black Hat Guy and a person sit in a room]]\nBlack Hat Guy: Did you know November is Tongue Awareness Month?\n\n[[Person is suddenly aware of their tongue]]\n\n[[Person continues to be aware of their tongue]]\n\n[[Person is *still* aware of their tongue]]\nPerson: I hate you.\nBlack Hat Guy: Enjoy the next four weeks.\n\n{{Title text: November marks the birthday of Charles Schulz, pioneer of tongue awareness.}}","alt":"November marks the birthday of Charles Schulz, pioneer of tongue awareness.","img":"https://imgs.xkcd.com/comics/november.png","title":"November","day":"2"},{"month":"11","num":973,"link":"","year":"2011","news":"","safe_title":"MTV Generation","transcript":"[[One of them damn kids that won't get OFF MY LAWN plays with some gadgetamabob while ignoring every damn thing around him off in the background.  Person 1 with a white hat, along with another person with long hair is in the foreground]]\nPerson 1: See, that's the problem with the MTV generation - no attention span.\n\nPerson 2: You know, that phrase referred to the 12-19 demographic that formed the core MTV audience in the mid-1980s.\n\nPerson 1: Uh huh. So?\nPerson 2: That generation's now in their 40s.\n\n[[Person 1 scratches their head]]\nPerson 1: That can't be right.\nPerson 2: Face it: your problem with the MTV generation is their *kids*.\n\n{{Title text: If you identified with the kids from The Breakfast Club when it came out, you're now much closer to the age of Principal Vernon.}}","alt":"If you identified with the kids from The Breakfast Club when it came out, you're now much closer to the age of Principal Vernon.","img":"https://imgs.xkcd.com/comics/mtv_generation.png","title":"MTV Generation","day":"4"},{"month":"11","num":974,"link":"","year":"2011","news":"","safe_title":"The General Problem","transcript":"[[A person sits at a table, eating a meal.]]\nPerson: Can you pass the salt?\n\n[[The person pauses, a bite of food on his fork, silently.]]\n\n[[The person still has fork in mid-air.]]\nPerson: I said--\nOff-screen Person: I know! I'm developing a system ot pass you arbitrary condiments.\nPerson: It's been 20 minutes!\nOSP: It'll save time in the long run!\n\n{{Title text: I find that when someone's taking time to do something right in the present, they're a perfectionist with no ability to prioritize, whereas when someone took time to do something right in the past, they're a master artisan of great foresight.}}","alt":"I find that when someone's taking time to do something right in the present, they're a perfectionist with no ability to prioritize, whereas when someone took time to do something right in the past, they're a master artisan of great foresight.","img":"https://imgs.xkcd.com/comics/the_general_problem.png","title":"The General Problem","day":"7"},{"month":"11","num":975,"link":"","year":"2011","news":"","safe_title":"Occulting Telescope","transcript":"[[A person is giving a lecture in front of a white board, pointing to a diagram with a pointer.]]\nLecturer: The occulting observatory consists of two parts -- the telescome and the discs.\n\nWhen the telescope sees a star, a disc is carefully steered to block its light.\n[[A diagram of a satellite (labeled \"telescope\") with waves going from it on the left, across to the other side of the diagram (labeled \"light from star\") on the right. In the middle is a small vertical line (labeled \"disc\"), stopping some of the light waves from the right traveling to the left of the diagram.]] \nThis procedure is repeated until all stars are covered.\n\n[[The lecturer looks down at a student.]]\nStudent (off screen): Wait, \nall?\n Why?\nLecturer: I'll feel better.\n\n[[Close-up on lecturer.]]\nStudent (off-screen): I thought the point was to image extrasolar planets.\nLecturer: The point is that there are \ntoo many stars.\n -- It's been freaking me out.\nStudent: What?\nStudent#2 (in smaller letters): He has a point...\n\n{{Title text: Type II Kardashev civilizations eventually completely enclose their planetary system in a Dyson sphere because space is way too big to look at all the time.}}","alt":"Type II Kardashev civilizations eventually completely enclose their planetary system in a Dyson sphere because space is way too big to look at all the time.","img":"https://imgs.xkcd.com/comics/occulting_telescope.png","title":"Occulting Telescope","day":"9"},{"month":"11","num":976,"link":"","year":"2011","news":"","safe_title":"Sail","transcript":"[[A person is sailing a cat-rigged sailboat. He detaches the mainsheet from the stern.]]\n\n[[The sailor pulls back on the mainsheet.]]\n\n[[The sailor stands up and pulls harder, causing the sail to arc outward.]]\n\n[[He continues pulling as hard as he can, and the sail begins to buckle outward in a semi-circular shape.]]\n\n[[Finally, the sail buckles so hard that a bubble forms and detaches from the sail, which begins to return to its normal shape.]]\n\n[[The sailor sits down and scratches his head in confusion as the bubble floats away.]]\n\n{{Title text: It only works a few times before you have to capsize the boat in a soap lagoon again.}}","alt":"It only works a few times before you have to capsize the boat in a soap lagoon again.","img":"https://imgs.xkcd.com/comics/sail.png","title":"Sail","day":"11"},{"month":"11","num":977,"link":"","year":"2011","news":"It turns out Monday was Steve Waterman's birthday. His <a href=\"https://www.watermanpolyhedron.com/\">site</a> has posters<br />of his map, plus maybe the world's only Winkel Tripel-critiquing poetry.","safe_title":"Map Projections","transcript":"((The comic is one large panel, with different types of map projections listed in two columns. Each listing has an illustration of that projection plus a short paragraph describing the individual who prefers that projection.))\n\nWhat your favourite Map Projection says about you.\n\nMercator\n[[A drawing of the Mercator projection is shown. In this the world is distorted to fit into a perfect square, centred on Africa.]]\nYou're not really into maps.\n\nRobinson\n[[A drawing of the Robinson projection is shown. Areas near the poles in this projection are fairly distorted, but the distortion is greatly reduced when moving toward the equator.]]\nYou have a comfortable pair of running shoes that you wear everywhere. You like coffee and enjoy the Beatles. You think the Robinson is the best-looking projection, hands down.\n\nWinkel-Tripel\n[[The Winkel-Tripel projection is similar to the Robinson projection, with less distortion at the poles. However the distortion at equivalent latitudes differs as the longitude varies.]]\nNational Geographic adopted the Winkel-Tripel in 1998, but you've been a W-T fan since \nlong\n before \"Nat Geo\" showed up. You're worried it's getting played out, and are thinking of switching to the Kavrayskiy. You once left a party in disgust when a guest showed up wearing shoes with toes. Your favourite musical genre is \"post-\".\n\nHobo-Dyer\n[[The Hobo-Dyer projection is a cylindrical projection resulting in significant latitudinal distortion. The result is a rectangular image with the poles vertically compressed, and land near the equator stretched.]]\nYou want to avoid cultural imperialism but you've heard bad things about Gall-Peters. You're conflict-averse and buy organic.l You use a recently-invented set of gender-neutral pronouns and think that what the world needs is a revolution in consciousness.\n\nA globe!\n[[It's a globe.]]\nYes, you're very clever.\n\nPierce Quincuncial\n[[This is a square projection centred over the north pole. The continents stretch out radially from the centre of the map and bits of Antarctica are visible in each corner of the projection.]]\nYou think that when we look at a map, what we really see is ourselves. After you first saw \nInception\n, you sat silent in the theater for six hours. It freaks you out to realise that everyone around you has a skeleton inside them. You \nhave\n really looked at your hands.\n\n((The second column of projections starts here.))\n\nVan Der Grinten\n[[This projection displays the continents inside a perfectly circular frame. The continents are displayed with similar distortion to what you would see in the Robinson or Winkel-Tripel projections.]]\nYou're not a complicated person. You love the Mercator projection; you just wish it weren't so square. The earth's not a square, it's a circle. You like circles. Today is gonna be a good day!\n\nDymaxion\n[[The Dymaxion projection attempts to unfold the earth into a polyhedral net, centred on the north pole. The map has no set shape, instead it looks to be made out of a series of triangles.]]\nYou like Isaac Asimov, XML, and shoes with toes. You think the segway got a bad rap. You own 3D goggles, which you use to view rotating models of better 3D goggles. You type in Dvorak.\n\nGoode Homolosine\n[[The Goode Homolosine projection attempts to minimise distortion by combining two equal area projections onto a split projection. The map resembles a smooth unfolded net, with landmasses kept whole where possible.]]\nThey say mapping the earth on a 2D surface is like flattening an orange peel, which seems easy enough to you. You like easy solutions. You think we wouldn't have so many problems if we'd just elect \nnormal\n people to congress instead of politicians. You think airlines should just buy food from the restaurants near the gates and serve \nthat\n on board. You change your car's oil, but secretly wonder if you really \nneed\n to.\n\nPlate Carrée\n(Equirectangular)\n[[This projection maps latitude and longitude to a rectangular grid, leading to significant longitudinal distortion near the poles.]]\nYou think this one is fine. You like how \nx\n and \ny\n map to latitude and longitude. The other projections overcomplicate things. You want me to stop asking about maps so you can enjoy dinner.\n\nWaterman Butterfly\n[[This projection unfolds the world into a net, similar to the Dymaxion projection. It is centred on the Atlantic, and resembles a butterfly with the Americas on the western wing, with Europe and Africa on the eastern wing.]]\nReally? You know the Waterman? Have you seen the 1909 Cahill map it's based-- ...You have a framed reproduction at home?! Whoa. ...Listen, forget these questions. Are you doing anything tonight?\n\nGall-Peters\n[[Another rectangular projection, this map suffers significant distortion near the poles, and significant latitudinal distortion in general.]]\nI \nhate\n you.\n\n{{Title text: What's that? You think I don't like the Peters map because I'm uncomfortable with having my cultural assumptions challenged?  Are you sure you're not ... ::puts on sunglasses:: ... projecting?}}","alt":"What's that? You think I don't like the Peters map because I'm uncomfortable with having my cultural assumptions challenged?  Are you sure you're not ... ::puts on sunglasses:: ... projecting?","img":"https://imgs.xkcd.com/comics/map_projections.png","title":"Map Projections","day":"14"},{"month":"11","num":978,"link":"","year":"2011","news":"","safe_title":"Citogenesis","transcript":"Where Citations Come From:\n\nCitogenesis Step #1\nThrough a convoluted process, a user's brain generates facts. These are typed into Wikipedia.\n[[A guy with short hair sits at a desk, typing on a laptop.]]\nGuy: (typing) The \"scroll lock\" key was designed by future Energy Secretary Steven Chu in a college project.\n\nA rushed writer checks Wikipedia for a summary of their subject.\n[[A woman with a ponytail sits at a desk, typing on a desktop.]]\nWoman: (typing) US Energy Secretary Steven Chu, (Nobel Prizewinner and creator of the ubiquitous \"scroll lock\" key) testified before Congress today...\nStep #2\n\nSurprised readers check Wikipedia, see the claim, and flag it for review. A passing editor finds the piece and adds it as a citation. \n[[A man sits on a couch with a laptop in his lap, typing.]]\nMan: Google is your friend, people. (typing) <ref>{{cite web|url=\nStep #3\n\nStep #4\nNow that other writers have a real source, they repeat the fact.\n[[A flow chart, with \"Wikipedia citation\" in the center. The word \"Wikipedia\" is in black, the word \"citations\" is white with a red background. \nA black arrow leads from \"brain\" to \"Wikipedia.\"\nA black arrow labeled \"words\" leads from \"Wikipedia\" to \"careless writers,\" and a red arrow labeled \"citations\" leads back to \"Wikipedia citations.\" \nA black & red arrow leads from \"Wikipedia\" to \"cited facts\" which leads to \"slightly more careful writers,\" which leads to \"more citations,\" which leads back to \"Wikipedia\" (all black & red arrows).]]\nReferences proliferate, completing the citogenesis process.\n\n{{Title text: I just read a pop-science book by a respected author. One chapter, and much of the thesis, was based around wildly inaccurate data which traced back to ... Wikipedia. To encourage people to be on their toes, I'm not going to say what book or author.}}","alt":"I just read a pop-science book by a respected author. One chapter, and much of the thesis, was based around wildly inaccurate data which traced back to ... Wikipedia. To encourage people to be on their toes, I'm not going to say what book or author.","img":"https://imgs.xkcd.com/comics/citogenesis.png","title":"Citogenesis","day":"16"},{"month":"11","num":979,"link":"","year":"2011","news":"","safe_title":"Wisdom of the Ancients","transcript":"((A poem is written outside the only panel, right justified along the left edge of the only panel.))\nNever have I felt so close to another soul\nAnd yet so helplessly alone\nAs when I Google an error\nAnd there's one result\nA thread by someone with the same problem\nAnd no answer\nLast posted to in 2003\n[[A person stands in front of his computer, shaking it violently while looking at the screen.]]\nPerson: Who were you, DenverCoder9? - \nWHAT DID YOU SEE?!\n\n\n{{Title text: All long help threads should have a sticky globally-editable post at the top saying 'DEAR PEOPLE FROM THE FUTURE: Here's what we've figured out so far ...'}}","alt":"All long help threads should have a sticky globally-editable post at the top saying 'DEAR PEOPLE FROM THE FUTURE: Here's what we've figured out so far ...'","img":"https://imgs.xkcd.com/comics/wisdom_of_the_ancients.png","title":"Wisdom of the Ancients","day":"18"},{"month":"11","num":980,"link":"https://xkcd.com/980/huge/","year":"2011","news":"This one was fun (and exhausting) to make.<br />There's a poster of it in the <a href=\"https://store.xkcd.com/products/money-poster\">store</a>!","safe_title":"Money","transcript":"Money\nall of it\n((this transcription is only reproducing text visible on the front page comic.  There are 5 large panels, each with a series of plots, comparing the values of various things.))\nDollars\n((This section covers single coffees up to the hourly salaries of CEOs))\n\nThousands\n((This section discusses values from around $1000 to $1000000, including a dissection of the song 'If I had $1000000'))\n\nMillions\n((This section focuses on $1000,000 to $1000,000,000, with a large section on campaign contributions of American political presidential campaigns, values of expensive works of art, and J. K. Rowling.))\n\nBillions\n((This section gets into larger scale finances, profits of various sectors, costs of natural disasters, and net worths of the richest people on the planet.  Also, Donald Trump.))\n\nTrillions\n((Global financial status is described here.  It discusses derivatives, liquid assets, public debt by nation and GDP by continent, culminating with the total economic production of the human race to date.))\n\n{{Title text: There, I showed you it.}}","alt":"There, I showed you it.","img":"https://imgs.xkcd.com/comics/money.png","title":"Money","day":"21"},{"month":"11","num":981,"link":"","year":"2011","news":"","safe_title":"Porn Folder","transcript":"[[A person sits at a desk, looking at a laptop screen with one hand on his chin.]]\nPerson: So I thought I found your porn folder, in calendar\nbackup\nPORN\n --\nPerson #2 (off screen): Don't open that!\n\n[[A wider shot of the person looking at the laptop.]]\nPerson #1: But it contains a bunch more folders, filled with more folders, and then... after 20 levels, somehow I'm back at the main folder?\nPerson #2 (off screen): It's, uh, well hidden.\n\n[[The person has turned around in the chair, now with the laptop in his lap.]]\nPerson #1: I think there's no actual porn here. - You're just turned on by filesystems.\nPerson #2 (off screen): It's a hardlinked directory loop -- so taboo!\nPerson #1: Now I feel dirty sharing a drive with you.\n\n{{Title text: Eww, gross, you modified link()? How could you enjoy abusing a filesystem like that?}}","alt":"Eww, gross, you modified link()? How could you enjoy abusing a filesystem like that?","img":"https://imgs.xkcd.com/comics/porn_folder.png","title":"Porn Folder","day":"23"},{"month":"11","num":982,"link":"","year":"2011","news":"","safe_title":"Set Theory","transcript":"[[A woman with a ponytail stands at a blackboard, facing away from it. She has a pointer in her hand, and written on the blackboard is some set theory math.]]\nWoman: The axiom of choice allows you to select one element from each set in a collection -- and have it \nexecuted\n as an example to the others.\n\n{{Title text: Proof of Zermelo's well-ordering theorem given the Axiom of Choice: 1: Take S to be any set. 2: When I reach step three, if S hasn't managed to find a well-ordering relation for itself, I'll feed it into this wood chipper. 3: Hey, look, S is well-ordered.}}","alt":"Proof of Zermelo's well-ordering theorem given the Axiom of Choice: 1: Take S to be any set. 2: When I reach step three, if S hasn't managed to find a well-ordering relation for itself, I'll feed it into this wood chipper. 3: Hey, look, S is well-ordered.","img":"https://imgs.xkcd.com/comics/set_theory.png","title":"Set Theory","day":"25"},{"month":"11","num":983,"link":"","year":"2011","news":"","safe_title":"Privacy","transcript":"Dorm:\n[[An incredibly libidinous, extremely attractive couple try and enter one person's dorm room.]]\nLocked.\n\nOther Dorm:\n[[The same couple in the other person's dorm room, where the roommate is sitting at a computer playing an MMO]]\nRoommate: I'll be done tuesday.\nRoommate in raid\n\nLibrary Rare Book Collection:\n[[Libidinous couple staring inside the room from outside.  Nelson Mandela and other university workers inside the room, looking at some extremely expensive items]]\nOccupied by tour for visiting Nelson Mandela\n\nAccelerator Tunnel:\n[[Couple stares at a heavy, imposing door denying them entry]]\nSealed while beam is in operation.\n\nBeaver Lodge (stop snickering!):\n[[couple attempting to enter an occupied beaver lodge]]\nFrozen over for winter to keep out predators; only accessible via underwater entrance.\n\nHyperspace:\n[[Couple in front of a number of highly advanced physics textbooks]]\nPerson 1: Are you *sure*?\nRuled out by current understanding of physics.\n\n{{Title text: Eventual headline: 'University Researchers Create Life in Lab! Darkness, Faulty Condoms Blamed.'}}","alt":"Eventual headline: 'University Researchers Create Life in Lab! Darkness, Faulty Condoms Blamed.'","img":"https://imgs.xkcd.com/comics/privacy.png","title":"Privacy","day":"28"},{"month":"11","num":984,"link":"","year":"2011","news":"","safe_title":"Space Launch System","transcript":"Person 1: Check out the SLS - 130 tons to orbit.  Finally, rockets that improve on the ones we had 40 years ago.\nBlack Hat Man: Are we getting Nazis to build those ones too?\n\nPerson 1, offscreen: What?\nBlack Hat Man, offscreen: When we first captured von Braun and his team, we had our engineers interview them, then *we* built the rockets.  But our rockets kept exploding\n[[von Braun interviewed by a scientist while under guard]]\n[[The same scientist in front of a spectacularly exploding rocket]]\n\nBlack Hat Man, narrating: Eventually we gave up and had the German teams do it, and they built us the Saturn V moon rocket.  \n[[The Saturn V gracefully arcing across the night sky]]\n\nPerson 1: I'm.. not sure what lesson to take from that.\nBlack Hat Man: \"If you want something done right ,learning from the Nazis isn't enough.  You have to actually put them in charge.\nPerson 1: That's a *terrible* lesson.\nBlack Hat Man: Then I guess you should get a Nazi to come up with a better one.\n\n{{Title text: The SLS head engineer plans to invite Shania Twain to stand under the completed prototype, then tell her, 'I don't expect you to date me just because I'm a rocket scientist, but you've gotta admit--this is pretty fucking impressive.'}}","alt":"The SLS head engineer plans to invite Shania Twain to stand under the completed prototype, then tell her, 'I don't expect you to date me just because I'm a rocket scientist, but you've gotta admit--this is pretty fucking impressive.'","img":"https://imgs.xkcd.com/comics/space_launch_system.png","title":"Space Launch System","day":"30"},{"month":"12","num":985,"link":"","year":"2011","news":"","safe_title":"Percentage Points","transcript":"[[An average news anchor reading news copy of below average intelligence appears on a TV, with one person watching it in utter disgust]]\nNews Anchor: Senator Grayton's campaign has imploded following the candidate's promise to give tax breaks to drunk drivers and to authorize the use of unmanned Predator drones in the War On Christmas.  Grayton had been polling at 20%, but his support has since plunged by 19%.\nI hate the ambiguity created when people don't distinguish between percentages and percentage points.\n\n{{Title text: Grayton also proposed making college scholarships available exclusively to sexually active teens, amnesty for illegal immigrants who create room for themselves by killing a citizen, and a graduated income tax based on penis size. He has been endorsed by Tracy Morgan, John Wilkes Booth's ghost, and the Time Cube guy.}}","alt":"Grayton also proposed making college scholarships available exclusively to sexually active teens, amnesty for illegal immigrants who create room for themselves by killing a citizen, and a graduated income tax based on penis size. He has been endorsed by Tracy Morgan, John Wilkes Booth's ghost, and the Time Cube guy.","img":"https://imgs.xkcd.com/comics/percentage_points.png","title":"Percentage Points","day":"2"},{"month":"12","num":986,"link":"","year":"2011","news":"","safe_title":"Drinking Fountains","transcript":"[[Person leaving the bathroom, headed towards a nearby water fountain.  Person having a drink at said water fountain.  Person grumblingly reentering the bathroom. Same person leaving the bathroom.  Cycle repeats endlessly in a horrific sisyphean loop.]]\n\nI avoid drinking fountains outside bathrooms because I'm afraid of getting trapped in a loop.\n\n{{Title text: I've always wondered whether you could drink slowly enough, and eliminate fast enough, that you just sort of peed continuously. But I'm afraid to try because I worry someone might call while I'm doing it and ask what I'm up to, and I won't be able to think of a lie.}}","alt":"I've always wondered whether you could drink slowly enough, and eliminate fast enough, that you just sort of peed continuously. But I'm afraid to try because I worry someone might call while I'm doing it and ask what I'm up to, and I won't be able to think of a lie.","img":"https://imgs.xkcd.com/comics/drinking_fountains.png","title":"Drinking Fountains","day":"5"},{"month":"12","num":987,"link":"","year":"2011","news":"","safe_title":"Potential","transcript":"Narrator: When teachers complain \"You're not working at your full potential!\" \n[[Explosion in background]]\n\nNarrator: Don't take it too hard.\n[[car casually spirals through the air while a crash is heard in the background]]\n\nNarrator: They complain *way* more when you do.\n[[A mechanized, 6-tentacled robot rampages around, picking up cars and creating a small warzone before the student inside while the lamentations of people and the building of military forces are in the background]]\n\n{{Title text: The bunch of disadvantaged kids I was tutoring became too good at writing, and their essays were forcing me to confront painful existential questions, so I started trying to turn them on to drugs and crime instead.}}","alt":"The bunch of disadvantaged kids I was tutoring became too good at writing, and their essays were forcing me to confront painful existential questions, so I started trying to turn them on to drugs and crime instead.","img":"https://imgs.xkcd.com/comics/potential.png","title":"Potential","day":"7"},{"month":"12","num":988,"link":"","year":"2011","news":"","safe_title":"Tradition","transcript":"The 20 most-played Christmas songs (2000-2009 radio airplay) by decade of popular release\n[[A bar chart labeled on the X-axis with the decades \"1900s\" through \"2000s\" labeled.  Each bar has, as one unit, a labeled song.  \n\"1900s\", \"1910s\", \"1920s\", \"1980s\", \"1990s\", and \"2000s\" are empty.  \n\"1930s\" has \"Santa Claus is Coming to Town\". \n\"1940s\" has \"Rudolph the Red-Nosed Reindeer\", \"Winter Wonderland\", \"Chestnuts Roasting on an Open Fire\", \"Let it Snow\", \"Have Yourself a Merry Little Christmas\", \"I'll be Home for Christmas\", and \"White Christmas\".\n\"1950s\" has \"Rockin' Around the Christmas Tree\", \"Jingle Bell Rock\", \"Blue Christmas\", \"Little Drummer Boy\", \"I Saw Mommy Kissing Santa Claus\", \"Silver Bells\", \"It's Beginning to Look a Lot Like Christmas\", \"Sleigh Ride\", and \"Frosty the Snowman\"\n\"1960s\" has \"Holly Jolly Christmas\" and \"It's the Most Wonderful Time of the Year\"\n\"1970s\" has \"Feliz Navidad\"]]\nEvery year, American culture embarks on a massive project to carefully recreate the Christmases of Baby Boomers' childhoods.\n\n{{Title text: An 'American tradition' is anything that happened to a baby boomer twice.}}","alt":"An 'American tradition' is anything that happened to a baby boomer twice.","img":"https://imgs.xkcd.com/comics/tradition.png","title":"Tradition","day":"9"},{"month":"12","num":989,"link":"","year":"2011","news":"","safe_title":"Cryogenics","transcript":"[[Two people, one of which is staring at a smartphone]]\nPerson 1: Everyone's carrying sensor-packed, always-connected computers everywhere.  That wasn't true ten years ago.\nWhite Hat Guy: It's all changing too fast, huh?\nPerson 1: No, too *slowly*.\n\nPerson 1: There's so much potential here.  These clumsy, poorly-designed toys are *nothing* compared to what lies ahead.\n\n[[Person 1 climbs into a cryogenic chamber]]\nPerson 1: That's why I've worked to develop cryogenic freezing.  I'm gonna skip forward 30 years and use this stuff when it's *good*.\n\n30 years later..\nSomeone who isn't Terry: Welcome to the future! Nothing's changed.\nPerson 1: What? Why??\n\n[[rows of other people waking up out of their own cryogenic chambers]]\nnot Terry: When cryogenic freezing was invented, all the engineers who were excited about the future froze themselves. So there's been no one building anything new.\n\nnot Terry: But they're all waking up now!\nPerson 1: Sweet! I'm gonna jump forward to see what they do!\nEngineer 1: Me too!\nEngineer 2: Wait, uh, guys?\n\n\n{{Title text: 'Welcome to the future! Nothing's changed.' was the slogan of my astonishingly short-lived tech startup.}}","alt":"'Welcome to the future! Nothing's changed.' was the slogan of my astonishingly short-lived tech startup.","img":"https://imgs.xkcd.com/comics/cryogenics.png","title":"Cryogenics","day":"12"},{"month":"12","num":990,"link":"","year":"2011","news":"","safe_title":"Plastic Bags","transcript":"((not a character; just a colon in a normal sentence))\nFun Fact: Stores have a competition to see who can spread your items across the most plastic shopping bags\n\nBag Packer: Here you go!\n[[5 items placed in a single bag; heaviest item placed at the bottom]\nShopper: Thanks!\n\nBag Packer: Here you go!\n[[Same items; heaviest item now placed in separate bag]]\nShopper: Oh, that's easier to carry.\n\nBag Packer: Here you go!\n[[Heavy item is now double bagged]]\nShopper: Double-bagging the big stuff makes sense..\n\nBag Packer: Here you go!\n[[the other 4 items are now split into 2 separate bags]]\nShopper: That's a bit wasteful..\n\nBag Packer: Here you go!\n[[The 2 separate bags are now double bagged]]\nShopper: You just put five items in six bags.\n\nBag Packer: Here you go!\n[[Every item is now in its own, double-bagged bag.]]\nShopper: OK! I give up! I'll buy a reusable bag!\n\nBag Packer: Here you go!\n[[Reusable bag is double-bagged]]\nShopper: Augh!\n\n{{Title text: The high I feel when I actually remember to bring my reusable bags to the store--and take them inside rather than leaving them in the parked car--can last for days.}}","alt":"The high I feel when I actually remember to bring my reusable bags to the store--and take them inside rather than leaving them in the parked car--can last for days.","img":"https://imgs.xkcd.com/comics/plastic_bags.png","title":"Plastic Bags","day":"14"},{"month":"12","num":991,"link":"","year":"2011","news":"","safe_title":"Phantom Menace","transcript":"[[Two people -- one in a Darth Maul mask, the other holding a lightsaber, and each holding money in his or her hand -- stand outside a building.]]\n\n[[They continue to stand there.]]\n\n[[They continue to stand there.]]\n\n[[Darth Maul turns to lightsaber guy.]]\nDarth Maul: Are you \nsure\n this place is a theater?\nLightsaber guy: Let's give it one more month.\n\n{{Title text: We could go to the theater across town and see if it's opened THERE yet, but we don't want to lose our place in line.}}","alt":"We could go to the theater across town and see if it's opened THERE yet, but we don't want to lose our place in line.","img":"https://imgs.xkcd.com/comics/phantom_menace.png","title":"Phantom Menace","day":"16"},{"month":"12","num":992,"link":"","year":"2011","news":"","safe_title":"Mnemonics","transcript":"XKCD Presents: Some New Science Mnemonics\n\n((Pattern goes: \nSubject\nElements\nTraditional mnemonic\nContents of frame\nNew mnemonics))\n\nOrder of Operations\nParentheses, Exponents, Division & Multiplication, Addition & Subtraction\nTraditional: Please Excuse My Dear Aunt Sally\n[[Person having a shark delivered to his laptop]]\nPlease Email My Dad A Shark  \nor\nPeople Expect More Drugs And Sex\n\nSI Prefixes\nBig: Kilo, Mega, Giga, Tera, Peta, Exa, Zetta, Yotta\nMilli, Micro, Nano, Pico, Femto, Atto, Zepto, Yocto\n[[Graph of the declining profits of the Zune]]\n[[Karl Marx delivering a number of zeppelins to a bunch of confused proletariats]]\nBig: Karl Marx Gave The Proletariat Eleven Zeppelins, Yo\nSmall: Microsoft Made No Profit From Anyone's Zunes, Yo\n\nTaxonomy\nKingdom, Phylum, Class, Order, Family, Genus, Species\nTraditional: King Philip Came Over For Good Sex\nKaty Perry: I'm not sure who doubts this, really.\nKaty Perry Claims Orgasms Feel Good Sometimes\nor\nKernel Panics Crash Our Family Game System.\n\nGeologic Periods\n(Precambrian), Cambrian, Ordovician, Silurian, Devonian, Carboniferous, Permian, Triassic, Jurassic, Cretaceous, Paleogene, Neogene\nTraditional: [I never learned one]\n[[A month's set of birth control pills]]\nPolyCystic Ovarian Syndrome Does Cause Problems That Judicious Contraceptives Partially Negate\n\nResistor Color Codes\nBlack, Brown, Red, Orange, Yellow, Green, Blue, Violet, Gray, White\nTraditional: [none I care for]\n[[Glenn Beck holding the traditional \"Nanobot Vaccine Chemtrail 9\n11\" sign]]\n\"Big Brother Reptilian Overlords\", yelled Glenn, \"Brainwashing Via Ground water!!\"\nor\nBe Bold, Respect Others; You'll Gradually Become Versatile, Great Wikipedians!\n\nPlanets\nMercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune\nTraditional: My Very Excellent Mother Just Served Us Nachos\n[[A pregnant Mary attempting to explain things to an incredulous Joseph]]\nMary's \"Virgin\" Explanation Made Joseph Suspect Upstairs Neighbor.\n\n{{Title text: 'Sailor Moon's head exploded once' and 'Some men have explosive orgasms' both work for the Great Lakes from west to east (Paddle-to-the-Sea order).}}","alt":"'Sailor Moon's head exploded once' and 'Some men have explosive orgasms' both work for the Great Lakes from west to east (Paddle-to-the-Sea order).","img":"https://imgs.xkcd.com/comics/mnemonics.png","title":"Mnemonics","day":"19"},{"month":"12","num":993,"link":"","year":"2011","news":"","safe_title":"Brand Identity","transcript":"[[The incredibly varied shelf of a supermarket aisle.  There are many different types of products on this shelf.  Each type has numerous different brands, all surrounding a very plain brand that has, as its only label, the type of product.  A plain bag, labeled in plain black letters, says \"Potato Chips\" and is surrounded by all the other various brands of potato chips.  The same exists for tissues, crackers, matches, peanuts, hot sauce, sugar , milk, pasta, coffee, black beans, lima beans, mayo, ketchup, tea, and bread.  There is a stark contrast between the incredibly noisy and complex labeling of every other brand and this simple one.]]\nIf I ever sold a line of supermarket goods, this is how I'd build a brand identity overnight.\n\n\n{{Title text: Legally-mandated information would be printed on the back or discreetly along the bottom. In small letters under the nutrition information it would say 'Like our products? Visit our website!' There would be no URL.}}","alt":"Legally-mandated information would be printed on the back or discreetly along the bottom. In small letters under the nutrition information it would say 'Like our products? Visit our website!' There would be no URL.","img":"https://imgs.xkcd.com/comics/brand_identity.png","title":"Brand Identity","day":"21"},{"month":"12","num":994,"link":"","year":"2011","news":"","safe_title":"Advent Calendar","transcript":"((There's a single large panel.  It shows a portion of an advent calendar.))\nDecember 23rd\nDecember 24th  12:00AM\nDecember 24th  NOON\nDecember 24th  6:00PM\nDecember 24th  9:00PM\nDecember 24th  10:30PM\nDecember 24th  11:15PM\nDecember 24th  11:37:30PM\nDecember 24th  11:48:45PM\nDecember 24th  11:54:22.5PM\nDecember 24th  11:57:11.25PM\nDecember 24th  11:58:35.63PM\n...\nZeno's Advent Calendar\n\n{{Title text: I think you could get up to about 11:59:57 before you'd have trouble swallowing the chocolates fast enough. At that point, you'd need some kind of a liquify-and-chug apparatus to get up over the 11:59:59 barrier. Anyway, Merry Christmas!}}","alt":"I think you could get up to about 11:59:57 before you'd have trouble swallowing the chocolates fast enough. At that point, you'd need some kind of a liquify-and-chug apparatus to get up over the 11:59:59 barrier. Anyway, Merry Christmas!","img":"https://imgs.xkcd.com/comics/advent_calendar.png","title":"Advent Calendar","day":"23"},{"month":"12","num":995,"link":"","year":"2011","news":"","safe_title":"Coinstar","transcript":"[[A mischievous, curious person empties a small bag into a whrrring machine]]\n\n[[Machine makes progressively less happy *kachunk*, *tshhhh*, *clickclickclick* and *grind* noises]]\n\n[[Machine pops, then beeps in a tone of utter defeat]]\n\nHoliday tip: Coinstar does not handle chocolate coins well.\n\n{{Title text: Plus they take like 9%.}}","alt":"Plus they take like 9%.","img":"https://imgs.xkcd.com/comics/coinstar.png","title":"Coinstar","day":"26"},{"month":"12","num":996,"link":"","year":"2011","news":"Some context for the cancer comics:<br /><a href=\"https://blog.xkcd.com/2011/06/30/family-illness/\">https://blog.xkcd.com/2011/06/30/family-illness/</a>","safe_title":"Making Things Difficult","transcript":"Breast Cancer Surgery Follow-Up\nOncologist: You're looking great! Remove your top so I can check how the incision is healing.\nDelightfully Awesome Person: Nuh-uh.\n\nOncologist: *sigh*. Do we have to do this *every* time?\nDelightfully Awesome Person: You know the rules.\n\nOncologist: This is so ridiculous.\n[[Oncologist fake-annoyedly searches for something in pockets]]\n\nOncologist: Here.\n[[Oncologist waves around a Mardi Gras bead necklace]]\nDelightfully Awesome Person: Woooo!\n[[Delightfully Awesome Person disrobes]]\n\n{{Title text: Favorite mastectomy breast prosthesis idea: a fake boob containing a spare rechargable battery, accessed via a nipple USB port. Complete with a ring of LED charge indicators in the areola!}}","alt":"Favorite mastectomy breast prosthesis idea: a fake boob containing a spare rechargable battery, accessed via a nipple USB port. Complete with a ring of LED charge indicators in the areola!","img":"https://imgs.xkcd.com/comics/making_things_difficult.png","title":"Making Things Difficult","day":"28"},{"month":"12","num":997,"link":"","year":"2011","news":"","safe_title":"Wait Wait","transcript":"Headlines!\nStockpiled in case Peter Sagal, host of NPR's Wait Wait Don't Tell Me, does something newsworthy in 2012.\n\n((Series of above-the-fold newspapers follows; Each has a headline, picture in most of them, and an explanation))\n\nWait Wait Don't Shoot Me\n[[A fierce Peter Sagal in a balaclava brandishes a gun in a supermarket]]\nNPR's Sagal in Whole Foods hostage standoff.\n\nWait Wait Don't Vote For Me\nPeter Sagal quits race for GOP top spot\n[[A sullen and defeated Peter Sagal surrounded by supporters admits defeat]]\n\nWait Wait Don't Judge Me\nSagal opens up about his Kermit fantasy.\n[[Stock profile images of Peter Sagal and Kermit the Frog]]\n\nWait Wait Don't Fire Me\n[[Stock profile image of Peter Sagal]]\nPeter Sagal let go after racist tirade.\n\nWait Wait Don't Cancel Me\nNPR axing news quiz.\n[[NPR spokesperson delivering announcement]]\n\nWait Wait Don't Interrupt Me\nSagal stabs Carl Kasell in on-air dispute.\n[[Peter Sagal mid-attack with a knife]]\n\nWait Wait Don't Look At Me\n[[Peter Sagal with a skin condition]]\nPeter Sagal's Poison Ivy Ordeal\nPeter Sagal: \"My 'Nam\"\n\nWait Wait Don't Friend Me\nPeter Sagal deletes his Facebook account.\n[[Person holding up a laptop with an \"Facebook account not found\" screen]]\n\nWait Wait Don't Seduce Me\nHow Lakshmi Singh stole Sagal's Heart.\n[[A wistful Lakshmi Singh being left by a sullen Peter Sagal]]\n\nWait Wait Don't Leave Me\n[[A wistful Peter Sagal being left by a furious Beth Sagal]]\nSagal's wife out after affair\n\nWait Wait Don't Spray Me\nPolice Raid Sagal's Occupy NPR protest\n[[Scummy policeman in riot gear spraying Peter Sagal in the face point blank with what is essentially a food product]]\n\nWait Wait Don't Indict Me\nSagal, five others named in cash-for-tote-bags scandal \n[[Peter Sagal doing a perp walk]]\n\nWait Wait Don't Clone Me\nPeter Sagal 'Outraged' over DNA harvesting.\n[[Fiery Peter Sagal, missing a small amount of DNA, at a podium]]\n\nWait Wait Don't Bust Me\nPeter Sagal's ghost captured\n[[Ghostbusters, careful not to cross the streams, capture the ghost of Peter Sagal]]\n\nWait Wait Don't Dissect Me\nSnoozing Sagal nearly snuffed in autopsy snafu\n[[Peter Sagal running away from from a very surprised pathologist]]\nPeter Sagal: \"I ain't dead!\"\n\nWait Wait Don't Objectify Me\nPeter Sagal is more than just a piece of meat\n\nWait Wait Don't Beatify Me\n[[Peter Sagal shakes his fist at a picture of the pope]]\nPeter Sagal Rebukes Pope\n\nWait Wait Don't Me\nPeter Sagal Accidentally\n[[Peter Sagal in a blank vacant]]\n\nWait Wait Don't Speak Its Name\n[[eyes... Eyes... AAAHHH]]\nPeter Sagal wakes Eldritch terror\nPeter Sagal:\"AAAAAAAA\"\n\nWait Wait Even For NPR This Is A Bit Much\nThis American Life to document the road to recovery for those who suffer the trauma of losing on Wait Wait\n\n{{Title text: You can't stab Karl Kasell. He sounds all slow and stentorian, but he moves like a snake.}}","alt":"You can't stab Carl Kasell. He sounds all slow and stentorian, but he moves like a snake.","img":"https://imgs.xkcd.com/comics/wait_wait.png","title":"Wait Wait","day":"30"},{"month":"1","num":998,"link":"","year":"2012","news":"","safe_title":"2012","transcript":"[[Two characters are talking.]]\nLeft: Well, it's 2012.\n\n((This panel has no upper and lower borders.))\nRight: Yup.\nRight: Only 354 days left until everybody abruptly stops talking about Mayans.\n\nLeft: Or thinking about Mayans.\nLeft: Or acknowledging that huge city-building ancient American civilizations existed at all.\nRight: You know what they say - those who fail to learn from history can still manage a 3.0 if they ace their other subjects.\n\n{{Title text: To compensate for this, I plan to spend 2013 doing nothing but talking about Mayans. My relationships with my friends and family may not fare well.}}","alt":"To compensate for this, I plan to spend 2013 doing nothing but talking about Mayans. My relationships with my friends and family may not fare well.","img":"https://imgs.xkcd.com/comics/2012.png","title":"2012","day":"2"},{"month":"1","num":999,"link":"","year":"2012","news":"","safe_title":"Cougars","transcript":"[[Parent is sitting at a computer; child is standing behind.]]\nParent: Whoa, ever seen Wikipedia's list of people who were attacked and killed by cougars?\nParent: Crazy how many of them were kids who were just playing outside their houses.\nReason #58 I should never have children: My love of learning and sharing knowledge about the world.\n\n{{Title text: If you're lying in bed tonight and you see yellow eyes glinting in your window, are you being stalked by a puma, a mountain lion, a panther, a catamount, or a cougar? Trick question--in North America, they're all names for the same species, Puma concolor! Isn't learning fun? Anyway, sleep tight!}}","alt":"If you're lying in bed tonight and you see yellow eyes glinting in your window, are you being stalked by a puma, a mountain lion, a panther, a catamount, or a cougar? Trick question--in North America, they're all names for the same species, Puma concolor! Isn't learning fun? Anyway, sleep tight!","img":"https://imgs.xkcd.com/comics/cougars.png","title":"Cougars","day":"4"}]
